{"url": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Here’s what happened in crypto today", "authors": [], "publication_date": null, "text": "Today in crypto, the co-founder of World Liberty Financial pushes back against US lawmakers' attempts to probe potential conflicts of interest involving the president. Meanwhile, a new report reveals that 90% of institutional players are either using or planning to use stablecoins. In other news, the US Department of Justice has added 12 more individuals to its list of defendants in a major crypto racketeering case.\n\nWorld Liberty Financial brushes off oversight concerns from Congress\n\nZach Witkoff, one of the co-founders of the Donald Trump family-backed crypto platform World Liberty Financial (WLFI), has rebuffed efforts by US lawmakers to investigate the president’s potential conflicts of interest.\n\nIn a May 15 letter to Senator Richard Blumenthal, lawyers for World Liberty Financial claimed a call to investigate the crypto platform was based on “fundamentally flawed premises and inaccuracies.” Witkoff did not specifically address any allegations, claiming that WLFI was “too busy building” for oversight.\n\n“The Company rejects the false choice between innovation and oversight,” said the letter. “What it opposes is the misuses of regulatory authority and uncertainty to suppress lawful innovation.”\n\nMay 15 letter to Sen. Blumenthal. Source: Zach Witkoff\n\n\n\nBlumenthal, the ranking member of the US Senate Permanent Subcommittee on Investigations, was one of many Democrats calling for investigations and legislative changes in response to Trump’s ties to WLFI, as well as his TRUMP memecoin and its dinner scheduled for the top tokenholders on May 22.\n\nThe GENIUS Act, a bill to recognize stablecoins as payment instruments currently being considered in Congress, may be a bellwether for how lawmakers intend to handle the president’s potential conflicts of interest.\n\n90% of institutions “taking action” on stablecoins\n\nA report from enterprise-grade digital assets platform Fireblocks shows that 90% of institutional players are using or exploring the use of stablecoins in their operations.\n\nThe report, published May 15, surveyed 295 executives across traditional banks, financial institutions, fintech companies and payment gateways. Almost half of the respondents (49%) said they already use stablecoins in payments, while 23% are conducting pilot tests and another 18% are in the planning stage.\n\nOnly 10% of institutions surveyed said they were undecided about stablecoin adoption.\n\n“The stablecoin race has become a matter of avoiding obsolescence as customer demand accelerates and use cases mature,” Fireblocks wrote.\n\nCurrent stablecoin adoption among institutional respondents. Source: Fireblocks\n\nAs traditional cross-border systems are hampered by higher costs, delays and other inefficiencies, stablecoins have emerged as a strategic solution in emerging markets’ business-to-business (B2B) settings.\n\nThe report found that financial institutions, particularly traditional banks, cited cross-border payments as a top priority for using stablecoins. Banks use stablecoins for a competitive advantage, to reduce friction and meet customer expectations.\n\nThe report also found that 58% of traditional banks use stablecoins for cross-border payments, while 28% use the assets to accept payments. Twelve percent of banks use stablecoins to optimize their liquidity, while 9% use them in merchant settlements. Another 9% use them in B2B invoicing.\n\nDOJ charges 12 more gamer-turned $263 million Bitcoin robbers\n\nAnother 12 people have been charged for their involvement in a $263 million crypto crime spree that stole 4,100 Bitcoin from a Genesis creditor last August, along with a string of break-ins and money laundering.\n\nThe 12 new names, included in a superseding indictment, add to charges originally brought against the main defendant in the case, Malone Lam, on Sept. 19, 2024, the Department of Justice noted in a May 15 statement.\n\n\n\nJeandiel Serrano was named a defendant in the initial indictment but was not included in the superseding one.\n\nThe DOJ said several defendants have been arrested, while two others are believed to be living in Dubai.\n\nMany of the suspects, with aliases like “Goth Ferrrari” and “The Accountant,” come from California, mostly aged between 18 and 22.\n\nThe group allegedly began operating in October 2023, evolving from friends while playing online games to what the DOJ describes as participating in a “cyber-enabled racketeering conspiracy.”"}