{"url": "https://cointelegraph.com/news/tokenization-makes-investing-more-accessible-robinhood-exec?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Tokenization makes investing more accessible — Robinhood exec", "authors": ["Christopher Tepedino"], "publication_date": null, "text": "Tokenization could open new opportunities for retail investors to access traditionally restricted asset classes, according to Johann Kerbrat, senior vice president and general manager of Robinhood Crypto, who called it “very important for financial inclusion.”\n\nSpeaking at the Consensus 2025 event in Toronto, Kerbrat said that some real-world assets, such as real estate and private equity, are available only to up to 10% of the US population. “You need to be an accredited investor to invest in private equity right now,” he said.\n\n“How many people can afford a house or an apartment in New York?” he elaborated. “But you can get a piece of it with fractionalization, through tokenization. And so we think it makes it a lot easier to be exchanged, a lot more accessible for everybody.”\n\nRobinhood's Johann Kerbrat at Consensus 2025. Source: Cointelegraph\n\nRobinhood has been one of a handful of investment firms or brokerages that have explored RWA tokenization in recent months. Others include BlackRock, Franklin Templeton, Apollo, and VanEck.\n\nRWA tokenization is often touted as a means to enhance financial accessibility, with most tokenized funds currently concentrated on the private credit and US treasury markets. According to RWA.xyz on May 16, the total market capitalization of onchain RWA is $22.5 billion across just 101,457 asset holders. On average, each holder owns $221,867 in onchain assets.\n\nRelated: MultiBank, MAG, Mavryk ink world’s largest $3B RWA tokenization deal\n\nStablecoin evolution will create more ‘specialized’ tokens\n\nKerbrat also touched on stablecoins, which have emerged as a key crypto use case this cycle. “You will see 100 stablecoins,” he predicted.\n\nKerbrat expects a rise in stablecoins that are “more specialized in a specific market.” According to DefiLlama, dollar-pegged stablecoins dominate the stablecoin sector. The two largest, Tether’s USDt (USDT) and Circle’s USDC (USDC), account for $211.8 billion or 87.1% of the $243.3 billion stablecoin market cap.\n\n“If you're trying to move funds from the US to Singapore, maybe you will use a specific stablecoin,” he said. \"The shift is going to go from just stablecoin to platforms that are managing all these stablecoins.”\n\nTether's USDT has seen its market share surge over the past few years. Source: DefiLlama\n\nFireblocks policy chief Dea Markova recently told Cointelegraph that there is a growing demand for non-dollar-pegged stablecoins. In April, the Italian finance minister warned that dollar-pegged stablecoins represent a greater risk than US President Donald Trump’s tariffs.\n\nMagazine: Ethereum is destroying the competition in the $16.1T TradFi tokenization race"}