{"url": "https://cointelegraph.com/news/bitcoin-breaks-out-coinbase-breaks-down-finance-redefined?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Bitcoin breaks out while Coinbase breaks down: Finance Redefined", "authors": ["Zoltan Vardai"], "publication_date": null, "text": "News broke on May 15 that Coinbase was the target of a $20 million extortion attempt after cybercriminals recruited overseas support agents to leak user data for social engineering scams.\n\nWhile less than 1% of Coinbase’s active monthly users were reportedly affected, the expected remediation and reimbursement expenses range from $180 million to $400 million, as the exchange pledged to repay all phishing attack victims.\n\nDespite the attack on the world’s third-largest cryptocurrency exchange, investor sentiment remains optimistic, with the Fear & Greed Index remaining firmly in the “Greed” zone above 69, according to CoinMarketCap data.\n\nFear & Greed Index, 30-day chart. Source: CoinMarketCap\n\nAdding to investor optimism, Coinbase saw over $1 billion worth of Bitcoin withdrawn on May 9, marking the highest net outflow recorded in 2025 so far, triggering analyst predictions of a supply-shock driven Bitcoin rally.\n\nCoinbase faces $400 million bill after insider phishing attack\n\nCoinbase was hit by a $20 million extortion attempt after cybercriminals recruited overseas support agents to leak user data, the company said on May 15.\n\nCoinbase said a group of external actors bribed and coordinated with several customer support contractors to access internal systems and steal limited user account data.\n\n“These insiders abused their access to customer support systems to steal the account data for a small subset of customers,” Coinbase said, adding that no passwords, private keys, funds or Coinbase Prime accounts were affected.\n\nLess than 1% of Coinbase’s monthly transacting users’ data was affected by the attack, the company said.\n\nAfter stealing the data, the attackers attempted to extort $20 million worth of Bitcoin (BTC) from Coinbase in exchange for not disclosing the breach. Coinbase refused the demand.\n\nInstead, the company offered a $20 million reward for information leading to the arrest and conviction of those responsible for the scheme.\n\nContinue reading\n\n$1 billion Bitcoin exits Coinbase in a day as analysts warn of supply shock\n\nInstitutional demand for Bitcoin is growing, as Coinbase, the world’s third-largest cryptocurrency exchange, recorded its highest daily outflows of Bitcoin in 2025 on May 9.\n\nOn May 9, Coinbase saw 9,739 Bitcoin, worth more than $1 billion, withdrawn from the exchange, the highest net outflow recorded in 2025, according to Bitwise head of European research André Dragosch.\n\n“Institutional appetite for Bitcoin is accelerating,” Dragosch added in a May 13 X post.\n\nSource: André Dragosch\n\nThe outflow occurred as Bitcoin traded above $103,600 and just days after the White House announced a 90-day reduction in reciprocal tariffs between the US and China, easing market concerns and lifting broader investor sentiment.\n\nJoint statement on US-China meeting in Geneva. Source: The White House\n\nThe 90-day suspension of additional tariffs removed the risk of “sudden re-escalation,” which may help Bitcoin, altcoins and the wider stock market rally due to improved risk appetite, Nansen’s principal research analyst, Aurelie Barthere, told Cointelegraph.\n\nContinue reading\n\nDeFi lender Aave reaches $40 billion in value locked onchain\n\nAave, a decentralized finance (DeFi) protocol, has reached a new record of funds onchain, according to data from DefiLlama.\n\nIn an X post, Aave said it topped $40.3 billion in total value locked (TVL) on May 12. Onchain data reveals that Aave v3, the latest version of the protocol, has about $40 billion in TVL.\n\nAave is a DeFi lending protocol that lets users borrow cryptocurrency by depositing other types of cryptocurrency as collateral. Meanwhile, lenders earn yield from borrowers.\n\n“With these milestones, Aave is proving its dominance in the Lending Space,” DeFi analyst Jonaso said in a May 12 X post. TVL represents the total value of cryptocurrency deposited into a protocol’s smart contracts.\n\nAave v3’s TVL over time. Source: DefiLlama\n\nContinue reading\n\nSEC delays Solana ETF as decisions for Polkadot, XRP loom\n\nThe US Securities and Exchange Commission (SEC) pushed back its decision on a proposed spot Solana exchange-traded fund (ETF), with the cryptocurrency industry now looking to the deadlines for the Polkadot and XRP-based ETFs in June.\n\nThe SEC delayed its decision on listing Grayscale’s spot Solana (SOL) Trust ETF on the New York Stock Exchange (NYSE) to October 2025, according to a May 13 filing by the securities regulator.\n\nDelay on Grayscale’s Solana ETF. Source: SEC\n\nThe decision came the week after the SEC delayed its ruling on Canary Capital’s Litecoin (LTC) ETF, Bloomberg Intelligence analyst James Seyffart wrote in a May 5 X post.\n\nSource: James Seyffart\n\nSpot ETFs are key drivers of liquidity and institutional adoption for digital assets. For Bitcoin, the US spot Bitcoin ETFs accounted for an estimated 75% of new investment after launching, which helped BTC recapture the $50,000 mark in February 2024, a month after the ETFs debuted for trading.\n\nWhile a Solana ETF may generate only a fraction of the inflows of Bitcoin ETFs, it could increase Solana’s institutional adoption in the long term by offering investors a “regulated investment vehicle” that may still attract billions of dollars in capital, Ryan Lee, chief analyst at Bitget Research, told Cointelegraph.\n\nContinue reading\n\nStarknet hits “Stage 1” decentralization, tops ZK-rollups for value locked\n\nEthereum layer-2 scaling platform Starknet has reached a decentralization milestone laid out by Ethereum co-founder Vitalik Buterin and is now the largest zero-knowledge rollup-based network by total value locked.\n\nStarknet said in a news release shared with Cointelegraph that it has hit “Stage 1” decentralization, according to a framework Buterin laid out in 2022, which means the network operates with limited oversight or “training wheels.”\n\nStarknet added that the framework was the “gold standard onchain tool for analyzing Ethereum scaling solutions,” and said it achieved the milestone through changes such as creating a security council and censorship-avoidance mechanisms.\n\nWhile the system still allows intervention from a security council, it has implemented a fully functional validity proof system governed by smart contracts.\n\nStarknet is now the only layer-2 ZK-rollup network to have reached Stage 1 and has grown to be the largest ZK-rollup blockchain with a total value locked of $629 million, just ahead of ZKsync’s $610 million, according to L2beat.\n\nStarknet is the fifth-largest layer-2 network by value locked, with the top four all Optimistic rollup-based, having reached Stage 1 decentralization using fraud proofs.\n\nContinue reading\n\nDeFi market overview\n\nAccording to data from Cointelegraph Markets Pro and TradingView, most of the 100 largest cryptocurrencies by market capitalization ended the week in the green.\n\nSolana-based memecoin Dogwifhat (WIF) rose over 43% as the week’s biggest gainer, followed by decentralized exchange Raydium’s (RAY) token, up nearly 19% over the past week.\n\nTotal value locked in DeFi. Source: DefiLlama\n\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space."}