{"url": "https://cointelegraph.com/news/bitfinex-bitcoin-longs-total-6-8-b-while-shorts-stand-at-25-m-time-for-btc-to-rally?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Bitfinex Bitcoin longs total $6.8B while shorts stand at $25M — Time for BTC to rally?", "authors": ["Marcel Pechman"], "publication_date": null, "text": "Key takeaways:\n\nBitfinex margin longs fell 18%, despite Bitcoin price rising 24% in 30 days.\n\n$6.8 billion in long positions far outweight the current $25 million in shorts.\n\nBitcoin options positioning and spot BTC inflows point to confidence from institutional investors.\n\nBitcoin (BTC) price climbed 23.7% over the past 30 days, yet traders on Bitfinex have cut their leveraged long positions by more than 18,000 BTC during this time. This wave of profit-taking in margin markets has led to speculation that professional traders may not be fully confident in the current $104,000 price level.\n\nBitfinex BTC margin longs, BTC. Source: TradingView / Cointelegraph\n\nBitfinex margin longs dropped from 80,387 BTC to 65,889 BTC between April 16 and May 16. This shift marks a reversal from the strong bullish margin demand seen between mid-February and mid-March, a period when Bitcoin’s price fell from $97,600 to $82,500. The current decrease in margin longs is likely a sign of healthy profit-taking rather than a turn toward bearish momentum.\n\nThe reasoning behind this move is not entirely clear, since Bitcoin’s jump above $100,000 occurred on May 8, about three weeks after the margin longs peaked. Still, it would be wrong to suggest that Bitfinex whales have adopted a bearish outlook. Their margin longs now total $6.8 billion, while margin shorts stand at just $25 million, showing a major gap between bullish and bearish positions.\n\nBitfinex BTC margin shorts, BTC. Source: TradingView / Cointelegraph\n\nThis difference is mainly due to Bitfinex’s low 0.7% annual interest rate for margin trading. By contrast, those using leverage for 90-day Bitcoin futures are paying a 6.3% annualized premium. This gap creates arbitrage opportunities.\n\nFor example, one can open Bitcoin longs on margin and simultaneously sell an equivalent position in BTC futures to benefit from the rate difference. Margin traders also tend to have longer time frames and higher risk tolerance than average investors, so their position changes are less affected by short-term price moves.\n\nWhales unfazed by $105,000 resistance as BTC ETFs drive optimism\n\nTo rule out factors limited to margin markets, it is useful to look at Bitcoin options. If traders expect a correction, demand for put (sell) options rises, pushing the 25% delta skew above 6%. In bullish periods, this metric usually drops below -6%.\n\nBitcoin 30-day options delta skew (put-call) at Deribit. Source: Laevitas.ch\n\nThe current -6% options delta skew shows confidence in Bitcoin’s price, even though data over the past two weeks has ranged from neutral to slightly bullish. This indicates that whales and market makers are not especially concerned about repeated failures to break above the $105,000 barrier.\n\nRelated: Bitcoin traders’ evolving view of BTC’s role in every portfolio bolsters $100K support\n\nSome of the increased optimism, despite lower demand for leveraged bullish positions, comes from the $2.4 billion net inflows into US spot Bitcoin exchange-traded funds (ETFs) between May 1 and May 15. Therefore, the drop in Bitcoin margin longs does not mean institutional traders are turning bearish, especially when considering the BTC options markets.\n\nAlthough this data does not reveal whether Bitcoin is any closer to breaking above $105,000, the fact that there are $6.8 billion in leveraged margin longs clearly shows that professional traders remain highly optimistic about the price outlook.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."}