{"url": "https://cointelegraph.com/news/bitcoin-treasury-pivot-boosts-watchmaker-stock-60-percent?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Bitcoin treasury pivot lifts luxury watchmaker’s stock more than 60%", "authors": ["Adrian Zmudzinski"], "publication_date": null, "text": "Shares of luxury watchmaker Top Win surged more than 60% in premarket trading after the company said it would adopt a Bitcoin accumulation strategy and had changed its name to AsiaStrategy.\n\nIn a May 16 announcement, AsiaStrategy said it is partnering with Sora Ventures to adopt a Bitcoin (BTC) treasury strategy. Sora previously partnered with Metaplanet in 2024 to create Japan’s first corporate Bitcoin treasury.\n\nThe stock market took immediate notice of the announcement. Top Win stock closed the trading day at $7.50 on May 15, but traded at $12.12 in premarket at the time of writing — a jump of over 60%.\n\nTop Win share price. Source: Google Finance\n\nAsiaStrategy’s luxury watchmaking business will continue alongside its Bitcoin accumulation strategy, rather than a full pivot.\n\nRelated: Jim Chanos takes opposing bets on Bitcoin and Strategy\n\nThe announcement comes a day after a Bahrain-based, listed catering company with a $24.2 million market cap adopted a Bitcoin treasury strategy in partnership with investment firm 10X Capital. Both companies are seemingly set to follow a path similar to the top corporate BTC holder Strategy (previously known as MicroStrategy).\n\nSora Ventures joins company board\n\nJason Fang, the founder and managing partner of Sora Ventures, will join AsiaStrategy as a member of its board. He will serve as co-CEO at the firm alongside Tony Ngai (Kwan Ngai), who served as the CEO and director at Top Win until now.\n\nFang started his career at Fenbushi Capital in 2016 and later founded Sora Ventures in 2018. Under his leadership, Sora Ventures invested in decentralized finance (DeFi), game finance (GameFi), social finance (SocialFi) and non-fungible tokens (NFTs). More recently, the company shifted its focus to decentralized science (DeSci) and the Bitcoin ecosystem.\n\nRelated: Strategy will beat all public equities with Bitcoin, analyst says\n\nWatchmaker joins Bitcoin treasury trend\n\nWhen US-based business intelligence company Strategy pivoted to accumulating Bitcoin in 2020, it was the beginning of a trend that would slowly pick up pace. BitcoinTreasuries.NET data shows that the company now holds 568,840 BTC worth nearly $59 billion, over 2.7% of all Bitcoin that will ever be mined.\n\nMetaplanet chose to adopt the same strategy last year, and BitcoinTreasuries.NET reports that they now hold 6,796 BTC worth over $704 million. Last week, the company announced that it is raising more funds through another $21.25 million bond issue to expand its Bitcoin treasury.\n\nMagazine: Rise of MicroStrategy clones, Asia dominates crypto adoption: Asia Express 2024 review"}