{"url": "https://cointelegraph.com/news/twitter-user-claims-tradingview-has-ignored-a-fibonacci-retracement-bug-for-5-years?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Twitter User Claims TradingView Has Ignored a Fibonacci Retracement Bug for 5 Years", "authors": ["Adrian Zmudzinski"], "publication_date": null, "text": "Update: the CTO of TradingView told Cointelegraph in comments that the reports of a bug were inaccurate, and the Twitter user partially withdrew his earlier claims that the tool was broken.\n\nPopular chart analysis service TradingView reportedly contains a bug in the Fibonacci retracement technical analysis tool, according to a tweet by self-proclaimed certified Elliott wave analyst Cryptoteddybear published on June 13.\n\nThe Elliott wave principle is a type of technical analysis for predicting prices in financial markets by looking at recurring patterns.\n\nIn a video that he uploaded to YouTube, the analyst explains that the tool does linear calculations when in logarithmic charts, which he notes is a significant issue for Elliot wave traders. The official Twitter account of the company behind the charting service answered his tweet, announcing that the issue is being investigated, to which Cryptoteddybear answered:\n\n“Thank you @tradingview for finally taking this issue seriously.”\n\nThe first reports of the bug, posted over five years ago (in November 2014) on consumer community platform getsatisfaction, have been reportedly ignored by the company. Another report submitted on the same platform, dated June 3, 2017, has seen the official TradingView account answer in the thread:\n\n“Hi, you are right, we have a planned task to fix this. Thanks for bringing this to our attention.”\n\nHowever, the problem apparently has not yet been solved. Cryptoteddybear claims that a company representative told him that he asked the technicians to increase the priority given to solving the bug.\n\nAs Cointelegraph recently reported, TradingView is one of the platforms that added the “CIX100” index — an AI-powered index for the 100 strongest-performing cryptocurrencies and tokens.\n\nAt the beginning of the current month, cryptocurrency analytics company Coin Metrics announced that it has acquired digital asset index firm Bletchley Indexes and plans to launch crypto smart beta indexes.\n\nAs of press time, TradingView has not responded to a request for comment."}