{"url": "https://cointelegraph.com/news/altcoins-are-on-the-verge-of-most-powerful-rally-since-2017-analyst?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Altcoins are on the verge of ‘most powerful rally’ since 2017 — Analyst", "authors": ["Biraajmaan Tamuly"], "publication_date": null, "text": "Key takeaways:\n\nThe total altcoin market cap (excluding ETH) gained $126 billion in Q2, fueling speculation of an altseason.\n\nThe altcoin market cap, excluding Ether (ETH), has added $126 billion in Q2, sparking enthusiasm from analysts who have been waiting for an altseason. Crypto analyst Javon Marks noted a breakout that could rival the explosive 2017 bull run.\n\nIn a recent post on X, Marks highlighted a chart comparing the TOTAL3 index (total market cap of altcoins excluding Bitcoin (BTC) and Ethereum) against the US money supply, suggesting that altcoins may be on the verge of a significant rally.\n\nA rise in TOTAL3 against the US money supply suggests that altcoins are gaining value relative to the total liquidity in the US economy, reflecting increased investor interest and capital inflow into altcoins.\n\nTOTAL3/US Money supply. Source: X.com\n\nMarks emphasized that altcoins have recently bounced off a critical retest level following a breakout, and said,\n\n“Altcoins have bounced off of the breakout retest against the US money supply and can deliver one of their most powerful runs since 2017!”\n\nLikewise, anonymous crypto trader Moustache shared an analysis on X, highlighting a weekly inverse head-and-shoulders pattern in the TOTAL3 chart. Comparing 2021 and 2025, the chart mirrors the 2021 altcoin season when top altcoins surged 174% against Bitcoin’s 20% during the final leg. The pattern, a bullish reversal indicator, suggests a rally, with the analyst forecasting \"much higher levels\" for altcoins.\n\nMoustache’s TOTAL3 analysis. Source: X.com\n\n“Altseason” sparks mixed sentiment among analysts\n\nWhile some analysts are on the altcoin rally bandwagon, others are approaching with caution. Technical analyst Crypto Scient explained that the recent rise in altcoin market cap is yet to reflect a higher time frame (HTF) bullish trend shift. The analyst noted that the TOTAL2 trend remained bearish after hitting resistance at the $1.25 trillion level, and said,\n\n“Since both BTC and TOTAL are near the resistance zone and TOTAL2 still has some room, I am inclined to believe that we are distributing.”\n\nSimilarly, Crypto commentator DonaXBT argued that a significant breakdown in Bitcoin's dominance trendline is essential for altcoins to experience a substantial move. The accompanying chart reveals that Bitcoin dominance is above 60%, with the weekly uptrend still intact.\n\nBitcoin dominance. Source: Cointelegraph/TradingView\n\nAccording to the analyst, a decline below the 60% level, followed by a retest of the support zone between 56% and 58%, could serve as the initial catalyst for a full-fledged altcoin season to emerge.\n\nRelated: Warren Buffett exits crypto-friendly Nubank holdings, netting $250M profit\n\nAltcoin spot trading volume is still under $10 billion\n\nData from CryptoQuant indicates that altcoin spot trading volumes remain subdued, averaging $3-$5 billion/per day compared to $8-$12 billion/per day in Q4 2024, indicating that altcoins are in the early stages of a rally. Despite these lower volumes, market observers see this as a precursor to significant growth, suggesting that altcoins have yet to reach their peak momentum.\n\nBitcoin and Altcoins spot trading volume. Source: CryptoQuant\n\nThe Altcoin Season Index, currently at 24, further supports this outlook by confirming that the market is in Bitcoin season, as noted by Blockchaincenter.net. Historically, an index below 25 indicates Bitcoin dominance, but this can be a positive setup for altcoins. When the index climbs above 30-40, altcoins often experience significant pumps, driven by capital rotation from Bitcoin.\n\nWith trading volumes showing early signs of recovery and the Altcoin Season Index pointing to a shift, investors’ optimism for an altcoin rally is growing.\n\nRelated: Spot Bitcoin ETF inflows fall, but BTC whale activity points to bull market acceleration\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."}