{"url": "https://cointelegraph.com/news/solv-rwa-backed-bitcoin-yield-avalanche?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Solv brings RWA-backed Bitcoin yield to Avalanche blockchain", "authors": ["Sam Bourgi"], "publication_date": null, "text": "Solv Protocol has launched a yield-bearing Bitcoin token on the Avalanche blockchain, giving institutional investors more exposure to yield opportunities backed by real-world assets, or RWAs.\n\nOn May 16, the protocol unveiled SolvBTC.AVAX, a token that connects Bitcoin (BTC) to real-world assets like US Treasurys and private credit offered by BlackRock and Hamilton Lane.\n\nThe new token was developed through a seven-way partnership involving Solv, Avalanche, Balancer, Elixir, Euler, Re7 Labs, and LFJ, the company said.\n\nSolv Protocol founder Ryan Chow said the token is a way to link Bitcoin to “real-world economic cycles” in uncorrelated assets such as US government bonds and private credit, as opposed to BTC’s typical boom-and-bust four-year cycle.\n\nThe token uses a multi-protocol strategy to generate yield involving Elixir’s deUSD stablecoin, Treasurys provided by BlackRock and Hamilton Lane via Elixir, and incorporated on the lending platform Euler to increase RWA exposure.\n\n“The yield is received in BTC format,” a Solv Protocol spokesperson told Cointelegraph\n\n\n\nElixir deUSD is a synthetic dollar with nearly $220 million in market capitalization. Source: RWA.xyz\n\nSolv is a Bitcoin-centric staking platform that offers yield strategies across various blockchains and decentralized finance applications. The protocol commands more than $2.3 billion in total value locked, according to industry data.\n\nSolv Protocol’s TVL. Source: DefiLlama\n\nRelated: Bitcoin supply crunch boosts confidence in $200K target for 2025 — Bitwise CIO\n\nThe race to offer Bitcoin yield intensifies\n\nDemand for Bitcoin yield solutions has grown amid the recent wave of institutional adoption of digital assets.\n\nEarlier this month, crypto exchange Coinbase launched the Bitcoin Yield Fund, which aims to offer annual returns of between 4% and 8% on BTC holdings.\n\nThe yield will be earned through a cash-and-carry strategy, which involves purchasing BTC in the spot market and selling a corresponding futures contract, Coinbase said.\n\nCoinShares analyst Satish Patel predicted the growing interest in Bitcoin yield in December, noting that more investors now see BTC “not only as a store of value but also as a means to generate yields.”\n\nWhile there are many ways to generate Bitcoin yield, such as leveraging derivatives or yield farming, Michael Saylor’s Strategy introduced its own “BTC Yield” metric to measure the performance of its investment strategy.\n\nStrategy’s BTC Yield, which measures how much additional Bitcoin it’s acquiring relative to its outstanding shares, is currently 15.5% year-to-date, according to the company.\n\n\n\nMagazine: Metric signals $250K Bitcoin is ‘best case,’ SOL, HYPE tipped for gains: Trade Secrets"}