{"url": "https://cointelegraph.com/news/cftc-commissioner-romero-leaving-may?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "CFTC commissioner to leave agency on May 31", "authors": ["Turner Wright"], "publication_date": null, "text": "Christy Goldsmith Romero of the US Commodity Futures Trading Commission (CFTC) will step down on May 31, leaving three seats open at the financial regulator.\n\nIn a May 16 announcement, Romero said her last day at the agency would be on May 31, ahead of her reported initial plans to leave if the Senate confirmed former commissioner Brian Quintenz as the new chair. Her departure will come a day after Commissioner Summer Mersinger is expected to step down to join the crypto advocacy organization the Blockchain Association as CEO.\n\n“It has been a tremendous honor to conclude my 23 years of federal service at an agency with such an important mission to ensure that financial markets perform their critical role in the US and global economies,” said Romero.\n\nRomero and Mersinger’s upcoming departures would leave the CFTC with only two Senate-confirmed members: acting chair Caroline Pham and Commissioner Kristin Johnson, each taking one Republican and Democratic seat, respectively. However, Pham also announced that she planned to leave after Quintenz’s confirmation. The shakeup in leadership potentially gives President Donald Trump the opportunity to pick three more commissioners after the Senate addresses Quintenz’s nomination.\n\nRelated: Former CFTC lawyer says agency should take lead on memecoin regulations\n\nAssuming Quintenz, likely being positioned for one of the CFTC’s Republican seats, is confirmed, Trump would still be able to radically change the leadership of the commission by choosing four of the five-member panel. CFTC rules require that no more than three commissioners belong to the same political party.\n\nCongress looking to clarify SEC, CFTC roles on crypto\n\nThe shakeup in leadership at one of the most significant US financial regulators came as lawmakers in the House were considering draft legislation that could establish a digital asset regulatory framework. The bill is expected to clarify oversight and enforcement authority of the CFTC and Securities and Exchange Commission (SEC) over many cryptocurrencies.\n\nDuring her time at the commission, starting in 2022, Romero helped establish the CFTC’s Technology Advisory Committee, in part in response to addressing regulatory concerns from the crypto industry. She also supported a joint effort by US authorities against cryptocurrency exchange Binance, which resulted in a $2.7-billion settlement with the CFTC.\n\nMagazine: SEC’s U-turn on crypto leaves key questions unanswered"}