{"url": "https://cointelegraph.com/news/basel-medical-shares-down-15-bitcoin-buying-plans?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Basel Medical shares down 15% on $1B Bitcoin buying plans", "authors": ["Alex O Donnell"], "publication_date": null, "text": "Shares of Basel Medical Group are down around 15% after the healthcare company announced plans to buy $1 billion in Bitcoin for its corporate treasury.\n\nOn May 16, Singapore-based Basel said it was “in advanced discussions with a consortium of institutional investors and high-net-worth individuals […] to acquire a US$1 billion BTC through an innovative share-swap arrangement.\n\nThe company said the benefits of its planned purchase include creating “one of the strongest balance sheets among Asia-focused healthcare providers” and providing “unmatched financial flexibility for mergers and acquisitions.”\n\nIt also said the Bitcoin (BTC) treasury would help Basel “[e]stablish “a diversified asset base to weather market volatility.”\n\nBut the company’s shareholders weren’t sold. Basel’s stock, BMGL, has dropped around 15% on the announcement, according to data from Google Finance.\n\nBasel Medical’s shares are down 15% intraday on May 16. Source: Google Finance\n\nRelated: Strive to become Bitcoin treasury company\n\nFueling acquisitions\n\nIn April, Basel announced that it had acquired a peer healthcare provider, Bethesda Medical, for an undisclosed sum.\n\nThe deal marked “the beginning of Basel Medical Group’s expansion strategy in Singapore and the broader Southeast Asian healthcare market.”\n\nBasel’s management team expects that accumulating Bitcoin will aid in these plans. “Our expanded balance sheet will allow us to move quickly on strategic opportunities as we build a premier healthcare platform across high-growth Asian markets,” Darren Chhoa, Basel’s CEO, said in a statement.\n\nBitcoin treasury metrics. Source: Bitcointreasuries.net\n\nCorporate Bitcoin treasuries\n\nThis isn’t the first time a company’s shareholders have punished it for announcing plans to build a Bitcoin treasury.\n\nGameStop shed nearly $3 billion in market capitalization during a single trading day in March as investors questioned the videogame retailer’s plans to stockpile Bitcoin.\n\n“There are question marks with GameStop's model. If bitcoin is going to be the pivot, where does that leave everything else?” Bret Kenwell, US investment analyst at eToro, told Reuters in March.\n\nCorporate treasuries collectively hold roughly $80 billion worth of Bitcoin as of May 16, according to data from BitcoinTreasuries.NET.\n\nBitcoin can “potentially be a valuable hedge against growing fiscal deficits, currency debasement, and geopolitical risks” for corporations, asset manager Fidelity Digital Assets said in a 2024 report.\n\nMagazine: Bitcoin’s $100K push wakes taxman, Vitalik visits real Moo Deng: Asia Express\n\n\n\n"}