{"url": "https://cointelegraph.com/news/judge-sec-hacker-eric-council?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "SEC hacker sentenced to 14 months in prison", "authors": ["Turner Wright"], "publication_date": null, "text": "A federal judge sentenced Eric Council Jr., who participated in posting a fake announcement on the US Securities and Exchange Commission’s X account saying it would approve spot Bitcoin (BTC) ETFs, to 14 months in prison.\n\nFollowing a May 16 hearing in the US District Court for the District of Columbia, the Justice Department announced that Council would serve 14 months in prison after pleading guilty to one count of conspiracy to commit aggravated identity theft and access device fraud.\n\n“Schemes of this nature threaten the health and integrity of our market system,” said Jeanine Pirro, interim US Attorney for the District of Columbia. “SIM swap schemes threaten the financial security of average citizens, financial institutions, and government agencies.”\n\nCouncil was part of a group that compromised the X account of the US Securities and Exchange Commission (SEC) through a SIM swap attack in January 2024. Prosecutors had requested that the judge impose a two-year sentence, while Council’s lawyers asked for one year and one day. Court filings showed he earned roughly $50,000 through SIM swap attacks like the one that compromised the SEC’s X account — funds likely subject to forfeiture.\n\nRelated: Coinbase faces $400M bill after insider phishing attack\n\nThe judge ordered Council to serve 36 months of supervised release after his sentence. It was unclear at the time of publication when he would report to prison, but he has been free on a personal recognizance bond since his arrest in October 2024.\n\nOther crypto figures have their days in court\n\nCouncil was the latest individual to be sentenced who drew the attention of the crypto industry. Though high-profile criminal cases like those involving executives from cryptocurrency exchange FTX have largely been concluded, others are ongoing.\n\nOn May 8, former Celsius CEO Alex Mashinsky was sentenced to 12 years following his guilty plea on two felony counts. The criminal trial of former SafeMoon CEO John Karony is also expected to continue for several more days in the US District Court for the Eastern District of New York.\n\nMagazine: Danger signs for Bitcoin as retail abandons it to institutions: Sky Wee"}