{"url": "https://cointelegraph.com/news/bitcoin-supply-crunch-boosts-confidence-200k-target-2025-bitwise-cio?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Bitcoin supply crunch boosts confidence in $200K target for 2025 — Bitwise CIO", "authors": ["Vince Quill"], "publication_date": null, "text": "Matt Hougan, chief investment officer at Bitwise, predicts Bitcoin (BTC) will reach $200,000 by the end of 2025 due to a supply shock from heightened institutional demand.\n\nIn an interview with Cointelegraph at Consensus 2025 in Toronto, the executive said that Bitwise's Bitcoin price prediction model is driven exclusively by supply and demand metrics. Hougan laid out the specific figures driving the forecast:\n\n\"We know that miners will produce 165,000 BTC this year. Already, publicly traded companies have bought more than that. ETFs are at $6 billion in inflows. We think governments are going to be buying. We see this sort of structural difference between demand and supply.\"\n\n\"I think eventually that will exhaust sellers at the $100,000 level where we have been stuck, and I think the next stopping point above that is $200,000,\" the executive said. Bitwise is one of the issuers of Bitcoin exchange-traded funds (ETFs) in the US markets, with nearly $4 billion in assets under management through its Bitwise Bitcoin ETF (BITB) as of May 14.\n\nEleanor Terrett, Ben Gagnon, Matt Hougan and Tom Lee at Consensus 2025. Source: Cointelegraph\n\nThis institutional demand has also bolstered the market with liquidity, likely making the four-year Bitcoin halving cycle, with significant drawdowns of up to 90% in between cycles, a \"vestige of the past,\" Hougan said.\n\nRelated: \"The world is trying to hoard Bitcoin right now\" — Eric Trump\n\nMichael Saylor's Strategy single-handedly shifting markets\n\nOne of the key corporate players driving Bitcoin demand is Strategy. The company has pioneered the BTC reserve strategy and currently holds 568,840 BTC in its corporate treasury, according to SaylorTracker.\n\n\n\nAuthor and Bitcoin analyst Adam Livingston said recently that Strategy is \"synthetically halving Bitcoin\" by outpacing the newly mined supply.\n\nLivingston added that Strategy has accumulated 379,800 BTC in the last six months and will likely control Bitcoin lending markets if it continues its rapid pace of accumulation.\n\n\"BTC's global cost of capital will no longer be set by 'the market.' It will be set by the gravitational policies of the first Bitcoin superpower: Strategy,\" Livingston wrote.\n\nBitcoin miner reserves are in long-term decline. Source: CryptoQuant\n\nStrategy's effect on Bitcoin's supply is so pronounced that market analyst Ki Young Ju says Bitcoin's supply is now deflationary, with an annual deflation rate of -2.33%.\n\nThe increased demand has led some analysts to forecast a $1 million Bitcoin price tag in the coming decade.\n\nHowever, analyst and investor Arthur Hayes recently predicted BTC would hit $1 million in three years. Hayes argued that a deteriorating macroeconomic environment and liquidity injected from central banks will continue to drive prices higher.\n\nMagazine: Metric signals $250K Bitcoin is ‘best case,’ SOL, HYPE tipped for gains: Trade Secrets\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."}