{"url": "https://cointelegraph.com/news/ripple-win-unaffected-xrp-settlement-denial-court?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Ripple: Judge's settlement rejection has no effect on legal victory", "authors": ["Helen Partz"], "publication_date": null, "text": "Ripple’s legal chief said a US court’s rejection of a proposed XRP settlement with the Securities and Exchange Commission (SEC) does not pose a threat to Ripple’s win.\n\nJudge Analisa Torres of the US District Court for the Southern District of New York rejected a joint Ripple-SEC motion seeking an indicative ruling on their proposed settlement, according to a filing on May 15.\n\nRipple’s chief legal officer, Stuart Alderoty, said the rejection does not reverse the company’s victory in the case. The company announced the end of the lawsuit on March 19.\n\nAlderoty stressed that the latest court decision does not change the fact that XRP (XRP) is not a security, adding that the rejection is related to “procedural concerns with the dismissal of Ripple’s cross-appeal.”\n\nWhy did the court refuse to grant the ruling?\n\nAccording to the court document, Torres denied the motion as “procedurally improper” since the SEC and Ripple failed to file the correct procedural motion to support the proposed settlement.\n\n“By styling their motion as one for ‘settlement approval,’ the parties fail to address the heavy burden they must overcome to vacate the injunction and substantially reduce the civil penalty,” the Judge wrote.\n\nAn excerpt from the court’s rejection of the SEC-Ripple motion on May 15, 2025. Source: Courtlistener\n\nThe SEC and Ripple agreed to lower the court’s $125 million fine days before Ripple CEO Brad Garlinghouse announced the end of the case. Subsequently, Alderoty disclosed on X that the SEC will keep $50 million of the $125 million fine.\n\n“The parties have made no effort to satisfy that burden here; their request does not even mention the Rule,” the court document stated.\n\nCommunity asks for explanation\n\nAs Alderoty has not provided any details on the nature of procedural concerns by the court, but assured the public that Ripple and the SEC are “fully in agreement to resolve the case,” many in the community were unhappy with the lack of specifics from Ripple.\n\n“First, in a recent post about this case, you said you would not be making any more X posts because the case was closed,” one XRP observer responded to Alderoty in the X thread.\n\n\n\nSource: X thread from Stuart Alderoty\n\n“Second, I don’t think it's enough to just say that it’s procedural. I think further explanation of what went wrong in the filing is needed,” one XRP observer wrote in an X thread,” the post continued.\n\nRelated: Ripple commits $25M to US school nonprofits\n\n“Let’s remember that both he and Brad said the case was over, and it still isn’t; they’re cheating us a little,” another user speculated.\n\nThe news came shortly after online reports suggested that US President Donald Trump was allegedly manipulated by a Ripple-linked lobbyist into announcing the XRP token would be part of his plans for a national cryptocurrency reserve.\n\nMany in the Bitcoin (BTC) community have been slamming Ripple for advocating for a multi-coin strategic reserve, instead of a Bitcoin-only reserve.\n\n\n\nMagazine: Danger signs for Bitcoin as retail abandons it to institutions: Sky Wee"}