{"url": "https://cointelegraph.com/news/galaxy-digital-lists-on-nasdaq-talks-of-tokenizing-own-shares?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Galaxy Digital lists on Nasdaq, seeks to tokenize shares — Reports", "authors": ["Christopher Tepedino"], "publication_date": null, "text": "Galaxy Digital shares began trading on the Nasdaq stock exchange May 16, completing a years-long process that CEO Mike Novogratz called unfair and infuriating, CNBC reported.\n\nThe crypto and infrastructure company, which is also listed in Canada, opened trading at $23.50 in its Nasdaq debut.\n\nTrading began on the same day Galaxy disclosed that it is working with the US Securities and Exchange Commission (SEC) to tokenize its shares. According to Bloomberg, the tokens representing Galaxy Digital’s shares could be used in decentralized finance applications, like borrowing or lending.\n\nGalaxy is among several crypto companies looking to access the US markets under a friendlier regulatory regime in the country. Companies that are also exploring or working on a US listing include Metaplanet, Circle, Kraken, and Gemini. Trading platform eToro completed a listing on May 14.\n\nThe company has $7 billion in assets on its platform, according to its website. It suffered a loss of $295 million in the first quarter of 2025.\n\nGalaxy Digital’s last two quarters. Source: Galaxy Digital\n\nReal-world asset (RWA) tokenization is gaining traction in crypto, though it still represents a small share of the market. Data from RWA.xyz shows the sector's market cap at $22.5 billion — a fraction of both global real-world asset values and major cryptocurrencies like Bitcoin (BTC). However, it’s growing fast, with a 111.8% increase over the past year.\n\nOne rising trend is tokenizing securities, essentially turning assets like stocks and treasury bonds into tradable tokens on the blockchain. Robinhood is considering building a blockchain that would allow retail investors in Europe to trade tokenized US securities like stocks. Galaxy Digital has plans to tokenize everything from stocks and fixed income to ETFs.\n\nAt the SEC’s crypto roundtable on May 12, Chair Paul Atkins compared the tokenization of assets to the music industry moving from analog to digital, which, according to Atkins, greatly benefited the American economy.\n\nThe closer relationships that US President Donald Trump has developed with the industry have sparked new enthusiasm for crypto activity in the country. In addition to the flurry of companies preparing for a US public listing, some other crypto companies have announced their reentry into the local market.\n\nMagazine: X Hall of Flame: Bitcoin will ‘start ripping’ as Trump’s polls improve — Felix Hartmann\n\n\n\n\n\n"}