{"url": "https://cointelegraph.com/news/the-rise-of-stablecoins?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "From debanking to a banking arms race—The rise of stablecoins", "authors": ["Megan Knab"], "publication_date": null, "text": "Opinion by: Megan Knab, CEO, Franklin Payroll\n\nThere are few historical examples of such a massive about-face for an industry, from banks debanking crypto businesses to now embracing stablecoins. If you talk to most crypto startup founders or companies with crypto on the balance sheet, they will all have war stories about finding, applying for and maintaining bank accounts.\n\nOver the past three years, over half of debanking complaints have been lodged against four American banks — Bank of America, JPMorgan, Wells Fargo and Citibank. Now, as the policies that discriminated against the crypto industry, like “Operation Chokepoint 2.0” and the recision of controversial accounting rule SAB 121, have been repealed, a new openness to blockchain technology from the finance sector is possible.\n\nIt is imperative that the banking industry stop shunning crypto and start — at least understanding it — to stay competitive. How stablecoins are deployed will separate the banking winners and losers.\n\nFrom debanking to stablecoins\n\nOf course, stablecoins are not a new concept. For years, large institutions like JPMorgan and Santander have experimented with stablecoins and blockchains. Those experiments were around small functions like internal treasury reconciliation and interbank settlement. Much of this was also on private blockchains created by those banks. Implementing digital dollars on private chains, however, misses out on the core innovation of stablecoins.\n\nWhile the use case of stablecoins for international remittances is clear, we are just scratching the surface of the power of stablecoins on public networks. For example, stablecoins eradicate unauthorized payment disputes and enable far faster pay cycles.\n\nPayroll payments are also complex. Payday is a web of thousands of automated clearing houses, wires, comma-separated values and PDFs. The programmability of stablecoins enables companies to create efficiency among all these data structures, processing times, reconciliations and paycheck reporting.\n\nMany smaller banks are just now waking up to the opportunity to incorporate permissionless, public network stablecoins into their workflows. Similar to how many businesses started to investigate how AI might change their businesses with the 2022 release of ChatGPT, so too are banks needing to look at how stablecoins will upend money movement.\n\nRecently, Custodia Bank issued its own stablecoin, Avit, on Ethereum. Custodia’s users can access quick, cheap banking services that are hard to beat. This is an excellent example of implementation for other financial institutions to follow.\n\nStablecoin adoption is increasing as the tech keeps improving\n\nActive stablecoin wallets increased from 19.6 million in February 2024 to over 30 million in February 2025, according to Artemis and Dune. US President Donald Trump hopes to have stablecoin legislation on his desk by August 2025. Wyoming already did so in late March 2025.\n\nRecent: Mastercard links with Circle, Paxos for merchant stablecoin payments\n\nStablecoin infrastructure has improved significantly, and there is increased confidence in the security of stablecoins. 91% of the supply of stablecoins is fiat-backed, and only 8.5% are backed by collateralized crypto assets. Riskier algorithmic stablecoins have gone out of vogue.\n\nIncremental changes also make it easier for non-crypto businesses to use stablecoins. There are now simple solutions for many of the original UX problems with stablecoins.\n\nAdditionally, more assets are moving onchain. Using stablecoins on public networks like Ethereum, payment companies will be better prepared to serve the future financial system. It’s not just stablecoins that are updating the financial system, either. Earlier this year, BlackRock CEO Larry Fink said on Squawk Box he wants the SEC to “rapidly approve the tokenization of bonds and stocks.”\n\nFor banks looking for a competitive advantage in a world of powerful fintechs, shifting interest rates and lower consumer savings, using the power of stablecoins to improve their products and their internal operations might be the most powerful decision they make.\n\nOpinion by: Megan Knab, CEO, Franklin Payroll.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\n"}