{"url": "https://cointelegraph.com/news/violent-crypto-robberies-rise-six-attacks-investors?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Violent crypto robberies on the rise: Six attacks that targeted investors", "authors": ["Aaron Wood"], "publication_date": null, "text": "As cryptocurrency gains in popularity and price, some criminals are taking to violent measures to steal funds from high-profile crypto holders.\n\nJameson Lopp’s GitHub repository, which logs such incidents, has recorded 22 “$5 wrench” attacks on crypto holders in 2025 alone. The moniker comes from the crude and violent methods perpetrators use to compel crypto holders to hand over their bags.\n\nIn many cases, local law enforcement can intervene before anyone is harmed and funds are lost. But there is a growing trend of increasingly violent and successful attacks, some of which have resulted in permanent harm and even death.\n\nThe most recent incident in Paris, France compelled the French Ministry of the Interior to hold a meeting to address the rising trend. Here are just seven of the most high-profile attacks this year.\n\nLedger founder and wife kidnapped, freed\n\nThe founder of crypto wallet Ledger, David Balland, and his wife, Amandine Balland, were kidnapped from their home on Jan. 21. The couple was put in a car, then separated and held at different locations.\n\nParis prosecutor Laure Beccuau said that the kidnappers called an executive at Ledger and demanded a substantial ransom to be paid in cryptocurrencies. They reportedly mutilated Balland’s hand and sent Ledger a photograph to put pressure on the company.\n\nSome 230 officers participated in the search after Ledger alerted authorities. The police managed to locate and free David on Jan. 22 in Châteauroux, 30 miles southwest of his residence. One day later, after questioning arrested suspects and analyzing phone records, police were able to locate and rescue Amandine in Étampes, 80 miles north of Vierzon.\n\nA small portion of the ransom was paid. Beccuau said it was frozen and tracked, leading to the arrest of nine men and one woman.\n\nLedger CEO Pascal Gauthier released a statement after Balland was rescued. Source: Pascal Gauthier\n\nLambo sale goes wrong for Korean Bitcoin trader\n\nOn Jan. 20, Korean Bitcoin (BTC) trader Taehwa Kim met with a man under the alias “JC” in Makati City, Philippines who was supposedly interested in buying his Lamborghini. After a test drive, they stopped at a spa, supposedly to meet with JC’s lawyer. Three other men forced Kim into another vehicle and bound his hands.\n\nKim was kept for three days. Then, the attackers abandoned him some 50 kilometers away, his hands still tied, where police officers found him.\n\nThe perpetrators didn’t manage to get his crypto, but they stole his car, his Rolex watch, his wallet and the keys to his house.\n\nStreamer shoots would-be crypto thieves\n\nIn November 2024, Kick streamer and cosplayer Kaitlyn Siragusa, known professionally as “Amouranth,” posted a screenshot on X of her crypto wallet. It held some $20 million in Bitcoin (BTC) and $80,000 in Ether (ETH).\n\nMonths later, on March 2, 2025, three armed assailants allegedly broke into her home with the intent of stealing her cryptocurrency. She posted during the incident on X, stating, “I’m being too robbed at gunpont. I believe I shot one of them they wanted crypto is what they were yelling they pulled me out of bed.”\n\nSiragusa claimed that the assailants physically assaulted her before she discharged a weapon, after which they fled the scene. She said that police were testing blood left by suspects at the scene and posted video of the incident on her X profile.\n\nKidnappers demand $50 million in crypto from Spanish businessman\n\nOn March 29, police in São Paulo arrested a retired military police officer in connection with the week-long kidnapping of a Spanish businessman.\n\nSpeaking to authorities, the businessman said he was approached by two men dressed in fake civil police uniforms and forced into a truck. Upon reaching a secluded location on the outskirts of the city, the assailants held him and demanded $50 million in cryptocurrency.\n\nLocal media said the kidnappers drugged their victim with sleeping pills, but he was still able to escape when one of them went to the bathroom. After finding a filling station, he tipped off police, who seized one of the suspects as well as a pistol and ammunition.\n\nDaughter of crypto exchange owner fights off assailants\n\nThe daughter and grandson of Pierre Noizat, co-founder and CEO of French crypto exchange Paymium, narrowly escaped a kidnapping attempt in Paris when passersby intervened.\n\nThree masked attackers tried to force Noizat’s daughter and her son into a van while they were taking a walk in Paris on May 13.\n\nEn plein Paris, un homme a été violenté par des individus cagoulés, habillés tout en noir. Ils tentaient de l'enlever. Un homme a surgi, extincteur à la main, pour les faire fuir. →https://t.co/P0qV6PR40v pic.twitter.com/9f4r2Gi7ho — Le Figaro (@Le_Figaro) May 13, 2025\n\nNoizat’s daughter managed to disarm an attacker, after which a passing crowd intervened. The assailants fled in a van, which was later found abandoned nearby. The victims sustained injuries and were evacuated to a local hospital.\n\nLocal media reported that the Brigade for the Suppression of Banditry, a special police unit of the French Ministry of the Interior, was investigating the incident.\n\nAssailants target father of crypto entrepreneur\n\nKidnappers in Paris, France abducted the father of a French cryptocurrency entrepreneur on May 4.\n\nThe attackers took him to Essonne, 35 miles away from the Paris street where they grabbed him, and cut off his finger. They made a video and sent it to his son, demanding 5 million euros in crypto. The victim’s son subsequently contacted police.\n\nThe victim was held for two days before French police were able to find and rescue him. According to CNN, five people were arrested in connection with the kidnapping.\n\nAuthorities have noted the striking similarities of the case to that of Balland, whose attackers also took him several miles from the city and mutilated his hand.\n\n“Obviously, there’s at least a link in the modus operandi. Now, whether it’s the same team or not is for the investigators to say,” said internal security expert Guillaume Farde.\n\nAuthorities seek answers and crypto holders want security\n\nThe rise in recent attacks has shaken the crypto industry. Ben Davis, co-founder and CEO at blockchain insurance firm Native, told Cointelegraph, “We used to see crypto wrench attacks predominantly happening when executives were abroad or traveling. However, high-profile cases like the kidnapping of Ledger’s co-founder show that attackers are now targeting individuals in their own homes, with more planning and precision than ever before.”\n\nAuthorities are responding to concerns as well. On May 16, the French Interior Minister Bruno Retailleau met with cryptocurrency professionals to address the recent uptick in violent crime against industry figures.\n\nFor the foreseeable future, personal security, not just asset security, will be a defining theme of the crypto industry.\n\nMagazine: Danger signs for Bitcoin as retail abandons it to institutions: Sky Wee\n\nAdditional reporting by Cath Jenkin"}