{"url": "https://cointelegraph.com/news/sequoia-capital-victims-coinbase-breach-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Sequoia Capital exec also a victim in Coinbase data breach — Report", "authors": ["Turner Wright"], "publication_date": null, "text": "At least one partner at Sequoia Capital was reportedly impacted by the recent data breach among Coinbase users, suggesting that data from others at the venture capital firm may also have been compromised.\n\nAccording to a May 16 Bloomberg report, Sequoia Capital Managing Partner Roelof Botha’s personal information available through his Coinbase account was stolen after a group of cybercriminals bribed the exchange’s support agents for access to user data. Though Botha had not publicly disclosed his net worth, estimates suggested he had hundreds of millions of dollars in assets.\n\nCoinbase disclosed the data breach in a May 15 blog post, saying that some of its users had been targeted with social engineering attacks after the criminals had access to their personal account information. The company said the group attempted to extort $20 million in exchange for not disclosing the breach, which Coinbase rebuffed.\n\nThough the extent of the breach was still unknown, another Bloomberg report suggested that the same type of attacks targeted users at Kraken and Binance. Cointelegraph reached out to representatives from both exchanges but had not received responses at the time of publication.\n\nRelated: Bitcoin breaks out while Coinbase breaks down: Finance Redefined\n\nCoinbase's chief security officer, Philip Martin, reportedly said the contracted customer service agents at the center of the controversy were based in India and had been fired following the breach. The exchange also filed with the US Securities and Exchange Commission (SEC), estimating that they planned to pay between $180 million and $400 million in remediation and reimbursement to affected users.\n\nThe exchange’s stock (COIN) fell more than 7% following the reports of the data breach and phishing attacks, to $244. At the time of publication, the price of COIN shares was $264.24.\n\nCoinbase CEO in DC to advocate for crypto bills\n\nAmid the reports related to the data breach, Coinbase CEO Brian Armstrong was in Washington, DC, to support crypto-related legislation being considered in Congress. Lawmakers in the Senate are expected to vote on a stablecoin bill in a matter of days, and those in the House of Representatives are considering a draft digital asset market structure bill.\n\nMagazine: Bitcoin eyes ‘crazy numbers,’ JD Vance set for Bitcoin talk: Hodler’s Digest, May 4 – 10"}