{"url": "https://cointelegraph.com/news/world-liberty-financial-oversight-congress?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "World Liberty Financial brushes off oversight concerns from Congress", "authors": ["Turner Wright"], "publication_date": null, "text": "Zach Witkoff, one of the co-founders of the Donald Trump family-backed crypto platform World Liberty Financial (WLFI), has rebuffed efforts by US lawmakers to investigate the president’s potential conflicts of interest.\n\nIn a May 15 letter to Senator Richard Blumenthal, lawyers for World Liberty Financial claimed a call to investigate the crypto platform was based on “fundamentally flawed premises and inaccuracies.” Witkoff did not specifically address any allegations, claiming that WLFI was “too busy building” for oversight.\n\n“The Company rejects the false choice between innovation and oversight,” said the letter. “What it opposes is the misuses of regulatory authority and uncertainty to suppress lawful innovation.”\n\n\n\nMay 15 letter to Sen. Blumenthal. Source: Zach Witkoff\n\nBlumenthal, the ranking member of the US Senate Permanent Subcommittee on Investigations, was one of many Democrats calling for investigations and legislative changes in response to Trump’s ties to WLFI, as well as his TRUMP memecoin and its dinner scheduled for the top tokenholders on May 22.\n\nThe GENIUS Act, a bill to recognize stablecoins as payment instruments currently being considered in Congress, may be a bellwether for how lawmakers intend to handle the president’s potential conflicts of interest.\n\nStablecoin bill debate continues in Republican-controlled Congress\n\nOne of Blumenthal’s and many US lawmakers’ concerns about Trump’s connection to WLFI is the USD1 stablecoin, which the platform launched in March. An Abu Dhabi-based investment firm announced in May that it would use the stablecoin to settle a $2-billion investment in Binance, a crypto exchange that had previously been the target of an investigation by US authorities.\n\n“WLFI’s financial entanglements with the President, his family, and the Trump Administration present unprecedented conflicts of interest and national security risks, including potential violations of the foreign emoluments clause,” Blumenthal wrote in a May 6 letter to Witkoff.\n\nRelated: What are the next steps for the US stablecoin bill?\n\nSome Democrats have called for clarification within the GENIUS Act to ensure that Trump was not able to personally profit from stablecoins whose legislation he may have influenced and then have the opportunity to sign into law. However, as of May 16, it was unclear whether any future vote on the bill would address these concerns. Cointelegraph reached out to Sen. Blumenthal’s office for comment but had not received a response at the time of publication.\n\nMagazine: Trump’s crypto ventures raise conflict of interest, insider trading questions"}