{"url": "https://cointelegraph.com/news/europe-s-mi-ca-law-is-motion-but-can-the-crypto-industry-keep-up?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Europe’s MiCA law is motion, but can the crypto industry keep up?", "authors": ["Savannah Fortis"], "publication_date": null, "text": "The European Union’s Markets in Crypto-Assets regulation — better known as MiCA — is now in its critical implementation phase. Designed to unify crypto regulation across all 27 EU member states, MiCA promises clarity, consumer protection and long-term market stability. But as implementation begins, cracks are already showing.\n\nIn this week’s episode of Byte-Sized Insight, we explore the key provisions of MiCA now in force, particularly around stablecoins, and why some of the largest players in the market are refusing to comply.\n\nAs of January 2025, crypto asset service providers (CASPs) began acquiring licenses to operate legally within the EU. A transitional or “grandfathering” period allows existing firms up to 18 months, depending on the member state, to comply. Still, with deadlines approaching, firms are being forced to act quickly.\n\nStablecoins at bay\n\nOne of MiCA’s earliest and most controversial provisions involves stablecoins. Under the law, no stablecoin can be offered to EU users unless the issuer is authorized in the EU and publishes a regulator-approved white paper.\n\nStrict rules around asset reserves, governance, conflict of interest and marketing are also part of the package. Issuers are even banned from offering interest on tokens, removing a common incentive for adoption.\n\nRelated: Stablecoin regulation next ‘catalyst’ for crypto industry — Aptos head\n\nThe world’s most-used stablecoin — Tether’s USDt (USDT) — has already announced it won’t seek MiCA compliance, meaning exchanges may soon be forced to delist it across the EU. This has major implications for liquidity, retail access and DeFi activity in the region.\n\nTether CEO Paolo Ardoino told Cointelegraph’s Gareth Jenkinson at Token 2049:\n\n“The reason is not, uh, fear of regulations, fear of compliance… The problem that I had with um, with MiCA is that [the] license is very dangerous when it comes to stablecoins and I believe that it's even more dangerous for the small medium banking system in Europe.”\n\nCompliance is key\n\nOn the flip side, other firms are leaning in. BitGo, a crypto custody firm, recently secured a MiCA-aligned license in Germany, positioning itself to serve institutional players across Europe.\n\nBrett Reeves, head of Go Network and European Sales at BitGo, told Cointelegraph the license is not just about compliance, but long-term strategic alignment with Europe’s evolving regulatory landscape.\n\n“We found that both BaFin and the European regulators have been relatively straightforward to deal with. Sometimes they have difficult questions, but they're there to make sure that our processes are in place and up to scratch.”\n\nWe also spoke with Erwin Voloder, head of policy at the European Blockchain Association, who emphasized the need for consistent national-level interpretation and better guidance from regulators to prevent fragmentation.\n\nListen to the full episode of Byte-Sized Insight for the complete interview on Cointelegraph’s Podcasts page, Apple Podcasts or Spotify. And don’t forget to check out Cointelegraph’s full lineup of other shows!\n\nMagazine: Legal Panel: Crypto wanted to overthrow banks, now it’s becoming them in stablecoin fight\n\n\n\n\n\n\n\n"}