{"url": "https://cointelegraph.com/news/ethereum-proponent-claims-bitcoin-is-screwed-a-51-attack-likely?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "51% attack on Ethereum more difficult than on Bitcoin — Justin Drake", "authors": ["Adrian Zmudzinski"], "publication_date": null, "text": "Ethereum Merge architect Justin Drake told Cointelegraph that it would be cheaper to launch a 51% attack on Bitcoin than on Ethereum.\n\nDrake said it would be “much cheaper to 51% attack Bitcoin” and that it would cost “on the order of $10 billion.”\n\nDrake led work on Ethereum’s proof-of-stake (PoS) implementation and was a principal architect in the Merge (the full PoS transition event). His remarks echo a May 14 X post by Grant Hummer, the co-founder of Ethereum-focused marketing and product company Etherealize.\n\nIn the post, Hummer said that Bitcoin “is completely screwed because of its security budget.”\n\nHummer claimed it would cost $8 billion to run a successful 51% attack, and said a successful attack is “virtually certain” when the cost slips to $2 billion. A 51% attack occurs when a single entity or group controls over 50% of a blockchain network’s mining or staking power, gaining power over the network. Hummer added:\n\n“This will become blindingly obvious over the next decade. ETH is the only truly decentralized crypto-asset that can become the internet's [store of value].“\n\nRelated: Coin Metrics research shows BTC and ETH are immune to 51% attacks\n\nEthereum attack would cost much more\n\nDrake said that “to have 100% control of the chain, you need 50% + 1 of stake.” He said that it would be extremely difficult and expensive, but far from impossible:\n\n“A rich nation state can probably pull it off.“\n\nAt the time of writing, there were 34,168,987 staked Ether (ETH) worth nearly $89.6 billion. Consequently, half of all ETH has a current value of almost $44.8 billion.\n\nStaked Ether chart. Source: BeaconCha.in\n\nStill, a much higher investment would likely be needed. Ether has a current market cap of $316 billion and a 24-hour trading volume of $25 billion (just over 8% of the market cap).\n\nThe ETH needed for an attack is worth nearly 14.2% of the market cap and 180% of the 24-hour trading volume. An undertaking of that size would likely cause a significant ETH price appreciation, further increasing the cost of the attack.\n\nRelated: Big miners pose a growing existential threat to Bitcoin\n\nEthereum’s last line of defense\n\nMatan Sitbon, the founder and CEO of blockchain interoperability developer Lightblocks, told Cointelegraph that Ethereum has an additional feature to defend against such attacks.\n\n“Ethereum’s ultimate security lies not solely in cryptography or protocol rules, but in the community’s powerful social and economic coordination mechanisms,“ he said.\n\nDrake also highlighted another advantage that he claims Ethereum has over Bitcoin. He explained that “if there is a 51% attack, the social layer can identify the attacker and socially slash it.”\n\n“This is a superpower of PoS that is not available with PoW,“ he added.\n\nDrake’s statement refers to the social layer, meaning the network’s human supermajority, which decides which software to run. Bitcoin’s simpler proof-of-work (PoW) consensus mechanism has a smaller attack surface and longer reliability track record, but it lacks this feature.\n\nPavel Yashin, Researcher at P2P.org, told Cointelegraph that “if the centralization is detected,” the community could resolve it with a new fork. The old token would end up being delisted, and the compromised chain would fall into irrelevancy.\n\nHassan Khan, CEO at Bitcoin liquidity protocol Ordeez, told Cointelegraph that “the debate around the feasibility of a 51% attack remains open-ended — largely because while theoretically possible, in practice the barriers are extremely high.”\n\nHe said that for Bitcoin, the necessary amount of computing power and energy “makes a sustained attack highly improbable,” while for Ethereum, “PoS introduces additional economic and governance deterrents.”\n\nMagazine: Danger signs for Bitcoin as retail abandons it to institutions: Sky Wee"}