{"url": "https://cointelegraph.com/news/warren-buffett-exits-crypto-nubank-250m-profit?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Warren Buffett exits crypto-friendly Nubank holdings, netting $250M profit", "authors": ["Yashu Gola"], "publication_date": null, "text": "Key takeaways:\n\nWarren Buffett’s Berkshire Hathaway earned $250 million from its complete exit from crypto-friendly Nubank.\n\nThe decision to divest didn’t appear to be performance-based; Nu Holdings posted record profits in 2024 and Q1 2025.\n\nBuffett’s exit aligns with Berkshire’s broader financial sector pullback and growing cash reserve strategy.\n\nWarren Buffett, the legendary investor long known for his skepticism toward cryptocurrencies, has fully exited his position in one of Latin America’s most crypto-friendly banks, Nubank, before his departure from Berkshire Hathaway.\n\nBerkshire earns $250 million from crypto investments\n\nA May 15 filing with the US Securities and Exchange Commission (SEC) confirmed that Berkshire has liquidated its positions in Nubank’s parent firm, Nu Holdings, ending its stake in the digital bank.\n\nBerkshire began divesting its 40.2 million Nubank shares in 2024, selling about 20.7 million in the third quarter at an average price of $13.46 per share, according to data resource Stock Circle.\n\nBerkshire Hathaway’s Nu Holdings stake vs. NU price. Source: Stock Circle\n\nIn the fourth quarter, it sold an additional 46.3 million shares at an average price of $13.22. The final tranche of 40.2 million shares was sold in the first quarter of 2025 at an average price of $11.83.\n\nThese transactions culminated in a total gain of about $250 million from the initial investment.\n\nNU doing well without Buffett\n\nBuffett’s divestment from Nu Holdings further follows the latter’s impressive earnings in recent quarters.\n\nIn Q1 2025, the firm reported a net income of $557.2 million, marking a 47% increase compared to the same quarter in the previous year. Adjusted net income reached $606.5 million, reflecting a 37% year-over-year growth.\n\nIn 2024, Nu Holdings achieved an annual net income of $1.97 billion, representing a 91% increase from 2023, indicating that Berkshire’s decision to liquidate NU shares entirely was not about its performance.\n\nNU weekly performance chart. Source: TradingView\n\nBuffett’s exit aligns with Berkshire’s broader retreat from the financial sector. In Q1 2025, it also sold off Citigroup and cut its Bank of America stake, unloading over $2.1 billion in shares.\n\nThese moves pushed Berkshire’s cash reserves to a record $347.8 billion, with $305.5 billion in short-term US Treasurys.\n\nNubank has been among the most active digital banks embracing crypto services in Brazil, offering trading in Bitcoin (BTC), Ether (ETH), XRP (XRP), and other top cryptocurrencies directly through its app.\n\nRelated: Berkshire-backed Nubank adds ADA, NEAR, ATOM to crypto offerings\n\nIn 2022, the neobank allocated 1% of its net assets to BTC, furthering Buffett’s indirect exposure to Bitcoin despite his criticism toward the cryptocurrency, which he once called a “rat poison squared.”\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."}