{"url": "https://cointelegraph.com/news/china-linked-ddc-bitcoin-reserve-strategy?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "China-linked consumer brand DayDayCook plans to acquire 5,000 Bitcoin", "authors": ["Helen Partz"], "publication_date": null, "text": "Mainland China, one of the world’s most restrictive countries toward cryptocurrency, may be inching closer to adoption as a locally operating brand announced a Bitcoin reserve strategy.\n\nDDC Enterprise, also known as DayDayCook, a US consumer brand with Hong Kong roots and operations in mainland China, is adopting a Bitcoin (BTC) reserve strategy, CEO Norma Chu announced in a shareholder letter on May 15.\n\nAs part of the strategy, DDC has acquired 100 BTC for about $10.4 million and plans to accumulate 5,000 BTC in the next 36 months, with 500 BTC targeted by the end of 2025.\n\nChu’s Bitcoin reserve announcement came after the firm posted a 33% revenue increase in 2024, with total revenue amounting to 273.3 million Chinese yuan ($37.4 million), according to its Form 20-F filing with the US Securities and Exchange Commission (SEC) on May 15.\n\nDDC’s Bitcoin plans missing in SEC records\n\nDespite the public announcement, DDC’s latest SEC filings do not explicitly mention the company’s Bitcoin holdings or a Bitcoin reserve strategy.\n\n“We are embarking on a pioneering initiative to position DDC at the forefront of digital asset innovation with laser-focused execution on Bitcoin accumulation,” the DDC CEO said in the shareholder letter.\n\nChu previously announced DDC’s intentions to adopt a Bitcoin reserve strategy in another letter on March 18.\n\nAlthough DDC’s annual report does not mention Bitcoin reserve plans, the SEC filing provides hints of the company’s intended adoption of BTC as a new asset class.\n\n“The company [DDC] is evaluating strategies to obtain the required additional funding for future operations,” the report said, adding:\n\n“The Company plans to diversify revenue streams and implement cost-saving measures to grow revenues and decrease expenses. However, the company may be unable to access further equity or debt financing when needed.”\n\nAdditionally, the filing refers to crypto disclosure guidelines set by the accounting standards update by the Financial Accounting Standards Board (FASB) issued in late 2023.\n\nAn excerpt from the DDC’s F-20 annual report. Source: SEC\n\n\n\n“In December 2023, the FASB issued ASU 2023-08, “Intangibles, Goodwill and Other-Crypto Assets (Subtopic 350-60). Accounting for and Disclosure of Crypto Assets,” the filing notes, adding that firms are allowed to start using the new rules early if their financial reports haven’t been published yet.\n\nChina’s evolving stance on crypto\n\nDDC’s filing says that the firm partly operates in mainland China and Hong Kong, which puts its financial conditions and growth under the influence of local political, economic and social developments.\n\nAs of May 2025, mainland China has maintained a restrictive agenda toward cryptocurrency trading and mining since 2021, when local regulators announced a major ban on crypto transactions.\n\nRelated: US-China trade deal could shed light on Bitcoin’s use case: Trader\n\nHowever, many online reports have speculated that China may lift its crypto ban amid growing adoption in Hong Kong, as well as the ongoing global shift to crypto fueled by the crypto-friendly approach of the US administration under President Donald Trump.\n\n\n\nBitcoin mining map by countries as of January 2022. Source: CBECI\n\nStill, some analysts have questioned mainland China’s plans to “unban Bitcoin” despite the fact that it has somehow remained a major global player in Bitcoin mining even after the ban was enacted.\n\nCointelegraph approached DDC for comment regarding its Bitcoin reserve plans but had not received a response by the time of publication.\n\nMagazine: How Chinese traders and miners get around China’s crypto ban\n\n\n\n"}