{"url": "https://cointelegraph.com/news/bitcoin-breakout-odds-climb-all-time-highs-90k-dip-warning?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Bitcoin breakout odds climb as all-time highs meet $90K dip warning", "authors": ["William Suberg"], "publication_date": null, "text": "Key points:\n\nBitcoin refuses to budge from a narrow range as traders consider the likely breakout direction.\n\nPrice discovery is keenly awaited, but downside predictions include levels further toward $90,000.\n\nBTC/USD has delivered highly patterned moves since its rebound began in April.\n\nBitcoin (BTC) kept traders guessing at the May 16 Wall Street open as consolidation sparked both bullish and bearish forecasts.\n\nBTC/USD 1-hour chart. Source: Cointelegraph/TradingView\n\n“Significant” liquidity builds around BTC price\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD shuttling between $103,000 and $104,000 on the day.\n\nDespite beating expectations, the latest US macroeconomic data in the form of the Consumer Price Index (CPI) and Producer Price Index (PPI) prints on May 13 and 15, respectively, failed to exert a strong influence on short-term price behavior.\n\nInstead, traders focused on Bitcoin’s latest consolidation phase less than 10% away from new all-time highs.\n\n“$BTC Has been doing roughly the same thing since the April lows. Move up, tight consolidation, new leg up,” popular trader Daan Crypto Trades wrote in part of ongoing X analysis.\n\n“Keep an eye on this local range and wait for a breakout to either direction would be my recommendation.”\n\nBTC/USD 6-hour chart. Source: Daan Crypto Trades/X\n\n\n\nA separate post noted areas of thick liquidity on either side of the price, potentially providing near-term targets should BTC/USD exit its narrow range.\n\n$BTC Liquidation Map showing a large cluster at $105K-$106K and a ton sitting between $99K-$103K.\n\n\n\nThis makes sense as these are the highs/lows of the current tiny range we're consolidating in for the past week or so.\n\n\n\nLately, we've seen a lot of similar consolidations and we… pic.twitter.com/y387V1WzsC — Daan Crypto Trades (@DaanCrypto) May 16, 2025\n\n“Notice the massive concentration of long liquidations clustered tightly just below the current price, particularly around 10280-10300? This represents a significant pool of liquidity,” fellow trading TheKingfisher continued.\n\n“Shorts are more spread out higher up. This imbalance makes the zone below a key area to watch. It could act as a price magnet, or a trigger point for cascading liquidations if price moves down.”\n\nBitcoin exchange order book liquidity data. Source: TheKingfisher/X\n\nAnother popular trader, Crypto Caesar, suggested that a range breakout could run deeper and take Bitcoin further below the $100,000 mark.\n\n“If price breaks and holds above this zone, we could see new crazy highs,” he told X followers, referencing a bullish crossover on the weekly moving average convergence/divergence (MACD) indicator.\n\n“However: a rejection right here might lead to a pullback toward $90K.”\n\nBTC/USDT 1-week chart with MACD data. Source: Crypto Caesar/X\n\nA rinse-and-repeat Bitcoin breakout?\n\nLike Daan Crypto Trades, analyst Kevin Svenson was keen to see a continuation of the stop-start rebound in place since April.\n\nRelated: Bitcoin hitting $220K ‘reasonable’ in 2025, says gold-based forecast\n\nAnalyzing 4-hour timeframes on the day, he delivered his next upside BTC/USD target well inside price discovery.\n\n“So far, the measured move extrapolations of each leg up in this run have been pinpoint accurate,” he wrote.\n\n“If this trend continues, if this pattern holds, the next target is $115,000.”\n\nBTC/USDT 4-hour chart. Source: Kevin Svenson/X\n\nEarlier, Cointelegraph reported on a variety of BTC price predictions now in force, with commentators overwhelmingly favoring upside next.\n\nZooming out, $1 million per coin may become reality in three years’ time or even sooner, according to former BitMEX CEO Arthur Hayes.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\n\n\n"}