{"url": "https://cointelegraph.com/news/stablecoin-bill-likely-pass-senate-several-weeks-digital-chamber?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "US Senate will pass Stablecoin bill — Digital Chamber chief", "authors": ["Vince Quill"], "publication_date": null, "text": "The stalling of key stablecoin legislation in the United States Senate was a minor setback, and the bill will pass in the coming weeks, said Cody Carbone, CEO of Digital Chamber, a Washington, DC,-based blockchain trade association and advocacy group.\n\nSpeaking to Cointelegraph at Consensus 2025, Carbone argued it is in the best interests of the US to pass comprehensive stablecoin regulations to protect US dollar hegemony in global markets, which has bipartisan appeal and support. Carbone said:\n\n\"These things never move as quickly as we want them to move, but it's stablecoin legislation. This Congress has already moved more expeditiously than we ever could have imagined. So, yes, it's a bump in the road, but I think very, very shortly, we will have another vote.\"\n\nThe Guiding and Establishing National Innovation in U.S. Stablecoins of 2025, or GENIUS Act, is seen as a critical piece of legislation. Failing to pass comprehensive regulatory reform before the midterm elections in 2026 could mean a reversal in the positive regulatory environment and a downturn in the crypto markets.\n\n\"Negotiations have continued, and so I am still very optimistic,” Carbone said. “This bill is going to pass the Senate in the next few weeks.”\n\nThe GENIUS Act of 2025. Source: US Senate\n\nRelated: What are the next steps for the US stablecoin bill?\n\nPartisan politics and Trump's involvement in crypto blamed for bill failure\n\nThe act failed to pass a procedural vote in the Senate on May 8 after several Democratic lawmakers withdrew support for the bill, citing US President Donald Trump's involvement in crypto as a potential cause for ethics concerns and the primary driver for backpedaling support for the bill at the last minute.\n\nCoinbase chief legal officer Paul Grewal likewise said that Trump's crypto ties complicate the regulatory process, as lawmakers continue to scrutinize his activities in the memecoin market, decentralized finance, and the non-fungible token (NFT) sector.\n\nRepublican Senator Tim Scott fired back against the concerns voiced by Democratic policymakers, attributing the failure to partisan politics and an attempt by Democrats to prevent Trump from achieving the administration's digital asset goals.\n\nThe latest version of the bill removes references to the Trump family and could pass the Senate by the end of May, some industry executives say.\n\nMagazine: Crypto wanted to overthrow banks, now it’s becoming them in stablecoin fight"}