{"url": "https://cointelegraph.com/news/the-emergence-of-sonic-and-what-it-means-for-de-fi-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "The emergence of Sonic and what it means for DeFi: Report", "authors": ["Igor K"], "publication_date": null, "text": "Why did Fantom reinvent itself as Sonic?\n\nFantom was one of the pioneers of the directed acyclic graph (DAG) design for distributed ledgers. It featured fast finality and transaction fees of a fraction of a cent. However, Fantom relied on the Ethereum-derived account storage model and the EVM, which led to bloated storage and slow execution times.\n\nTo address these bottlenecks and implement numerous other updates, the team behind Fantom rolled out Sonic, a fully independent new blockchain network. A new report by HTX explores Sonic's technological background, its new tokenomics model and the innovations it brings to DeFi.\n\nDownload a full version of the report for free here\n\nSonic’s technical architecture\n\nSonic runs on the proprietary SonicVM execution engine, which dynamically translates EVM bytecode into a faster internal format for speedier execution. It also optimizes heavy computations to prevent repeated work and pre-analyzes contract code to cache valid jump destinations. The SonicVM is fully compatible with the EVM, meaning that Fantom smart contracts can run seamlessly on the new blockchain.\n\nTo address the issue of hefty onchain data storage and slow node synchronization, Sonic uses a new database design called SonicDB. SonicDB separates the blockchain state into two databases. It uses the LiveDB for fast access to the current state and execution, and the ArchiveDB for storing full historical data. This separation allows consensus nodes to cut data storage requirements by up to 90% and thus significantly reduces hardware requirements and synchronization time.\n\nFor a more comprehensive explanation of the technical aspects of Sonic, download the full report for free here.\n\nIntroducing the S token\n\nThe Sonic mainnet is powered by a new native token, S. Holders of FTM can convert their tokens to S at a 1:1 ratio using the official portal. S remains non-inflationary over the first six months following the mainnet launch in December 2024. Then, 6% of the initial supply will be minted to reward the early users of the blockchain. The full report offers in-depth coverage of several capital-efficient airdrop farming strategies with different risk profiles.\n\nSonic rewards developers as well via its Gas Fee Monetization (FeeM) mechanism. Up to 90% of the transaction fees across participating applications are forwarded to developers, while the rest is routed to validators.\n\nBecoming a new hub for DeFi\n\nAndre Cronje, one of the founders of Fantom and the mastermind behind the Yearn.finance protocol is spearheading DeFi innovation on Sonic. Cronje unveiled Flying Tulip, a new DeFi platform that combines trading, liquidity pools and lending functionalities. The report discusses some innovations Flying Tulip brings to the Sonic blockchain.\n\nFlying Tulip is based on the same concept as Curve v2’s dynamic bonding curve. An AMM with a dynamic bonding curve adjusts its curvature based on how close the pool price is to an external price observed by an oracle. It also automatically concentrates the liquidity around the current price, simplifying liquidity management and enhancing capital efficiency. Flying Tulip introduces even faster equilibrium curve updates and narrower ranges alongside other improvements with a novel dynamic loan-to-value model. To learn more about Flying Tulip and its benefits, check out the full Sonic report by HTX:\n\nDownload a full version of the report for free here\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision. This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. Cointelegraph does not endorse the content of this article nor any product mentioned herein. Readers should do their own research before taking any action related to any product or company mentioned and carry full responsibility for their decisions."}