{"url": "https://cointelegraph.com/news/eric-trump-fake-token-rug-in-making-blockchain-data-firm?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound", "title": "Fake Eric Trump-themed token is ‘rug in the making,’ says Bubblemaps", "authors": ["Zoltan Vardai"], "publication_date": null, "text": "A fake Eric Trump-themed memecoin launched on Solana’s memecoin launchpad Pump.fun, rose more than 6,200% in the past 24 hours, raising red flags among blockchain analysts who warned of a potential rug pull.\n\nA newly-created Eric Trump (ERICTRUMP) memecoin with the token address “jv7d” surpassed $140 million in market capitalization within a day since its launch on May 16, CoinMarketCap data shows.\n\nERICTRUMP/USD, all-time chart. Source: CoinMarketCap\n\nThe memecoin’s distribution raises significant red flags that point to a rug pull “in the making,” warned blockchain data platform Bubblemaps in a May 16 X post.\n\nA rug pull typically refers to the sudden removal of liquidity or mass sell-off by token insiders, often resulting in a steep price collapse that leaves retail holders with worthless tokens.\n\nLooking at Bubblemaps’ token clusters for the 250 largest holders, the majority of these tokens are held across 10 token clusters, founded by 10 main crypto addresses.\n\nRelated: Coinbase faces $400M bill after insider phishing attack\n\nThe token’s ownership pattern is reminiscent of recent memecoin collapses, including the Wolf of Wall Street-inspired WOLF token, created by Hayden Davis, the co-creator of the Official Melania Meme (MELANIA) and the Libra token.\n\nOver 82% of the WOLF token’s supply was held by the same entity, which led to a 99% price crash after the token peaked at a $42 million market capitalization.\n\nRelated: Ukraine strategic Bitcoin reserve bill reportedly in final stages\n\nEric Trump token deployer created four scam tokens\n\nThe deployer behind the fake Eric Trump token also created three other Eric Trump tokens that failed on Pump.fun,” a Bubblemaps investigator told Cointelegraph.\n\nFake Eric Trump tokens created by the same deployer: Source: Solscan, Bubblemaps\n\nBlockchain data shared by the firm shows that these tokens were all created around the same time by the Solana blockchain address “BjTm.”\n\nIndustry watchers have been increasingly vigilant about rug pulls since the meltdown of the Libra (LIBRA) token, endorsed by Argentine President Javier Milei, which saw eight insider wallets cash out $107 million in liquidity, leading to a $4 billion market cap wipeout within hours.\n\nMagazine: Crypto wanted to overthrow banks, now it’s becoming them in stablecoin fight"}