{"url": "https://techcrunch.com/2024/03/19/cure51-raises-a-e15m-seed-round-aiming-to-crack-the-code-on-cancer-survival/", "title": "Cure51 raises a €15M seed round aiming to crack the code on cancer survival", "authors": ["Mike Butcher", "Editor At Large", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-03-19T00:00:00", "text": "Rather than grimly assembling data about cancer deaths to predict outcomes in treatment, the founders of Cure51 had another idea: Instead, the company assembles data about long-term survivors of cancer, hoping to crack the code on what keeps people alive.\n\nThe company has now raised a €15 million seed round led by Paris-based Sofinnova Partners. Other investors in the round included Hitachi Ventures GmbH, Life Extension Ventures, Xavier Niel and Olivier Pomel, the CEO and co-founder of Datadog.\n\nCure51 will now use the money to build a “cohort” of data to work out why certain cancer patients survive for a long time, even with highly aggressive forms of the disease.\n\nCure51 was founded in March 2022 by Nicolas Wolikow and Simon Istolainen. Wolikow formerly founded healthtech startup Qare, and Istolainen has previously been an investor and consultant in healthcare.\n\nWolikow told me: “There are plenty of companies licensing oncology databases, but their databases don’t include survivors. They don’t present such a granularity of multi-omics data (single cell and spatial), and they lack ethnic diversity.”\n\nHe also claims companies like Flat Iron (Roche), Market Scan (IBM) and Iqvia offer “simple databases with clinical data and sparse genomic data.” But molecular databases “at multi-omics levels are required for drug discovery,” he said.\n\nIn a statement, Simon Turner, a partner at Sofinnova Partners, commented: “Looking at ‘mechanisms of exceptional survival’ is not a new concept, but Cure51 has taken this to a whole new level in terms of the scale of the endeavor, plus leveraging the latest in analytical techniques.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe tech industry has increasingly turned its guns on cancer in recent years.\n\nAlphabet recently announced a number of initiatives to deploy AI models in the healthcare industry. One will be a tool that will help Fitbit users get insights from their devices and a partnership to improve screenings for cancer and disease in India."}