{"url": "https://techcrunch.com/2022/09/14/blue-sky-wants-to-help-lower-your-snowflake-data-bills/", "title": "Bluesky built cost guardrails to help cut Snowflake data spend", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-09-14T00:00:00", "text": "Snowflake has a revenue model that investors have to love, but big customers, not so much. That’s because it’s based on a consumption model where the more you use, the more you pay — and when it comes to data management these days, that can add up pretty quickly.\n\nBluesky, a new startup from a couple of ex-Google and Uber engineers, came up with a way to help reduce those bills, and today the company announced a healthy $8.8 million seed.\n\nMingsheng Hong, Bluesky co-founder and CEO, who spent more than eight years at Google, says that Bluesky takes an organized approach to cost cutting. “First, we observe to get the visibility to understand who has been spending and what the most expensive workloads and queries are,” Hong explained. He jokingly referred to this step as “the walk of shame because finally everyone knows how much you’re spending.”\n\nThe idea is to delete workloads that are costing cash but don’t add a lot of value.\n\nThe second piece involves optimizing the remaining spend by finding what the most expensive workloads are and figuring out how to adjust them to reduce the overall cost. He said it’s often about simply changing how they run the query, taking a smarter approach to save money.\n\n“These queries will still run, and they will still get the same result, but we run them faster and cheaper by, for example, avoiding scanning a huge table, when we can generate indices [to get the same result] without having to scan a very large dataset.”\n\nThe last step, which is planned for the future, is to have an optimization engine that automatically does this for you. Once customers trust the software to do the job, it will constantly be scanning the workloads and searching for ways to cut costs automatically.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nYou may think that Snowflake would be threatened by such a product, but Hong says the company is actually a partner. “Snowflake is bringing us in to help customers to reduce or manage growth, and this way all three parties are happy. Customers can sign a larger contract with Snowflake, and yet they know they have the assurance that they have the cost guardrails that Bluesky provides,” he said.\n\nHe said the product is built around optimizing SQL queries, and that it plans to apply the same approach to other consumption-based data products like Databricks in the future.\n\nThe company is just six months old, but has more than 10 customers using the product including Coinbase. Hong launched the company with CTO Zheng Shao, who helped build the open source project Apache Hive, a SQL query engine built on top of Hadoop, an early way of dealing with large datasets.\n\nThe company currently has 15 employees, and he is trying to build a diverse group right out of the gate. “In terms of diversity, we make sure that we have people coming in with different perspectives. They may have a different perspective due to their culture or gender, but first and foremost, it’s not about trying to diversify for the sake of diversity, hitting some metrics. It’s about people coming in with different ideas and perspectives,” Hong said.\n\nToday’s $8.8 million seed investment was led by Greylock with participation from several industry angels."}