{"url": "https://techcrunch.com/2025/03/11/the-sibling-founders-of-stax-payments-are-back-with-a-new-fintech-and-a-20m-seed-raise/", "title": "The sibling founders of Stax Payments are back with a $20M seed raise for their new fintech, Worth", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-11T00:00:00", "text": "Worth, a company focused on helping fintechs, banks, and enterprises underwrite small and medium-sized businesses more easily, has raised $20 million in a seed funding round, the startup tells TechCrunch exclusively.\n\nIt’s a large seed round, especially these days when capital is harder to come by. But the founders’ history may have something to do with that. Sal Rehmetullah and Suneera Madhani, who are siblings, also founded another fintech company, Stax Payments. They exited that startup after nearly 10 years when it was valued at north of $1.1 billion, said Madhani, after growing it to over $140 million in recurring revenue and raising $245 million in funding. (Stax still operates but the pair haven’t been part of the business in over two years.)\n\nNow they’re aiming to take their learnings from that experience to grow Orlando, Florida-based Worth, which they say is providing “frictionless” onboarding and underwriting for SMBs applying for credit-based products, loans, or financing.\n\n“Today, as a consumer you can apply for an Apple Card on your phone and use it minutes later at a coffee shop. It’s instant and seamless. But if you’re a small business applying for the same credit card, financing, merchant services, or a new bank account? That is a different story,” Madhani said.\n\nAnd when a small business applies for financing, credit cards, loans, any financial service or onboarding to enterprises, they often have to complete a cumbersome application process, upload several documents, and wait several days — and in some cases, weeks — for a response, she added.\n\nWorth says its technology “fixes” these issues, meaning that SMBs instead face less paperwork, less application abandonment, fewer delays, and faster approvals when applying for credit cards or loans. It claims that it helps entities “quickly and easily” prefill, onboard, and underwrite small businesses with just three fields: their name, address, and tax ID.\n\nIt does this by pre-filling an application with necessary data and automating all the checks a financial institution needs to do, said Rehmetullah. Those checks include Know Your Business (KYB), Know Your Customer (KYC), ownership identity verification, fraud verification, bank account verification, and financial statement analysis in real time. And, Worth says it is able to perform those checks on SMBs and business owners across the globe, not just in the United States.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWorth, which launched its product a year ago, has used artificial intelligence and a strategic relationship with Equifax to build a proprietary set of data on more than 242 million global SMBs by analyzing large volumes of data from bank accounts, tax returns, QuickBooks, Stripe, and other sources. By continuously updating it, it’s able to provide financial institutions, credit unions, payment processers, and fintechs with real-time data, said lead investor Neil Kapur, partner of TTV Capital, which led the startup’s equity raise.\n\n“We have the full 360 financial data of a small business, which has been nonexistent,” Rehmetullah said.\n\nWhile the founders won’t disclose hard revenue figures to date, they told TechCrunch that the startup’s ARR is in the “seven figures,” and that its growth is “exceeding the triple digits,” including adding 12 customers in the fourth quarter of 2024 alone.\n\nWorth currently has over 25 clients, including Aurora Payments, REPAY Holdings, Fairwinds, and PatientFi, among others.\n\nThe company makes money by charging a platform fee for access to pre-filling capabilities, instant verification services, a case management database, ongoing predictive monitoring, and AI-based features. It also charges a per-entity verification usage fee.\n\nLooking ahead, Worth plans to launch a “Worth Score,” or business credit score, to SMBs directly in early 2026 in an effort to help them better understand their financial health.\n\nPresently, Worth has more than 50 full-time employees.\n\nTTV Capital led the equity raise, which also included participation from Ingeborg, Florida Funders, Deep Work Capital, and Florida Opportunity Fund. Worth also secured $5 million in debt funding from Silicon Valley Bank.\n\nWorth plans to use its new capital primarily to scale its organization, particularly across sales and marketing.\n\nTTV’s Kapur believes that Worth is increasing operational efficiency for customers in an automated way, “which provides immediate and quantifiably measurable ROI.” His firm also believes that Worth’s founding team “is uniquely qualified” to solve the challenges of onboarding and underwriting for financial institutions.\n\n“TTV is investing in the founders as much as the idea itself,” he told TechCrunch."}