{"url": "https://techcrunch.com/2025/02/11/anduril-takes-control-of-microsofts-22b-vr-military-headset-program/", "title": "Anduril takes control of Microsoft’s $22B VR military headset program", "authors": ["Julie Bort", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-02-11T00:00:00", "text": "The Army plans to grant upstart weapons maker Anduril control of one of its highest-profile and long-troubled projects known as the Integrated Visual Augmentation System (IVAS) pending final Department of Defense (DoD) approval, founder Palmer Luckey announced in a blog post Tuesday.\n\nIVAS was initially awarded to Microsoft in 2018 to develop augmented reality headsets for soldiers based on a ruggedized version of HoloLens. The initial budget for IVAS was set at $21.9 billion.\n\nAnduril will now assume control of the contract. While Microsoft is being removed as the prime contractor, it is not being kicked off the project. The company will continue to be the cloud provider, according to Microsoft.\n\nAnduril will be tasked with oversight of production, the future development of both hardware and software, and the delivery timelines, Microsoft said.\n\nThe initial idea was to give troops a heads-up display with features like a thermal sensor, Tactical Assault Kit software (which provides various types of mission-critical information), and maps.\n\nAnduril’s Lattice software had already been added to Microsoft’s IVAS headsets, the company announced in September. Lattice added computer vision AI and other features that helped the headset detect, track, and classify objects.\n\nBut IVAS has had a long history of problems.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBack in 2022, the DoD’s inspector general issued a report saying IVAS wasn’t doing a good enough job serving the people — meaning the soldiers — who will use the headsets. The report warned, “Procuring IVAS without attaining user acceptance could result in wasting up to $21.88 billion in taxpayer funds to field a system that soldiers may not want to use, or use as intended.”\n\nMicrosoft’s prototypes suffered from technical issues, as prototypes tend to do, such as detecting virtual objects, sources told Breaking Defense in 2023.\n\nIn August, the Army indicated it was open to pulling Microsoft off as the prime contractor although the tech giant vowed it would enter any new bidding process to attempt to keep it, Breaking Defense reported.\n\nLuckey’s blog post on the Anduril win waxed poetic and covered a lot of celebratory ground, including diss to a competitor. The blog post got downright comical at certain points.\n\n“Tactical heads-up-displays that turn warfighters into technomancers and pair us with weaponized robotics were one of the products in the original Anduril pitch deck for a reason,” he wrote.\n\n“If Anduril had been more than a dozen people when IVAS was first getting spun up all those years ago (at least the Tragic Heap guys didn’t win, our country really dodged a bullet there), I do believe our crazy pitch could have won this from the start,” he continued.\n\nTragic Heap is Luckey’s unkind nickname for Magic Leap, reportedly among the 80-some companies vying to take over this project. Others included Palantir, and Kopin, which builds displays used in F-35 helmets, Breaking Defense reported.\n\nLuckey also teased that a whole list of new features were planned for the project but didn’t name them. Instead he jokingly redacted that paragraph.\n\n“Whatever you are imagining, however crazy you imagine I am, multiply it by ten and then do it again. I am back, and I am only getting started,” he promised.\n\nWhether the project, under its soon-to-be new prime contractor Anduril, will retain the entire $22 billion budget remains to be seen. Threats to cut funding, or cancel the program altogether, have been ongoing for years.\n\n\n\nFor Microsoft’s part, the company’s VP of mixed reality Robin Seiler wrote in its public statement, “We are incredibly proud of the work our teams have put in to help the U.S. Army transform its concept of a soldier-borne, AR headset into reality with the IVAS program.”\n\nStill, 2025 is already shaping up to be a hell of a year for Luckey and Anduril. The company is in talks to raise up to a $2.5 billion round at a $28 billion valuation. And it announced that the location of its new weapons-building megafactory will be in Ohio.\n\n\n\nNote: This story was updated to include Microsoft’s statement and to clarify that the official transfer is still pending DoD approval, although both companies have announced the change in the contract."}