{"url": "https://techcrunch.com/2022/08/12/amazon-launches-aws-private-5g-so-companies-can-build-their-own-on-site-mobile-networks/", "title": "Amazon launches AWS Private 5G", "authors": ["Paul Sawers", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-08-12T00:00:00", "text": "Amazon’s cash-cow cloud division AWS has launched a new service designed to help companies deploy their own private 5G networks — eventually, at least.\n\nAWS first announced AWS Private 5G in early preview late last year, but it’s now officially available to AWS customers starting in its U.S. East (Ohio), U.S. East (N. Virginia), and U.S. West (Oregon) regions, with plans to roll it out internationally “in the near future.”\n\nBut — and this is a big “but” — despite its name, AWS Private 5G currently only supports 4G LTE.\n\n“It supports 4G LTE today, and will support 5G in the future, both of which give you a consistent, predictable level of throughput with ultra low latency,” AWS chief evangelist Jeff Barr wrote in a blog post.\n\nWith AWS Private 5G, companies order the hardware (a radio unit) and a bunch of special SIM cards directly from AWS, and AWS then provides all the necessary software and APIs (application programming interfaces) to enable businesses to set up their own private mobile network on-site. This incorporates the AWS Management Console, through which users specify where they want to build their network and their required capacity, with AWS automating the network setup and deployment once the customer has activated their small-cell radio units.\n\nCrucially, the AWS-managed network infrastructure plays nicely with other AWS services, including its Identity and Access Management (IAM) offering, which enables IT to control who and what devices can access the private network. AWS Private 5G also channels into Amazon’s CloudWatch observability service, which provides insights into the network’s health, among other useful data points.\n\nIn terms of costs, AWS charges $10 per hour for each radio unit it installs, with each radio supporting speeds of 150 Mbps across up to 100 SIMs (i.e. individual devices). On top of that, AWS will bill for all data that transfers outwards to the internet, charged at Amazon’s usual EC2 (Elastic Compute Cloud) rates.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSo in effect, Amazon is promising industries — such as smart factories or other locations (remote or otherwise) with high-bandwidth requirements — instant, localized 5G, while shoehorning them onto its sticky cloud infrastructure where the usual fees apply.\n\nPublic vs private\n\nIt’s clear that 5G has the potential to transform many industries , and will be the bedrock of everything from robotics and self-driving cars to virtual reality and beyond. But public 5G networks, which is what most consumers with 5G-enabled devices currently rely on, have limited coverage and the bandwidth may be shared by million of users. On top of that, companies have little control over the network, even if their premises are within range of the network. And that is why private 5G networks are an appealing proposition, particularly for enterprises with mission-critical applications that demand low-latency data transfers round-the-clock.\n\nAWS Private 5G uses Citizen Broadband Radio Service (CBRS), a shared 3.5 GHz wireless spectrum that the Federal Communications Commission (FCC) authorized in early 2020 for use in commercial environments, as it had previously been reserved for the Department of Defense (DoD). So this update essentially opened CBRS to myriad use-cases, including businesses looking to build new 5G services, or extend existing 4G/LTE services.\n\nAt the same time, the FCC announced key Spectrum Access System (SAS) administrators who would be authorized to manage wireless communications in the CBRS band, a process effectively designed to protect “high priority” users (e.g. the DoD) from interference. Any device connecting to the CBRS spectrum needs authorization from a SAS administrator, which today includes Google, Sony, CommScope, Federated Wireless, Key Bridge Wireless and Amdocs.\n\nAnd this is a key component of the new AWS Private 5G service — it’s fully-integrated into the SAS administration process, with AWS managing everything on behalf of the customer, including taking on responsibility for interference issues among other troubleshooting tidbits relating to spectrum access.\n\nSo Amazon’s new private 5G offering is perhaps something of a misnomer as it stands today, insofar as it currently only supports 4G LTE. But the OnGo Alliance (then called the CBRS Alliance) completed its 5G specs for CBRS more than two years ago now, and the intervening months have been about setting the foundation to enable fully commercial 5G services — just yesterday, Samsung Electronics America announced a partnership with Kajeet to deploy a new private 5G network on CBRS.\n\nBut while “AWS Private 5G” is a nod to what it’s built to support in the future, the current branding may cause some consternation among interested parties seeking local 5G deployments today."}