{"url": "https://techcrunch.com/2024/05/17/indiebios-sf-incubator-lineup-is-making-some-wild-biotech-promises/", "title": "IndieBio’s SF incubator lineup is making some wild biotech promises", "authors": ["Devin Coldewey", "Writer", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-05-17T00:00:00", "text": "IndieBio’s Bay Area incubator is about to debut its 15th cohort of biotech startups. We took special note of a few, which were making some major, bordering on ludicrous, claims that could pay off in a big way.\n\nBiotech has been creeping out in recent years to touch adjacent industries, as companies find how much they rely on outdated processes or even organisms to get things done. So it may not surprise you that there’s a microbiome company in the latest batch — but you might be surprised when you hear it’s the microbiome of copper ore.\n\nI talked with IndieBio’s chief science officer, Wes Dang, about the companies I found most promising or provocative, and he assured me that despite sounding somewhat outlandish, these companies are serious and the IndieBio program does a lot of verification work.\n\n“We’re all technical by background, several PhDs, including myself — we do the diligence together. We all look at the papers, and some of us go deep and check the figures and assumptions,” he said.\n\nStream Genomics is perhaps the most easily grasped of the new group: a genome sequencing method and device that is faster and cheaper than runaway market leader Illumina, and more importantly reduces the need for wet-lab prep that still takes a lot of time and expertise.\n\nImage Credits:Stream Genomics\n\nThere are cheaper sequencers out there, but because Illumina is so deeply embedded, the cost of switching is high, especially if you’re only saving money on the sequencing step. Stream Genomics’ approach minimizes sample prep and reagents used (the sequencing isn’t cyclic) while shifting a lot of the computational load to the cloud. They say it’s orders of magnitude quicker and cheaper.\n\n“With Stream, you’re just watching the nucleotides incorporate in real time, looking at the colors associated with the As, Ts, Gs, and Cs coming up, and doing it without a huge computational load,” said Dang. “It’s the equivalent of streaming versus download a Blu-ray.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIllumina is too big to be displaced outright, but smaller operations will likely appreciate a faster, less involved option for sequencing than either sending it out to a third party (which can take weeks or months) or building their own sequencing lab (expensive).\n\nAnother company looking at a potentially huge change is AquaLith, a battery tech startup that claims (we covered them last year) to have figured out a silicon anode material that resists the type of long-term wear and tear that it is usually subject to. The specifics are certainly in the weeds, but the company is planning to sell just the material to battery makers who already have the means to make batteries of this type but need the silicon mixture — “Basically a slurry,” said Dang — which Aqualith makes exclusively.\n\nAs you can see, the AquaLith thing (right) is smoother. Image Credits:Aqualith\n\nBattery startups and alternative chemistries have come and gone for decades, and only a small portion end up being anything but a footnote; however, AquaLith is apparently solving for a very specific problem in an otherwise noncontroversial part of the domain. They have plans to make a nonflammable battery cell soon as well. Here’s hoping it works out.\n\nFarm Minerals is starting its journey off with a bit of good old-fashioned stunt advertising: It’s giving away the first million acres’ worth of its synthetic fertilizer for free. “They’re basically doing it as a sort of flex,” said Dang. “It’s just so incredibly cheap to make.”\n\nElectron microscope image of the high-surface-area structure of the mineral additive. Image Credits:Farm Minerals\n\nFertilizer is a huge expense for farming and you need tons of it to cover a good-size field. But ultimately crops need only a small amount of the minerals in it — so Farm Minerals is encapsulating those minerals in a special super-bioavailable carbon casing. They say that 160 grams of it is enough for — checks notes — 2 million hectares?!\n\n“As a scientist, I was like, no fucking way this works,” Dang said after I offered a similarly blue appraisal. But they looked into it and apparently it does. Also, that means they’re giving away about a cereal bowl’s worth of product for the stunt. Suddenly that part doesn’t seem so wild. That jug in the image above is probably enough to cover the whole country. We’ll follow up with the company soon to see about independent validation of these claims.\n\nImage Credits:Transition Biomining\n\nTransition Biomining may be the most sci-fi of the companies, trying, as they describe it, “to squeeze life out of a rock.” The issue is this: Only a certain amount of the minerals in raw ore can be easily collected through the physical and chemical processes (already quite extreme and caustic) currently used. What’s better than getting 95% of the copper out of five gigatons of ore? Getting 98% of it. (I’m inventing these numbers.) And if Transition’s method works, someone else will be doing the work: microbes.\n\nThe company aims to test and understand the microbiome of the rock — that is, the unique set of microbes living in and around it — and modify it so that minerals are being extracted by those microbes just doing their thing. It won’t replace the acid baths and other traditional methods, but it might help make mines more efficient.\n\nThere are plenty more in the batch. Here’s a brief rundown of the others:\n\nAble Sciences: Self-amplifying RNA that lowers the cost of cell therapy.\n\nBryosphere: Treatment for age spots made in a moss cell reactor.\n\nHypercell: Simple, fast food safety testing for industrial packing facilities.\n\nNutrition From Water: Low-carbon whey sourced from aquaculture.\n\nSpiralWave: Plug-and-play cold plasma methanol reactor.\n\nReactosome: Gene delivery via a supplementary nucleus (!).\n\nRybodyn: Finds and characterizes unknown proteins from the “dark proteome.”\n\nCalifornia Organic: Organic ammonia supplier via fermentation.\n\nCereswaves: “Electrofertilizer” that boosts crop and animal growth with energy field (?).\n\nOxyle: Mechanical(ish) PFAS removal from ground and waste water.\n\nWe’ll want to follow up with these companies as they share more about their progress toward these sometimes mad-sounding ambitions. The San Francisco–based incubator’s demo day will be in June, at which time the companies may have more information to share."}