{"url": "https://techcrunch.com/2016/10/17/targeting-the-untapped-market-of-wearables-for-elder-care/", "title": "Targeting the untapped market of wearables for elder care", "authors": ["Rahmat Shoureshi", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2016-10-17T00:00:00", "text": "Today’s 20-something tech wizards might not worry about the challenges of old age — but they should.\n\nSeniors represent a huge untapped market for tech companies. While just 13 percent of America’s population is 65 or older today, that slice will jump to 19 percent by 2030.\n\nOne area that holds particular promise? Wearables.\n\nSuch technology is already supporting healthier lifestyles. More than 20 percent of Americans are using wearables. Ralph Lauren, Adidas and other top brands have developed smart wear to help people optimize their workout routines.\n\nWearables that foster healthy aging and independent living will soon fill seniors’ wardrobes. With recent advances in nanotechnology, “smart clothes” that monitor seniors’ health and remind them to take their medications are on the way. Analysts predict that medical applications will soon account for the largest share in the smart textile industry, reaching $843 million by 2021.\n\nGetting wired\n\nUntil recently, smart textiles weren’t so wearable. Composed of metallic fibers, they were bulky, fragile and often unattractive. But new futuristic threads –called “smart yarn“– allow designers to embroider circuits into fabric with super precision, making wearables lightweight, comfortable and low-cost.\n\nUsing wearables for health\n\nWearables empower patients to take active roles in managing their own health. For seniors, that can include new ways to manage such chronic illnesses as diabetes and heart disease.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nChronic disease accounts for an astounding 86 percent of U.S. health spending. More than nine out of 10 seniors have at least one chronic condition. Technology that helps seniors avoid complications from their conditions can yield tremendous savings by eliminating unnecessary emergency room visits and hospital stays.\n\nSmart watches are already being used to alert patients when it’s time to take their pills. In the future, seniors with hypertension could put away bulky cuffs in favor of smaller, wrist-worn devices to track blood pressure.\n\nSeniors with diabetes may soon manage their illness with the help of intelligent footwear. New Zealand startup Footfalls & Heartbeats is collaborating with the University of Nottingham on a pair of sensor-equipped “smart socks” that can warn diabetics when they are at risk for foot ulcers.\n\nT-shirts made by Canada’s OMsignal, meanwhile, can keep track of wearers’ stress levels, and even send vital signs to family members and doctors. The company believes its thread-based health sensors will help prevent everything from heart failure to seizures.\n\nExpanding mobility\n\nFor the more than 6 million seniors who suffer from vision loss, mobility is often a nightmare. Sensors can change that. While canes can help the visually impaired detect obstacles on the ground, they can’t tell users which way to face or when to turn.\n\nTechnology is coming to the rescue. The first generation of wearable tech relied on tiny speakers that users inserted into their ears to receive warnings — a good first step. But since many visually impaired people rely on a heightened sense of hearing to compensate for their lack of vision, audio signals transmitted by the devices proved distracting.\n\nDesigners have learned from their earlier efforts and are developing new tools to assist the blind and partially sighted. Sensors that emit ultrasound waves to detect objects can be clipped to clothing or woven into vests. As the user approaches an obstacle, the sensor vibrates, growing in intensity and frequency the closer the obstacle gets.\n\nTake Tactile Navigation Tools‘ Eyeronman vest, which employs three different types of sensors to guide the visually impaired. The vest’s sensors communicate with an electronic textile shirt, which vibrates in a particular spot to indicate impending obstacles and their locations.\n\nStaying independent\n\nMore than anything, wearables can keep seniors safe and independent. Perhaps most important? New technology that can prevent life-changing injuries caused by falls.\n\nAccording to government estimates, every year one in three people older than 65 will suffer a fall. One in five falls will result in a broken bone or head injury. The cost of treating falls in elderly patients is approximately $34 billion annually, and the problem will only become more prevalent as baby boomers age.\n\nWearable tech can help reduce the risk of falling. Washington-based Sensoria, which designs technology for runners, recently teamed up with Orthotics Holdings Inc. to give seniors some extra support. The partnership is developing a brace that uses flexible textile sensors to alert wearers when they are about to lose their balance.\n\nComing next: wearables outfitted with airbags to cushion users in the event of a tumble.\n\nToday’s tech executives are laser focused on millennials. But tomorrow’s tech gadgets will offer revolutionary ways to stave off disease to enhance independence. That’s why, with America’s population steadily and rapidly growing older, it’s time to start thinking about seniors."}