{"url": "https://techcrunch.com/2024/01/23/blueshift-a-marketing-automation-startup-raises-40m-in-debt/", "title": "Blueshift, a marketing automation startup, raises $40M in debt", "authors": ["Kyle Wiggers", "Ai Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-01-23T00:00:00", "text": "Blueshift, a San Francisco–based startup that taps AI to help brands automate and personalize engagement across different marketing channels, has secured $40 million in debt financing from Runway Growth Capital.\n\nCo-founder and CEO Vijay Chittoor said that the loan will be used to refinance Blueshift’s existing debt as well as expand sales and marketing and general operations.\n\n“With the explosion in customer data — first-party data — across a number of channels, manual approaches to marketing are no longer feasible,” Chittoor told TechCrunch in an email interview. “Blueshift drives the next level of personalized engagement across channels by using AI-based decisioning.”\n\nBlueshift, which Chittoor co-founded with Mehul Shah and Manyam Mallela in 2014, aims to automate various aspects of marketing through AI.\n\nBlueshift can unify and organize customer data from third-party sources to create what Chittor describes as “richer” customer profiles. Via the platform, marketers can leverage Blueshift’s AI to segment customers and identify the possible best channels — and times — to reach them.\n\nMarketers are increasingly embracing AI, including generative AI, in pursuit of higher consumer “stickiness.” That’s not an ill-advised strategy — after all, shoppers are more likely to make a purchase when brands offer personalized experiences, survey data shows.\n\nFor example, 90% of respondents in a recent Epsilon poll — consumers ages 18 to 64 — indicated that personalized experiences were “highly appealing” to them and that they were likely to buy more than 15 products a year from businesses that offered these experiences.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPersonalization is easier said than done, however. Per Gartner, in 2021, 63% of marketers said that they were struggling with ad personalization tech.\n\nChittoor pitches Blueshift — and its GenAI suite — as the solution.\n\nWithin the past year, Blueshift has added capabilities, including customer profile summaries for call center agents and auto-generated, personalized variations of brand marketing content in different tones and styles.\n\nThe cynic in me wonders how accurate this GenAI is — and whether it’s prone to bias, hallucination and toxicity. But Chittoor, for what it’s worth, asserts that Blueshift takes pains to mitigate algorithmic shortcomings.\n\nBlueshift competes with a number of vendors in the marketing automation space, including several who aim to build solutions from the ground up on GenAI.\n\nWorkMagic, which emerged from stealth in October, provides tools designed to automate marketing tasks for e-commerce retailers. Retail Rocket develops AI-forward tech to retain brand customers. There’s also Pixis, an AI-powered full-stack marketing platform; Aampe, a marketing automation platform for mobile apps; and Connectly, which employs automation to nudge shoppers to complete purchases.\n\nThe struggle for these startups — and Blueshift, for that matter — is attracting business away from the incumbents. As of June 2023, HubSpot had a roughly 37% share of the marketing automation market, followed by Adobe (~7%), Oracle (~7%) and ActiveCampaign (~7%).\n\nBut it’s a very lucrative venture, marketing automation. The segment was worth $4.62 billion in 2021 and could reach $13.32 billion in 2030, according to a study from Emergen Research."}