{"url": "https://techcrunch.com/2025/01/29/health-insurance-startup-alan-keeps-growing-at-a-rapid-pace/", "title": "Health insurance startup Alan keeps growing at a rapid pace", "authors": ["Romain Dillet", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-29T00:00:00", "text": "With its 700,000 customers, Alan could be considered as a mature company. But the health insurance company that wants to become a digital companion for your health is still growing like a startup.\n\nOn Wednesday, the company shared some financial metrics. The most impressive one is its top-line revenue. In 2024, the company generated €505 million in revenue (around $525 at today’s exchange rate).\n\nBut comparing Alan to a normal tech startup can be difficult as the startup is an insurance company. It offers a health insurance product that complements the national healthcare system in France, Spain, Belgium, and soon Canada.\n\n“The model remains the same: We aim for a breakeven claims-to-premiums ratio, with a membership fee of 12% to 14%,” Alan’s co-founder and CEO Jean-Charles Samuelian-Werve said at a press conference. In other words, the vast majority of Alan’s revenue could be considered as insurance premiums, with Alan taking a 12 to 14% cut for additional services and management fees.\n\nIf you want to compare Alan with a software-as-a-service company, a little back-of-the-envelope calculation would rank Alan as a startup with €60 million to €70 million in annual recurring revenue ($62 million to $73 million).\n\nHowever, the startup — valued at $4.5 billion — is still losing money. In 2024, Alan registered a net loss of €54 million compared to €59 million in 2023 ($56 million and $61 million, respectively).\n\n“We confirm the objective we announced last year of achieving profitability by 2026,” Alan’s chief financial officer Mihaela Albu said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhile the company isn’t turning a profit just yet, the good news is that its distribution strategy is scaling well. The Alan team only grew by 8% in 2024 and the sales team is more or less stable.\n\nIn France, the company won tenders for government workers. In Belgium, it signed a strategy partnership with Belfius, the second biggest bank and insurance company of the country. Belfius is now an investor in Alan and is going to distribute Alan’s products to its own customers.\n\nDisrupting the health insurance market with AI\n\nJust like last year, artificial intelligence came up quite often during the press conference. Ludovic Bauplé, Alan’s chief revenue officer, said that the sales team has increased its results by around 50% thanks to the use of artificial intelligence in the sales process.\n\n“Operationally, we’ve been able to cut customer service costs. On the product side, we’ve accelerated our code production and the way we do unit tests,” Samuelian-Werve said. “In marketing, it’s actually quite amazing how much we’ve accelerated the production of assets and videos, reducing costs while dramatically increasing quality and performance.”\n\nUp next, Alan plans to grow total revenue by another 40% in 2025 compared to 2024. The company should reach 1 million end customers by early 2026. And, of course, there will be more automations, with 40% of customer support requests that should be handled without any manual input by the end of the year.\n\nThe company also used Wednesday’s press conference as an opportunity to announce its health insurance offers for retired people in France. According to the company, there are 750,000 new retirees in France every year. So this will help when it comes to growth."}