{"url": "https://techcrunch.com/2022/10/03/vodafone-confirms-merger-talks-with-three-uk-in-a-no-cash-deal-to-scale-up-in-5g/", "title": "Vodafone confirms merger talks with Three UK in a ‘no cash’ deal to scale up in 5G", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-10-03T00:00:00", "text": "Another major piece of mobile M&A appears to be in the works in the U.K. Today, Vodafone confirmed that it was in merger discussions with Three UK, a carrier owned by CK Hutchison, to accelerate their 5G rollout. A deal would not involve any cash consideration, Vodafone said.\n\n“The envisaged transaction would involve both companies combining their UK businesses, with Vodafone owning 51% and our partner CK Hutchison owning 49% of the combined business,” it wrote in its official statement to the market published earlier today. The statement itself was made in response to press speculation around a possible deal, Vodafone noted. It described the combination as a “no cash” deal — that is, no actual price tag, or deal valuation, or other financial consideration paid as there might be with an acquisition.\n\nVodafone is traded publicly in the U.K., and its market cap is currently around £28.7 billion, or $32.2 billion at today’s rates. CK Hutchison has a market cap of about $21 billion (but that also controls other assets).\n\nThe story of mobile carriers in the U.K. has been one of saga-style soap opera proportions. Three had a major attempt at a merger in its past, a £10.25 billion deal for rival carrier O2. That deal however was blocked by regulators in 2016, only for regulators, four years later in 2020, to overturn that decision.\n\nO2 by that point had moved on to a different combination: It had merged with Virgin Media/Virgin Mobile (which itself had been acquired and merged by Liberty Media with its older pay-TV assets) in a $39 billion deal. Meanwhile, EE — itself a merger of T-Mobile and France Telecom’s acquired and then spun out again Orange — was snapped up by BT (which used to own O2, then spun it out, and then also had reported designs to buy it back) in a $19 billion deal. (Three also made some smaller deals in the interim, such as this one for $373 million for UK Broadband to gain more mobile spectrum.)\n\nVodafone was always an arm’s length from all those scraps.\n\nArguably, part of the reason why was that it was the market leader in Europe overall, and specifically the U.K. Those different M&A moves, however, did have the effect of helping those other carriers get more scale, thus putting more pressure on the market leader.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nNow Vodafone needs Three’s scale to compete, and Three needs Vodafone. Or at least that is likely what they will argue if they do move into a formal process and the deal comes up for regulatory clearance. That overturned merger ruling in Three’s past didn’t lead to Three getting together with O2, but in the end it might still prove useful, by laying the groundwork for approving any subsequent big mergers that Three attempts, such as this one now with Vodafone.\n\nThe big takeaway from all of the above is that mobile carriers are always aiming for more scale — critical to the economics of the capital-intensive, infrastructure-intensive carrier business model, but these days all the more important because of the data and customer ownership that this scale brings carriers, and because of there are fewer routes for carriers monetizing users, given how much content and services have decoupled from customers’ carrier relationships.\n\nThe issue of scale is also at the heart of this latest deal.\n\nVodafone is playing its merger card very carefully here. It notes that the deal would be made to speed up 5G rollout through a larger single network, specifically that it would make such a rollout more financially viable — using a statement from the government itself about the two carriers to back up its assertion.\n\n“The UK Government rightly sees 5G as transformational for the economy and society and critical to the UK becoming more competitive in an increasingly digital world,” it notes, but, “as Ofcom has identified, some operators in the UK – Vodafone UK and Three UK – lack the necessary scale to earn their cost of capital. By combining our businesses, Vodafone UK and Three UK will gain the necessary scale to be able to accelerate the rollout of full 5G in the UK and expand broadband connectivity to rural communities and small businesses.”\n\nThis is just step one in the process, which may or may not ever end up in a deal; Vodafone said that it and Three would be making more statements as and when talks progress, so watch this space."}