{"url": "https://techcrunch.com/2023/12/07/lami-bluewave-deal-that-never-was/", "title": "Kenyan insurtech Lami’s bid to acquire Bluewave collapses", "authors": ["Annie Njanja", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-12-07T00:00:00", "text": "Kenyan insurtech Lami Technologies in February last year announced its acquisition of Bluewave, another startup within the insurance space, to expand its product offerings and enable it to scale into new markets in Africa — but it has now emerged that the deal fell through months later.\n\nTechCrunch has exclusively learned that at the time Lami went public with the acquisition, only a two-year “strategic partnership agreement” was in place. However, Bluewave founder Adelaide Odhiambo told TechCrunch that ground had been laid for an acquisition once Lami’s fundraising campaign, which had taken off in earnest around the same time, closed. Lami went on to raise a $3.7 million seed extension led by Harlem Capital.\n\nOdhiambo, who joined Lami as head of partnerships, claims that the terms of the deal, including the acquisition cost, started changing, forcing her to walk away in August last year. In the meantime, Bluewave had licensed its tech to Lami, and onboarded partners and employees as per the agreement.\n\nLami declined to comment.\n\nOdhiambo told TechCrunch that Bluewave “entered into the negotiations with full intent” to see the deal with Lami through. “Unfortunately, the conversations did not bear fruit as we couldn’t agree on the commercial terms for an acquisition. We, however, still retained the strategic partnership agreement which is now coming to an end, said Odhiambo.\n\nLami has an end-to-end digital insurance platform and an API that allows businesses in different sectors to create tailored insurance solutions for their customers. It was founded in 2018 by Jihan Abass (CEO). Roy Perlot (CFO) who has been with the insurtech since 2020, was appointed co-founder last year.\n\nBluewave, launched in 2016, has built an online platform that allows clients to access micro-insurance products through diverse channels, including USSD, SMS, WhatsApp chatbots and web applications.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAt the time of the acquisition announcement last year, Abass said Lami would integrate with Bluewave’s platform to enhance its B2B2C offerings. Lami was also set to tap Bluewave’s reach, to scale into new markets including Malawi and the Democratic Republic of Congo.\n\nOdhiambo claims the two-year agreement with Lami ends in January 2024. Asked why she let the agreement run through, Odhiambo said she had initiated the partnerships and didn’t want to interrupt.\n\n“I did not want anything that may jeopardize that relationship with them,” she said, adding that Bluewave is relaunching to continue from where the company left off, and has signed partnerships with aggregators including Mobile Network Operators and banks to distribute micro-insurance products in several countries within the East and Southern Africa regions."}