{"url": "https://techcrunch.com/2023/09/04/envisics-closes-100m-to-advance-ar-heads-up-display-tech-in-cars/", "title": "Envisics closes $100M to advance AR heads-up display tech in cars", "authors": ["Rebecca Bellan", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-09-04T00:00:00", "text": "Envisics, a U.K.-based holographics company building in-car technology that projects navigation, safety alerts and other data onto the inside of a windscreen, has closed a $100 million Series C round.\n\nThe company announced the round’s first $50 million tranche in March, which brought Envisics up to a $500 million valuation. Envisics didn’t share an updated valuation with the closing of its Series C, but the startup did bring on new investors like M&G Investments.\n\nThe previous $50 million round was led by Hyundai Mobis, with participation from InMotion Ventures (the investment arm of Jaguar Land Rover) and Stellantis.\n\nThe closing of its Series C comes as Envisics gets nearer to commercializing its augmented reality heads-up display (AR HUD). General Motors has confirmed that Envisics’ second-generation displays will be available in the electric Cadillac Lyriq, but could not be reached in time to provide a timeline or additional details.\n\nDr. Jamieson Christmas, founder and CEO of Envisics, told TechCrunch in March that its first HUDs with GM are “remarkably, absolutely on track to be released this year.”\n\nChristmas also said that Envisics is “working with just about everybody” at the moment, but didn’t name names beyond JLR (formerly Jaguar Land Rover) and GM. However, given the startup’s backers, it’s possible we’ll begin to see automakers like Stellantis, Hyundai and SAIC Motor start announcing similar tech.\n\nAside from automakers, Envisics has also partnered with Panasonic Automotive Systems, a major automotive supplier under consumer electronics giant Panasonic, which suggests rollouts across a wider range of vehicles at various price points in the future.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAutomakers seem to be embracing AR HUDs as a means of relaying important information to the driver. Typically, navigation data and vehicle information can be seen on LED display screens, which are placed above a vehicle’s center console. But engaging with those displays requires the driver to take their eyes off the road, which could be a safety hazard.\n\nFor its part, BMW has unveiled two concept cars — Dee and Vision Neue Klasse — that both feature AR HUDs. The automaker didn’t say with which AR company it would work to power its HUDs, but in the past, BMW has partnered with Finnish company Basemark to bring the tech into BMW iX models.\n\nThe adoption of AR HUDs come as automakers also press ahead to advance advanced driver assistance systems (ADAS) and other forms of autonomous driving — see Tesla’s “Full Self-Driving” beta advanced driver assistance system (ADAS); Polestar’s use of Mobileye’s hands-off, eyes-off ADAS; and XPeng’s XNGP."}