{"url": "https://techcrunch.com/2022/06/30/eu-roaming-regulation-update/", "title": "EU keeps mobile roaming fees at bay for another decade", "authors": ["Natasha Lomas", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-06-30T00:00:00", "text": "Five years ago, the European Union passed rules which largely ended mobile roaming fees for citizens traveling with their devices across borders within the bloc. Today lawmakers are reupping the regulation that lets EU citizens “roam like at home” for a full decade, meaning European consumers can keep avoiding most extra fees when travelling within another of the 27 EU Member States (or the EEA) until at least 2032.\n\nThe updated regulation also brings some new additions — including a focus on quality of service, with a requirement that consumers have access to the same services abroad in the EU as at home when the same networks and technologies are available on the network in the visited Member State.\n\nThis means, for example, that a roaming customer who can use 5G services at home should also have 5G roaming services — where they are available — in the visited Member State.\n\nThe quality of service provision does not mean a guarantee of getting the same mobile network speed when roaming, since network speeds can vary, but the Commission says the new rules “aim to ensure that when similar quality or speeds are available in the visited network, the domestic operator should ensure the same quality of the roaming service.”\n\nOperators are also required to inform their customers of the quality of services they can expect while roaming by stating this in the roaming contract and publishing information on their website.\n\nThe Commission argues that quality of service will be increasingly important as 5G rollouts expand and mobile network technology continues to evolve (its PR includes the phrase “future 6G” — alongside talk of the EU “investing in developing and using innovative digital solutions”).\n\n“As concerns 5G services, it will become more and more important for consumers travelling abroad to know if they could be affected by limitations in available network quality when using certain applications and services,” it suggests. “The new roaming rules aim to enable innovation and business development, ensuring the widest use of innovative services and minimising the risk that citizens would not be able to use certain applications requiring the latest network technology, such as 5G, when crossing internal EU borders.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe EU’s executive also frames the updated roaming regulation as a boon to digital innovation by reducing the risk of usage disruption since consumers can continuously use their apps and services as they travel across borders in the EU.\n\nThe Commission’s PR makes no mention of contrasting recent developments in the U.K. — which ceased to be an EU Member on January 31 2020, following the 2016 ‘Brexit’ referendum vote to leave the bloc — and where, since the EU roaming regulation ceased to apply, most of the big carriers have quietly announced they will be reintroducing roaming charges for their U.K. subscribers travelling in the EU.\n\nBut U.K. mobile users are unlikely to have missed the fact that Brexit has meant a return of roaming fees when they want to travel in Europe.\n\nSome Brits may therefore detect a faint trace of trolling in this statement from Thierry Breton, the EU’s commissioner for the internal market, commenting on the extension of fee-free roaming inside the EU, who said: “Remember when we had to switch off mobile data when travelling in Europe — to avoid ending up with a massive roaming bill? Well this is history. And we intend to keep it this way for at least the next 10 years. Better speed, more transparency: We keep improving EU citizens’ lives.”\n\nTransparency\n\nAnother focus for the EU’s updated regulation is around increasing transparency about the types of services that can still bring additional costs when roaming, such as calling customer service numbers, help desks or insurance companies — to help travellers in the bloc avoid related ‘bill shocks.’\n\nThe Commission says consumers who are roaming should receive an SMS about “potential increased charges” from using such services.\n\n“The SMS should include a link to a dedicated webpage providing additional information on the types of services and, if available, about the relevant phone numbering ranges,” it notes, suggesting operators may also include information about the types of services that may be subject to higher charges in roaming in their contracts with the consumers.\n\nThe updated rules are also intended to improve information provisions about and access to emergency communications across the EU — such as via the single European emergency number, 112.\n\n“Dialing the emergency numbers and transmitting information on the location of the caller while roaming should be seamless and for free. Likewise, citizens who cannot place a call to 112 should be able to access emergency services free of charge through alternative means when roaming, for example through real-time text or a smartphone application,” says the Commission.\n\n“The new roaming rules also reinforce access to emergency services, through calls and alternative means of communications in case of cross-border use. It will also ensure that the transmission of caller location will be seamless and free of charge while using roaming services.”\n\nThe EU is continuing to regulate wholesale caps — controlling the maximum prices a visited operator may charge for the use of its network by another operator in order to provide roaming services — with the Commission describing this as “an essential element for the sustainability of ‘roam like at home’ for operators.” Its review of the roaming market concluded that wholesale caps should be further reduced.\n\n“The co-legislators agreed on a gradual reduction of the wholesale caps from 2022 onwards,” it notes. “These caps reflect decreasing operators’ wholesale costs of providing roaming services, provide sufficient investment incentives and maximise sustainability for EU operators.”\n\nThe Commission expects these wholesale cost reductions to lead to benefits for consumers — such as more generous data allowances while roaming and less likelihood of consumers having to pay surcharges for data usage that exceed contract allowances.\n\nOperators will still be able to apply a ‘fair use’ policy — meaning that if a person moves to live in another EU country it will be better for them to move to a local contract, as permanent roaming is no longer considered ‘fair use.’"}