{"url": "https://techcrunch.com/2024/10/17/byjus-founder-says-his-edtech-startup-once-worth-22b-is-now-worth-zero/", "title": "Byju’s founder says his edtech startup, once worth $22B, is now ‘worth zero’", "authors": ["Manish Singh", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-10-17T00:00:00", "text": "Byju Raveendran, the founder of the embattled edtech group Byju’s, acknowledged on Thursday afternoon that he made mistakes, mistimed the market, overestimated growth potential, and that his startup, once valued at $22 billion, is now effectively worth “zero.”\n\nSpeaking to a group of journalists, Raveendran said the company’s aggressive acquisition of more than two dozen startups to expand into new markets proved fatal when financing dried up in 2022. Byju’s was planning to go public in early 2022 with several investment bankers giving the firm valuation as high as $50 billion, TechCrunch reported earlier.\n\nHe alleged that many of his more than 100 investors had urged him to pursue aggressive expansion into as many as 40 markets. But, he added, those very investors got cold feet when global markets tumbled following Russia’s invasion of Ukraine, sending the venture capital market into a downward spiral.\n\nRaveendran said many of his investors “ran away,” and the departure of three key backers — Prosus Ventures, Peak XV, and Chan Zuckerberg Initiative — from the company’s board last year made it impossible for the startup to raise additional funds.\n\nRepresentatives of the aforementioned three firms as well as auditor Deloitte left the startup’s board last year, citing governance issues.\n\nByju’s has since entered insolvency proceedings, and Raveendran, who no longer controls the company, said: “It’s worth zero. What valuation are you talking about? It’s worth zero.”\n\nByju’s, once India’s most valuable startup, counts BlackRock, UBS, Lightspeed, QIA, Bond, Silver Lake, Sofina, Verlinvest, Tencent, Canada Pension Plan Investment Board, General Atlantic, Tiger Global, Owl Ventures, and World Bank’s IFC among its backers. It has raised more than $5 billion to date.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nRaveendran said he remains hopeful that his startup will make a comeback. “I have nothing to lose. I came from a small village. I invested everything I had into the startup.”"}