{"url": "https://techcrunch.com/2024/12/03/orakl-oncology-combines-data-and-biology-to-bring-new-drugs-to-cancer-patients/", "title": "Orakl Oncology combines data and biology to bring new drugs to cancer patients", "authors": ["Anna Heim", "Freelance Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-12-03T00:00:00", "text": "Cancer incidence is on the rise, particularly among younger adults, but most new drug compounds fail to progress through clinical trials. According to French entrepreneur Fanny Jaulin (on the right in the picture above), the problem lies with clinical trial design.\n\n“Just because a drug isn’t successful in clinical trials doesn’t mean it’s not a good drug,” she told TechCrunch. Hence the need for better ways to trial new molecules, especially for cancers in which innovation has failed to make a dent in recent decades.\n\nHer startup, Orakl Oncology, applies AI to this problem, but Jaulin is prompt to admit that her team is far from being the only one doing so. In fact, she thinks AI is becoming table stakes in drug discovery. But that’s not where Orakl’s differentiation lies, she said.\n\nFounded in 2023 as a spinoff from the Gustave Roussy Institute of Oncology, Orakl operates at the intersection of data and biology, which makes it different from companies that only do one or the other, and more akin to Tempus, the AI health tech that went public earlier this year.\n\nBoth sides are complementary; the data side helps deal with the fact that each tumor is unique, while the biology side is the best way to take the complexity of cancer into account, Jaulin said.\n\nThe result is hybrid, with avatars that combine the background of real patients with tissue. Currently, this means working on organoids, which are miniaturized, simplified in vitro versions of an organ that can be used for trials.\n\nAs for the data layer, it includes some 40 variables per patient, which makes up for the fact that its corpus is still smaller compared to its larger competitors, and with an initial focus on colorectal and pancreatic cancers.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWith this basis in place, Orakl plans to commercialize two products: O-Predict, which helps customers forecast patient response to a drug candidate, and O-Validate, where the process goes the other way around. This makes the former better suited for drug developers, while the latter can also serve AI- and data-led biotech companies, Jaulin said.\n\nThis commercialization plan will be funded by the seed round it has just raised and that comes in addition to the €3 million pre-seed round the startup secured in 2023. Led by European VC fund Singular, it also follows some nondilutive funding from Bpifrance, including the Grand Prix i-Lab, bringing Orakl’s total capital raised to date to nearly €15 million.\n\nWhile most of the proceeds will go toward building a commercial team to close contracts, it is not what made Jaulin become an entrepreneur. With cancer becoming a chronic disease and a therapeutic arsenal “undersized for what’s at stake,” her long-term goal is to unblock the precision medicine discovery process to “get as many drugs as possible to patients.”"}