{"url": "https://techcrunch.com/2022/02/24/anyroad-helps-brands-measure-customer-experiences/", "title": "AnyRoad helps brands measure customer experiences", "authors": ["Christine Hall", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-02-24T00:00:00", "text": "We were stuck inside for so long over the past two years that now when we go anywhere, we want it to be an experience. AnyRoad, an eight-year-old San Francisco-based company, wants to help brands make sure we have them, while also building stronger relationships with customers.\n\nYou might be asking yourself, “Haven’t I heard of a travel company with the name AnyRoad?” and you would be right. TechCrunch reported on the company back in 2013 when it was a custom tour company.\n\nHowever, AnyRoad pivoted about four-and-a-half years ago to be one of the first companies to do “experience relationship management,” a phrase that co-founders, and brothers, Jonathan Yaffe and Daniel Yaffe coined with Salesforce CEO Marc Benioff, who is one of the company’s early investors.\n\n“We were pounding our heads against the wall to build a platform to democratize experiences, which initially put us in the travel space,” Jonathan Yaffe told TechCrunch. “We knew it wasn’t going to be a venture-scaleable company, but we were sitting on a mountain of data and realized we could predict experiences that could change the fate of businesses.”\n\nMuch of Yaffe’s background in experiences came from being initially in cognitive neuroscience, learning about behavioral data. However, he decided not to spend his life in a research lab, and instead got a job on the marketing team at Red Bull. This was two decades or so ago when Red Bull had just come to the U.S.\n\nHe recalls the company spending millions on experiences to get Red Bull into people’s hands. However, rather than sink money into digital marketing — an area that was oversaturated even then — Red Bull concentrated on events where people could bring their group of friends, have a good time and be eager to try a new drink. It ended up being experiences that created a bond between Red Bull and its customers and changed customers’ relationship to the brand and purchase habits, Yaffe said.\n\nThat is the kind of relationship AnyRoad is helping any brand create with its customers. And data shows this is the direction brands are going: the experience economy is booming now that we are all going out again, and 81% of brands say their event and experiential budgets will “match or exceed” pre-pandemic levels in 2022.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nHowever, when it’s a big party, brands don’t often know everyone who is attending, which leads to limited return on investment and actionable insights. AnyRoad provides that insight with software. For example, for its craft store client Michaels, AnyRoad’s software creates the arts and crafts class schedule, manages ticket sales and payments and, if the class is online, facilitates the video conferencing. It also pulls in all of the consumer data from the classes, then applies machine learning and natural language processing to provide qualitative feedback.\n\n“It turns into a holistic view for them of their community and helps increase revenue,” Yaffe added. “Experiences make us happier than buying things, and research shows it. Some might say that retail is dead, but experiential retail is booming.”\n\nThe shift of more brands becoming experiential businesses drove AnyRoad to go after a $47 million Series B funding round, led by funds and accounts managed by BlackRock, with participation from Andreessen Horowitz, Runa Capital, Kaiser Permanente, other existing investors Rally Ventures, Precursor Ventures and Day One Ventures, and new investors Commonfund and Corner Ventures.\n\nThe latest funding round gives the company total investment of $66.2 million, which includes a $9.2 million Series A round in 2020 and $10 million Series A extension in 2021.\n\nCompanies ramping up their experiential budgets is resulting in AnyRoad seeing a ton of growth, Yaffe said. The company tripled its top line revenue in 2021, and brought in new brands like Diageo, Beam Suntory, Unilever and Anheuser-Busch. AnyRoad is now working with over 400 brands delivering 200,000 virtual, in-person or hybrid experiences every month.\n\nThe new funding will go toward scaling the company’s go-to-market team, product development, data insights, customer data experience and predictive modeling. AnyRoad is also exploring other verticals like web3’s impact on a brand’s ability to interact with its customer base, not on Discord, but with experiences like the Bored Ape Yacht Club and conferences, Yaffe said.\n\n“The experience economy is stronger than ever,” he added. “It is interesting to see the scope of organizations that are now looking at experiences as the primary way to engage with their consumer base. Brands we never expected to be experiential are now creating programs and coming to us.”"}