{"url": "https://techcrunch.com/2013/02/28/hgsts-nanotechnology-printing-breakthrough-is-great-news-for-data-center-storage-and-hdd-capacity/", "title": "HGST’s Nanotechnology Printing Breakthrough Is Great News For Data Center Storage And HDD Capacity", "authors": ["Darrell Etherington", "Editor At Large", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2013-02-28T00:00:00", "text": "If you’re at all familiar with mobile processors, you’ve likely heard a lot about 32nm vs. 28nm construction when comparing the current generation of chips from companies like Qualcomm and others. That refers to the size of the processor, where a smaller number is better in terms of power consumption, fitting more transistors in less space for more efficient processing.\n\nCurrently, it’s hard to get past around the 20nm when creating individual patterns for data storage on today’s disk drives, which is another area in addition to processors where Moore’s Law applies. Today though, HGST, a Western Digital Company, announced a breakthrough that allows it to produce patterns as small as 10nm, via a process called “nanolithography,” meaning that it can essentially double the current maximum storage capacity possible in hard disk drives, given the same-sized final product.\n\nHGST’s process, which was developed in tandem with Austin, Texas-based silicon startup Molecular Imprints, Inc. doesn’t use the current prevailing photolithography tech, which is limited in how small it can go by the size of light wavelengths, which is what allows it to get to the 10nm threshold, and hopefully beyond even that in time, HGST VP of Research Currie Munce told me in an interview.\n\nThe upshot of all this is that HGST hopes to have the process ready for wide-scale commercial production by the end of the current decade, with a process that makes the resulting storage both affordable and dependable enough to be used widely by customers who need ever-increasing amounts of storage. The number of customers who fit that description is increasing rapidly, too: the advent and growth in popularity of cloud services means that big companies like Facebook, Apple and Amazon are continually building and expanding new data centers in search of greater storage capacity. HGST’s nanolithography process could double the storage capacity per square foot at any of those facilities, without having the same effect on power requirements, which is clearly an attractive proposition.\n\nWhile the process looks well-suited to disk-based storage, where redundancies and workaround can account for minor imperfections at the microscopic level, Munce says that HGST nanolithography is less well-suited to the task of creating mobile processors for smartphone like those mentioned above.\n\n“If you don’t connect the circuits properly on a processor it doesn’t work at all,” he explained. “On a hard disk drive, we can always have error connecting codes, we can always use additional signal processing to cover up a few defects in the pattern that’s created.”\n\nStill, for HDDs and computer memory (RAM), HGST’s breakthrough could have a massive impact on cloud computing, mobile devices and the tech industry as a whole, and all within the next five to six years."}