{"url": "https://techcrunch.com/2025/04/09/meta-whistleblower-sarah-wynn-williams-says-company-targeted-ads-at-teens-based-on-their-emotional-state/", "title": "Meta whistleblower Sarah Wynn-Williams says company targeted ads at teens based on their ‘emotional state’", "authors": ["Sarah Perez", "Consumer News Editor", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-09T00:00:00", "text": "Meta whistleblower Sarah Wynn-Williams, the former director of Global Public Policy for Facebook and author of the recently released tell-all book “Careless People,” told U.S. senators during her testimony on Wednesday that Meta actively targeted teens with advertisements based on their emotional state.\n\nThis claim was first documented by Wynn-Williams in her book, which documents her time at Facebook and the “careless” disregard from its top execs, including CEO Mark Zuckerberg and former COO Sheryl Sandberg, about the power the tech company wields in the world and its capability to do harm.\n\nThough the focus of Wednesday’s hearing was largely on Meta’s dealings with China and how it may have misrepresented its plans in prior congressional hearings, the senators were also keen to ask about Instagram, given that the social app had been the subject of earlier congressional investigations into Meta’s harms to children back in 2021.\n\nIn response to a question from Sen. Marsha Blackburn (R-TN), Wynn-Williams admitted that Meta (which was then known as Facebook) had targeted 13- to 17-year-olds with ads when they were feeling down or depressed.\n\n“It could identify when they were feeling worthless or helpless or like a failure, and [Meta] would take that information and share it with advertisers,” Wynn-Williams told the senators on the subcommittee for crime and terrorism within the Judiciary Committee. “Advertisers understand that when people don’t feel good about themselves, it’s often a good time to pitch a product — people are more likely to buy something.”\n\nShe said the company was letting advertisers know when the teens were depressed so they could be served an ad at the best time. As an example, she suggested that if a teen girl deleted a selfie, advertisers might see that as a good time to sell her a beauty product as she may not be feeling great about her appearance. They also targeted teens with ads for weight loss when young girls had concerns around body confidence, Wynn-Williams said.\n\nShe claimed that Meta was aware that users aged 13-17 were a vulnerable but “very valuable” demographic to advertisers, which was the motive.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIn fact, she said that one business leader at the company even explained to her that Facebook was aware that it has the “most valuable segment of the population” for advertisers, teens, and said that Meta should be “trumpeting it from the rooftops.”\n\nAt the time, Wynn-Williams had been suggesting to the exec that a trillion-dollar company was not short on money and didn’t need to go this route to add a little more to its coffers.\n\nIf Meta was willing to target teens based on their emotional states, it stands to reason they’d do the same to adults. And one document displayed during the hearing showed an example of just that, it turned out.\n\nIn a screenshot of an internal chat, a Facebook policy director asks if it’s true that Facebook was doing research into young mothers and their emotional state, to which another person replied, “yes,” even joking that they may ask their “apparently morally bankrupt colleagues” if there was any other research like this.\n\nAdding a bit more color to her comments, Wynn-Williams also noted that it had surprised her how many Silicon Valley executives didn’t let their own children use the products they built.\n\n“I would say, ‘Oh has your teen used the new product we’re about to launch?,’” Wynn-Williams said. “And they’re like, ‘My teenagers are not allowed on Facebook. I don’t have my teenager on Instagram.’ These executives … they know. They know the harm this product does. They don’t allow their own teenagers to use the products that Meta develops. The hypocrisy is at every level.”\n\nIn a company statement, Meta denied the allegations in Wynn-Williams’ testimony, calling them “divorced from reality and riddled with false claims.”\n\nIn response to the claims about teens, Meta added the following:\n\n“We know parents are worried about their teens having unsafe or inappropriate experiences online, which is why we’re making significant changes to the Instagram experience for tens of millions of teens with new Teen Accounts. These accounts provide teens with built-in protections to automatically limit who’s contacting them and the content they’re seeing, and teens under 16 need a parent’s permission to change those account settings. We’re also giving parents more oversight over their teens’ use of Instagram, with ways to see who their teens are chatting with and block them from using the app beyond 15 minutes per day, or for certain periods of time, like during school or at night.”\n\n\n\nThe company also pointed to a 2017 statement it made that directly responded to the claims about targeting ads at people based on their emotional state, saying that the market analysis was “never used to target ads and was based on data that was anonymous and aggregated.”\n\nUpdated after publication with additional statements from Meta."}