{"url": "https://techcrunch.com/2024/04/15/apple-pulls-a-game-boy-emulator-for-app-store-violations-but-says-game-emulators-are-allowed/", "title": "Apple pulls a Game Boy emulator for App Store violations, but says game emulators are allowed", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-04-15T00:00:00", "text": "Apple has removed iGBA, a Game Boy emulator app for the iPhone, after approving its launch over the weekend. The app was among the first to capitalize on Apple’s newly relaxed rules around retro game emulators, a move the tech giant made after EU regulators forced Apple to open up to App Store competitors, like AltStore, which aims to offer game emulators and other Patreon-backed apps to iPhone users.\n\nFirst launched on Sunday, iGBA was an ad-supported copy of the open source project GBA4iOS that offered a Game Boy game emulator for iOS. The new app worked as described, allowing users to download both Game Boy Advance and Game Boy Color ROMs from the web and then open them in the app to play.\n\nHowever, the app was submitted to the App Store without the permission of GBA4iOS developer Riley Testut, who also developed the AltStore and Delta, a Nintendo emulator and popular successor to GBA4iOS.\n\nTestut said in a post on Threads on Sunday that he was angry at Apple for approving iGBA while his own app Delta, currently on Apple’s TestFlight, has been ready to launch since March 5. He was also not thrilled at his work being knocked off and monetized this way.\n\nPost by @rileytestut View on Threads\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“I did not give anyone permission to do this, yet it’s now sitting at the top of the charts (despite being filled with ads + tracking),” Testut said on Threads. “I’ve bit my tongue a bunch in the past month…but this really frustrates me. So glad App Review exists to protect consumers from scams and rip-offs like this,” he added, sarcastically.\n\nAs some noted, the knock-off version used the same code as GBA4iOS. But, as others pointed out, the GBA4iOS emulator was distributed under a GNU GPL v2 license, which should have otherwise permitted copies — except for the fact that Testut added a custom restriction to it that prohibited App Store distribution for any work containing the code. They argued that such a restriction was not technically allowed under GPL v2.\n\nNevertheless, Apple determined that the knock-off app should be removed for violating its App Store guidelines around spam and copyright (rules 4.3 and 5.2, respectively), essentially siding with Testut on the matter, despite its earlier mistake.\n\nPost by @kche1gamer View on Threads\n\n\n\nApple told TechCrunch the functionality in the app was approved, but when the company learned that the app was copying another developer’s submission and passing it off as its own, it took action in accordance with its guidelines.\n\nThe Cupertino-based tech giant has been pushed to make the App Store more open thanks to the EU’s Digital Markets Act (DMA). Following an update to its App Store rules to comply with the new regulation, Apple had announced it would also allow streaming game stores globally. But the additional support for retro game emulators wasn’t added until this month, with the caveat that the games must use in-app purchases if they offer downloads of digital items. While that would potentially open another stream of revenue for Apple, the iGBA app was free and ad-supported, so it wasn’t a loss to Apple’s bottom line to remove it."}