{"url": "https://techcrunch.com/2024/10/09/european-unicorn-alan-becomes-canadas-first-new-health-insurance-company-in-almost-70-years/", "title": "European unicorn Alan becomes Canada’s first new health insurance company in almost 70 years", "authors": ["Romain Dillet", "Senior Reporter", "Theresa Loconsolo", "Anthony Ha", "Maxwell Zeff", "Kirsten Korosec", "Sarah Perez", "Sean O'Kane", "Tim De Chant", "Rebecca Bellan"], "publication_date": "2024-10-09T00:00:00", "text": "In 2016, when Alan originally launched its health insurance product in France, it was the first new health insurance company in the country in 30 years. Now, as Alan announces its expansion to Canada, the startup is about to break a new record: There hasn’t been a new health insurance company in Canada since 1957.\n\nIn many ways, Alan treats health insurance as software as a service. It’s a subscription-first product that can be optimized with technology. For instance, Alan has built its own claim management system. Its flagship product is health insurance that complements the national healthcare system in France. French companies must provide health insurance to all their employees when they join.\n\nThe startup has also added additional services to improve consumer satisfaction, reduce churn, and win new deals. Alan members can use the company’s mobile app, for example, to chat with doctors, order prescription glasses, and consume preventive care content on mental health or back pain.\n\nWhile the company has raised a ton of money — including a recently announced €173 million Series F round — Alan has been relatively focused when it comes to geographic coverage. In addition to its home country, the service is also available in Belgium and Spain.\n\nIt’s such a big market, however, that it doesn’t necessarily need to launch everywhere to find new clients. It currently covers 675,000 people across its three markets. Given that nearly 100% of the population in France, Belgium, and Spain has a health insurance contract, Alan is still a challenger.\n\nBut that hasn’t seemed to stop Alan’s expansion plans. The company has obtained a federal OFSI license in Canada, meaning that it can officially operate as an insurance company in the country. It’s building a local board and a local team with insurance and healthcare experts.\n\n“You cannot use your European license in Canada. You need to apply for a new license. But then the rules in terms of solvency, distribution, risk management, and so on are very, very similar,” Alan co-founder and CEO Jean-Charles Samuelian-Werve (pictured above) told TechCrunch.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAlan is essentially bringing the full Alan product suite to Canada and plans to hire 50 people in the country over the next few years.\n\nIt’s surprising that Alan didn’t pick a European country for its next market expansion. Part of the reason can be found on Alan’s capitalization table. Teachers’ Venture Growth (TVG), the venture fund of the Ontario Teachers’ Pension Plan Board, led Alan’s Series E round. But with Canada, Alan wanted to make a statement.\n\n“I try to be very long-term oriented in the way we make our decisions at Alan. And when I picture Alan in 10 years from now, I don’t see us just as a European company. I see us as a global company,” Samuelian-Werve said.\n\nCanada is also a fairly large market, with both a national healthcare system and private health insurance coverage. Primary care is covered by the government, but a good portion of healthcare, around $60 billion a year, is handled by health insurance providers. And things haven’t changed much lately.\n\n“In Canada, there are only 20 [health insurance providers] that have at least 1% in market share. That number is 400 in France … It’s really, really uncompetitive [in Canada],” Alan’s general manager for Canada, Mark Goad, said. “And if you look at the satisfaction ratings with the net promoter score, it’s at -8 in Canada, whereas Alan operates at +70.”\n\nJust like in France, the Canadian team is going to distribute Alan through employers. Employers typically pick one health insurance provider to cover the entire workforce of that company.\n\nAround 55 Canadian companies have already expressed interest in trying Alan. The company plans to onboard one customer per week starting in January 2025. It will then launch its self-signup portal at some point during the second quarter of 2025."}