{"url": "https://techcrunch.com/2025/02/25/elevenlabs-is-now-letting-authors-create-and-publish-audiobooks-on-its-own-platform/", "title": "ElevenLabs now lets authors create and publish audiobooks on its own platform", "authors": ["Ivan Mehta", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-02-25T00:00:00", "text": "Voice AI company ElevenLabs is now letting authors publish AI-generated audiobooks on its own Reader app, TechCrunch has learned and the company confirmed. The announcement comes days after the company partnered with Spotify for AI-narrated audiobooks.\n\nElevenLabs, which raised a $180 million mega-round last month, started inviting authors to try out their publishing program through their app on a trial basis last year, TechCrunch previously spotted. That program is newly open to all authors as of today.\n\nImage Credits:ElevenLabs\n\nThe company confirmed the development to TechCrunch, explaining the idea is to provide affordable and accessible tools for audiobook creation, which might have otherwise cost much more to produce in a studio.\n\nThe platform itself aims to compete with Audible, which ElevenLabs believes offers lower royalty rates for authors. Under its model, ElevenLabs’ audiobooks will be offered within its own Reader app and the company will pay authors when users engage with their content.\n\nCurrently, it pays roughly $1.10 to authors when listeners engage with an audiobook for 11 minutes or more.\n\nElevenLabs said the average user spent 19 minutes listening to the published books on its app during the testing phase. While the startup thinks that these rates are among the best in the industry, they could still change as the program scales.\n\nAt launch, the payout is offered to authors in the U.S. and for English-only titles. Later, it aims to extend payouts to titles in the 32 languages it supports for audiobooks.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe company also plans to create a marketplace where authors can sell their content.\n\nThe bigger opportunity for ElevenLabs involves authors and publishers generating audiobooks using its AI tech by way of its paid plans ranging from $11 to $330 per month. This is less expensive than booking studio time and paying voice actors.\n\nNotably, ElevenLabs has already powered other audio platforms like Pocket FM and Kuku FM to turn text into audio content.\n\nThe company’s move to become a publishing and distribution surface to host more indie content is in line with ElevenLabs CEO Mati Staniszewski’s plans to expand into more consumer experiences."}