{"url": "https://techcrunch.com/2017/02/24/smart-cities-must-be-people-centered-equitable-cities/", "title": "Smart cities must be people-centered, equitable cities", "authors": ["Brooks Rainwater", "Nicole Dupuis", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2017-02-24T00:00:00", "text": "Technology has always been a critical force deeply intertwined with the evolution of cities. From the first human settlements millennia ago to the industrial revolution to today, technological breakthroughs have impacted the buildings we use, the way we get around and how we live, work and play in the urban space.\n\nThe development of smart cities builds upon this strong historical foundation with a digital foundation that allows cities to function more efficiently, be more responsive to community members and ultimately create better, more equitable urban environments where people thrive.\n\nCities are beginning to, and will continue to, integrate technological dynamism into municipal operations, from transportation to infrastructure repair and more. The back ends of these systems are not always apparent to the end user — but, as the integration of smart-city technology becomes more visible in our everyday lives, we will continue to see positive changes in our cities.\n\nWe have just released our report, “Trends in Smart City Development,” which analyzes smart-city growth and presents best practices. This report is meant to spark conversation and action among city leaders about how to incorporate smart-city strategies in every community. Examples abound of cities leading in this space both nationally and globally, examining how they can use technology as a tool to promote equity and uplift those that need help the most.\n\nIn San Francisco, city leaders are continually working to employ smart-city initiatives that make San Francisco safer, fairer and more sustainable. The city’s OpenData initiative supports smart-city projects that aim to meet greenhouse gas reduction goals and improve public transportation service. This initiative helps propel forward the city’s environmental justice goals and programs, which aim to ensure that every part of the city is a “healthy and sustainable place to live and work.”\n\nAcross the globe, we see New Delhi equally interested in equity. In conjunction with the New Delhi Municipal Council’s smart-city programs, the Delhi Development Authority (DDA) has introduced a land-pooling policy to address one of Delhi’s primary challenges: affordable housing that can accommodate its growing population, while laying the infrastructure to implement information and communication technologies (ICTs). Besides regulating the land-pooling policy, DDA is also committed to accountability and transparency by allowing the population to monitor its infrastructure projects online.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMoving beyond the here and now, we are on the cusp of increasingly rapid shifts in cities precipitated by technology. To that end, it is worth imagining what the connected smart city of the future will look like — and the associated impact it will have on our everyday lives.\n\nAutonomous vehicles on our roadways and the data they provide could create environments where traffic lights become obsolete, and traffic itself becomes a thing of the past. Cities can once again be for people rather than cars, as different modes of transportation work in tandem and communicate with each another.\n\nWi-Fi hotspots at scale, like we are already starting to see in New York with LinkNYC, could help transform the way we access information and help alleviate the digital divide. And, as we move toward greater usage of shared vehicles, we can reduce parking needs and enable cities to recapture land for people, while reducing building costs as parking garages become an unnecessary expense.\n\nEnergy sources could be completely renewable in the smart city of the future, as well, with technology paving the way for better integration into our cities, thereby helping to create a cleaner environment for everyone. At the same time, residents can be safer with street-light networks that use embedded sensors to detect gunshots or flash their lights during emergencies. These systems will also allow cities to collect information from sources such as smart water, electric and gas meters, and make repairs as soon as they are needed — not just when residents call them in.\n\nThese changes have the potential to be both far-reaching and consequential for community members, and all of this prospective change is predicated on the premise that technologies can help make people’s lives better in cities.\n\nAt the end of the day, technological developments will enhance our urban experience — but they also risk leaving more people behind. This is why creating equitable communities has become such a top priority for mayors and other city leaders across the country. For this reason, we must be deliberate in the development of smart cities and imbue equity as a primary goal, because as cities work to incorporate new technology in city operations in the coming years, they must think about how smart-city systems can make life better for everyone."}