{"url": "https://techcrunch.com/2025/05/01/may-mobility-to-launch-robotaxis-on-uber-platform-this-year-in-texas/", "title": "May Mobility to launch robotaxis on Uber platform this year in Texas", "authors": ["Rebecca Bellan", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-05-01T00:00:00", "text": "Startup May Mobility plans to deploy its autonomous vehicles on the Uber platform by the end of 2025, starting in Arlington, Texas, as part of a multi-year partnership.\n\nThe tie-up with Uber offers May Mobility a chance to grow beyond offering shuttles within campuses and planned communities, while Uber adds May Mobility to its growing roster of autonomous vehicle collaborators as it works to integrate self-driving tech onto its platform.\n\nFor example, Uber has already begun offering Waymo robotaxis on its app in Phoenix and Austin, and plans to launch in Atlanta this summer. That will put it in competition with Lyft and May Mobility, which recently announced a similar partnership to launch autonomous ride-hail in Atlanta this year.\n\nAs with Uber’s other AV partnerships, customers in Arlington will have the option to choose a May Mobility vehicle — one of the startup’s hybrid Toyota Sienna Autono-MaaS vehicles fitted out with its self-driving tech — when they book a ride.\n\nThe first deployment in Arlington will involve human safety operators behind the wheel before transitioning to driverless. Following initial launch, Uber and May Mobility intend to expand to other U.S. markets in 2026 and “deploy thousands of AVs” over “the next few years,” according to May Mobility.\n\nMay Mobility operates on-demand autonomous microtransit services — essentially self-driving shuttles — primarily in small-scale areas across the U.S., typically on campuses and in other low-speed, predefined zones. The startup has piloted its technology in Arlington, Texas, as well as in Ann Arbor, Michigan; Grand Rapids, Minnesota; Peachtree Corners, Georgia; Miami, Florida; and Sun City, Arizona.\n\n"}