{"url": "https://techcrunch.com/2020/12/24/the-built-environment-will-be-one-of-techs-next-big-platforms/", "title": "The built environment will be one of tech’s next big platforms", "authors": ["Jonathan Shieber", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2020-12-24T00:00:00", "text": "From the beginning, the plan for Sidewalk Labs (a subsidiary of Alphabet and — by extension — a relative of Google) to develop a $1.3 billion tech-enabled real estate project on the Toronto waterfront was controversial.\n\nPrivacy advocates had justified concerns about the Google-adjacent company’s ability to capture a near-total amount of data from the residents of the development or any city-dweller that wandered into its high-tech panopticon.\n\nBut Alphabet, Sidewalk Labs’ leadership and even Canada’s popular prime minister, Justin Trudeau, had high hopes for the project.\n\n“Successful cities around the world are wrestling with the same challenges of growth, from rising costs of living that price out the middle class, to congestion and ever-longer commutes, to the challenges of climate change. Sidewalk Labs scoured the globe for the perfect place to create a district focused on solutions to these pressing challenges, and we found it on Toronto’s Eastern Waterfront — along with the perfect public-sector partner, Waterfront Toronto,” said Sidewalk Labs chief executive Dan Doctoroff, the former deputy mayor of New York, in a statement announcing the launch in 2017. “This will not be a place where we deploy technology for its own sake, but rather one where we use emerging digital tools and the latest in urban design to solve big urban challenges in ways that we hope will inspire cities around the world.”\n\nFrom Sidewalk Labs’ perspective, the Toronto project would be an ideal laboratory that the company and the city of Toronto could use to explore the utility and efficacy of the latest and greatest new technologies meant to enhance city living and make it more environmentally sustainable.\n\nThe company’s stated goal, back in 2017 was “to create a place that encourages innovation around energy, waste and other environmental challenges to protect the planet; a place that provides a range of transportation options that are more affordable, safe and convenient than the private car; a place that embraces adaptable buildings and new construction methods to reduce the cost of housing and retail space; a place where public spaces welcome families to enjoy the outdoors day and night, and in all seasons; a place that is enhanced by digital technology and data without giving up the privacy and security that everyone deserves.”\n\nFrom a purely engineering perspective, integrating these new technologies into a single site to be a test case made some sense. From a community development perspective, it was a nightmare. Toronto residents began to see the development as little more than a showroom for a slew of privacy-invading innovations that Sidewalk could then spin up into companies — or a space where startup companies could test their tech on a potentially unwitting population.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSo when the economic implications of the global COVID-19 pandemic started to become clear back in March of this year, it seemed as good a time as any for Sidewalk Labs to shutter the project.\n\n“[As] unprecedented economic uncertainty has set in around the world and in the Toronto real estate market, it has become too difficult to make the 12-acre project financially viable without sacrificing core parts of the plan we had developed together with Waterfront Toronto to build a truly inclusive, sustainable community,” Doctoroff said in a statement. “And so, after a great deal of deliberation, we concluded that it no longer made sense to proceed with the Quayside project.”\n\nHowever, Sidewalk’s mistakes, missteps and closures may have had less to do with the economic downturn associated with the COVID-19 pandemic and more to do with the insistence on imposing a universal vision of techno-utopia on a community that recognized the social costs that such a development could entail.\n\nBecause in contrast to Sidewalk Labs Toronto, smaller projects pursuing pieces of the Sidewalk Labs vision are seeing investors open their wallets and cities open their doors. Even as Sidewalk was closing doors, startups working in real estate technology managed to nab a record $3.7 billion from investors in the first quarter of the year, the highest amount the industry had raised in a five year period.\n\nWhether it’s the $1 billion in financing that REEF raised from various investors to turn parking lots into more financially viable (if equally as unattractive) retail and restaurant space; or the $170 million in equity financing that Culdesac raised for their Tempe, Arizona residential development; or projects like Cavnue and Resilia from Sidewalk Infrastructure Partners (the Sidewalk Labs spinout), projects looking to remake the built environment through technology and business innovation are thriving.\n\nThe evidence is also in broader property tech investment trends. Taken broadly, real estate investments are projected to decline only slightly from their 2019 highs, according to industry tracker CB Insights. In July, the firm predicted that deals around real estate technology were on a run rate to hit $8.35 billion, down slightly from the $8.86 billion raised in 2019.\n\n“I … don’t see the pandemic altering people’s feeling or perception about the appeal of the ‘1950’s suburban ideal’ in which someone (usually a father in a grey suit) commutes daily into a nearby urban center of activity — in fact, I think what the current interest in the suburbs confirms is that people don’t want to commute and that they feel more interested in suburban environments as they imagine them transitioning into ‘miniurban’ environments where commuting is limited, ideally, there is walkability and where they have access to restaurants, culture and shopping through a mix of local and digital experiences,” wrote Celia Warburg Peters, a venture partner at Bain Capital Partners, in response to an ExtraCrunch survey.\n\n“I think technology is going to be a significant part of the transition in how we live and work in the next few years, and I am bullish about proptech during this period. There was always the anticipation that, across the industry, tech adoption would be accelerated during a downturn because tech can often drive efficiency and bring down costs,” Peters wrote.\n\nThese investments (outside of enabling home buying and selling) can be organized around big new urban infrastructure projects and their enabling technologies and the intentional communities that could leverage those technologies to build new developments.\n\nGiving communities a hardware refresh\n\nEven before the Toronto project started falling apart, Alphabet’s Sidewalk Labs subsidiary was planting the seeds to continue to grow its vision of a more tech-enabled future.\n\nIn late summer of 2019, months before the company pulled the plug on its North American waterfront dream community, it spun up and spun out Sidewalk Infrastructure Partners.\n\nDesigned as a holding company to invest in infrastructure projects that have technology solutions as their cornerstone, the business quickly raised $400 million from investors, including the Ontario Teachers Pension Plan, its parent company and its parent company’s parent company, Alphabet.\n\nThe holding company’s goal is no less ambitious than initiating large-scale infrastructure projects to make cities more efficient, resilient, safer and sustainable.\n\nThese four organizing principles each have an associated project.\n\nFor efficiency, there’s the company’s still-in-stealth effort, Cofi, which is set to launch in 2021 and will leverage innovations in software-defined networking, open standards, radio access networks and virtualization to enable a neutral-host infrastructure for wireless broadband distribution across new radio spectrum. “This infrastructure can deliver value to all stakeholders, including traditional incumbents, new service providers, municipalities, enterprises and others while advancing broadband access equity,” the company said.\n\nSidewalk Infrastructure Partners has already unveiled its other three projects, with varying degrees of specificity and at different stages of development. For safety, there’s Cavnue, which is working initially with the city of Detroit and state of Michigan to create a special route that would give autonomous vehicles greater access to roads and freeways. Together with portfolio company Amp Robotics, Sidewalk Infrastructure Partners has launched the Polysift initiative to build recycling capacity; and finally there’s Resilia, the most recent of the company’s initiatives, which uses demand response technologies to reduce stress on power grids, potentially avoiding blackouts and brownouts.\n\nIndividually these infrastructure projects represent hundreds of millions of dollars of potential revenue. And billions of dollars are waiting to be spent in the U.S. on scores of infrastructure initiatives promised over the past 12 years or more. The Council on Foreign Relations estimates that there’s a $2 trillion funding gap between what’s needed to upgrade American infrastructure and what’s currently allocated.\n\nOther companies are joining Sidewalk Infrastructure Partners in the attempt to upgrade the hardware of American cities. Swell Energy has $450 million in renewable energy, energy storage and demand-response projects lined up, in a sweeping deal that will see the company compete against Resilia’s pitch.\n\nOn the transit side, big money tech companies like Virgin Hyperloop and Elon Musk’s Boring Company are taking stabs at redeveloping urban and interstate mobility, while Amazon’s Zoox just unveiled its autonomous taxi, which could be hitting streets in broader pilots next year. In a more modest proposal, The Routing Company is pitching a service to provide an on-demand ride-sharing platform to transit platforms and has just raised $5 million in cash to do it.\n\nThere are even opportunities for urban infrastructure development to create its own green revolution. That’s why companies including Plenty, Bowery, Bright Farms, AeroFarms and Gotham Greens, have raised at least $1.3 billion between them to build out networks of indoor vertical farms.\n\nThese startups (and many, many more) may all see a potential windfall in federal dollars as the Biden Administration moves ahead with plans to funnel billions of dollars into sorely needed upgrades around the country.\n\nPrivate capital also sees the benefit in upgrading or refurbishing forgotten parts of urban infrastructure. In just three years the Los Angeles real estate-focused investment firm Fifth Wall has managed to go from a $212 million first fund to now holding nearly $1.2 billion in assets under management from investors in fourteen countries representing nearly 60 corporations.\n\n“Fifth Wall sits at the intersection of real estate as an industry and tech as an industry,” said the firm’s co-founder Brendan Wallace.\n\nWhile much of that capital is dedicated to finding ways to repurpose retail outlets or smooth the process of buying, selling, renting and remodeling real estate across the globe — increasingly, the firm’s biggest investors are asking about ways to tackle climate issues along with their other concerns.\n\nWallace sees three drivers for the newfound interest in upgrading the built environment with an eye toward efficiency and resiliency.\n\n“Large commercial real estate and debt allocators were basically saying that they will deploy capital to low- or no-carbon real estate [exclusively],” said Wallace. “The second vector was regulators. Because real estate is inherently local and local regulators in cities like New York and Los Angeles enacted carbon neutrality laws mandating that landlords decarbonized,” interest in technologies to help has spiked.\n\nFinally, he said, customers like Amazon and Microsoft have committed to decarbonize not just their own businesses, but their supply chains as well. That means data centers, delivery drivers, warehouses, component suppliers and others will have to green their own supply chains in order to work with these incredibly massive, incredibly wealthy businesses.\n\n“From an investment perspective there’s a lot more science and hardware being integrated in far more complicated ways than we were used to as investors,” said Wallace. “Real estate has this new imperative to decarbonize.”\n\nThat’s why Fifth Wall has set out to raise a $300 million climate-focused real estate technology fund. The need for new investment in the revitalization of existing infrastructure is also why REEF, the Softbank-backed company that’s looking to repave parking lots and put up a paradise was able to raise massive amounts of capital for its own take on an urban renaissance.\n\nUnlike the developers looking to create intentional communities from the ground up, REEF chief executive Ari Ojalvo sees his company’s project as one of the ultimate expressions for urban infill. Ojalvo dismisses “the idea of starting with a blank canvas.”\n\nInstead, REEF’s project is to take the unused urban infrastructure that exists in the network of parking lots that scar cities across the country and transform them into something more useful. It’s an idea that’s come of age in the era of the COVID-19 pandemic.\n\nAs concerns about indoor dining and enclosed spaces contributing to the spread of the virus grew, restaurants took to the sidewalks, streets and parking lots of their own accord. REEF sees itself as part of that trend — and a broader push to rehabilitate unused urban spaces.\n\n“First with parking lots then we evolve to lobbies and we evolve to rooftops, we evolve to all of the inadequate infrastructure in a city and how we can improve neighborhood living,” said Ojalo. “We’re trying to change how neighborhood living can be more optimized.”\n\nAdmittedly, the fledgling steps the company are taking aren’t pretty. But the buildout of basic infrastructure has to start somewhere, according to Ojalvo.\n\n“It’s almost like a settler. You don’t start a city with a building. You bring in the settlers and the settlers come in and they start the activity and the activity justifies the infrastructure investment — and the sustainable infrastructure allows for sustainable growth,” Ojalvo said. “There is a ton of work that actually goes into making sure that that kitchen meets all the standards from a legal framework … once you solved a kitchen you can put a grocery in there … you can. if we want to put some storage in there or some convenience stores [we can].”\n\nREEF also has its first clutch of settlers. It’s a group that includes partners like the last-mile delivery startup Bond (and the logistics giant DHL); the national primary healthcare services clinic operator and technology developer, Carbon Health; the electric vehicle charging and maintenance provider, Get Charged; and — at its operations in London — the new vertical farm developer, Crate to Plate. (Ojalvo said it was in talks with established vertical farming companies in the U.S. on potential partnerships.)\n\nThe developments that Ojalvo envisions have a retail component that complements a different kind of consumer and the different services that cater to them.\n\n“Communities fought back the congestion caused by these commuters by building these garages,” Ojalvo said. “That congestion is no longer caused by me and my car, it’s caused by the Instacart delivery guy and the people who are supplying the kitchen. They use their street as their warehouse … the question has always been … if the garage is meant to absorb this congestion and the congestion is no longer caused by commuters … what is it we need to do to these garages so that they can absorb all of this? What if this car was inside a garage and the production was inside the same property?”\n\nThe near-term opportunities may be at odds with the long-term vision, and REEF’s ability to transform the temporary trailers housing its ghost kitchens into more permanent — and permanently appealing — structures for community engagement is still an open question. But Ojalvo does have a vision for urban transformation — and it begins with the garage.\n\n“The way we look at the garage is very different … it’s pretty dilapidated, it’s pretty sad. [But] it’s very similar to the bones of a building where you and I live,” he said. “What you do with those bones depend on what kind of capital and what kind of power you have to make that vision look a lot better. There are parking lots right on the water … and there are 40 or 50 of them. You could open it up to the public and it would be very, very nice.”\n\nAlso, like Sidewalk Labs, REEF’s chief executive sees his company as a potential consumer for all kinds of new technological innovations to transform his long-term vision into a reality.\n\nIn that way REEF can provide another market for the tech companies that are building new energy efficiency technologies, like the Sidewalk Labs-backed startup, Volt Server; or the novel building materials manufacturer and 3D-printed building design firm Icon Build. The company’s developments could employ software like the kind developed by Cove.tool.\n\n“The more that kind of funding comes to the market the more that crazy vision is possible,” said Ojalvo. “We were not going to be the people that invent the new material that is eco-friendly and cheap and light … [But] hopefully we can provide them with the infrastructure that helps them achieve the dream.”\n\nIntentional communities\n\nRoughly 6,650 miles south of Toronto, in Sao Paulo, sits the city of Fortaleza, Brazil. And even as Sidewalk Labs announced that it would wind down its Toronto project, the Italian startup property development company Planet Smart City was gearing up its fourth “smart city” development 23 kilometers outside the Brazilian city.\n\nEquipped with the latest in energy-efficient lighting and HVAC systems, and a community-focused app, which includes a geo-located social network, akin to Nextdoor; an emergency alert app, like RapidSOS; opportunities for communal equipment rental; and a service to track power and water usage, the Planet Smart City developments stand as a model for what developers can achieve with more modest ambitions.\n\nFounded in 2015 by Italian real estate developers Giovanni Savio and Susanna Marchionni, and chaired by Stefano Buono (an Italian physicist), Planet Smart City has four projects built or under development in Brazil, for complexes that can house over 50,000 people and intends to expand into India.\n\nBy 2023, the company is looking to have 30 large-scale projects in Brazil, India and Kenya, according to Planet Smart City’s chief digital officer, Alan Marcus. And all of these projects will be built with the latest in smart lighting, smart metering and wireless connectivity in apartments that are priced between $27,000 and $30,000 in Brazil.\n\nSince its launch, Planet Smart City has raised $75 million in equity from private investors, Marcus said — including a €23 million round of funding which closed in January.\n\n“Our customers are not that poor, but they’re not rich enough to buy a home on the open market,” said Daniele Russolillo, the co-chief executive of Planet Smart City in an interview earlier this year. “They have decent jobs, but they’re not rich enough to buy a house exactly where they want at market prices. We offer affordable housing at exactly the price that they can afford. It’s interesting because of the social impact we can create … we can make a difference in those lives. [And] affordable housing is evolving … there is almost a seven million unit housing deficit in Brazil … in India there’s a housing deficit of 30 million.”\n\nGlobally, there are 1.5 billion people living in inadequate housing solutions, according to Russolillo. “We could work for centuries and only scratch the surface of this problem,” he said.\n\nPlanet Smart City may be among the most ambitious global vision for the ways in which community developments can be built using the latest technologies, but it’s hardly the only one.\n\nSomewhat closer to home, a startup backed by Khosla Ventures, Zigg Capital and Initialized Capital called Culdesac is taking its own spin on community redevelopment. The company has raised $17 million in equity for its parent company and another $170 million in funding for its project in Tempe, Arizona, across the Salt River and just seven miles to the east of Phoenix near the city’s airport.\n\nThat project is a 17-acre lot meant to be filled with 761 apartments, 16,000 square feet of retail space and 1,000 residents — with no parking. The entire acreage of the carless village that Culdesac is hoping to create could be circumnavigated in less than an hour of walking.\n\nFounded by former employees of the real estate company, Open Door Labs, Culdesac takes some of the lessons learned from that real estate acquisition and redevelopment company and applies it to neighborhood redevelopment, according to co-founder and chief executive, Ryan Johnson.\n\n“What we saw at Opendoor … was there is enormous demand for walkable neighborhoods, and with all these innovations in transportation, ride-sharing, scooters, etc., we realized that there was a way to build it. So we said, ‘Where can we build a new type of walkable neighborhood?’” Johnson said to The New York Times.\n\nMeanwhile, co-living startups like Venn, which has outposts in Berlin, Brooklyn, New York and Tel Aviv, replicate the vision on a similar, smaller scale. Using apps to integrate their tenants into the surrounding communities — in an effort to support local development in a way that potentially avoids the negative connotations of gentrification (at least, according to the company).\n\n“We want to have an active community that takes responsibility for themselves. I call it ‘participatory citizenship,’” a former general manager of the Venn space in Tel Aviv told the Israeli newspaper Haaretz last January. “We’re used to being consumers. We live in our flats, we order online. We’re not actively influencing the way that we live. If you want to have a better education system in your neighborhood, rise up. If you want to influence the local businesses in your neighborhood, rise up.”\n\nAt Venn, the company will not only develop living spaces, but it helps its residents develop businesses, schools and even bars. In Tel Aviv’s rapidly gentrifying Shapira neighborhood, that means places like Getzel Coffee Shop, which was opened in partnership with Venn; or People Pizza, a pizzeria in which Venn has a stake; or Atlas, a new bar opened with assistance from some of the company’s connections.\n\nPlanet Smart City also incorporates an aspect of economic development into its communities. “We source all of our materials locally,” said Marcus. “We have a factory on the build site that produces our bricks and provides fabrication for roofing and walls.” It can also be a source of employment for residents even after the housing is built, he said.\n\nThe Italian company is also thinking about the infrastructure to support its developments, whether that’s through electricity microgrids powered by solar or geothermal energy to the smart utility components of its app. “We want to have as low a footprint as possible,” Marcus said. “Compare it to an Android-type device. We’ll bring in new software and we’ll give the next community a hardware refresh.”\n\nAs for privacy concerns associated with the Planet Smart City developments, Marcus said that residents can opt out of data collection services at any time. “We’re not forcing them to give us [data]. We’re not hiding terms and conditions in some obscure legal language. We have to follow GDPR and Brazilian data authorities,” he said. “[Urban development] could be local and transparent. Instead of thinking top-down, let’s think bottom-up.”\n\nMany of these businesses have been surprisingly resilient in the face of a global pandemic that’s prevented through social distancing and isolation. Starcity, a co-living business backed by investors like Urban.us, managed to raise $30 million in the early days of the COVID-19 outbreak, and in a bookend to emphasize how the industry has bounced back, New York-based Common raised $50 million in September for its co-living spaces.\n\nIt seems that even a COVID-19 pandemic couldn’t crush the interest in co-living and community development. Some companies have even found a way to give co-living a more communitarian feel for potential economic development beyond gentrification.\n\nIn Los Angeles, Nico (which stands for “neighborhood investment company”) isn’t just engaged in building properties, it’s also building wealth for local investors. The company raised money from Collaborative Fund and Alphabet’s Sidewalk Labs, along with private angel backers and is focused on pitching real estate investment trusts to local investors in the neighborhoods it’s looking to build in.\n\n“The neighborhood REIT is organized as a benefit corporation,” said Max Levine, the co-founder and chief executive of Nico. “It has an explicit mandate to balance financial outcomes with social and environmental outcomes as we’ve defined it for people in the community who may or may not be shareholders.”\n\nSo far, Nico has used $30 million to acquire three rent-stabilized buildings in the Los Angeles neighborhood of Echo Park. The company’s aim is to give neighborhood residents a chance to participate in the area’s renewal. The Nico REITs have a minimum investment threshold of $100 and investment materials have been distributed around the neighborhood in both English and Spanish, Levine said.\n\n“Both in the startup world and in commercial real estate there are massive amounts of big capital flowing into communities where that capital is trying to purely maximize the financial return to investors who typically have nothing to do with those communities,” Levine said. “The institutionalization of real estate broadly has been the story of real estate since 2008 … [And] to us, the question is if that’s what’s happening in the system — and it’s this huge force shaping communities — how do we create a way for communities to participate in success where success is measured not just by financial returns but by human outcomes in a community?”\n\nAll of this activity likely means that the rumors of the death of cities has been greatly exaggerated.\n\n“Despite the anecdotal conversations on Twitter and the public narrative of people fleeing cities, as prices for rental units drop in cities, historically, new demand backfills quickly,” Stonly Baptiste Blue told TechCrunch earlier this year. “Younger demographics who were once pushed out of the more expensive cities flock as newly available supply comes available. This was the case for the last three major recessions and also follows the logic of the 500-year exponential trend of urbanization. It can seem like a lot because so many voices in tech are amplified, but that largely ignores the data. When a COVID-19 vaccine gets here, and rent in cities is lower than before and people remember that FUN: nightclubs, bars, restaurants, CULTURE: fashion shows, art exhibitions, concerts, INTELLECT: universities, incubators, co-working, etc. are all concentrated in dense locations, the trend will reverse back to the mean, just as it has every other time in history.”"}