{"url": "https://techcrunch.com/2024/05/06/hong-kongs-crypto-ambition-starts-garnering-global-attention/", "title": "Global crypto firms turn to Hong Kong for refuge — and opportunity", "authors": ["Rita Liao", "Reporter", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-05-06T00:00:00", "text": "With U.S. regulators continuing to ramp up their scrutiny of crypto, startups and founders in the space are looking overseas to find friendlier climates to support their growth.\n\nOne such destination is Hong Kong, which, seeking to restore its status as a financial hub, is banking on favorable crypto regulations to draw a fresh raft of entrepreneurs, technologists and investors. So far, its strategy seems to be working.\n\nIn mid-April, Hong Kong’s annual web3 festival drew in over 50,000 attendees. There were noticeably more non-Chinese attendees compared to last year, when the event felt like a gathering of crypto refugees fleeing mainland China’s restrictive policy. At this year’s edition, buttoned-up officials from the city listened attentively to scruffily dressed founders battling jetlag. While she did not make it to the event in person, Cathie Wood, the billionaire founder of Ark Invest, delivered a speech via video. And Vitalik Buterin, the nomadic founder of Ethereum, made a last-minute appearance.\n\nIt evoked a sense of déjà vu: In the industry’s infancy, Hong Kong was a major hub for crypto firms run by foreign entrepreneurs, including the likes of FTX, Crypto.com and BitMex. Like other jurisdictions around the world, the city clamped down on crypto activities to safeguard investor interest as market volatility was spiraling out of control.\n\nExcitement around Hong Kong’s web3 scene started to bubble up again last June, when the government made it legal for retail investors to trade crypto. Since then, the city has implemented a series of measures to regulate crypto-related activities, including a sandbox for stablecoin issuance as well as a licensing regime for crypto exchange operators. Following in the footsteps of the U.S., Hong Kong just listed a batch of cryptocurrency exchange-traded funds this week.\n\nThese moves are in stark contrast to the U.S. government’s tough stance against crypto businesses. Attendees at the web3 festival, who flew in from the U.S., Europe, the Middle East, India and other regions, expressed their optimism about the momentum in Hong Kong. First Digital’s FDUSD, issued under Hong Kong’s digital asset rules and backed by U.S. Treasury bills, for example, has quickly become the world’s fourth-largest stablecoin by market capitalization.\n\nAt the same time, people are mindful of Hong Kong’s limitations as an aspiring crypto hub. For one, it’s a relatively small market of seven million people, and mainland China’s enormous market is going to be off-limits for now at least. Moreover, the rules prioritize investor protection, which can result in higher compliance costs and deter those who favor a more freewheeling environment.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nStill, Hong Kong remains one of the few jurisdictions, alongside countries like the United Arab Emirates, Japan and Singapore, that have shown a clear commitment to cryptocurrency. As Jack Jia, head of crypto at global payments company Unlimit, remarked: “The fact that Hong Kong is coming up with any crypto regulation at all, just from a reputation and optics standpoint, will attract everyone.”\n\nOpen-minded officials\n\nHong Kong doesn’t actually have the most lenient crypto regulations. Indeed, its scrutiny over exchange operators has pushed its crypto posterchild, HashKey, to seek a license in Bermuda. The world’s largest crypto exchanges, namely Binance, Coinbase and Kraken, are conspicuously absent from the list of 22 applicants for the city’s virtual asset exchange license.\n\nAs it turns out, Hong Kong’s greatest allure is its effort to provide regulatory clarity for crypto activities.\n\n“The SEC is notorious. ‘Everything’s a security, but we’re not going to tell you clearly what licensing you need to apply for, and then we might just reject your application anyway,’” said Jia, describing the attitude of the U.S. Securities and Exchange Commission in regulating crypto firms. “There’s no set SEC process. But Hong Kong regulators have put out a process for hearing your opinions.”\n\nIndeed, multiple crypto executives told TechCrunch that they have held closed-door meetings with Hong Kong government representatives. Working to feed real-world data to smart contracts, which are lines of code that execute predefined rules, San Francisco-based Chainlink is in discussions to provide its technology to major financial infrastructure in Hong Kong, said its co-founder Sergey Nazarov.\n\n“People don’t fully realize that the capital markets and crypto are very compatible. In coming to Hong Kong, I found that that compatibility is going to be accelerated here first because the government and the regulators are more open to that compatibility,” said Nazarov, who invited Hong Kong’s Under Secretary for Treasury Joseph Chan to speak in a fireside chat with him at SmartCon, Chainlink’s annual conference, in Barcelona last year.\n\nThis year, Chainlink is taking SmartCon to Hong Kong at the invitation of the local government, making Hong Kong the first Asian city to host the conference, according to Nazarov.\n\n“The Hong Kong regulator is giving out regulation on stablecoins and regulation on [digital] assets. That means Hong Kong can be a place where assets and payments can reliably function in one system in a regulated way,” Nazarov added. “That’s important, because if things are not regulated, then all of the hundreds of trillions of dollars and banks will not migrate.”\n\nSteve Yun, president of Dubai-based TON Foundation, Telegram’s official blockchain partner, shared the sanguine sentiment, saying that Hong Kong might have the biggest competitive advantage over other aspiring crypto hubs as the city “is trying to come up with a very comprehensive framework to make builders and entrepreneurs feel more comfortable and to attract talent.”\n\nHong Kong’s financial regulations are intricate, but Charles d’Haussy, CEO of Switzerland-based dYdX Foundation, is no stranger to them, having previously headed fintech for InvestHK, the Hong Kong government’s foreign direct investment department.\n\n“The Hong Kong government was very open to crypto in the early days,” d’Haussy recalled. Then came a period of hostility as regulators tried to combat rampant crypto frauds. But “about a year ago or so, I think they understood that there was a new market there, and there should be regulations to make sure that this opportunity was not missed.”\n\n“That’s when you saw the HKMA [Hong Kong Monetary Authority] doing more and more CBDCs [central bank digital currencies], and the Hong Kong SFC [Securities and Futures Commission] issuing crypto exchanges and ETFs licenses,” d’Haussy added.\n\nAccess to China\n\nWhen Hong Kong opened up to cryptocurrencies last year, speculation was rife that mainland China might follow suit. That hope remains distant as China continues to bar its people from trading crypto. Nonetheless, companies are now recognizing Hong Kong’s potential as a gateway to another valuable resource from its neighbor.\n\nWhile Hong Kong is a magnet for financial talent, its neighbor to the south, Shenzhen, is home to some of the world’s largest tech companies, such as Huawei, DJI and Tencent. Unsurprisingly, crypto firms are capitalizing on the combination of Hong Kong’s friendly regulations and its proximity to developer resources in Shenzhen and other Chinese cities.\n\nOne such player tapping Hong Kong’s geographic location is TON Foundation. As part of its effort to become a super app, Telegram is partnering with TON, which enables developers to build blockchain-based lite apps that run on the messenger. During the web3 week, the Foundation held a bootcamp in Hong Kong in the hope of attracting Chinese developers, particularly those who are familiar with WeChat’s mini-app empire.\n\n“Now we are reaching out to regions where they have a high number of developers and entrepreneurs, especially the ones who grew up using some type of mini apps through a super app, and those who participated in the growth of such ecosystem,” said Yun.\n\na16z-backed Aptos, for example, hosted a three-day hackathon in Shenzhen back in February, attracting hundreds of applicants. Aptos, run by a team that previously worked on Meta’s Diem blockchain, has also partnered with Alibaba’s cloud computing arm to lure Chinese developers.\n\nSome foreign founders have taken a step further by establishing a physical presence in the city. zkMe, founded by a German entrepreneur to enable private credential verifications, chose to locate its headquarters in Hong Kong.\n\n“We came here to build a sustainable business and take advantage of the tech expertise here, and then obviously, the cooperation with the Greater Bay Area is also really beneficial,” said zkMe’s founder and CEO, Alex Scheer, referring to the initiative that aims to integrate Hong Kong with nine adjacent Chinese cities through policies like tax benefits for Hong Kong firms to set up in Shenzhen. Of zkMe’s team of 16 members, 14 are based out of its Shenzhen office.\n\nSome founders are more optimistic about Hong Kong paving the path for China to embrace crypto in the future. Anurag Arjun, founder of Dubai-based Avail, a modular blockchain company, believes governments that see the full benefits of crypto technologies will eventually adopt a more accommodating position.\n\n“[The crypto industry has] been building very advanced technology over the last few years. Some examples are things like zero-knowledge proof technology,” he said, suggesting that the underlying technology behind cryptocurrency was developed not to support fraudulent NFTs or speculative trading, but to enhance the foundational tech of the industry.\n\n“Due to the strategic nature of Hong Kong, we feel that it is an important place — a gateway to China in the future,” said Arjun. “If China opens up in the future — and once we talk to more government officials and make our case for the technology not only for the currency elements of it — what we do in Hong Kong will be a useful lesson to also expand to China.”"}