{"url": "https://techcrunch.com/2025/01/27/how-to-switch-off-apple-intelligence-on-your-iphone-ipad-and-mac/", "title": "How to switch off Apple Intelligence on your iPhone, iPad, and Mac", "authors": ["Lorenzo Franceschi-Bicchierai", "Senior Reporter", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-01-27T00:00:00", "text": "Apple released new software updates on Monday, including iOS 18.3, which automatically opts users into Apple Intelligence, at least for newer devices.\n\nUnlike what the tech industry seems to think, or wants to believe, not everyone wants generative AI features enabled by default on their devices. You may want to switch off the new AI features because you are concerned about the AI industry’s impact on the environment or some of the political views of the industry’s top players, or you just don’t think it works very well right now — something that has so far been proven true with Apple Intelligence, so much so that there’s an entire subreddit dedicated to its fails.\n\nWe are here to help you switch off Apple Intelligence from your devices, a process which should be the same for iPhones, iPads, and Macs — and it’s relatively straightforward.\n\nGo to Settings on iOS, or System Settings on Mac, and then tap or click on Apple Intelligence.\n\nOn Mac, if it’s switched on, turn it off by clicking on the toggle. You may also want to switch off Siri here as well.\n\nImage Credits:Lorenzo Franceschi-Bicchierai\n\nYou will have to confirm you want to stop using Apple Intelligence in a dialog that will open once you click on the toggle.\n\nImage Credits:Lorenzo Franceschi-Bicchierai\n\nOn iOS, when you open the Settings app, scroll down to Apple Intelligence & Siri and tap on the toggle to turn it off. You can turn off Siri here too, which we suggest for privacy and security reasons, especially related to Siri on the lock screen.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe settings screen for apple intelligence on ios\n\nIt’s worth noting that Apple has designed its AI features to be privacy-minded, with a system and infrastructure that the company calls Private Cloud Computer. In practice, this means no personal data ever touches the company Apple Intelligence servers."}