{"url": "https://techcrunch.com/2021/12/20/the-growing-power-of-digital-healthcare-6-trends-to-watch-in-2022/", "title": "The growing power of digital healthcare: 6 trends to watch in 2022", "authors": ["Bill Taranto", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-12-20T00:00:00", "text": "The digital healthcare revolution has already begun, and it will gain further momentum in 2022 as providers and patients look for new and better ways to improve care. Companies with strong offerings, management teams and balance sheets are poised to capture tremendous value.\n\nHealthcare deals were hot in the first nine months in 2021. They brought in a total of $21.3 billion in venture funding across 541 deals, dwarfing the previous record of $14.6 billion set in 2020, according to Rock Health.\n\nBut startups will continue to lead the way in innovation with the use of AI, IoT and data analytics, especially with data becoming the central currency of healthcare.\n\nGiven this environment, here are six emerging trends that we’re watching closely in 2022.\n\nTelemedicine will change how chronic conditions are treated\n\nThe pandemic showed how telemedicine could change how we think about care interactions, with virtual visits increasing almost 40 times, according to data from McKinsey. Most of these interactions were centered around acute care. But for telemedicine to achieve its full potential, it will need to engage patients more frequently, especially for certain chronic conditions.\n\nCosts around chronic care are poised to rise as baby boomers age and put greater strain on the healthcare system. One chronic condition where telemedicine will play a larger role is diabetes. That’s why Teladoc Health, a leader in the space, acquired Livongo last year for $18.5 billion.\n\nIn 2022, entrepreneurs and investors are likely to expand telemedicine into more chronic care spaces like cardiology. Today, someone in the U.S. suffers a heart attack every 40 seconds, and heart disease costs the country about $219 billion a year. Telehealth offers a convenient, cost-effective way to diagnose and treat cardiovascular disease. For instance, with telehealth, even patients in remote or rural areas can gain access to cardiologists to get treatment without traveling far.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nOverall, expect telehealth players to build their offerings across the chronic care landscape in a meaningful way in 2022.\n\nDigital therapeutics will rewrite the future of healthcare\n\nDigital therapeutics is perhaps the most innovative development in healthcare today and has the potential to dramatically change how care is delivered. More than any other area, this is the space where I believe we’ll see the most entrepreneurial and investment activity in the coming year.\n\nFunding in the industry was up 79% over 2020 as of the third quarter, according to CB insights. The global digital therapeutics market is projected to hit $13.1 billion by 2026, up from $3.4 billion in 2021.\n\nDigital therapeutics offers the potential to engage patients on a daily basis to improve their care. That’s why both the telemedicine players and medical device players are looking to lock in patients with digital therapeutics that go beyond the traditional digital wrappers.\n\nSeveral years ago, we invested in Welldoc, which was the first digital therapeutic on the market and the first FDA-approved diabetes application for self-care. Today, there is clinical validation showing that patients can decrease their A1C profile, better manage their diet and exercise routine and actually reverse type 2 diabetes by using Welldoc.\n\nOther areas where DTx will show promise in the coming year are in mental health and substance abuse. The beauty of digital therapeutics is that it can dramatically enhance the breadth of data gleaned from individual patients and entire patient populations. This data can be used to deliver more effective treatment options and approaches.\n\nOne example not in our portfolio is Pear Therapeutics, which recently received breakthrough device designation from the FDA for its digital therapeutic candidate focused on the treatment of alcohol use disorder.\n\nGoing forward, the pharmaceutical industry will also seek to develop digital solutions that can radically improve current therapies and help foster new ones. Ultimately, digital therapeutic solutions will span almost every therapeutic area, especially as they start to produce measurable positive outcomes for patients.\n\nSocial determinants of health will result in greater health equity\n\nSocial determinants of health (SDH) are the non-medical factors that influence health outcomes. They include economic stability, education, access to health literacy and even neighborhood of residence. All of these and more can impact a person’s health.\n\nTake, for instance, the 34 million Americans living with diabetes. Even if they understand the need to exercise and eat healthy, they may not be able to due to a variety of social determinants. Can they afford healthy food? Do they live close enough to healthy food options? If not, do they have a means of transportation to get there? These are all real issues and are part of the reason why America spends more than $325 billion every year treating diabetes and related complications.\n\nIn 2022 and beyond, we’ll see healthcare companies finally start to identify and address inequities and structural barriers in their industry. Core to their effort will be the sharing of data around SDH. Data and analytics will go a long way toward seeing where social risk exists and measuring the impact of these risks on surrounding communities.\n\nSuch data will be extremely important in treating diseases like type 2 diabetes. For instance, if we can identify at-risk individuals and better understand the socioeconomic reasons why they do or don’t improve, we have a much better chance of delivering better healthcare.\n\nRemote health monitoring will improve outcomes and lower costs\n\nMedical devices today are smaller and more powerful with the ability to collect massive amounts of data. They can measure and monitor almost anything and can be used in nearly any therapeutic area.\n\nThe global remote-patient monitoring market was valued at $975 million in 2020 and it is expected to reach $3.24 billion by 2027. The sale of Preventice Solutions, a cardiovascular monitoring company, to Boston Scientific for $1.2 billion where MGHIF was an investor validated this market opportunity.\n\nRemote monitoring is often pitched as a way to help individuals get care outside the hospital. But aside from patient convenience, there is a strong clinical and economic argument for monitoring patients remotely.\n\nRemote monitoring not only improves outcomes and lowers costs, it can also change the game for clinical development by pharmaceutical companies. For instance, remote-monitoring data can be used to inform clinical research into drug discovery, facilitating faster vaccine development and new treatments. Additionally, remote-monitoring data can be used to paint a more complete picture of a patient’s medical history. This data can then be analyzed to identify people who are at high risk.\n\nThe amount of clinical data derived by remote-monitoring devices has much relevance. One use case that will receive a lot of attention in the coming year is oncology. For instance, many cancer patients suffer from neuropathy and other serious side effects when undergoing chemotherapy, so monitoring patients as they go through chemotherapy is vitally important.\n\nUltimately, winners will include a mix of companies, some doing the actual monitoring and others doing the data analytics to predict when a patient is about to experience a medical event.\n\nReal-world data will deliver real-world results\n\nThe number of mobile devices, wearables and sensors that collect health-related data is growing rapidly. This real-world data enables us to answer questions previously thought unknowable, and we can turn that data into insights that lead to better clinical care and outcomes.\n\nThe companies that amalgamate, aggregate and integrate health data will continue to prosper, the ones to drive value will be the firms with fully annotated, longitudinal multimodal date. The coming year will see a line of difference between the companies providing access to data and those that provide insights.\n\nHealthcare will get truly patient-centric\n\nThe consumerization of healthcare will accelerate next year. We’ll see the market recognize the importance of patients and put them at the center of care. The companies that succeed will be the ones that change the way patients interact with the healthcare system by building their entire operation around the patient experience and ensuring patients get the best care at the best price.\n\nThis includes offering value-add services like online self-scheduling tools that make it easier for patients to book appointments, as well as interactive solutions that guide patients to the right appointment with the right provider based on their needs. It also includes giving people greater control over their healthcare decisions and allowing them to share in the financial benefits of those decisions.\n\nNext year will also reward companies that are building out personalized medicine engines to get patients quickly to the right treatment. We can expect to see personalized medicine startups creating effective drug therapies based on users’ individual specifications, which should be safer, cheaper and more effective because they’re fine-tuned to each person’s unique genetic makeup.\n\nHealthcare is being forced to reinvent itself and offer more and better digital solutions. Agile investors recognize this trend and they’re seizing the advantage to deliver returns, power innovation and, most importantly, bring better healthcare to patients."}