{"url": "https://techcrunch.com/2021/09/15/nigerian-agritech-startup-releaf-secures-4-2m-to-scale-its-food-processing-technology/", "title": "Nigerian agritech startup Releaf secures $4.2M to scale its food processing technology", "authors": ["Tage Kene-Okafor", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-09-15T00:00:00", "text": "The distance between their farms and the nearest processor is key for smallholder farmers who need to process their crops. And though Nigeria’s food processing systems have a keen resemblance to the West with respect to big factories and huge economies of scale in high-demand cities, farmers still suffer from poor logistics networks.\n\nWith distance and logistics problems, farmers’ crops can go bad and when factories buy them, it affects their processing yields and price. Farmers, witnessing post-harvest loss, also get paid less and miss the opportunity to invest in their crops production.\n\nNigerian agritech startup Releaf is solving this by building proprietary hardware and software solutions to make these farmers and food factories more efficient and profitable. Today, the company is announcing that it has raised $2.7 million in seed toward this effort.\n\nPan-African focused venture capital firms Samurai Incubate Africa, Future Africa and Consonance Investment Managers led the round. Individual investors like Stephen Pagliuca, the chairman of Bain Capital and Justin Kan of Twitch also participated.\n\nIn addition to the seed round, the agritech startup secured $1.5 million in grants from The Challenge Fund for Youth Employment (CFYE) and USAID.\n\nFounded by Ikenna Nzewi and Uzoma Ayogu, Releaf focuses on value chains where smaller factories are set up near smallholder farmers. This allows them to get better processing yields and fewer logistics costs; in the end, the farmer has more money to work with.\n\nWhen the pair started the company in 2017, the idea behind Releaf was not concrete yet as the team, based in the U.S., had not figured out product-market fit.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nFirst, it planned to increase productivity in Nigeria’s agricultural sector using software. Even after graduating from Y Combinator’s summer batch that year, Releaf toyed around with ideas around trade finance and a marketplace for buyers and sellers of agricultural products.\n\nThe team would get a clearer picture of what it wanted to build when the founders moved back to Nigeria. The Americans of Nigerian descent toured across 20 states and studied different value chains for crops spotting inefficiencies that could be solved by technology.\n\n“We took a much more broad approach to what the solution would be, but we really wanted to decide on a specific crop to work in. And we found that opportunity in the oil palm sector,” Nzewi said to TechCrunch in an interview.\n\nThe oil palm market in Nigeria is a $3 billion one with over 4 million smallholder farmers cultivating farms where those crops are planted.\n\nThese farmers drive 80% of the production of oil palm. But since the industry is quite fragmented, they have many challenges processing the oil palm because it’s a crop that requires serious processing power to extract vegetable oil from it.\n\nFarmers typically go through this process by using rocks or inappropriate hardware — ineffective processes that lead to low-quality oil palm largely unfit as input for high-quality vegetable oil manufacturing.\n\nNzewi says the team saw an opportunity and set out to build a technology to help farmers crack oil palm nuts. The result was Kraken, a proprietary patent-pending machine.\n\nSo here’s how the company’s business model works. Releaf buys nuts from the farmers, then uses the Kraken to crack the nuts and crush the kernels into vegetable oil. Releaf then sells the vegetable oil to FMCG processors and local manufacturers, mainly in Nigeria’s South South region.\n\n“Nigeria has about 60% more demand for vegetable oil than it does supply. And it can not be met due to supply shortfall with imports because the government banned the importation of vegetable oil. So there is a need to take these smallholders who are driving 80% of production and make them more efficient so that we can have a better balance of supply and demand for vegetable oil,” Nzewi said about the pain point Releaf is addressing.\n\nBut still, why does the company think it can break into a competitive Nigerian vegetable oil market with hardly differentiable products?\n\nNzewi explains that the answer lies in the quality of products. Typically vegetable oil is driven by a free fatty acid (FFA) metric that measures vegetable oil’s impurity. The CEO claims that while the industry standard is about 5% FFA, Releaf produces at 3.5%.\n\nDespite having an edge in quality of production, Releaf products are sold on an industry standard. Nzewi says that might not be the case in the future as the company is looking to finally take advantage of its product quality and increase prices to improve its profit margins.\n\nAccording to the company, Kraken already processes 500 tonnes of palm nuts. Its software connects to over 2,000 smallholder farmers who have supplied over 10 million kilograms of quality palm kernel nuts to food factories.\n\nRegarding expansion, Nzewi noted that Releaf has more appetite for moving into new geographies instead of crop offerings. His argument is that processing oil palm and cultivation style is a straightforward method due to its similarities across West Africa.\n\nBut for crop expansion, the company may need to find crops that can be planted alongside oil palm and practice intercropping or work with crops like soybeans or groundnuts used in the vegetable oil industry.\n\nReleaf will use the seed investment to develop technology and deploy it to smallholder farmers, Nzewi tells me. Then the $1.5 million in grants will focus on providing working capital financing to these farmers. He adds that Releaf has run financing trials already this year where it has increased smallholder incomes by three to five times.\n\n“We think there’s a really great opportunity to bring both physical technology and financial services to these communities to make them more productive. And it’s kind of central to our thesis,” the CEO said. “We believe that our smart factories can serve as an economic pillar in these rural communities and make it easier for us to supply these communities with other services that they can find valuable like access to working capital, payment for education, and access to insurance services. So we see the food processing as like the first step it cements us in the value chain.”\n\nEarlier this year, agritech startups like Gro Intelligence and Aerobotics raised huge sums of venture capital and showed the sector’s promise in Africa. However, venture capital has slowed down over the past few months and Releaf’s investment brings that spotlight back to the sector, albeit briefly.\n\nRena Yoneyama, the managing partner at Samurai Incubate Africa, said Releaf’s novel approach sets it aside from other agritech startups the venture capital firm has engaged with.\n\n“We believe the firm’s thesis on decentralizing food processing would have a strong match with Africa’s economic development landscape for the next few decades. Ikenna and Uzo are the perfect founders to disrupt this market in Nigeria and beyond. We are thrilled to back them as they innovate in providing both agro-processing and financial services to rural communities and farmers,” she added.\n\nSpeaking on the investment as well, Iyin Aboyeji, general partner at co-lead investor Future Africa said, ” … The team at Releaf is building the agro-allied industry of the future from the ground up, starting with palm oil which they have developed a novel technology to aggregate, deshell and process into critical ingredients like vegetable oil and glycerine. Future Africa is delighted to back Releaf to build the future of modern agriculture.”"}