{"url": "https://techcrunch.com/2024/02/13/akamai-extends-its-edge-computing-platform-as-it-looks-to-challenge-aws-azure-and-gcp/", "title": "Akamai extends its edge-computing platform as it looks to challenge AWS, Azure and GCP", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-02-13T00:00:00", "text": "Akamai today announced the launch of its Gecko “Generalized Edge Compute” platform. This new initiative will increase the company’s cloud-computing network with an additional 10 regions worldwide in the first quarter of this year and then another 75 throughout the rest of the year.\n\nEver since it acquired Linode in 2022, Akamai has made it clear that it intends to build a more comprehensive cloud computing service with a focus on bringing compute capacity close to its users, reducing latency for many traditional use cases and enabling new ones like immersive retail, spatial computing and consumer and industrial IoT. There is, of course, also an AI play here, as Akamai believes that many businesses will want to run their models and other machine learning workloads close to their users.\n\nAWS is taking a similar approach with its Local Zones, but Akamai argues that its competitors treat their cloud and edge networks separately while Gecko is a single, highly distributed cloud platform.\n\n“Gecko is the most exciting thing to happen to the cloud in a decade,” said Akamai co-founder and CEO Tom Leighton. “It’s the next phase of the roadmap toward a more connected cloud we laid out when we acquired Linode to add cost-effective, cloud-native computing capabilities to our portfolio. We began delivering on that roadmap with the launch of Akamai Connected Cloud and the rapid rollout of new core computing regions around the world. With Gecko, we’re furthering that vision by combining the computing power of our cloud platform with the proximity and efficiency of the edge, to put workloads closer to users than any other cloud provider. When we say we operate at planetary scale, this is what we mean.”\n\nGiven its massive network, with over 4,100 points of presence, Akamai also believes that it can differentiate its service through the strength of its network. In addition, the company also argues that a lot of businesses today are looking for a more nimble alternative to the large centralized clouds.\n\n“Akamai is delivering on the promise it made when it acquired Linode by quickly integrating compute into its security and delivery mix,” said Dave McCarthy, IDC, research vice president of Cloud and Edge Services. “What they’re now doing with Gecko is an example of the more distributed cloud world we’re heading toward, driven by demands to put compute and data closer to the edge.”\n\nThe company plans to open hundreds of these small regions in the next few years. Though looking at the near term, today it is launching in cities like Hong Kong SAR; Kuala Lumpur, Malaysia; Querétaro, Mexico; Johannesburg; Bogotá, Colombia; Denver, Colorado; Houston, Texas; Hamburg, Germany; Marseille, France; and Santiago, Chile, launching later this quarter. That’s on top of the 25 core compute regions it currently offers.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nOnce Akamai gets a good number of the regions up and running, it plans to bring its container service to them and then, at a later point, its automated workload platform, which, the company promises, will allow developers to easily distribute their applications to hundreds of locations."}