{"url": "https://techcrunch.com/2025/02/05/stripe-makes-1-1-billion-crypto-bet-as-it-closes-on-bridge-acquisition/", "title": "Stripe makes $1.1B crypto bet as it closes on Bridge acquisition", "authors": ["Mary Ann Azevedo", "Sarah Perez", "Aisha Malik", "Theresa Loconsolo", "Charles Rollet", "Julie Bort", ".Post-Authors-List__Authors --Font-Size Var", "Align-Items Center Display Flex Gap Var", ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var", "Border Solid Var --Wp--Custom--Color--White"], "publication_date": "2025-02-05T00:00:00", "text": "In Brief\n\nStripe has closed on its $1.1 billion purchase of stablecoin platform Bridge — marking the payment giant’s largest acquisition to date and tangible push into crypto.\n\nCo-founded in 2022 by Coinbase and Square alumni Zach Abrams and Sean Yu, San Antonio, Texas-based Bridge built an API that helps companies accept stablecoins. The pair raised $58 million from investors such as Index Ventures and Sequoia Capital, according to PitchBook. It was valued at $200 million when it raised a $40 million Series A in 2024.\n\nWith this acquisition, Stripe is clearly betting big on crypto.\n\nIn a February 5 post on X, Stripe co-founder and CEO Patrick Collison wrote: “We expected Bridge (go follow them at @stablecoin) to grow very quickly, and we’re nevertheless shocked at just how rapidly adoption is exploding. In the coming years, everyone programmatically moving money will likely want a stablecoin strategy.”\n\nLast July, Stripe enabled crypto purchases in the EU, and in October, the fintech announced a Pay with Crypto feature that lets merchants accept stablecoins."}