{"url": "https://techcrunch.com/2022/05/24/starlink-adds-rv-plan-that-provides-roving-coverage/", "title": "Starlink RV plan provides roving coverage", "authors": ["Darrell Etherington", "Editor At Large", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-05-24T00:00:00", "text": "Starlink has added yet another new service tier, its second diversification of its offerings in 2022, after it introduced a Business option earlier this year. The new “‘RV” plan comes with some noteworthy differences versus its standard service — including the ability to stop and start service whenever you want.\n\nStarlink for RVs uses the same hardware as the standard offering, but automatically bundles in access wherever Starlink offers service, though SpaceX says that service quality may differ depending on whether you’re in a coverage area marked “Available” (higher speeds and lower latency) or “Waitlist” (slower speeds and higher latency during peak usage hours).\n\nNote that this isn’t designed to be used by RVs in motion; it’s intended for use while you’re stationary at parking spots, camping grounds and RV parks during your trip.\n\nStarlink RV costs $25 per month more than standard consumer service, meaning it’s $135 per month, plus the cost of hardware. If you’re paying close attention to Starlink pricing, you might notice that’s the same cost as ordinary service plus the “Portability” feature Starlink introduced in March that allows you to take your dish anywhere else on the same continent where service is available and use it there.\n\nWhile Starlink for RVs is similar to basic Starlink + Portability, there are some key differences, including that there is no requirement to have a “home” address, and Starlink for RVs is available immediately without waitlist. The ability to pause and unpause service is also exclusive to the RV plan: Standard Starlink users aren’t locked into any service duration beyond the rolling 30-day period that comes with a sub, but they aren’t able to just stop and start service easily — doing so could put them to the back of the queue in an area with waitlisted demand.\n\nAlso, SpaceX crucially notes that RV customers are essentially considered second-tier by the service relative to standard home users. That doesn’t mean you won’t be able to get a connection in a busy spot, but it might mean your connectivity isn’t that great."}