{"url": "https://techcrunch.com/2023/09/27/snap-shutters-its-enterprise-services-division-after-less-than-a-year/", "title": "Snap shutters its enterprise services division after less than a year", "authors": ["Sarah Perez", "Consumer News Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-09-27T00:00:00", "text": "Snap is closing down a division of its company designed to offer its AR expertise to enterprise customers. The initiative, called AR Enterprise Service, or ARES, was announced in March of this year, and included a Shopping Suite for brands that allowed them to access AR try-on features, a 3D viewer for looking at a product from multiple angles, fit and sizing recommendation technology and an enterprise manager where brands could host and manage all digital assets.\n\nThe closure was first reported by Bloomberg, based on an internal memo sent from Snap CEO Evan Spiegel, which Snap confirmed. In the memo, the exec pointed to the emergence of AI tools that impacted Snap’s competitive advantage as well as the need to invest more heavily into web tools, rather than mobile — technology that he described as “technically complex and less engaging for our customers.”\n\nOn AI, specifically, Spiegel wrote, “the advent of generative AI has made it easier for companies of all sizes to create try-on experiences for their customers and made it harder for us to differentiate our offering.”\n\nThe company made the decision that building up ARES would take “significant” investment and it couldn’t continue to fund those efforts. The memo says the shuttering of the business will cut 170 jobs at Snap, but some employees may be rehired for other roles, including support for CameraKit, Sponsored AR advertising and others. Snap noted in the memo it has 250 million people still engaging with its AR experiences every day.\n\nAfter the introduction of ARES in March, Snap demonstrated the offering to brands at its Partner Summit in April, where it also rolled out a new offering called AR Mirrors, designed to bring AR tech to physical screens in the real world. Coca-Cola was using the tech to make an AR-enabled vending machine, and other retailers, including Men’s Wearhouse and Nike, have tested the product, Snap said.\n\nThe shopping suite, meanwhile was expanded with features like Live Garment Transfer, a tool that makes AR asset creation easier for retailers by allowing them to upload 3D assets in Lens Studio. Businesses would access Snap’s Shopping Suite solution via a front-end dashboard and back-end infrastructure where they create and manage their AR assets, build AR experiences, manage 3D asset catalogs and implement the Shopping Suite SDK.\n\nSnap also provided an in-house team to help clients with onboarding and using the suite’s features.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe division closure comes at a time when Snap has seen declining revenue. The company saw its first revenue decline as a public company in Q1 and reported $1.07 billion during Q2, another year-over-year drop. However, the company did grow its daily active users, which were up 14% year-over-year to 397 million in the second quarter, and recently announced it has topped 5 million paid subscribers for Snapchat+.\n\n“I am deeply grateful for the hard work of our AR Enterprise team,” wrote Spiegel. “It is very difficult to create a new business, and incredibly painful to wind it down, but it is the willingness to take risks and try new things that moves the world forward through innovation and experimentation. The courage and strength of our AR Enterprise team members embodies so much of what I love about Snap and I am so sorry that this venture did not work out as we had hoped. Leading in augmented reality means that sometimes we will fail, and I am proud that our team dared to build this business even if we did not succeed,” he said."}