{"url": "https://techcrunch.com/2021/10/25/malaysia-based-poladrone-raises-4-29m-seed-round-to-protect-crops/", "title": "Malaysia-based Poladrone raises $4.29M seed round to protect crops", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-10-25T00:00:00", "text": "Rhinoceros beetles are one of the greatest threats to oil palm crops, attacking plants while they are young and potentially lowering a farm’s yield for years. They also affect workers’ health, since pesticides need to be sprayed frequently. Based in Kuala Lumpur, Poladrone wants to change the way farms use pesticides with a combination of drones and automation and analytics software.\n\nThe company announced today it has raised a $4.29 million seed round led by Wavemaker Partners, which it says is the largest seed round ever raised in Malaysia, based on data from Crunchbase. Other participants include the Malaysian Technology Development Corporation (MTDC), which is wholly owned by Khazanah Nasional Berhad, the Malaysian government’s sovereign wealth fund; ZB Capital Limited; and angel investors.\n\nFounded in 2016 by Cheong Jin Xi, Poladrone now operates in Malaysia and Thailand and plans to expand into Indonesia, the world’s largest oil palm producer. Cheong told TechCrunch that Poladrone is profitable, but decided to seek funding after the COVID-19 pandemic hit and “highlighted the positive impact our technology has on agriculture communities by creating jobs and upskilling opportunities.”\n\nAdoption of Poladrone’s drones also increased during labor shortages caused by the pandemic, and the startup grew its team from 20 people to over 80 in less than a year to meet demand. Its seed round will be used for more hiring and to scale operations and to build more service centers in agricultural areas, where clients can buy equipment and spare parts.\n\nCheong first became interested in drones when he was a high school student in Melbourne, Australia, and it led to him pursuing an aerospace engineering degree at university.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAfter Cheong returned to Malaysia, he began looking at potential applications for drone technology and realized “the agriculture industry made perfect sense,” because drones can fly over large terrain to perform repetitive tasks autonomously, and their cameras also capture a large amount of data.\n\nCheong’s interest in agritech was also inspired by growing up in Kuala Lipis, an agricultural town in the state of Pahang. Many of his family members and relatives are involved in farming, and his early insights went into the development of Poladrone’s products.\n\nRhinoceros beetles are a serious problem during the first three years of an oil palm’s 25-year lifecycle, he said, because attacks hurt trees’ growth, delaying them from reaching maturity — and sometimes killing plants.\n\n“The issue is that once the surrounding oil palms matures, replanting is no longer possible which means that any space wasted on a dead palm would be wasted for the next 22 years,” Cheong said. As a result, oil palm farms usually need to perform preventative pesticide spraying every two weeks for the first two years after oil palms are planted, then every month until they mature. This is often done by workers with knapsack sprayers or on tractors.\n\nIn 2020, the company launched Oryctes, developed with support from Malaysia Digital Economy Corporation, for precision spot spraying of rhinoceros beetles and other pests. It also recently launched Mist Drone, which blanket sprays open field crops, like paddies, corn and bananas.\n\nMost of the oil palm farms Poladrone works with are mid-to-large size, or about 5,000 hectares and above. “Data analytics and automation becomes extremely important for farms once they reach this scale,” Cheong said. He added that oil palm farms cover 18.7 million hectares around the world, and Poladrone sees a serviceable addressable market of 4.2 million hectares in Malaysia alone, worth over $1.3 billion per year. The company is also planning to expand its reach to other types of crops, like rice, corn and sugarcane.\n\nIn addition to selling its products, Poladrone’s Service Centers also provide repairs, training and workshops, with the goal of increasing drone adoption. Cheong said it typically takes one week of training before workers start using Poladrone’s equipment, which can be operated from smartphones.\n\nIn statement about investment, Wavemaker Partners general partner Gavin Lee said, “Poladrone now works with eight out of 10 of the biggest palm oil farms in Malaysia — an impressive feat that gives us confidence to back the team and their vision of propelling Southeast Asia’s agriculture industry.”"}