{"url": "https://techcrunch.com/2025/02/27/amazon-debuts-ocelot-its-first-quantum-computing-chip/", "title": "Amazon debuts Ocelot, its first quantum computing chip", "authors": ["Paul Sawers", "Kirsten Korosec", "Rebecca Bellan", "Lauren Forristal", "Kyle Wiggers", "Tim De Chant", "Rebecca Szkutak", ".Post-Authors-List__Authors --Font-Size Var", "Align-Items Center Display Flex Gap Var", ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var"], "publication_date": "2025-02-27T00:00:00", "text": "In Brief\n\nAmazon Web Services (AWS) has introduced Ocelot, its first quantum computing chip. The news brings it into line with its big cloud rivals Microsoft and Google, which have also unveiled their own quantum chips in recent months, respectively Majorana and Willow.\n\nThe cloud computing giant has long been investing in the quantum computing space, starting in 2019 with its Braket quantum computing-as-a-service launched in partnership with industry players such as QuEra and Rigetti.\n\nQuantum computing builds on principles borrowed from quantum mechanics, leveraging “quantum bits” (qubits) to perform complex calculations more quickly than traditional computers. Applications potentially include drug discovery, cryptography and security, and AI.\n\nBuilding quantum chips that can run with reduced errors — one of the gating factors for quantum computing now — will be central to advancing quantum computing overall.\n\nOcelot was developed in partnership with the California Institute of Technology (Caltech), and integrates two small silicon microchips (pictured above) stacked atop each other. The company says that the chip’s design could reduce costs associated with error-correction by as much as 90%.\n\n“With the recent advancements in quantum research, it is no longer a matter of if, but when practical, fault-tolerant quantum computers will be available for real-world applications,” AWS director of quantum hardware, Oskar Painter, said in a statement."}