{"url": "https://techcrunch.com/2022/11/30/indian-agritech-dehaat-tops-700-million-valuation-in-60-million-funding/", "title": "Indian agritech DeHaat tops $700 million valuation in $60 million funding", "authors": ["Manish Singh", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-11-30T00:00:00", "text": "DeHaat, a startup that offers a wide range of agricultural services to farmers in India, has raised $60 million in a new funding round as it looks to deepen its penetration in the country and reach break-even profitability within two years.\n\nSofina Ventures and Temasek co-led the Patna and Gurgaon-headquartered startup’s Series E funding, it said, at a valuation between $700 million and $800 million, according to a person familiar with the matter. Existing backers RTP Global Partners, Prosus Ventures and Lightrock India also participated in the new round.\n\nFarming is a $350 billion industry in India, but farmers face myriad challenges in the country that were largely unaddressed until upstarts such as DeHaat arrived on the scene. Farmers struggle with securing agri-inputs, finding buyers for their produce and in maintaining enough runway.\n\nGiants such as Reliance and Adani Group offer some services to farmers, but their involvement in the agriculture sector remains largely limited. A fast-growing population and climate change mean Indian farmers need to adopt technology quickly to improve — and maintain — their yields.\n\nDeHaat uses artificial intelligence to help 1.5 million farmers across 11 states, 110,000 villages and more than 150 ZIP codes in India source raw materials, find advisory and credit services, and sell crops.\n\nThe startup has onboarded over 2,000 agricultural institutions, including input manufacturers, food and consumer goods giants, banks and insurance firms. It works with over 10,000 micro-entrepreneurs who help the startup run a maze of last-mile supply chains.\n\nIn the past two years, DeHaat has aggressively expanded across several key Indian states, and co-founder and chief executive Shashank Kumar told TechCrunch in an interview that the startup will focus on deepening its presence across the ZIP codes where it’s already operational in the immediate future and reaching break-even profitability in 12 months.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe new funding provides DeHaat with up to 40 months of runway, during which time Kumar said the startup will be profitable. “At least for the next three to five months, we are not adding any new geographies. We will continue to serve more farmers and broaden our network of centers in the states where we are operational,” he said. DeHaat currently doesn’t have a presence in the Southern Indian states. Kumar said the startup is hopeful to start expanding to those states after about a year.\n\nKumar acknowledged that raising funds in the current market scenario isn’t a walk in the park. Funding inflows to local startups has shrunk by more than 80% as investors grow cautious following a sharp reversal in the global market conditions.\n\n“The lens is different — everyone is looking for assets that have a clear path to profitability,” said Kumar. “In that way, DeHaat had its own advantage — our unit economics are very strong, whatever burn we have is for adding geographies. We raised the round to be ready for all the future opportunities,” he said, adding that DeHaat still has about two-thirds of the funds left from the previous $115 million funding round.\n\nHe said the startup, whose name means village in Hindi, has acquired about half a dozen firms in the recent quarters and sees more M&A potential on the horizon and is ready to execute when it finds the right partners.\n\n“With the intent to become a contributor to sustainable development goals, Sofina supports organizations that have a positive impact on their communities and the environment. We continue to be impressed by DeHaat’s vision and endeavour to empower farmers and local communities, and with this additional funding we hope to create an even deeper and broader impact within the existing network as well as new geographies,” said Yana Kachurina, principal at Sofina, in a statement."}