{"url": "https://techcrunch.com/2024/04/08/neurovalens-anxiety-fda/", "title": "Neurotech startup Neurovalens gets FDA clearance for noninvasive anxiety treatment", "authors": ["Natasha Lomas", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-04-08T00:00:00", "text": "A 2019 rule change by the U.S. medical devices regulator aimed at encouraging innovations targeting insomnia and anxiety is bearing fruit: Neurovalens, a Belfast-based startup that for over a decade has been developing technology to deliver noninvasive electrical stimulation of the brain and nervous system, has just had its second head-mounted treatment device cleared by the FDA.\n\nNeurovalens now has two medical devices approved for prescription by doctors in the U.S.: one to treat generalized anxiety disorder (GAD) and another targeting insomnia. Its GAD device was approved just last week, and its device for insomnia received FDA clearance last October. More products are on the way, including a device for treating obesity-related cardiometabolic risk, which targets brain messaging that can influence the storage of harmful visceral fat. It’s next in the pipeline.\n\nCEO Dr. Jason McKeown tells TechCrunch that Neurovalens is hoping to be granted an FDA “de novo” classification for a third noninvasive neurostimulating device — for people diagnosed with obesity — later this year or early next year. It’s also working on another product for PTSD.\n\nIssues like chronic pain, depression, and anxiety or stress are often poorly handled by resource-strapped traditional healthcare services, and a growing number of startups are taking an interest in applying neurostimulation to treat a range of issues and chronic conditions. Pharmaceutical interventions have their own drawbacks, not least risks related to side effects, so noninvasive alternatives that are able to demonstrate efficacy and safety could be transformative and could also work in concert with drugs to dial up interventions. So there’s huge potential, even as the field of noninvasive neurostimulation remains nascent and novel.\n\nNeurovalens has deliberately chosen to focus on selling regulator-cleared medical devices for specific conditions. This pathway requires it to conduct clinical trials to demonstrate significant results for particular use cases — rather than going direct to consumers with a marketing pitch composed of fuzzier “wellness” promises, for example — but it’s a differentiating strategy, McKeown says. “As a consumer device, we wouldn’t be allowed to make medical claims,” he points out. “So it’s really to differentiate ourselves as bona fide medical treatment for very, very, very specific conditions.”\n\n“In 2019, the FDA actually updated their regulations and specifically called out insomnia and anxiety because they knew that neurotechnology could potentially treat these things. In those two cases, we were actually allowed to do a 510(k) [FDA application]. But the restriction was that we had to do our own clinical trials,” he said, referring to the process that the first two prescribable products had to go through.\n\nA 510(k) clearance refers to a type of FDA application where a medical device can be considered substantially similar to an existing device, rather than the more novel “de novo” classification, which future Neurovalens products targeting other conditions (i.e., not anxiety and insomnia) will need to obtain.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Typically with a 510(k) you don’t need clinical trials; you’re kind of copying someone that’s been there before,” he said. “Whereas the FDA were like, ‘We don’t feel anything that’s come before has provided enough evidence. So we’re asking them to redo their trials.’ So we then took the guidance in 2019 and actually started then on our own trials. And, as far as I know, we’re the first company globally who has gone through that process with the FDA and got the first approval in that category.”\n\nConsumers in Europe, where regulations differ, are able to contact Neurovalens to purchase devices directly, according to McKeown. But he confirms the company is applying for medical device clearances in the U.K. and EU, too, saying it expects to get its first stamp of approval for doctors in Europe to prescribe its insomnia device as a treatment later this year.\n\nNeurovalens’ products take the form of a head-mounted device that applies electrical neurostimulation to the skin behind the ear — directly targeting the vestibular nerve — as a route to stimulate the hypothalamus and associated autonomic nuclei of the brainstem.\n\nThe startup says these are areas of the brain that are responsible for functions like metabolic control, stress response and circadian regulation. The basic theory for how the mechanism works is that targeted stimulation can re-regulate the brain’s control centers when areas are not functioning normally. (McKeown also says effects can be lasting, with users able to stop regular treatment after noticing positive change and switch to top-up treatments; it suggests four weeks of initial use to determine individual efficacy.)\n\nIt’s worth noting that this is a distinct approach to some other neurostimulation startups, such as those applying transcranial direct current stimulation (TDCS) or magnetic stimulation.\n\n“We are applying the minimum stimulation, but it’s extremely specific,” McKeown said. He argues that TDCS is less specific because it applies electricity to neurons on the surface of the brain, rather than going via the brainstem.\n\n“We know those nerve fibers carry signal into the deep area of the brain, which previously could only be accessed by an implant,” he said. “It’s a bit like sending a signal down a USB cable or something … The cable itself is almost irrelevant as long as the signal gets from one end to the other. So we can start at the surface and push stimulation down the vestibular nerves, and we know that activates the neurons in the brainstem.”\n\nThe vestibular system is typically associated with balance, but McKeown suggests it’s been underestimated, saying it plays a critical role in “overall homeostasis”: helping regulating everything from blood pressure to breathing rate, heart rate or even how much fat the body stores.\n\nNeurovalens is the first company that’s focused on noninvasive direct stimulation of the vestibular nerve, per McKeown. Although he notes there are startups attempting to develop noninvasive stimulation of the vagus nerve — another cranial nerve that links the brain with organs elsewhere in the body and plays a role in regulating various sensory and motor functions. This was an area Neurovalens also looked at, but decided it was too unreliable to target stimulation there given the presence of more soft tissue, muscle, etc. The vestibular nerve is essentially easier to get at.\n\n“Every cranial nerve stimulator is in our kind of seam area,” he said. “So, in the general space, there are competitors in the noninvasive space, [but] specifically, we don’t know of anyone who has device approval or regulatory approval for an anxiety treatment.”\n\nOn Monday, Neurovalens is also announcing a £2.1 million ($2.65 million) top-up to its Series A funding round, with existing investors chipping in to kick off commercializing the new device in the U.S. market. McKeown says they’ll begin the process of raising a Series B directly, targeting around $40 million for that round and aiming to close it out by the end of the year.\n\nSo far, Neurovalens has raised a total of £23.1 million in equity funding from U.K.-based investors, including Wharton Asset Management, IQ Capital, Techstart Ventures, Angel Co Fund, Beltrae Partners, Clarendon Fund Managers and British Business Bank."}