{"url": "https://techcrunch.com/2021/09/12/should-we-care-about-the-lives-of-our-kids-kids-kids-kids/", "title": "Should we care about the lives of our kids’ kids’ kids’ kids’?", "authors": ["Danny Crichton", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-09-12T00:00:00", "text": "We live during a time of live, real-time culture. Telecasts, spontaneous tweetstorms, on-the-scene streams, rapid-response analysis, war rooms, Clubhouses, vlogging. We have to interact with the here and now, feel that frisson of action. It’s a compulsion: We’re enraptured by the dangers that are terrorizing whole segments of the planet.\n\nJust this past month, we saw Hurricane Ida strike New Orleans and the Eastern Seaboard, with some of the fiercest winds in the Gulf of Mexico since Hurricane Katrina. In Kabul, daily videos and streams show up-to-the-minute horrors of a country in the throes of chaos. Dangers are omnipresent. Intersect these pulses to the amygdala with the penchant for live coverage, and the alchemy is our modern media.\n\nYet, watching live events is not living, and it cannot substitute for introspection of both our own condition and the health of the world around us. The dangers that sprawl across today’s headlines and chyrons are often not the dangers we should be spending our time thinking about. That divergence between real-time risks and real risks has gotten wider over time — and arguably humanity has never been closer to the precipice of true disaster even as we are subsumed by disasters that will barely last a screen scroll on our phones.\n\nToby Ord, in his prophetic book “The Precipice: Existential Risk and the Future of Humanity” argues that we aren’t seeing the existential risks that can realistically extinguish human life and flourishing. So he has delivered a rigorous guide and compass to help irrational humans understand what risks truly matter — and which we need to accept and move on from.\n\nOrd’s canvas is cosmic, dating from the birth of the universe to tens of billions of years into the future. Humanity is but the smallest blip in the universal timeline, and the extreme wealth and advancement of our civilization dates to only a few decades of contemporary life. Yet, what progress we have made so quickly, and what progress we are on course to continue in the millennia ahead!\n\nAll that potential could be destroyed though if certain risks today aren’t considered and ameliorated. The same human progress that has delivered so much beauty and improvement has also democratized tools for immense destruction, including destructiveness that could eliminate humanity or “merely” lead to civilizational collapse. Among Ord’s top concerns are climate change, nuclear winter, designer pandemics, artificial general intelligence and more.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThere are plenty of books on existential risks. What makes The Precipice unique is its forging in the ardent rationality of the effective altruism movement, of which Ord is one of its many leaders. This is not a superlative dystopic analysis of everything that can go wrong in the coming centuries, but rather a coldly calculated comparison of risks and where society should invest its finite resources. Asteroids are horrific but at this point, well studied and deeply unlikely. Generalized AI is much more open to terrifying outcomes, particularly when we extend our analysis into the decades and centuries.\n\nWhile the book walks through various types of risks from natural to anthropogenic to future hypothetical ones, Ord’s main goal is to get humanity to take a step back and consider how we can incorporate the lives of billions — maybe even trillions — of future beings into our calculations on risk. The decisions we make today don’t just affect ourselves or our children, but potentially thousands of generations of our descendants as well, not to mention the other beings that call Earth home. In short, he’s asking the reader for a bold leap to see the world in geological and astronomical time, rather than in real time.\n\nIt’s a mission that’s stunning, audacious, delirious and enervating at times, and occasionally all at the same time. Ord knows that objections will come from nearly every corner, and half the book’s heft is made up of appendices and footnotes to deflect arrows from critics while further deepening the understanding of the curious reader or specialist. If you allow yourself to be submerged in the philosophy and the rigorous mental architecture required to think through long-termism and existential risks, “The Precipice” really can lead to an awakening of just how precarious most of our lives are and just how interwoven to the past and future we are.\n\nHumanity is on the precipice, but so are individuals. Each of us is on the edge of understanding, but can we make the leap? And should we?\n\nHere the rigor and tenacity of the argument proves a bit more elusive. There isn’t much of a transition available from our live, reality-based daily philosophy to one predicated on seeing existential risks in all the work that we do. You either observe the existential risks and attempt to mitigate them, or you don’t (or worse, you see them and give up on protecting humanity’s fate). As Ord points out, that doesn’t always mean sacrifice — some technologies can lower our existential risk, which means that we should accelerate their development as quickly as possible.\n\nYet, in a complicated world filled with the daily crises and trauma of people whose pained visages are etched into our smartphone displays, it’s challenging to set aside that emotional input for the deductive and reductive frameworks presented here. In this, the criticism isn’t so much on the book as on the wider field of effective altruism, which attempts to rationalize assistance even as it effaces often the single greatest compulsion for humans to help one another: the emotional connection they feel to another being. “The Precipice” delivers a logical ethical framework for the already converted, but only offers modest guidance to persuade anyone outside the tribe to join in its momentum.\n\nThat’s a shame, because the book’s message is indeed prophetic. Published on March 24, 2020, it discusses pandemics, gain-of-function research and the risks of modern virology — issues that have migrated from obscure academic journals to the front pages. There really are existential risks, and we really do need to confront them.\n\nAs the last year has shown, however, even well-known and dangerous risks like pandemics are difficult for governments to build up capacity to handle. Few humans can spend their entire lives moored to phenomenon that happen once in 100,000 years, and few safety cultures can remain robust to the slow degradation of vigilance that accompanies any defense that never gets used.\n\n“The Precipice” provides an important and deeply thought-provoking framework for thinking about the risks to our future. Yet, it’s lack of engagement with the social means that it will have little influence on how to slake our obsession for the risks right before us. Long-termism is hard, and TikTok is always a tap away.\n\nThe Precipice: Existential Risk and the Future of Humanity by Toby Ord\n\nHachette, 2020, 480 pages\n\nSee Also"}