{"url": "https://techcrunch.com/2021/12/09/shabodi-aims-to-make-developing-apps-in-5g-piece-of-cake-takes-in-3m/", "title": "Shabodi aims to make developing apps in 5G a piece of cake; takes in $3M", "authors": ["Christine Hall", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-12-09T00:00:00", "text": "While most of the market is focused on building and selling 5G infrastructure, an important piece that is overlooked is the application development on 5G networks, according to Vivek Ladsariya, general partner at SineWave Ventures. That’s what makes him excited to support a company like Shabodi.\n\n“Application developers have always wanted to abstract away network complexities and Shabodi is primed to serve that need,” Ladsariya said via email.\n\nShabodi raised $3.375 million in seed funding to enable enterprises, system integrators and telecommunications companies to accelerate the development and deployment of next-generation applications on 5G.\n\nThe Toronto-based company was founded by telecom veterans Vikram Chopra and Harpreet Geekee in 2020 with an initial focus on 5G deployments through its application enablement platform. This is the pair’s second time working together.\n\nShabodi is already working with customers to leverage the full potential of the network by monetizing their 5G deployments to accelerate return on investment.\n\n“5G is a couple of years away from everyone, but enterprise is ripe for this,” Chopra told TechCrunch. “Companies are deploying 5G across multiple sites, but building applications on it requires a new skill set, and right now, we are one of the few addressing it.”\n\nLikening it to what Square did for payments, Shabodi aims to demystify 5G by providing simple APIs so that developers can build Industry 4.0 applications without unexpected costs, complexity and domain disparity, he added.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBlumberg Capital led the seed round and was joined by Counterview Capital, Shasta Ventures, SineWave Ventures, MAVA Ventures, Green Egg Ventures, Maccabee Ventures, CEAS Investments, Supernode Ventures and Lorimer Ventures. Shabodi raised a $200,000 pre-seed round earlier this year led by Forum Ventures and former Cisco and Yahoo executives.\n\nMeanwhile, the company has 15 employees and two patents, with a third coming next year.\n\nThough Chopra could not reveal other customers, he said that the company is in talks with about a dozen enterprises. He intends to use the new funding to build out product and sales teams as it readies Shabodi’s first product for public consumption by the end of this year.\n\n“We are proud to partner with Shabodi’s visionary team of industry experts to accelerate the deployment of 5G, one of the most impactful developments of this decade,” said Bruce Taragin, managing director at Blumberg Capital, via email. “5G will disrupt many aspects of enterprise technology, and Shabodi’s platform has the potential to significantly improve how application developers, organizations and entire industries make 5G a reality.”"}