{"url": "https://techcrunch.com/2025/05/07/uber-invests-100m-in-weride-to-fuel-robotaxi-expansion-across-15-more-cities/", "title": "Uber invests $100M in WeRide to fuel robotaxi expansion across 15 more cities", "authors": ["Kirsten Korosec", "Transportation Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-05-07T00:00:00", "text": "Uber and Chinese autonomous vehicle technology company WeRide plan to expand a commercial robotaxi partnership and bring the service to another 15 cities over the next five years. The expansion comes five months after the two companies launched a commercial robotaxi service in Abu Dhabi.\n\nAs part of that expansion, Uber will increase its investment into WeRide by $100 million, according to a Wednesday regulatory filing. WeRide said it expects the cash to come through by the second half of 2025.\n\nThe companies said the expansion will include cities in Europe. Under the partnership, WeRide’s robotaxi services are available through the Uber app. The relationship is similar to Uber’s deal with Waymo, in which the ride-hailing company handles the network routing and fleet operations, while the autonomous vehicle company remains responsible for the AV tech.\n\nUber and WeRide, which went public on the Nasdaq in late October, operate together in Abu Dhabi and announced plans to add Dubai. In Abu Dhabi, they work with local Tawasul Transport to handle fleet operations.\n\nThe additional 15 cities will focus on cities outside of China and the United States.\n\nUber has locked up more than 15 partnerships with a wide-range of autonomous vehicle technology companies over the past two years across ride-hailing, delivery, and trucking. In the past two months, Uber has announced deals with Ann Arbor, Michigan-based May Mobility Volkswagen, and Chinese self-driving firm Momenta.\n\n\n\nIt’s most high-profile partnership in the U.S. — and one that is commercially operating today — is with Waymo. The companies offer a Waymo on Uber service in Austin and are about to do the same in Atlanta.\n\nThis story was originally published May 5. It has been refreshed with Uber’s capital commitment to WeRide."}