{"url": "https://techcrunch.com/2025/04/17/ramp-is-trying-to-get-the-us-government-as-a-customer-after-seeing-a-tweet-from-doge/", "title": "Ramp is trying to get the US government as a customer after seeing a tweet from DOGE", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-17T00:00:00", "text": "Expense management startup Ramp is being considered for a charge card pilot program by the U.S. government’s General Services Administration, the company confirmed to TechCrunch on Thursday.\n\nThe government’s internal expense card program, dubbed SmartPay, is a $700 billion program. It is estimated that the charge card pilot program contract for which Ramp is being considered is worth up to $25 million, according to a report by Pro Publica.\n\nPro Publica claims that fintech Ramp has been lobbying for the administration’s attention since January, before President Trump was sworn in.\n\nIn January, Ramp co-founder CEO Eric Glyman and Ramp VC investor Kyle Harrison wrote a blog post titled “The Efficiency Formula” in which they listed the ways they imagined the government could “eliminate inefficient spending.” Harrison is a general partner at the firm Contrary.\n\nThe post seemed to be an appeal to Elon Musk’s government agenda — which would be formally created a few days later as the Department of Government Efficiency — considering Ramp has ties to Musk’s and Trump’s world. Ramp’s investors include Peter Thiel’s Founders Fund; Keith Rabois of Khosla Ventures; Thrive Capital, which was founded by Joshua Kushner, brother of Trump’s son-in-law Jared; Trump ally 8VC’s Joe Lonsdale and Jeb Bush, former governor of Florida and brother of former Republican President George W. Bush.\n\nRamp “is competing in a standard procurement process for a SmartPay pilot program based on the strength of our solution,” Lindsay McKinley, head of communications told TechCrunch on Thursday.\n\nShe added: “Ramp’s technology has prevented billions of dollars in wasted spend across the economy, and if chosen, we’ll bring those same results to the American taxpayer.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nDespite McKinley’s strong rhetoric, she’s referring to how Ramp positions itself as a money-saving option for corporations. It offers similar spend management features as other corporate expense management platforms, like setting parameters to identify expenses that don’t conform to policies. The federal government has many such policies for employees in place.\n\nMcKinley said that the startup saw a public post on X shared by the Department of Government Efficiency, better known as DOGE, on February 18 that said “the US government currently has ~4.6M active credit cards/accounts, which processed ~90M unique transactions for ~$40B of spend in FY24.”\n\nA former customer, Ramp claims, introduced Ramp to GSA a few days later.\n\n“Since then we have demonstrated the product and are now part of a standard RFI process,” she said. “We have no indication of whether we’ll be selected.”\n\nIn March, Ramp doubled its valuation to $13 billion after a $150 million secondary share sale. The startup has raised over $1 billion in equity financing and $700 million in committed debt funding since its 2019 inception."}