{"url": "https://techcrunch.com/2025/05/07/teslas-robotaxi-and-cybercab-trademarks-hit-roadblocks-ahead-of-june-launch/", "title": "Tesla’s ‘Robotaxi’ and ‘Cybercab’ trademarks hit roadblocks ahead of June launch", "authors": ["Sean O'Kane", "Sr. Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-05-07T00:00:00", "text": "Tesla’s attempt to trademark the term “Robotaxi” in reference to its vehicles has been refused by the U.S. Patent and Trademark Office for being too generic, according to a new filing. Another application by Tesla to trademark the term “Robotaxi” for its upcoming ride-hailing service is still under examination by the office.\n\nIn addition, applications from Tesla for the trademark on the term “Cybercab” have been halted due to other companies pursuing similar “Cyber” trademarks. That includes one company that has applied for numerous trademarks related to aftermarket Cybertruck accessories.\n\nThe USPTO issued Tuesday what’s known as a “nonfinal office action” on the “Robotaxi” trademark application, which means Tesla has three months to file a response or the office will abandon the application. A trademark lawyer representing Tesla did not immediately respond to a request for comment.\n\nTesla applied for the trademarks in October 2024 on the same day that it revealed the Cybercab, the purpose-built electric car that it hopes to one day use in its planned autonomous ride-hailing service. Tesla also submitted two similar trademark applications October 10 for the term “Robobus,” which are still under examination.\n\nThe trademark that was refused was assigned to a USPTO examiner on April 14. Tesla said it would use the word in reference to “[l]and vehicles; electric vehicles, namely automobiles; automobiles; and structural parts therefor,” according to the original application.\n\nWhile the USPTO examiner found there were no conflicting trademarks in existence, it refused the application because it was “merely descriptive.” The examiner wrote that the term “Robotaxi” is “used to describe similar goods and services by other companies.”\n\n“[S]uch wording appears to be generic in the context of applicant’s goods and/or services,” the examiner wrote.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nTesla will be allowed to submit evidence and arguments to support its argument in favor of the trademark. If it does, the USPTO wants Tesla to provide “[f]act sheets, instruction manuals, brochures, advertisements and pertinent screenshots of applicant’s website as it relates to the goods and/or services in the application, including any materials using the terms in the applied-for mark.”\n\n\n\nIn other words, Tesla needs to give the agency specific plans for how and why it deserves the “Robotaxi” trademark.\n\nThe examiner also wrote that Tesla will need to tell the USPTO if “competitors” use the terms “ROBO, ROBOT, or ROBOTIC to advertise similar goods and/or services.”\n\nTesla’s other application for the “Robotaxi” trademark would cover the use of the word when offering transportation services, including “coordinating travel arrangements for individuals and for groups,” “arranging time-based ridesharing services,” and offering vehicle sharing or rentals. That application was also assigned to a USPTO examiner on April 14, but no decision has been filed.\n\nThis story has been updated to include information about the “Cybercab” trademark applications."}