{"url": "https://techcrunch.com/2023/09/27/mark-zuckerberg-went-33-minutes-without-saying-metaverse-at-his-keynote/", "title": "Mark Zuckerberg went 33 minutes without saying ‘metaverse’ at his keynote", "authors": ["Amanda Silberling", "Senior Writer", "Kyle Wiggers", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-09-27T00:00:00", "text": "When Meta rebranded from Facebook two years ago, the word “metaverse” went mainstream. Even people outside the tech world wondered if we would soon start to socialize via virtual reality headsets. But at least according to public opinion and the stock market, the metaverse proved itself to be pretty mid.\n\nPropelled by founder and CEO Mark Zuckerberg’s ardent vision, Meta remains committed to its dreams of a world where we attend work meetings in VR and hang out with our friends in Horizon Worlds, rather than in person. So, as Mark Zuckerberg announced the Quest 3 headset today at the Meta Connect event, it was a surprise that he didn’t mention the metaverse.\n\nNo, really. Zuckerberg did not utter the word “metaverse” until 33 minutes into his Meta Connect presentation. He played a text adventure game with a Snoop Dogg–inspired AI before he mentioned the metaverse. He used AI to turn his dog into origami before he mentioned the metaverse. He made numerous references to his interest in cage fighting before he mentioned the metaverse. We don’t know how much Mark took away from his Meta Connect rehearsals — he seemed a little nervous onstage — but we can guess that someone told him sternly that he cannot talk about the metaverse. The bullying would be endless.\n\nWhen did the metaverse actually come up? After demoing a new slate of AI assistants with specific personalities (which, for some reason, are depicted as celebrities like Naomi Osaka and Charli D’Amelio), Zuckerberg let us know that we will be able talk with these AIs across platforms.\n\n“We’re also working on bringing all of this to the metaverse . . . where these AIs will be embodied as avatars, you’ll be able to make them as NPCs in the different games and experiences that you build in all of the different Horizon Worlds, and I think that’s gonna be really neat,” Zuckerberg said at Meta Connect today.\n\nThis pivot in messaging isn’t surprising — and it’s smart, given how Meta managed to make virtual reality, an inherently cool technology, extremely uncool. This marketing shift has been foreshadowed in Meta’s last several quarterly earnings calls, where Zuckerberg has emphasized Meta’s strides in AI, while VR takes a back seat. He even had to clarify that he still is committed to the metaverse.\n\n“A narrative has developed that we’re somehow moving away from focusing on the metaverse vision, so I just want to say up front that that’s not accurate,” Zuckerberg said on an earnings call in April. “We’ve been focusing on AI and the metaverse, and we will continue to.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThough the Quest 3 makes Meta very competitive with Apple’s mixed-reality headset, Reality Labs (Meta’s division for VR and AR) continues to struggle. Last quarter, Meta’s VR and AR products brought in just $276 million, while Reality Labs lost $3.7 billion."}