{"url": "https://techcrunch.com/2021/10/25/amazon-brings-alexa-to-hospitals-and-senior-living-centers/", "title": "Amazon brings Alexa to hospitals and senior living centers", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-10-25T00:00:00", "text": "After already targeting verticals like hotels and apartment complexes, Amazon announced today it’s now rolling out new solutions for healthcare providers and senior living centers. The solutions, which are a part of Alexa Smart Properties, are designed specifically to meet the needs of deploying Alexa devices at scale and will allow the facility’s administrators to create customized experiences for their residents or patients.\n\nIn senior living centers, the residents would be able to use Alexa devices to call their family members and other loved ones, as well as keep up with the goings-on at their community and other community news. The devices could also be used to make announcements, allow the residents to communicate with each other through direct audio messages and make voice and video calls, and they can streamline other center activities — like check-ins, maintenance requests and various administrative tasks. Amazon believes this could help make facilities more efficient and productive.\n\nAmazon says senior living communities include Atria and Eskaton will integrate with its new solution.\n\nThe market for using Alexa in senior living communities was already being explored by third-party providers, like K4Connect, which last year closed on $21 million in Series B funding to bring newer technologies, including Alexa’s voice assistance, to older adults and those living with disabilities. Companies like K4Connect and others, including Lifeline Senior Living, Aiva and Vocera, can now tap into Alexa Smart Properties’ tools and APIs to make it easier for them to roll out their own, customized solutions and software.\n\nMeanwhile, Amazon had already piloted putting Alexa in patient rooms in a test with Cedars-Sinai, which allowed patients to use voice commands for performing basic tasks, like changing TV channels, as well as communicating with caregivers. The idea was that, by offloading some of the everyday tasks to Alexa, it could free up nurses to focus more on medical care.\n\nWith Amazon’s new solution for hospitals, patients will be able to use Alexa to communicate with care staff, control the devices in their room, and stay entertained with news and music. Healthcare providers can also communicate with their patients using Alexa features like calling and Drop-In, without having to enter the patient rooms. This could also help hospitals be more productive and conserve their medical supplies and protective equipment like gloves, masks and gowns, notes Amazon. (PPE shortages had been an ongoing issue in some locations as COVID spiked during the pandemic.)\n\nCedars-Sinai is among those officially rolling out the Alexa Smart Properties solution, following its pilot program, and is joined by BayCare and Houston Methodist, Amazon says.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Voice is intuitive for patients, regardless of age or tech-savviness,” said Peachy Hain, executive director of Medical and Surgical Services at Cedars-Sinai, in a statement. “Since it’s so easy to operate, patients can use Alexa to connect with their care team and stay entertained as soon as they settle in, while care providers can streamline tasks to make more time to care for those patients. It’s a total gamechanger for enhancing our hospital experience,” Hain added.\n\nThough Amazon has struggled with privacy issues related to its use of voice recordings and transcriptions, the healthcare and senior living center solutions will not save the voice recordings and don’t require users to share personal info with Alexa to use the device, the company explains. Users can also mute the Echo’s microphone at any time with the button on top. Amazon also claims it safeguards protected health information received through HIPAA-eligible Alexa skill interactions.\n\nAmazon has been working to bring Alexa to healthcare facilities for some time. A report in 2018 by CNBC had said the company was building out a healthcare team with Alexa in order to make the voice assistant useful in the industry. This included working through the complex HIPAA regulations that would be required to do so. The following year, Amazon announced its first HIPAA-compliant medical skills and began piloting its devices in hospitals. Elsewhere across Amazon, the company has invested in healthcare solutions in other ways, including through solutions like Amazon Comprehend Medical, a machine learning tool that gathers information from things like doctors’ notes and patient health records, and acquisitions like online pharmacy PillPack.\n\nBoth of the new Alexa Smart Properties solutions will roll out in the U.S. starting next month, Amazon says."}