{"url": "https://techcrunch.com/2025/04/28/hugging-face-releases-a-3d-printed-robotic-arm-starting-at-100/", "title": "Hugging Face releases a 3D-printed robotic arm starting at $100", "authors": ["Kyle Wiggers", "Ai Editor", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-04-28T00:00:00", "text": "Hugging Face, the startup best known for the AI developer platform of the same name, is selling a programmable, 3D-printable robotic arm that can pick up and place objects and perform a few other basic chores.\n\nCalled the SO-101, the arm is the follow-up to Hugging Face’s previous robotic arm, the SO-100, released last year. The company’s robotics division, LeRobot, partnered with French robotics firm The Robot Studio to debut the SO-100 for around $100 in October.\n\nHugging Face teamed up with The Robot Studio once again for the SO-101, as well as with robotics store WowRobo, IoT hardware supplier Seeed Studio, and robotics part seller PartaBot.\n\nCompared to the SO-100, the SO-101, which also starts at $100, is faster to assemble and features improved motors that reduce friction while allowing the arm to sustain its own weight. The camera-equipped arm can be trained via an AI technique called reinforcement learning, which allows it to “learn” to perform tasks like picking up a Lego block and placing it in a bin.\n\nTo be clear, $100 is the base price for the SO-101. Thanks to premiums on fully assembled units and U.S. tariffs on Chinese imports, prices range from $100 to around $500, depending on the supplier.\n\nHugging Face is greatly expanding its robotics efforts, recently acquiring Pollen Robotics, a robotics startup based in France, for an undisclosed amount. Led by former Tesla Optimus engineer Remi Cadene, Hugging Face’s robotics wing plans to sell Pollen’s humanoid robot, Reachy 2, and let developers download and suggest improvements to its code."}