{"url": "https://techcrunch.com/2023/10/26/agentsync-raises-50m-more-in-a-massive-series-b-extension/", "title": "AgentSync raises $50M more in a massive Series B extension", "authors": ["Alex Wilhelm", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-10-26T00:00:00", "text": "Insurtech has had a rocky few years. Several startups in the space raised a lot of money and tried their luck on the public markets, but found that investors were unwilling to grant them valuations on par with other tech companies for just trying to make insurance more efficient.\n\nIndeed, the market seems to demand much more of insurtech players, with former startup darlings seeing their valuations decline sharply (in the case of Hippo), or deciding to sell for a fraction of their former worth (what happened with Metromile).\n\nInsurtech startup AgentSync is taking on the same slice of the economy, but with a very different model, focusing on helping federate information via APIs between different parties. That, it appears, is a more viable model: AgentSync recently raised a $50 million Series B extension, TechCrunch+ has learned. Prior investors led the round, and Craft and Valor returned as lead investors.\n\nThe company last raised capital in 2021, adding $75 million to its coffers at a $1.2 billion valuation at the time. The startup declined to share its new valuation.\n\nThe new money is great news in this climate, but that’s not to say AgentSync has had an easy time of it. The startup’s CEO and co-founder, Niranjan Sabharwal, told TechCrunch+ that insurance companies have had to wrangle several external forces in recent quarters, including a run of catastrophic events (obviously not a good thing for insurers) compounded by rising labor and materials costs, which have made paying out customer claims more expensive.\n\nAs the insurance industry was leaning toward a more conservative stance, AgentSync shook up its own business in late 2022. Sabharwal said the company revised its financial plan, reduced expenses and moved employees around internally to better fit the moment.\n\nStill, the company has continued to grow and is in the right zone when it comes to key SaaS metrics, like the ratio of its customer acquisition costs (CAC) to the long-term value (LTV) of those customers. Traditionally, it’s good for a startup’s LTV to be roughly 3x its CAC, and AgentSync has an LTV:CAC ratio of 3.6x at present, per Sabharwal.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nInterestingly, the startup told TechCrunch+ that it was actually not running low on cash when it decided to raise again. So why take on more capital, especially when you have a lower cost profile and winsome sales metrics? Oddly enough, it appears the market required it.\n\nSabharwal said his company’s move upmarket to larger insurance customers has yielded lengthy sales cycles. While AgentSync previously had the cash to see a number of transactions through, after those sales closed, it would have wound up with less cash than its new customer base would find comfortable. So, AgentSync raised capital before it needed the money, ensuring that when it does close some big deals, it has more than enough capital on hand to keep its customers unworried, Sabharwal said. The startup now has over $100 million in cash, he added.\n\nFunnily, this round is therefore somewhat like an IPO for AgentSync. Several CEOs of newly public companies have told TechCrunch+ that an IPO lets customers vet your financial health easily, which in turn stimulates a lack of concern about the state of your books and cash balances. That peace of mind makes it easier to choose a product or service from a smaller, or younger company.\n\nAgentSync is dancing to a similar tune, just with private capital.\n\nThe extension question\n\nStartups often raise extensions to seed rounds, but it’s rare to see a unicorn pause before moving up the ladder. But AgentSync is not alone in taking on an intermezzo round — Canopy Servicing did so, too, the other week, raising a Series A1 instead of a Series B. Canopy is certainly a smaller startup, but it does share something in common with AgentSync: long sales cycles.\n\nYou can connect the dots easily. A startup that has long sales cycles and confidence in its ability to close deals may wait to raise a large sum from new investors until that new revenue arrives. So, it instead raises money from existing investors at a discount to help it through until it can close the big deals, and then raise from new investors at a far more attractive price.\n\nSo what is AgentSync worth today? Sabharwal didn’t want to say, telling TechCrunch+ that the startup doesn’t intend to share valuation data, as the number can be volatile based on changing market conditions. Canopy Servicing said something similar, but we had PitchBook data about its new round, which spurred the company to share more detailed information. Sadly, we lacked a similar grip on data about AgentSync, though if that does shake loose in time, we’ll update this post.\n\nRegardless, I think that if AgentSync had raised at a flat or a higher valuation, it would have said so. It’s therefore likely that the company had its valuation reduced in this new round. Now, that may sound negative, but it’s actually not a big deal at a company worth as much as this one: If AgentSync took a 25% valuation cut in its Series B extension and sold $50 million worth of stock, it would only be diluted by around 5% or 6%. That’s far from lethal.\n\nWhat’s next?\n\nAgentSync’s ARR increased by about 3x since its Series B two years ago, per the company. That’s nothing to sneeze at, given that tech companies everywhere are prioritizing cash preservation over juicing their growth rates.\n\nSabharwal told TechCrunch+ that his company has shaken up its pitch. Earlier, it used to tell customers that it would help them ensure agent compliance as they scaled; today, he said, the pitch is more focused on ROI.\n\nThe CEO thinks there’s still a lot of the insurance market that is paper-based and slow, which means there will be plenty more data that his company can help scoot between the various parties. While AgentSync’s product is aimed at onboarding agents and the ensuing compliance work generates the majority of its revenue, the company has also built integrations to support other forms of compliance (FINRA) and continuing education requirements for insurance agents.\n\nNow with a fresh slug of capital, it’s on AgentSync to go out and close the big deals that are presumably in flight. We’ll be watching."}