{"url": "https://techcrunch.com/2023/10/24/new-solar-mini-grids-in-africa-to-be-powered-by-husk-power-systems-103m-series-d/", "title": "New solar mini-grids in Africa to be powered by Husk Power Systems’ $103M Series D", "authors": ["Tage Kene-Okafor", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-10-24T00:00:00", "text": "Husk Power Systems, a clean energy company at the forefront of fueling rural electrification since 2008 and that announced plans to launch 500 solar mini-grids in Nigeria over the next five years, has raised $103 million Series D in equity and debt to meet its objectives.\n\nThe capital injection includes $43 million in equity, which Husk Power describes as the largest-ever raise of its kind in the mini-grid industry — and a $60 million debt financing. New investors STOA Infra & Energy, the US International Development Finance Corporation (DFC) and Proparco, and existing investors Shell Ventures, Swedfund and FMO participated in the equity deal. On the other hand, several finance institutions, including the International Finance Corporation (IFC) and the European Investment Bank (EIB), provided the debt component.\n\nWhat does this mean for Husk Power? In a statement, the 15-year-old cleantech said the investment cements its position as the leader in electrifying communities in rural Sub-Saharan Africa and South Asia with an AI-enabled platform of renewable energy services.\n\nPer the World Bank, mini-grids have the potential to provide half a billion people with clean energy by the end of this decade (including those using overburdened grids) with the right policies in place. They also provide cleaner and cheaper alternatives of energy, which could transform the lives of millions of people living in darkness.\n\nSub-Saharan Africa accounts for 75% of the world’s population without access to renewable energy solutions and electricity. Countries like South Sudan, Burundi, Chad, Malawi, Burkina Faso, Madagascar and Tanzania are among some of the least electrified countries in the world and could benefit from clean energy from solar or wind.\n\nBuoyed by this new capital, Husk Power will look to evaluate expansion into some of these markets over the next couple of years, including the Democratic Republic of Congo (DRC), Zambia and Madagascar; it has so far deployed over 200 mini-grids in Nigeria and India, according to co-founder and CEO Manoj Sinha.\n\nSince its launch in 2008, when it helped pioneer the community mini-grid industry (a category of distributed renewable energy infrastructure that provides first-time access to reliable, affordable, clean and modern power), Husk Power has since evolved its business model, expanding beyond energy access to include the energy transition from fossil fuels to renewables.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAs a result, Husk says it has matured from a pure-play mini-grid operator to an integrated platform that goes beyond just electricity sales to sales and financing of energy-efficient appliances, turnkey commercial and industrial (C&I) rooftop solar and a range of low-carbon and climate-resilient energy services, including e-mobility, agro-processing and cold storage. The company said this approach is progressively becoming more intelligent and automated, powered by AI and IoT.\n\n“We have evolved our technology in multiple aspects. Firstly, our mini-grids are now powered by an artificial intelligence platform. That means we can synthesize demand patterns and data from a historical perspective to predict future demand because our customer patterns are not predictable,” Sinha told TechCrunch.\n\n“We also have a customer-facing app that people use in rural India and Nigeria to make payments online. So that’s a small component, but people are using digital payment, eliminating the need for cash. Most importantly, people can use that app to monitor energy usage, optimize and even reduce energy consumption if and when needed. Last but not least, we also have our e-commerce platform, which sells energy-efficient devices on the app,” added the CEO, who noted that these devices are delivered to customers within 72 hours.\n\nIn 2018, Husk Power raised a $25 million Series C, money it used to grow its fleet from about 12 to 200 solar mini-grids, Sinha mentioned in the interview. He claimed that number makes the cleantech the largest community mini-grid owner and operator globally. India is its largest market, with 188 mini-grids to Nigeria’s 12.\n\nSo far, Husk Power, through those mini-grids, has served over 10,000 micro, small and medium enterprises (MSMEs) and avoided 25,000 tonnes of carbon dioxide, it said in a statement. The statement shows its projections over the next five years: growing its fleet to serve 300,000 new connections while avoiding 350,000 tonnes of carbon dioxide.\n\nHaving achieved a CAGR of 60% and maintained a retention rate of more than 90% over the years, Husk Power will also use this new financing to increase its mini-grid footprint to 1,500 across Africa and India. According to Sinha, two-thirds of the financing will be dedicated to growing its Sub-Saharan Africa footprint to bring the number of mini-grids in the region on par with what has been deployed so far in India. Husk Power expects the mini-grids in Nigeria to reach 500 over the next five years, a 40x growth from its current figure.\n\nThe World Bank says distributed renewable energy, typically mini-grids, is the most cost-effective, fastest path to universal electrification for 380 million people in Africa by 2030. To that end, Husk Power sees itself playing a more significant role in deploying more mini-grids across rural sub-Saharan Africa through “Africa Sunshot,” an initiative the cleantech announced last month to install 2,500 mini-grids (including 1,000 in Nigeria, 500 in the DRC and 250 each in four additional countries still to be identified) within five years. Husk expects to mobilize $500 million in equity and debt to finance the Sunshot, money it intends to raise privately or via an IPO by 2027.\n\n“This Series D paves a path for us to raise the next half a billion dollars in the coming years. Of course, we will have our heads down for the next 18 to 24 months and deploy several 100 mini-grids,” the CEO noted. “And then we will be out in the market to look for either the next round of financing from private capital markets, or we will also strongly consider a path to an IPO to list the company publicly and raise money from public markets.”\n\nIn a market that needs more than 100,000 mini-grids to achieve universal electrification in Africa, despite being ambitious, Husk Power’s projected numbers are a drop in the ocean; accordingly, there’s a need for multiple cleantech players providing mini-grids in different markets across the region. Husk faces competition from other cleantech platforms, including Nuru and CrossBoundary. According to Sinha, Husk differs from others in that it targets small villages while platforms like Nuru are keener on larger towns; similarly, he argues that Husk has the lowest levelized cost of energy (LCOE) globally and uses an AI-powered algorithm to run operations.\n\nWhile each cleantech platform has its competitive edge, they may need to engage multiple governments instead of venturing independently if they want to scale faster, Sinha noted.\n\n“I think it is possible for us to exceed even 2,500 mini-grids over the next five years. But we need to change the scaling strategy that we have had so far to get there. Our [Husk Power] strategy is to get into five or six countries simultaneously. But that cannot happen without public-private partnership arrangements with governments,” he said.\n\n“We can deploy a mini-grid asset for an area in a much less capital-intensive way than what is traditionally used with poles and wires. That’s why the World Bank is deploying its program across multiple countries, currently in DRC, Nigeria and soon in other countries. So these companies must come together to solve the problem of electrifying half a billion people over the next seven years. Is it likely we are going to reach there? I hope so because many companies like us will have to come to the platform to execute at more than 10x scale-up rate to at least move the needle in that direction.”\n\nHusk Power became EBITDA positive in the last quarter of 2022, according to Sinha. The cleantech, which has built a team of 500+ employees, expects to add more than 2,500 employees over the next five years as it expands across Africa and Asia. The company’s growth in various aspects of its business reflects the increasing opportunity in Africa’s cleantech space, which has rekindled the interests of local and global investors over the past 18 months."}