{"url": "https://techcrunch.com/2022/03/07/ugandas-rocket-health-raises-5m-in-round-led-by-creadev-to-scale-telemedicine-across-africa/", "title": "Uganda's Rocket Health raises $5M in round led by Creadev to scale telemedicine across Africa", "authors": ["Annie Njanja", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-03-07T00:00:00", "text": "The world over, the popularity of telemedicine spiked during the COVID pandemic, growing 78 times in April 2020, a few months after the disease struck, according to a McKinsey study.\n\nIn some parts of Africa, it was a great opportunity for telemedicine to make new inroads. But in Uganda, the industry had already taken off, albeit slowly, through Rocket Health, a startup working to transform the delivery of medical care using technology.\n\nLaunched in 2012, Rocket Health offers online medical consultation, collection of samples, and delivery of medicines. They also have a USSD service for those without internet connection. After nearly a decade of operation in Uganda, the startup is now set to scale its integrated digital health solution to more regions across the country and within East Africa over the next two years, following a $5 million Series A funding. In the long term, it will pursue growth opportunities in West Africa.\n\nRocket Health’s co-founder and CEO, Davis Musinguzi, told TechCrunch that the greater plan remains making healthcare easily accessible across Africa, a region with the highest disease burden in the world and the lowest patient-to-doctor ratio.\n\nCurrently, countries across sub-Saharan Africa have 0.23 doctors for every 10,000 people, against the best ratio of 84.2 doctors in the most developed countries, according to the World Health Organization.\n\n“I think tech is what helps us cover that gap, create more efficiencies, and broaden our reach beyond. There’s no way we’re going to build enough hospitals to be able to reach everybody with the health care that they need. I think telemedicine really helps breach the gap of availability,” said Musinguzi.\n\n“A lot of healthcare facilities and professionals are still centralized within the urban areas or the capital cities. So very many people across the country don’t get the benefits of these highly skilled individuals. And I think technology complemented with existing infrastructure is how we can bridge that gap.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe startup’s latest funding round was led by Creadev, an evergreen investment firm backed by Mulliez family, with participation of early-stage African investors Grenfell Holdings and LoftyInc Capital Management. The round brings the total funding raised by Rocket Health to $6.2 million.\n\n“We are delighted to partner with Rocket Health on its mission to make Healthcare accessible to many people in Sub-Saharan Africa,” Creadev Africa said in a statement. “We have been highly impressed by the creativity, tenacity and vibrant culture of the Rocket Health team, who hold an ambitious vision for the future of African primary care. The opportunities are countless, from data analytics to innovative distribution channels.”\n\nOther telehealth startups in the space across Africa include Ghanaian health tech startup mPharma, which revealed plans to set up 100 virtual centers in its markets by the first quarter of the year, and Quro Medical, a South African startup that offers home care complemented by telemedicine service.\n\nRocket Health runs its own lab and pharmacy delivery services, which Musinguzi said helps them remain in control of the delivery of products and services. They charge a $3 consultation fee and $1.5 for drug delivery.\n\nThe company has grown from a few thousand virtual consultations a year to about 400,000, propelled by the demand for remote healthcare during the pandemic.\n\n“COVID has been a great boost to introducing people to telemedicine. Once somebody has had that magical experience with last-mile telemedicine, they almost never go back to queuing up in hospitals waiting to see the doctor. We now do tests like PCR testing in addition to home-based care,” said Musinguzi.\n\nMusinguzi co-founded Rocket Health with John Mark Bwanika (COO), Fiona Nuwamanya (CFO), Hope Achiro (chief pharmacist) and William Lubega (chief medical officer).\n\nIts clientele base ranges from those calling in to have their children vaccinated to patients managing chronic illnesses. Also, 12 insurance companies have signed up, giving it access to a pool of customers within Uganda and across East Africa, since most of them have a regional presence.\n\n“We have different categories of clients; a lot of our clients are in urban areas, and they love the convenience of our services. We have also seen companies start buying subscriptions for casual workers, who don’t qualify for corporate medical covers,” said Musinguzi.\n\nAs Rocket Health expands and embarks on its next phase of growth, they have partnered with Ada, a Berlin-based end-user self-assessment platform, to integrate artificial intelligence into its teleconsultations."}