{"url": "https://techcrunch.com/2025/01/23/after-pivoting-from-crypto-to-payroll-rollfi-gets-acquired/", "title": "After pivoting from crypto to payroll, Rollfi gets acquired", "authors": ["Dominic-Madori Davis", "Ingrid Lunden", "Lauren Forristal", "Kyle Wiggers", "Tim De Chant", ".Post-Authors-List__Authors --Font-Size Var", "Align-Items Center Display Flex Gap Var", ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var", "Border Solid Var --Wp--Custom--Color--White", "Border-Radius"], "publication_date": "2025-01-23T00:00:00", "text": "In Brief\n\nKirubha Perumalsamy co-founded Rollfi during crypto’s heyday in 2021 to help companies process crypto payroll.\n\nWhen crypto crashed, Rollfi pivoted to become an embedded payroll company, partnering with financial services companies to offer payroll and benefits services to their clients.\n\nThe pivot was enough of a success for Rollfi to be acquired for an undisclosed amount by Priority Tech Ventures, a unit of the publicly traded payments and banking tech provider Priority Technology Holdings. Rollfi had raised $3.25 million before its exit. Speaking to TechCrunch, Perumalsamy said that the company was in the middle of a fundraise when the opportunity to sell came about.\n\n“We realized we would be much more successful at winning this market if we can combine the focus, speed, and obsession of a startup with the institutional strength of one of Priority.”\n\nHe said the whole team will remain at PTV after the transaction and will remain an independent entity under Priority.\n\nThis piece was updated to clarify what PTH does and what Rollfi did."}