{"url": "https://techcrunch.com/2021/04/13/deeplite-raises-6m-seed-to-deploy-ml-on-edge-with-fewer-compute-resources/", "title": "Deeplite raises $6M seed to deploy ML on edge with fewer compute resources", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-04-13T00:00:00", "text": "One of the issues with deploying a machine learning application is that it tends to be expensive and highly compute intensive. Deeplite, a startup based in Montreal, wants to change that by providing a way to reduce the overall size of the model, allowing it to run on hardware with far fewer resources.\n\nToday, the company announced a $6 million seed investment. Boston-based venture capital firm PJC led the round, with help from Innospark Ventures, Differential Ventures and Smart Global Holdings. Somel Investments, BDC Capital and Desjardins Capital also participated.\n\nNick Romano, CEO and co-founder at Deeplite, says the company aims to take complex deep neural networks that require a lot of compute power to run, tend to use up a lot of memory and can consume batteries at a rapid pace, and help them run more efficiently with fewer resources.\n\n“Our platform can be used to transform those models into a new form factor to be able to deploy it into constrained hardware at the edge,” Romano explained. Those devices could be as small as a cell phone, a drone or even a Raspberry Pi, meaning that developers could deploy AI in ways that just wouldn’t be possible in most cases right now.\n\nThe company has created a product called Neutrino that lets you specify how you want to deploy your model and how much you can compress it to reduce the overall size and the resources required to run it in production. The idea is to run a machine learning application on an extremely small footprint.\n\nDavis Sawyer, chief product officer and co-founder, says that the company’s solution comes into play after the model has been built, trained and is ready for production. Users supply the model and the data set and then they can decide how to build a smaller model. That could involve reducing the accuracy a bit if there is a tolerance for that, but chiefly it involves selecting a level of compression — how much smaller you can make the model.\n\n“Compression reduces the size of the model so that you can deploy it on a much cheaper processor. We’re talking in some cases going from 200 megabytes down to on 11 megabytes or from 50 megabytes to 100 kilobytes,” Davis explained.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nRob May, who is leading the investment for PJC, says that he was impressed with the team and the technology the startup is trying to build.\n\n“Deploying AI, particularly deep learning, on resource-constrained devices, is a broad challenge in the industry with scarce AI talent and know-how available. Deeplite’s automated software solution will create significant economic benefit as Edge AI continues to grow as a major computing paradigm,” May said in a statement.\n\nThe idea for the company has roots in the TandemLaunch incubator in Montreal. It launched officially as a company in mid-2019 and today has 15 employees, with plans to double that by the end of this year. As it builds the company, Romano says the founders are focused on building a diverse and inclusive organization.\n\n“We’ve got a strategy that’s going to find us the right people, but do it in a way that is absolutely diverse and inclusive. That’s all part of the DNA of the organization,” he said.\n\nWhen it’s possible to return to work, the plan is to have offices in Montreal and Toronto that act as hubs for employees, but there won’t be any requirement to come into the office.\n\n“We’ve already discussed that the general approach is going to be that people can come and go as they please, and we don’t think we will need as large an office footprint as we may have had in the past. People will have the option to work remotely and virtually as they see fit,” Romano said."}