{"url": "https://techcrunch.com/2022/07/21/zededa-lands-a-cash-infusion-to-expand-its-edge-device-management-software/", "title": "Zededa lands cash infusion to fund its edge device management software", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-07-21T00:00:00", "text": "Factors like latency, bandwidth, security and privacy are driving the adoption of edge computing, which aims to process data closer to where it’s being generated. Consider a temperature sensor in a shipyard or a fleet of cameras in a fulfillment center. Normally, the data from them might have to be relayed to a server for analysis. But with an edge computing setup, the data can be processed on-site, eliminating cloud computing costs and enabling processing at greater speeds and volumes (in theory).\n\nTechnical challenges can stand in the way of successful edge computing deployments, however. That’s according to Said Ouissal, the CEO of Zededa, which provides distributed edge orchestration and virtualization software. Ouissal has a product to sell — Zededa works with customers to help manage edge devices — but he points to Zededa’s growth to support his claim. The number of edge devices under the company’s management grew 4x in the past year while Zededa’s revenue grew 7x, Ouissal says.\n\nZededa’s success in securing cash during a downturn, too, suggests that the edge computing market is robust. The company raised $26 million in Series B funding, Zededa today announced, contributed by a range of investors including Coast Range Capital, Lux Capital, Energize Ventures, Almaz Capital, Porsche Ventures, Chevron Technology Ventures, Juniper Networks, Rockwell Automation, Samsung Next and EDF North America Ventures.\n\n“There were two main trends that led to Zededa’s founding,” Ouissal told TechCrunch in an email interview. “First, as more devices, people and locations were increasingly being connected, unprecedented amounts of data were being generated … Secondly, the sheer scale and diversity of what was happening at the edge would be impossible for organizations to manage in a per-use case fashion. The only successful way to manage this type of environment was for organizations to have visibility across all the hardware, applications, clouds and networks distributed across their edge environments, just like they have in the data center or cloud.”\n\nOuissal co-founded Zededa in 2016 alongside Erik Nordmark, Roman Shaposhnik and Vijay Tapaskar. Previously, Ouissal was the VP of strategy and customer management at Ericsson and a product manager at Juniper Networks. Nordmark was a distinguished engineer at Cisco, while Shaposhnik — also an engineer by training — spent years developing cloud architectures at Sun Microsystems, Huawei, Yahoo and Cloudera.\n\nZededa’s software-as-a-service product, with works with devices from brands like SuperMicro, monitors edge installations to ensure they’re working as intended. It also guides users through the deployment steps, leveraging open source projects designed for Internet of Things orchestration and cyber defense. Zededa’s tech stack, for example, builds on the Linux Foundation’s EVE-OS, an open Linux-based operating system for distributed edge computing.\n\nZededa aims to support most white-labeled devices offered by major OEMs; its vendor-agnostic software can be deployed on any bare-metal hardware or within a virtual machine to provide orchestration services and run apps. According to Ouissal, use cases range from monitoring sensors and security cameras to regularly upgrading the software in cell towers.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“The C-suite understands that digital transformation is critical to their organization’s success, particularly for organizations with distributed operations, and digital transformation cannot happen without edge computing. The ability to collect, analyze and act upon data at the distributed edge makes it possible for businesses to increase their competitive advantage, reduce costs, improve operational efficiency, open up new revenue streams and operate within safer and more secure environments,” Ouissal said. “As a result of this, edge computing projects are accelerating within organizations.”\n\nSome research bears this out. According to a June 2021 Eclipse Foundation poll, 54% of organizations surveyed were either using or planning to use edge computing technologies within the next 12 months. A recent IDC report, meanwhile, forecasts double-digit growth in investments in edge computing over the next few years.\n\nZededa’s customers are primarily in the IT infrastructure, industrial automation and oil and gas industries. Ouissal wouldn’t say how many the company has currently but asserted that Zededa remains sufficiently differentiated from rivals in the edge device orchestration space.\n\n“In terms of the ‘IT down’ trajectory, we are complementary to data solutions from the likes of VMware, SUSE, Nutanix, Red Hat and Sunlight, but these solutions are not suitable for deployments outside of secure data centers. From the ‘OT up’ standpoint, adjacent competitors include the likes of Balena, Portainer and Canonical’s Ubuntu Core. However, these solutions are more suitable for ‘greenfield’ use cases that only require containers and lack the security required for true enterprise and industrial deployments,” Ouissal argued. “Despite the economic downturn, the strategic and transformative potential of edge computing to create new business opportunities is leading investors across verticals to increase their commitment, at a time when they may be more reluctant to invest in other avenues.”\n\nIn any case, Zededa, which has a roughly 100-person team spread across the U.S., Germany and India, is actively hiring and plans to expand its R&D, sales and marketing teams within the year, Ouissal said. To date, the eight-year-old startup has raised a total of $55.4 million in venture capital.\n\n“[We aim to increase] the use cases and integrations that we support. Within our product, we will continue to focus on innovation to improve ease of use and security. As the edge computing market evolves and matures,” Ouissal said. “We are also focused on enabling applications including updating legacy applications and bringing new solutions to the market that simplify technologies like AI and machine learning.”"}