{"url": "https://techcrunch.com/2024/11/19/microsoft-and-atom-computing-will-launch-a-commercial-quantum-computer-in-2025/", "title": "Microsoft and Atom Computing will launch a commercial quantum computer in 2025", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Julie Bort", "Maxwell Zeff", "Sarah Perez", "Marina Temkin", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size"], "publication_date": "2024-11-19T00:00:00", "text": "Quantum computing is getting there. After years of slow but steady development to create a useful quantum computer that can outperform classical machines, we’re still squarely in the “noisy intermediate-scale quantum era.” However, many of the pieces needed for building more advanced — and stable — machines are starting to fall into place now.\n\nAt the Microsoft Ignite 2024 conference on Tuesday, Microsoft and Atom Computing announced yet another breakthrough on the way to a fault-tolerant quantum computing: The two companies entangled 24 logical qubits using neutral atoms held in place by lasers. The two companies say that this is the highest number of entangled logical qubits on record. (It takes a number of physical qubits to create the logical qubit that can then be used to run quantum algorithms.)\n\nWhat’s maybe just as important is that the system was able to detect when one of the neutral atoms that make up a physical qubit disappeared (they have the pesky tendency to do so) and repeatedly correct for that.\n\nThe two companies plan to deliver quantum computers based on this technology to commercial customers next year. Those machines will feature over 1,000 physical qubits.\n\nImage Credits:Atom Computing\n\nUsing this system, Microsoft and Atom Computing created 20 logical qubits made from 80 physical qubits and successfully ran the Bernstein-Vazirani algorithm on it. This is a classic quantum algorithm designed in the 1990s that is, at its core, a demonstration of the powers of superposition (the qubit’s ability to be both 0 and 1 simultaneously) and interference, which applies transformations that cause different parts of the superposition to interfere with each other in useful ways. The challenge here is to find a secret code that is a sequence of 0s and 1s). While the classical computer would have to try every possible combination, the quantum computer can do so with just one query because it can test all of the combinations at once.\n\n“We’ve run that algorithm in this hardware out to 20 logical qubits in that computation and shown that we can get better than physical performance there. You also get better than classical, it turns out, for this algorithm,” said Krysta Svore, the technical fellow and vice president of advanced quantum development for Microsoft Azure Quantum. “So we’ve shown the ability to compute with these logical qubits, and then we’ve also been able to do repeated loss correction with these qubits.”\n\nSvore noted how the Azure Quantum Compute platform provides a qubit virtualization system that allows the teams to design quantum error correction that is optimized for a specific quantum processor. This is also what drove Microsoft’s recent advances with Quantinuum, which achieved 12 logical qubits. It’s this virtualization system, combined with the steady advances in Atom Computing’s work with neutral atoms, that has, in part, allowed for these recent advances, Svore said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nOne factor that makes working with neutral atoms harder, though, is that these atoms sometimes simply disappear. That’s on top of the regular noise issue that all quantum computers have to deal with. Realizing that one of the atoms has gone missing is its own challenge. Right after loading the system with atoms, it’s possible to take an image and check if all the atoms are in place. Then, as the system operates, it’s possible to detect the luminescence to check if an atom is in the right spot.\n\n“When an atom is lost, we want to know it happened, and then we also want to be able to correct for that loss,” Svore said. “We want to be able to overcome that loss without halting the computation. It’s a key element of what we bring to the qubit virtualization system. We have designed the virtualization system to account for this loss mechanism that appears in this type of hardware so we can combat that loss in our qubit virtualization system by finding and then correcting for that loss.”\n\nThis, she said, is the first time this loss correction has been demonstrated.\n\nLooking ahead, the two companies plan to support upward of 1,000 physical qubits in the machine they’ll offer commercially next year (the current system actually supports up to 256 already). There’s some flexibility in how many logical qubits that means.\n\n“We are excited to continue our collaboration with Microsoft, which has already led to significant milestones in quantum computing,” said Ben Bloom, founder and CEO of Atom Computing. “By coupling our state-of-the-art neutral-atom qubits with Microsoft’s qubit-virtualization system, we are now able to offer reliable logical qubits on a commercial quantum machine. This system will enable rapid progress in multiple fields, including chemistry and materials science.”"}