{"url": "https://techcrunch.com/2024/01/11/amazons-just-walk-out-tech-now-works-with-employee-badges/", "title": "Amazon’s ‘Just Walk Out’ tech now works with employee badges", "authors": ["Sarah Perez", "Consumer News Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-01-11T00:00:00", "text": "Amazon’s computer vision and sensor-powered Just Walk Out retail technology, which allows customers to shop at stores and then skip the cashier line when it’s time to check out, is now expanding to corporate domains with support for employee badges as the payment mechanism. The retail giant announced today the launch of “badge pay,” a new option that will initially bring Just Walk Out technology to a hospital setting.\n\nWith the launch, doctors, nurses and other healthcare staff will be able to grab food and beverages from their hospital’s Just Walk Out store by scanning their employee badges. The badge is linked to the employee’s payroll deduct account, allowing them to pay for food and drinks around the clock, even after the hospital’s cafeteria is closed. The employees will also be able to look up their receipts and see their account balance in their hospital’s badge pay web portal or mobile app, Amazon explains.\n\nThe system is first being introduced at St. Joseph’s/Candler at its Candler Hospital Campus in Savannah, Georgia. At this location, Amazon worked with healthcare automation provider CBORD on the implementation of the tech at the hospital store. In addition to healthcare staff, visitors to the hospital can also shop at the store using their debit or credit cards or mobile wallets, and then access their receipts via justwalkout.com/receipts. The Candler Hospital’s store, meanwhile, is operated by food and nutrition provider Morrison Healthcare, which serves over 950 hospitals and healthcare systems.\n\nA hospital exec said the introduction of the test was a test to determine if it would make sense to roll out the solution to other locations.\n\n“Amazon’s Just Walk Out technology supports our smart medicine strategy by providing high tech solutions to our patients, visitors and co-workers, even with food service,” said Paul P. Hinchey, president and CEO of St. Joseph’s/Candler, in a statement about the launch. “With this technology, Candler Hospital co-workers needing a quick snack or a meal during the third shift, as well as visitors taking care of friends or family members, have a convenient way to purchase the meals, snacks, and drinks they need so they can quickly get back to their loved ones. Once we evaluate its impact post-launch, we will determine how this technology might be utilized on our other campuses,” he added.\n\nThe addition of badge pay follows other new features that have been added to Just Walk Out in recent months, including support for RFID tags, and support for other types of store formats, like concession stands and university stores, where students can pay using their meal plan accounts. Amazon also introduced Just Walk Out Analytics, which offers aggregated and anonymized analytics for retailers that have implemented the system at their own stores."}