{"url": "https://techcrunch.com/2023/05/12/psychedelics-startups-investor-survey-trends/", "title": "11 investors predict a colorful, if difficult, future for psychedelic startups", "authors": ["Anna Heim", "Freelance Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-05-12T00:00:00", "text": "How far has the psychedelics medicines industry come over the past 12 months? Well, it depends on where you look.\n\nIf you look at the stock market, the view isn’t very good: The charts are all down and in the red, and all you can see are psychedelics companies tottering by, doing their best to impress cynical investors.\n\nSimilar to most other sectors today, that crumbling of confidence in the sector has trickled down to the private markets as well, slowing down venture deal-making and further shrinking deal sizes in an already parched venture market.\n\nBut if you focus and leave your preconceptions behind, you’ll find that beyond the skein of valuations and share prices, there is a world of spirited deal-making, ripe with impetus for building a sustainable industry. A recent survey by TechCrunch+ indicates that investors and founders are, instead of simply looking for attractive opportunities, increasingly putting their minds to building the foundations for an industry that can employ the power of psychedelics to change lives.\n\nFor Bek Muslimov and Nikolay Tretiyakov, co-founding partners at Leafy Tunnel, the problems currently being tackled by the industry are proof of the nascent sector’s progress. “The questions our industry is grappling with are becoming more refined and nuanced, reflecting the necessary maturation. Amongst these questions are actual costs of therapies, reimbursement coverage, the commercialization strategy for psychedelic drug development companies, resource bottlenecks with the therapists’ supply and infrastructure, etc,” they told TechCrunch+.\n\nWe’re widening our lens, looking for more investors to participate in TechCrunch surveys, where we poll top professionals about challenges in their industry.\n\nIf you’re an investor and would like to participate in future surveys, fill out this form.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nRegulation is moving forward, too, albeit slowly, with only Oregon and Colorado taking steps to partially decriminalize psychedelics. But even as the industry looks to those states to serve as test beds for everything from drug development to integration into the healthcare infrastructure, several investors pointed out that the U.S. is not the only place where psychedelics are seeing interest.\n\n“Decriminalization is not the same as legalization at the Federal level. I believe we will continue to see international locations as primary test beds as the larger question of legalization in the U.S. is discussed,” said Amy Kruse, chief investment officer, Satori Neuro. “The developments in Australia this year are extremely interesting and worth watching closely. As Australia is often a site for clinical trials research in the psychedelic medicine ecosystem, it will be worth watching to see how this develops. Will they take the lead?”\n\nLike several investors we surveyed, Kruse doesn’t solely invest in psychedelics, but they are very much on her radar. The firm she’s part of, Satori Neuro, is a new venture that aims to invest in solutions to address mental health challenges, including psychedelic medicine.\n\nBut she and her ilk are among the few investors willing to enter the space, as the majority of investors, especially institutions, still labor under misapprehensions about psychedelics or aren’t interested in risking their money or reputation.\n\n“For most institutional investors, psychedelics continue to be a ‘no can do’ sector to invest in,” said Sa’ad Shah, managing partner at Noetic Fund. “While we can certainly argue for the major strides made and progress on the regulatory front, institutions still need to see it to believe it. Secondly, this sector is still too small. It does not warrant the kind of capital that most institutional investors typically put to work.”\n\nWhen this could change likely depends on how regulation is framed and how the healthcare industry responds to advances in the space. But that’s not to say the path to commercialization and wider adoption is closed to psychedelic startups and investors at the moment.\n\nTim Schlidt, co-founder and partner at Palo Santo, explained it succinctly: “Rather than seeking to change how our healthcare system operates, we believe this early generation of psychedelics must transform and adapt to fit within existing infrastructure. Rather than trying to storm the ramparts, we believe a Trojan horse approach is the only means by which these therapies can achieve wide-scale adoption.”\n\nRead on to learn about where these investors are placing their bets, how they decide which companies to back, what are the prospects for M&A in the space, how to best approach them and more.\n\nWe spoke with:\n\nSa’ad Shah, managing partner, Noetic Fund\n\nHow has the trajectory of listed psychedelics companies affected private firms and startups?\n\nListed psychedelics companies were highly overvalued in 2021, and the correction in the markets has brought valuations for private companies back to more standard early-stage levels.\n\nInvestors are more prudent with capital today, allowing capable founders and teams working on a great product with a good business plan to shine through rather than being drowned out by the noise.\n\nThe adjustment of expectations from investors also allows private companies to grow organically and make decisions with good counsel.\n\nAt the same time, generalist investors burned by investing in bad apples could now have developed an adverse view to investments in the space, costing good companies backed by deep tech venture firms access to additional pools of capital. The inability to raise more capital in this environment has caused many good companies to shelve or halt promising programs and prioritize survival over rapid growth.\n\nOther than disagreements over prices, which factors have impeded M&A activity in the psychedelic space in the last 12 months?\n\nThere are three main factors impeding M&A activity:\n\nIsolating the magnitude of efficacy: While there are clear signs of efficacy in clinical trials, the magnitude of the effect being assignable to psychedelics alone is still a work in progress. Big Pharma awaits more data on this front before an M&A move. In the meantime, pharma and big biotech VC firms are more interested in exploring the non-hallucinogenic psychedelic pathways. Intellectual property uncertainty: Due to the 18-month window of uncertainty in filing patents and being granted one, there is some hesitation with acquisitions. Maintaining cash balances: In this environment, biotechs are focusing on prioritizing and rationing their cash for their lead programs and are being more deliberate than before when making big moves.\n\nDrug development is very costly, and startups are having a harder time raising cash. Does this make psychedelics startups that aren’t developing any drugs more attractive to investors than those involved in drug development?\n\nBusiness models that can generate revenues with low burn rates have always been more attractive to the traditional investor than non-revenue generating businesses like drug development. However, there are investors who still understand the unique risk-reward profile in each case, and hence, founders need to be able to approach the right investor.\n\nThere are drug development companies that continue to raise capital at higher valuations due to the continued validation of efficacy and the “optionality” that exists in their program — i.e., they are pursuing several promising leads/molecular pathways. What is riskier, especially at this point in time, are pure drug discovery companies that don’t have any leads to take into trials anytime soon.\n\nWhether developing a drug or not, a company would be attractive to investors if and only if it is addressing a key problem in the market that cannot already be solved by incumbents efficiently. Several non-drug development companies touting to be “specific to the psychedelic industry” would only be successful in the long term if they have a unique and differentiating value proposition, can develop a sustained economic moat, have a proven track record of raising capital and have the right team to execute.\n\nHow has your approach to the psychedelics sector changed since our previous psychedelics survey a year ago?\n\nOur view of the markets from a year ago has only been validated by what has transpired in the psychedelics market.\n\nOur overall focus is and has always been on the central nervous system (CNS), and we are agnostic as to the modality, be it psychedelic drug development, other pharmacological approaches, medtech devices or digital therapeutics.\n\nWhen it comes to the psychedelics sector in particular, we feel this industry has clearly matured from being a toddler in its terrible twos to an adolescent, but there is still a long way to go. We continue to focus on the non-hallucinogenic approach to psychedelics, as it has the most promising prospects of being commercialized with much less scrutiny while adhering to current standards of care.\n\nWe were not surprised by the closure of several ketamine clinics, as we stated last year that given the industry’s life cycle, we are too early for “downstream” opportunities to have a viable chance of succeeding.\n\nWhat we weren’t expecting was the level of headwinds the markets are facing overall, which is affecting money-good companies from raising additional capital to shepherd their plans through. This is very much a Darwinian model being played out. The strong and most adaptable are the ones that will survive.\n\nWe have to accept that the failure rates for a startup in a new industry such as ours will be high, especially in light of the macro backdrop. As such, our approach is to have a high-conviction portfolio and lean on/back the companies that have the ability to execute well in any given environment.\n\nWe also feel that the simple “pick a molecule and an indication” strategy that was easily funded in 2020/2021 will go extinct, as it is not a viable business model. To survive, you must show safety and efficacy, protect your IP, be differentiated and have a team that can execute on the science and business in order to commercialize and scale.\n\nColorado and Oregon voted to partially decriminalize psychedelics, but there are caveats. Should these U.S. states be considered test beds for what might happen in this space globally? Why or why not?\n\nIf we want to talk about test beds, we should first and foremost look at Australia, which has been the first out of the gate to legalize MDMA and psilocybin for therapeutic use under proper protocol and compliance.\n\nIn jurisdictions where psychedelics are being decriminalized, it is likely that psychedelic-naïve individuals would access psychedelics outside of the medical system. To reduce any unforeseen risks in these cases, it is imperative that effective pre-screening protocols and post-session psychotherapy and support be implemented to ensure people have safe and effective access.\n\nAdditionally, a reliable source of information to educate individuals would be required. It is therefore our goal to focus on the regulated paths (e.g., FDA, EMA, Health Canada) to usher in psychedelic-assisted psychotherapy to patients in a safe, efficacious and accessible manner.\n\nIt is imperative that the decriminalization process ensures that the right safety checks are in place. This requires proper education about psychedelics and safe protocols to follow.\n\nWhat are the broader consequences of the collapse of the Synthesis Institute?\n\nThe Synthesis situation highlights that this is not an easy industry to navigate. You need more than access to capital, interest and passion for psychedelic-assisted therapy to start a venture and run a company.\n\nThere are many well-intentioned and good-hearted people trying to bring about much-needed change, but once you take on the role of a fiduciary — managing other people’s capital — you have an immense responsibility on your shoulders.\n\nUnfortunately, this industry is ripe with many inexperienced founders who are first-time operators in an industry that requires a very deep understanding of a very complicated subject matter. The critical turning point that caused the tide to move out were the macro headwinds and lack of liquidity. But many of these firms were already facing challenges at the best of times.\n\nWe also feel this is another example of how the industry is sobering up. It’s about timing. As an industry, we are still in the early stages of the life cycle. We are still trying to prove that psychedelic-assisted therapy can be commercialized and scaled. We know it works, but how do you scale it up in a structured, disciplined and regimented way that adheres to current standards of care and complies with the necessary regulatory approvals?\n\nWe do believe that there is a dire shortage of therapists to deploy psychedelic-assisted psychotherapy at scale post FDA approval and hope that this doesn’t discourage efforts for structured training of therapists.\n\nAre institutional investors still as reluctant to become LPs for funds that invest in psychedelics as they were before the pandemic and the related mental health crisis?\n\nFor most institutional investors, psychedelics continue to be a “no can do” sector. The key reason is regulations and their perceived uncertainty around that. While we can certainly argue for the major strides made and progress on the regulatory front, institutions still need to see it to believe it.\n\nSecondly, for many institutional investors, this sector is still too small. It does not warrant the kind of capital that most institutional investors typically put to work. Keep in mind that when you are managing multibillion-dollar plans, an allocation of less than $25 million (while ensuring that it’s not greater than 5% to 10% of the overall allocation) is not worth their while. Small allocations do not move the needle for them.\n\nHowever, there are smaller institutional investors, including endowments and foundations, and some large sophisticated family offices, that have clearly taken an interest in the sector. As a VC industry, we still have a ways to go before we can start to attract the bigger players. Getting past FDA approval for MDMA and psilocybin will be a watershed moment for that reason.\n\nPlant-based psychedelics seem to stand a better chance of getting decriminalized in the short term than synthetic drugs. How are you capitalizing on this in your investment choices?\n\nOur investments are not dictated by the decriminalization of plant-based psychedelics. We have always focused on the biology and clinical potential of underlying mechanisms that plant-based psychedelics have helped uncover. Our investment choices continue to be aimed at bringing this clinical potential in a safe, efficacious and accessible manner through regulated pathways.\n\nDo you see patents as a hindrance or an accelerator for the wider adoption of psychedelics? How much weight does IP carry when you’re considering an investment?\n\nHaving good foundational intellectual property and a strategy to build upon it is a crucial factor in our investment decisions.\n\nPatents can be a hindrance when used by bad actors operating with the intention to block development of other therapies by competitors. However, having patents ensures stakeholders critical for scaling of psychedelic-assisted psychotherapy are at the table and the companies developing these therapies are able to raise enough capital to bring their therapies through trials and to the market.\n\nIf and when you invest in therapeutics-oriented solutions, how important is their ability to integrate with the current health and insurance system?\n\nQuite high. We acknowledge the current health and insurance systems are not without flaws. However, for the majority of the population suffering from mental health challenges, the current system offers the best chance of accessing these therapies affordably.\n\nThe current health and insurance systems are cognizant of the unique challenges faced in treating and preventing mental health challenges at the population level and are hence more willing than ever to be open to adaptations that may be a requisite to deployment of psychedelic-assisted psychotherapy.\n\nAre you seeing anything interesting happening at the intersection of AI and psychedelics?\n\nThere are huge opportunities at the intersection of AI and psychedelics, and we are deeply immersed in it. As an aside, it is uncanny that the term “hallucinations” plays a critical role in both industries.\n\nThere is no doubt that machine learning algorithms are making it possible to analyze biological and behavioral markers to generate actionable insights, such as stratification of patient groups, personalizing treatment protocols and monitoring the results of the intervention with greater accuracy.\n\nThere is also great potential for generative pre-trained transformers (GPTs) and large language-based models to help solve the problem of personalizing talk therapy at the individual level and making it affordable. There are key challenges around the quality of the responses, insights generated, ethical implications and risk management plans that would need to be solved before they are ready for deployment.\n\nWe have actively invested in and continue to explore AI-related opportunities that may play an accretive role in solving some of the distinct plumbing issues that psychedelics-assisted therapy and education platforms are currently facing. We feel that AI will ultimately solve the psychedelics-assisted therapy scalability problem — and that too in the short term.\n\nMany startup employees have been laid off recently. Which profiles might be a good fit for psychedelics companies in your portfolio?\n\nProfiles that have an established track record of scaling and growing startups to enter clinical trials or markets for establishing partnerships and commercialization would be of particular interest. Our portfolio includes companies working across modalities: devices, digital, drug development, etc.\n\nAlso, profiles that have experience navigating various types of financings during periods of capital market dislocations and have had prior success in raising significant capital for startups.\n\nAre you open to cold pitches? How can founders reach you?\n\nYes. We are open to dialogue with companies developing digital technologies, medical devices and molecular therapies as well as those focused on the areas of neuropsychiatry, neurodegenerative diseases, pain and addiction.\n\nYou can reach me at saad.shah@noeticfund.com.\n\nVine Ventures: Ryan Zurrer, Ozan Polat and Daniel Tarockoff\n\nHow has the trajectory of listed psychedelics companies affected private firms and startups?\n\nThe market downturn has dramatically reduced public valuations in the broader biotech market, which has been slow to recover. Many public psychedelics companies are now trading below cash.\n\nThis bleeds into private markets by making it much more difficult for early-stage startups to raise rounds without a clear path to liquidity. The graduation rates from pre-seed to seed, seed to Series A and onward are dropping, requiring companies to extend their runways and do more with less.\n\nOther than disagreements over prices, which factors have impeded M&A activity in the psychedelics space in the last 12 months?\n\nThere are not that many companies in the psychedelics space with enough abundant cash to support a significant amount of M&A activity. The few that do have been conserving cash to extend their runways amidst uncertainty around how long the current downturn will last.\n\nDrug development is very costly, and startups are having a harder time raising cash. Does this make psychedelics startups that aren’t developing any drugs more attractive to investors than those involved in drug development?\n\nThere is less funding available to startups overall, but that doesn’t mean that startups in more costly parts of the psychedelic ecosystem (e.g., drug development) will lose out to those in less costly parts. The only companies that will receive funding in this environment are those with the strongest teams building real value, regardless of where they’re building on the value chain.\n\nThat said, it’s more important than ever for startups to hit the necessary milestones to raise their next rounds one or two years later. That may be more achievable for companies involved in areas outside of drug development.\n\nHow has your approach to the psychedelics sector changed since our previous psychedelics survey a year ago?\n\nWe are back to a much slower, more rational market that is difficult to fundraise in but better for building a healthy industry. Our focus has shifted toward opportunities that will throw off cash in the short term as well as organizations that will be vital to the growth of the overall field.\n\nA prime example of this is MAPS, which is nearing FDA approval for MDMA-assisted therapy to treat PTSD. MAPS’ approval will be a major tailwind for the entire industry, and it is one of the only psychedelics companies that will generate meaningful revenue in the next two years.\n\nColorado and Oregon voted to partially decriminalize psychedelics, but there are caveats. Should these U.S. states be considered test beds for what might happen in this space globally? Why or why not?\n\nWhen we first launched Vine, we predicted that Canada, California, Colorado and Oregon (what we call the “CACAO markets”) would lead the liberalization of psychedelics, and that’s exactly what we’re seeing play out. These states are definitely test beds for everything from drafting regulations, collecting real-world data, defining privacy protocols, training therapists, developing psychedelic care models and much more.\n\nThat said, it’s way too early to make a call on whether the way these states run things is how psychedelic care will roll out globally: That’s why they’re test beds. These markets will inevitably get a lot wrong, and in fact, we’re already seeing the mounting challenges the Oregon market is facing in getting started.\n\nWhat are the broader consequences of the collapse of the Synthesis Institute?\n\nThe collapse of Synthesis is going to put even more pressure on the already struggling roll-out of the adult regulated-use market in Oregon. More than that, it should be a wake-up call that we need more thoughtful leaders who can competently execute.\n\nThe rollout of psychedelics is not dependent on a single organization, but on the entire ecosystem setting high standards for how psychedelic care is delivered, especially outside of the traditional medical system.\n\nAre institutional investors still as reluctant to become LPs for funds that invest in psychedelics as they were before the pandemic and the related mental health crisis?\n\nSome institutional investors are warming up to backing funds that invest in psychedelics, but LPs largely remain limited to family offices and high-net-worth individuals with less stricter mandates to avoid vices.\n\nIt’s beginning to change and institutional investors are much more open than they were prior to the pandemic, but we expect it’ll be a couple years before you see significant backing from more traditional capital.\n\nPlant-based psychedelics seem to stand a better chance of being decriminalized in the short term than synthetic drugs. How are you capitalizing on this in your investment choices?\n\nFrom the beginning, we have held the belief that a significant portion of the demand profile for psychedelics will come from naturals. This has played out in the way many state regulations are unfolding, notably with Oregon banning the use of synthetics altogether.\n\nWe have backed and continue to look for innovative approaches to natural cultivation and are open to businesses that consider a broader approach to how consumers will access psychedelics outside of the traditional healthcare system.\n\nDo you see patents as a hindrance or an accelerator for the wider adoption of psychedelics? How much weight does IP carry when you’re considering an investment?\n\nThere are examples that can be drawn from within the space where patents have been more of a hindrance and others where they’ve been more of an accelerator — it’s case-specific.\n\nOverall, patents are an accelerator for wider adoption of psychedelics within the traditional medical system, though they’re entirely unnecessary when you look at broader adoption outside of FDA-approved medicines (e.g., decriminalization and state legalization efforts).\n\nWhen considering an investment in drug development companies, the IP strategy is a key component of our diligence, but this doesn’t always require patents. MAPS, for example, has an IP strategy centered around data exclusivity rather than patents.\n\nIf and when you invest in therapeutics-oriented solutions, how important is their ability to integrate with the current health and insurance system?\n\nIt’s very important that the therapeutics we invest in can be integrated within the current health and insurance system. It’s not the only route by which people should or will be able to access psychedelics, but without that integration, the ability to scale to a substantial number of patients will be much more limited and take a much longer time, not to mention it will be much more expensive without insurance coverage.\n\nAre you seeing anything interesting happening at the intersection of AI and psychedelics?\n\nAI will impact every industry on the planet, but this doesn’t mean there are going to be AI companies built specifically around psychedelics. We have seen some, but it’s mostly noise trying to capitalize off the hype.\n\nAI will increasingly play a role in improving drug discovery and development more broadly, which has exciting implications for all of biotech. With the collection of more real-world data as regulations open up larger markets for psychedelics, there is some potential to apply AI in interesting ways. But frankly this isn’t something that’s top-of-mind for us at this point.\n\nMany startup employees have been laid off recently. Which profiles might be a good fit for psychedelics companies in your portfolio?\n\nCompanies are in a period of minimizing their burn to extend runway. It’s still not clear how long the fundraising markets will remain challenging, and as a result, there are fewer opportunities in the short term.\n\nDepending on the type of psychedelic company, there is still a need for a variety of profiles. We’ve seen recent job postings looking for people with experience managing clinical trials to people with wide-ranging business skills and experience working within pharma or biotech.\n\nAre you open to cold pitches? How can founders reach you?\n\nYes, founders can reach out on our website, or send an email directly to Vine partner Daniel Tarockoff.\n\nTim Schlidt, co-founder and partner, Palo Santo\n\nHow has the trajectory of listed psychedelics companies affected private firms and startups?\n\nWhile there tends to be a lag between the public and private markets, we are finally beginning to see what’s happening in the public markets take hold in the private market.\n\nThis has impacted the private market in two respects: Firstly, it brings down the median of the comparables used to value private firms, and secondly, it limits the upside scenario many VCs need to see to underwrite a target return.\n\nWhen Atai or Compass Pathways were worth $2 billion to $3 billion, there was a perceivable path to 10x+ returns on other investments. Now, with market caps floating in the $300 million to $400 million range, and implied enterprise values near zero, it is much more difficult to see a path to meaningful uplift in other psychedelic investments. That compresses earlier-stage valuations.\n\nOther than disagreements over prices, which factors have impeded M&A activity in the psychedelics space in the last 12 months?\n\nAmongst psychedelics companies, the barriers to M&A are largely driven by a lack of funding, which limits the cash required to acquire assets. Some companies could potentially merge via stock deals, but sadly, there is not much of a synergistic effect to merging multiple biotech assets. The clinical costs are relatively fixed so there is minimal benefit to scale. On a combined basis, they will still have to raise the same amount of capital the two individual entities would need to raise anyway.\n\nAs it relates to M&A in the pharma universe, the main rate-limiting factor is the perception that many first-generation psychedelic therapies are not scalable. Many large pharmaceutical players do not see the first-in-class emerging therapies as commercially tractable or consider them able to plug in seamlessly into our healthcare infrastructure. That limits their commercial potential.\n\nThere is some attention on subperceptual psychedelics, though many business development units consider them riskier with limited translational models, and therefore want to see efficacy proved in the clinic before they step in.\n\nDrug development is very costly, and startups are having a harder time raising cash. Does this make psychedelics startups that aren’t developing any drugs more attractive to investors than those involved in drug development?\n\nWe could see a shift toward some technology and infrastructure-related plays that will support building infrastructure around the psychedelic ecosystem.\n\nThat said, many of these businesses still take on upstream risk, as they are beholden to the biotech opportunities receiving funding and rolling out therapies. Ultimately, the first step required is the development and approval of drugs, which will take years to get through clinical trials.\n\nTherefore, many tech-related plays may be premature in launching now before there is further clarity on the drug development side.\n\nHow has your approach to the psychedelics sector changed since our previous psychedelics survey a year ago?\n\nOur approach has not changed markedly since last year’s survey. We still see the future of this sector heading toward development of novel drugs with enhanced commercial tractability. Without this development, the sector will be unable to attract meaningful investment from larger biotech VCs, which will be required to steward these therapies through late-stage, capital-intensive clinical trials.\n\nIf there is one perspective that has shifted, it is the importance of the team. At times, it is easy to get lured by blind faith that good tech will persevere, irrespective of team quality, acumen or willingness to heed advice from investors.\n\nDrug development is a grueling process, and sound clinical strategy, especially in central nervous system disorders, is of utmost importance. The bar we require for team quality has therefore risen much higher.\n\nColorado and Oregon voted to partially decriminalize psychedelics, but there are caveats. Should these U.S. states be considered test beds for what might happen in this space globally? Why or why not?\n\nI would not consider Colorado or Oregon to be bellwethers of a global shift, though they may have some bearing on policies within more U.S. states.\n\nWhile these states voted for outright legalization (with stipulations), there are many U.S. cities that have voted for decriminalization. We believe decriminalization movements will likely continue to take hold, as the war on drugs has largely been deemed to be a failure. Cities and states will therefore deescalate the importance of law enforcement’s prosecuting drug violations.\n\nThat said, we have yet to see whether outright legalization and the creation of a legal marketplace will take hold nationwide. More progressive states will no doubt take up the mantle of this effort, though we anticipate many will wait for policies and regulations to be refined first in Oregon and Colorado, and then observe what the rollout in these states looks like before taking any steps.\n\nWe are reminded that cannabis has been on a 25-year journey since the first medical legalization movements. The legalization process for psychedelics will, therefore, likely take much longer than many think.\n\nWhat are the broader consequences of the collapse of the Synthesis Institute?\n\nWe view the collapse of Synthesis as a relatively isolated incident that will have minimal spillover effects. Our understanding of the incident is that it was triggered by a large real estate deal gone wrong that eventually bankrupted the company. It is more emblematic of poor management acumen than qualities innate to the psychedelic sector.\n\nAre institutional investors still as reluctant to become LPs for funds that invest in psychedelics as they were before the pandemic and the related mental health crisis?\n\nInstitutional investors will likely continue to sit on the sidelines in wait-and-see mode. That said, given continued positive media coverage and captivating stories of patients getting significant relief from psychedelics where other conventional treatments have failed, we continue to see an uptick in interest from UHNWIs and family offices. While our fund is closed, we still receive ample inbound from investors from these camps asking to invest.\n\nPlant-based psychedelics seem to stand a better chance of getting decriminalized in the short term than synthetic drugs. How are you capitalizing on this in your investment choices?\n\nWe are not capitalizing on the decriminalization movement in any way, as it only decriminalizes the use of psychedelics but not the purveying of them. Therefore, dealers and distributors of drugs can still be prosecuted, meaning there is no commercial opportunity in decriminalized markets.\n\nIn legal markets, the current regulations are most conducive to clinic-based models. However, it is difficult to make these models profitable and scalable, and they are therefore not conducive to a standard VC investing strategy or target return profile.\n\nWe are watching, in admiration, the legalization wave from a distance but have not found compelling investment opportunities within it.\n\nDo you see patents as a hindrance or an accelerator for the wider adoption of psychedelics? How much weight does IP carry when you’re considering an investment?\n\nWithin biotech, patents are an absolute necessity. Without them, a company does not have meaningful defensibility to justify the high investment required to develop a drug. We put strong weight on IP quality when vetting an investment, and in particular, look for compositional IP over less defensible forms such as method of use.\n\nIf and when you invest in therapeutics-oriented solutions, how important is their ability to integrate with the current health and insurance system?\n\nIt is very important. Rather than seeking to change how our healthcare system operates, we believe this early generation of psychedelics must transform and adapt to fit within existing infrastructure. Those wishing to “terraform” our entire healthcare system to be conducive to psychedelics are in for a world of disappointment. Western healthcare models are heavily entrenched and sclerotic, and will not change overnight. Furthermore, some of the limitations to early psychedelic therapies are simply driven by socioeconomic factors — very few citizens have the privilege of being able to pay the sky-high costs of MDMA or psilocybin therapy out of pocket.\n\nThe dissemination of these powerful medicines into society will be incremental and won’t occur overnight. Rather than trying to storm the ramparts, we believe a Trojan horse approach is the only means by which these therapies can achieve wide-scale adoption.\n\nAre you seeing anything interesting happening at the intersection of AI and psychedelics?\n\nOutside of the benefits of AI for early-stage drug discovery, we see minimal intersection at this time. We have no doubt that in the future AI will play a role in precision psychiatry and potentially refining patient selection for clinical trials. But again, this will have an impact on biotech overall, of which psychedelics is a subsector.\n\nMany startup employees have been laid off recently. Which profiles might be a good fit for psychedelics companies in your portfolio?\n\nFor individuals coming from the pharmaceutical industry with experience in business development or with backgrounds as chief medical officers, give us a call!\n\nIn particular, many psychedelic companies are in need of strong resumes that could fill a chief operating officer, chief business officer or chief medical officer position.\n\nAre you open to cold pitches? How can founders reach you?\n\nGiven overwhelming demand for capital at this time, we sadly will not be opening the floodgates further. We have seen a very large uptick in inbound by many cash-starved companies, which has put pressure on internal resources to sufficiently vet opportunities. We very much feel for founders, as it is a grueling time to be running a startup, but are prioritizing our near-term pipeline and existing portfolio.\n\nThe cases where we are still picking up the phone are for assets with compelling IP, have a commercially attractive profile, have a strong team with prior success in biotech and pharma and for which valuation reflects current market conditions.\n\nAmy Kruse, chief investment officer, Satori Neuro\n\nHow has the trajectory of listed psychedelics companies affected private firms and startups?\n\nIt’s my view that some of the “irrational exuberance” evident in the psychedelic investing market (and the VC market more broadly) over the last three years has diminished. Private firms and startups realize that they will be judged on their progress as is typical for companies at their development stage and maturity level.\n\nAs valuations have come down, I have observed that companies in the psychedelic ecosystem, particularly those developing novel molecules and/or treatments, are being evaluated like other drug development companies (in different fields) and priced accordingly. It is my view that this moderation is good for the overall development of the field.\n\nOther than disagreements over prices, which factors have impeded M&A activity in the psychedelics space in the last 12 months?\n\nI expect there to be M&A activity and consolidation within the psychedelic medicine sector in the coming year(s). I don’t think that price disagreements are holding it back. I think, like other sectors, that assets and programs that are more mature and developed will be the most attractive. It’s not holding back the field, but instead waiting for programs to mature that will spur M&A activity.\n\nCapital is always a constraint, and companies with resources will be in prime position to acquire companies or assets that would be ideal additions to their portfolios. These conversations are going on now. I expect them to continue and for companies to raise capital to complete more of them.\n\nDrug development is very costly, and startups are having a harder time raising cash. Does this make psychedelics startups that aren’t developing any drugs more attractive to investors than those involved in drug development?\n\nI guess it depends on what part of the psychedelic medicine ecosystem an investor is interested in. As an investor (at Satori Neuro), I am interested in all aspects, as there are many elements of the ecosystem that need to be developed in order to successfully deploy even a fraction of what is being developed (both traditional medicines as well as new molecules).\n\nI am looking to build a diversified portfolio that takes that into account. Others may want to focus on the molecules alone or other elements. I am most interested in seeing these treatments reach patients and those who need it most.\n\nColorado and Oregon voted to partially decriminalize psychedelics, but there are caveats. Should these U.S. states be considered test beds for what might happen in this space globally? Why or why not?\n\nIt is great that there are states in the U.S. that are looking at these medicines and assessing their potential to help individuals. That said, I think there will be caution as companies learn to navigate this landscape.\n\nDecriminalization is not the same as legalization at the Federal level. I believe we will continue to see international locations as primary test beds as the larger question of legalization in the U.S. is discussed. I suspect we will continue to see the majority of the work done in the U.S. at clinical trial sites, universities, etc., as that data is critical for the rescheduling of traditional molecules.\n\nThe developments in Australia this year are extremely interesting and worth watching closely. As Australia is often a site for clinical trials research in the psychedelic medicine ecosystem, it will be worth watching to see how this develops. Will they take the lead?\n\nWhat are the broader consequences of the collapse of the Synthesis Institute?\n\nMany in the field were saddened by the Synthesis Institute collapse, me included. It indicates how challenging it will be to scale and deploy these treatments. There is a lot to learn about how to create a robust, sustainable treatment ecosystem.\n\nIt’s not just therapists and medicines, it’s also legal approvals, land use, government restrictions, etc. As with any evolving field, lessons are being learned in real time, and while some companies may fail, hopefully those lessons aren’t wasted and the next wave of companies can have a head start.\n\nAre institutional investors still as reluctant to become LPs for funds that invest in psychedelics as they were before the pandemic and the related mental health crisis?\n\nI am seeing robust interest in mental health investments, neuroscience and related funds. Some LPs may be interested in a blend of investments in this space and some may avoid it entirely. There is still confusion about what is legal in this space, and some LPs may associate psychedelics with cannabis. There is always some education to do on that topic. We are focused on clinical treatments and access to care through legally approved channels.\n\nPlant-based psychedelics seem to stand a better chance of getting decriminalized in the short term than synthetic drugs. How are you capitalizing on this in your investment choices?\n\nThe wording matters here. Are we talking decriminalization or rescheduling? MDMA is a synthetic drug, and by all estimations, it is next in line for rescheduling and FDA approval for the treatment of PTSD. That is first up in my eyes in the U,S. Most think psilocybin is next.\n\nI am closely watching investments that have a chance of being rescheduled in the U.S. and/or that may be legally approved in non-U.S. locations. I am not currently looking at decriminalization (at the state level) in my investments now. There are too many unknowns.\n\nDo you see patents as a hindrance or an accelerator for the wider adoption of psychedelics? How much weight does IP carry when you’re considering an investment?\n\nI am a “yes, and…” investor. We need ALL of the options in our toolkit as we start to use these medicines to address the mental health crisis (and other conditions). If I am looking at a company developing novel molecules, then yes, IP, particularly in the form of composition of matter, is of great importance. There is some controversy around companies trying to patent non-drug elements. This seems less useful.\n\nHowever, if companies are developing a truly novel method of drug delivery, that is of utility. We still don’t know the best way to administer many of these molecules, and companies that figure that out are adding value.\n\nIP protects an investment that a company has made. I think that’s an important part of the way that companies are valued and viewed by the larger pharmaceutical ecosystem (and potential biotech investors). And yes, I do see biotech investors getting very interested as these novel molecules enter the clinic.\n\nIf and when you invest in therapeutics-oriented solutions, how important is their ability to integrate with the current health and insurance system?\n\nThis is at the heart of the scalability question. As an investor, I believe that some (not all) of these therapeutics will need to intersect with the health and insurance system to reach the number of individuals that need to be reached. I don’t see how that scale can happen without it. It is interesting to see the pick-up in Spravato prescriptions. That is a good sign, as practitioners have figured out how to work with it and integrate it into care. Sure, it took a bit, but that’s a really good sign for the field.\n\nAre you seeing anything interesting happening at the intersection of AI and psychedelics?\n\nI am not seeing as much with AI and psychedelics at the moment besides some drug design and some use in developing models around sorting through large data sets.\n\nI am seeing much more activity in the general mental health space: There are a lot of AI-powered companies there. Some use the generative approach and are chatbots/clinician support, and some are more focused on the data side for potential diagnosis and biomarkers. Exciting to watch!\n\nMany startup employees have been laid off recently. Which profiles might be a good fit for psychedelics companies in your portfolio?\n\nAlways looking for great individuals with a strong biotech background. Clinical design is especially important right now.\n\nAre you open to cold pitches? How can founders reach you?\n\nI am open to pitches, but the best way to get introduced is through another founder or investor. Also, I recommend that companies do their homework on the fund before they send something.\n\nClara Burtenshaw, partner, Neo Kuma Ventures\n\nHow has the trajectory of listed psychedelics companies affected private firms and startups?\n\nThe downward trajectory post-IPO has affected valuations, which can be seen across the sector. There is also less interest in deals, as any potential exit is less certain. The result of this is a generally pessimistic mood, but there is still an appetite for top decile companies and teams in the private sector. This has been evidenced by strong deals in private markets. Good teams are still raising well.\n\nOther than disagreements over prices, which factors have impeded M&A activity in the psychedelics space in the last 12 months?\n\nGiven the nascent nature of the sector, M&A had been seen as an exit option rather than a near-term event for young and well-funded companies. However, the challenging fundraising environment means that companies may struggle to raise the capital required to take their assets through to later stages of clinical development, meaning that good IP and data may be acquired by larger companies along the way. One example of such in the sector has been the acquisition of Eleusis by Beckley PsyTech.\n\nOne might have expected to see more M&A with clinics, but this has generally not been the case yet, as clinics have not yet reached the scale and volume of patients to generate the positive EBITDA required to make them attractive targets.\n\nDrug development is very costly, and startups are having a harder time raising cash. Does this make psychedelics startups that aren’t developing any drugs more attractive to investors than those involved in drug development?\n\nAny investment comes down to the investors’ appetite for risk. Biotech as a sector is generally deemed riskier than others due to the binary nature of clinical trial outcomes and the time horizons involved. Biotech valuations have broadly been calculated with respect to future revenue, with appropriate discounts based on the level of technical and clinical risk at the point of valuation, and limited liquidity events between clinical inflection points.\n\nIn the current economic climate, with record levels of inflation, future expected earnings are worth less each year, making the biotech sector even less attractive to short-term investors.\n\nIn some cases, drug development companies are an attractive adjunct to a portfolio for two main reasons: Firstly, they decrease concentration risk in a particular part of the sector, and secondly, they provide diversity and a quicker path to revenues, and therefore exit opportunities.\n\nWe invest across the entire value chain, with exposure to early-stage companies working on not just pharmaceutical compounds, but also clinics, care delivery, digital therapeutics and platforms.\n\nHow has your approach to the psychedelics sector changed since our previous psychedelics survey a year ago?\n\nOur approach has always been based on fundamentals to avoid any washouts when hype and hope dries out. If you take the word ‘psychedelic’ out of the description, would the investment still stand based on the IP, team and future prospects?\n\nThis approach has served us well over the last three years, and we continue to use it as the sector evolves and we get a better sense of the timeframes and regulatory landscape, and as more sophisticated companies enter the market.\n\nWhat are the broader consequences of the Synthesis Institute collapse?\n\nThe main contributors to the collapse of Synthesis Institute are issues witnessed in early-stage companies across all industries: myopic financial planning and problems with cash flow.\n\nAt face value, the story implies a level of uncertainty for investors in the psychedelic sector, which is not untrue. This uncertainty around legislative change is exactly why finding the right companies and leadership is vital for avoiding myopic financial decisions and cash flow issues as seen in the case of Synthesis.\n\nSophisticated biotech investors are likely to read beyond the headlines and see Synthesis as a case study highlighting the issues to be aware of when scaling a company in such a nascent sector, rather than avoiding sectors that hold so much promise entirely due to one major failure.\n\nPlant-based psychedelics seem to stand a better chance of getting decriminalized in the short term than synthetic drugs. How are you capitalizing on this in your investment choices?\n\nWe take decriminalization and other legislative issues into account when considering the merits of a particular investment. We have exposure to both plant-based and synthetic compounds, and believe both classes may represent large markets in the future.\n\nHowever, our fund takes more of a biotech approach when it comes to drug development, investing in novel and defensible IP rather than synthetic forms of naturally available compounds.\n\nIf and when you invest in therapeutics-oriented solutions, how important is their ability to integrate with the current health and insurance system?\n\nFor us this is essential: We are in the market to develop medicines that people can access, and for these treatments to scale, reimbursement will be required. It’s important to judge each company on a case-by-case basis to assess any risks in integration versus potential upsides.\n\nIn the short-term, it’s important that they have the potential to integrate enough that the product can be proven effective and conversations can be had with health and insurance providers.\n\nIn the long-term, while there are some uncertainties about how the psychedelic healthcare sector will sit alongside existing healthcare architecture, there have been some really positive developments with MAPS and Compass Pathways receiving reimbursement codes.\n\nAre you seeing anything interesting happening at the intersection of AI and psychedelics?\n\nSome of our portfolio companies are working with AI in interesting ways, such as using language processing to build a predictive model to estimate the specific effects of different psychedelic molecules. Another example is a portfolio company of ours developing AI-guided rating tools for psychedelic service provision.\n\nAre you open to cold pitches? How can founders reach you?\n\nYes! Please use the “contact us” form on our website.\n\nPsyMed Ventures: Greg Kubin and Matias Serebrinsky\n\nHow has the trajectory of listed psychedelics companies affected private firms and startups?\n\nListed psychedelic companies took a nose dive in the past year. The decline was correlated with the decline in the biotech industry until the second half of 2022, when psychedelics stocks dropped further.\n\nOn the private side, we’ve seen startups attempt to raise bridge rounds on the same terms they raised one or two years ago. While some raises have been successful, others stalled as more startups look for strategic exits.\n\nOnly a handful of companies have managed to raise at increased valuations, but these are startups that have best-in-class teams, demonstrated real traction or achieved meaningful drug development milestones.\n\nOther than disagreements over prices, which factors have impeded M&A activity in the psychedelics space in the last 12 months?\n\nPharma partners are looking for psychedelic biotechs to significantly de-risk their clinical programs before engaging in M&A or partnerships.This typically happens after later-stage clinical trial readouts (e.g., phase 2).\n\nPharma companies are still deciding if delivery of care for psychedelic medicines is commercially viable. We believe that recent news about Spravato sales picking up will help them build conviction.\n\nDrug development is very costly, and startups are having a harder time raising cash. Does this make psychedelics startups that aren’t developing any drugs more attractive to investors than those involved in drug development?\n\nNot necessarily. We’ll happily invest in amazing teams with a drug development approach that is safe, effective, commercially viable and ethical. At the same time, we’re interested in companies that are building the infrastructure to deliver psychedelic therapy, which will take some years to form.\n\nHow has your approach to the psychedelics sector changed since our previous psychedelics survey a year ago?\n\nCapital is scarcer than it was a year ago. A big question we consider when evaluating a startup investment is whether the company will be able to raise their next round. Our due diligence process now involves speaking to Series A and B investors to understand what they’d need to see for each potential investment to be investable.\n\nColorado and Oregon voted to partially decriminalize psychedelics, but there are caveats. Should these U.S. states be considered test beds for what might happen in this space globally? Why or why not?\n\nColorado and Oregon will help gauge the pent up demand for psilocybin journeys. These states might help inform how psychedelic treatments will be delivered and the occurrence of adverse events. But since they won’t be covered by insurance and there won’t be a REMS program (Risk Evaluation and Mitigation Strategy), it will be hard to infer how psychedelics will be adopted by the medical community.\n\nWhat are the broader consequences of the collapse of the Synthesis Institute?\n\nIn our view, retreats and facilitators in Colorado and Oregon should be mindful of taking on venture capital. Venture capital investments require hypergrowth and often need to raise additional capital that may not always be available. These businesses are better off remaining independent, and if they need outside capital, they should seek it from angels and other alternative sources.\n\nAre institutional investors still as reluctant to become LPs for funds that invest in psychedelics as they were before the pandemic and the related mental health crisis?\n\nMany institutional investors are still reluctant. But we expect this dynamic to change over the next one or two years with anticipated FDA approvals and more data demonstrating safety and efficacy. Perhaps, in that time frame, more institutional investors will be personally exposed to the benefits of psychedelic therapy.\n\nPlant-based psychedelics seem to stand a better chance of being decriminalized in the short term than synthetic drugs. How are you capitalizing on this in your investment choices?\n\nWhile plant-based psychedelics have a better chance of being decriminalized, synthetic drugs have a better chance of being approved by the FDA. We invest in medicines pursuing FDA approval, so our investments have been in synthetic medicines to date.\n\nDo you see patents as a hindrance or an accelerator for the wider adoption of psychedelics? How much weight does IP carry when you’re considering an investment?\n\nWe like to invest in companies that have clear IP based on novel discoveries. For example, new chemical entities such as nonhallucinogenic analogs are potentially truly scientific breakthroughs.\n\nDrug development is expensive, so patents can play an important role in incentivizing a company to bring a medicine to market. But they can be a hindrance when companies claim a novel formulation but are really just developing a known compound and blocking research or gouging prices in the process.\n\nIf and when you invest in therapeutics-oriented solutions, how important is their ability to integrate with the current health and insurance system?\n\nIntegrating with the current health and insurance system is vital to ensure access to these treatments. Most people can’t afford to pay $5,000 to $20,000 out of pocket, so insurance will be critical.\n\nImportantly, we believe that the cost of treatment will go down over time as more options become available and companies find ways to safely scale delivery of psychedelic care.\n\nAre you seeing anything interesting happening at the intersection of AI and psychedelics?\n\nCompanies like Kernel and Sama Therapeutics are aggregating large neuroimaging datasets. This data could be used to diagnose and determine which treatments will work best for each patient. That’s truly exciting.\n\nMany startup employees have been laid off recently. Which profiles might be a good fit for psychedelics companies in your portfolio?\n\nSome of our portfolio companies are hiring; some are keeping headcount low. Startups in our portfolio are looking for software engineers, business and operation managers.\n\nAre you open to cold pitches? How can founders reach you?\n\nYes! Email us at hi@psymed.ventures.\n\nLeafy Tunnel: Bek Muslimov and Nikolay Tretiyakov\n\nHow has the trajectory of listed psychedelics companies affected private firms and startups?\n\nThe global monetary tightening policy has weakened public equity markets, including the biotech sector, making it more challenging for early-stage private companies to access capital. Not only has this market downturn forced founders to reduce their burn rate and become more resourceful and focused on their strategic priorities, it has also led to the survival of the fittest and most capable founders and companies.\n\nAs venture capital investors, we also see higher-quality early-stage companies in our deal flow, with the signal-to-noise ratio in this market environment shifting in favor of investors.\n\nOther than disagreements over prices, which factors have impeded M&A activity in the psychedelic space in the last 12 months?\n\nEarly-stage companies were in cash preservation mode to extend their runways and focused on organic growth rather than business development opportunities via M&A. Having said that, in the next 12 months, we’ll see more companies running out of cash — they might become potential acquisition targets.\n\nDrug development is very costly, and startups are having a harder time raising cash. Does this make psychedelics startups that aren’t developing any drugs more attractive to investors than those involved in drug development?\n\nNot necessarily. We are only scratching the surface of understanding the therapeutic potential of novel psychoactive compounds. Many new applications of psychedelic medicines are being discovered, and they are not only confined to neurology and psychiatry.\n\nExisting side effects with certain psychedelic compounds also create a need for second-generation compounds with a safer and more efficacious pharmacological profile as well as improved patient outcomes. Our investment interest in biotech companies has not changed. In addition, we are also investing in companies in the ancillary segment of the psychedelics sector.\n\nHow has your approach to the psychedelics sector changed since our previous psychedelics survey a year ago?\n\nThe questions our industry is grappling with are becoming more refined and nuanced, reflecting the necessary maturation. Amongst these questions are actual costs of therapies, reimbursement coverage, the commercialization strategy for psychedelic drug development companies, resource bottlenecks with the therapists’ supply and infrastructure, etc.\n\nColorado and Oregon voted to partially decriminalize psychedelics, but there are caveats. Should these U.S. states be considered test beds for what might happen in this space globally? Why or why not?\n\nU.S. states such as Colorado and Oregon are trailblazers and set examples for creating regulatory frameworks for patients to access psychedelic medicine. It is yet to be seen how successful legal reforms in those states will be in order to replicate them in other states or countries.\n\nWhat are the broader consequences of the collapse of the Synthesis Institute?\n\nThe Synthesis Institute was a reputable and valuable training program and its failure would result in a loss of educational resources for aspiring psychedelic practitioners. The failure of a training program could undermine the trust and confidence of individuals who were considering enrolling. It could also raise questions about the quality of training and the ability of other similar programs to deliver on their promises.\n\nAre institutional investors still as reluctant to become LPs for funds that invest in psychedelics as they were before the pandemic and the related mental health crisis?\n\nAs clinical research into cannabinoids and psychedelic compounds advances, institutional investors are becoming more educated about the potential opportunities in the sector. When speaking with new potential LPs, it is encouraging to see that many of them are not only open to looking at this market but already have a good understanding of it and know companies and key players within the sector. That was not always the case before.\n\nWhile some institutional LPs might still need to overcome regulatory limitations, their overall market awareness has drastically improved over the past one to two years.\n\nPlant-based psychedelics seem to stand a better chance of getting decriminalized in the short term than synthetic drugs. How are you capitalizing on this in your investment choices?\n\nPlant-based psychedelics are part of our investment scope as long as they are within the medical and pharmaceutical markets. We also invest in ancillary businesses that enable and support the medical markets of the psychedelics sector.\n\nDo you see patents as a hindrance or an accelerator for the wider adoption of psychedelics? How much weight does IP carry when you’re considering an investment?\n\nPatents allow early-stage companies to achieve certain defensibility of their business models and obtain venture capital funding. Hence, we see patents as an accelerator of the industry. Patent and IP analysis are critical in our investment evaluation process.\n\nIf and when you invest in therapeutics-oriented solutions, how important is their ability to integrate with the current health and insurance system?\n\nAs we see more companies moving from clinical research to commercialization, this is becoming a key consideration for investors when evaluating opportunities.\n\nAre you seeing anything interesting happening at the intersection of AI and psychedelics?\n\nWe are seeing more biotech companies integrating the latest advancements in AI/machine learning into their drug discovery process.\n\nMany startup employees have been laid off recently. Which profiles might be a good fit for psychedelics companies in your portfolio?\n\nProfiles of candidates depend on the role requirements and specific activities of our portfolio companies. While medical and pharmaceutical experience is required for a biotech/drug development company, it may not be a prerequisite for starting a software company in the ancillary segment.\n\nAre you open to cold pitches? How can founders reach you?\n\nOf course. Founders can reach out by emailing us."}