{"url": "https://techcrunch.com/2023/11/22/luko-allianz-buyer/", "title": "Non-unicorn insurtech Luko urgently needs a buyer, but will it be Allianz?", "authors": ["Anna Heim", "Freelance Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-11-22T00:00:00", "text": "How fast time flies. Just a few weeks ago, on the heels of its announced acquisition by British group Admiral, French insurtech Luko advertised itself through billboards in the Paris metro and felt confident enough to joke about the fact that it once won a “Next Unicorn” award. Fast-forward to this week, and its parent company, Demain ES, will be put for sale via a legal notice in the newspaper after Admiral abandoned ship.\n\nWhat happened in the meantime is a bumpy journey from one offer to the next, until a tribunal pulled the brakes on the roller coaster ride that can’t end soon enough for the 120+ employees whose jobs are on the line. They already know they work for a non-unicorn, but they are now likely very keen to know whether their next employer will be Allianz.\n\nAs for policyholders, Luko insists they don’t need to worry, as “Luko Cover, the broker and manager of contracts marketed by Luko, and Luko Insurance AG, the insurer of the Luko Group [are] separate entities […]. Luko’s insurance and brokerage activities therefore continue to operate normally,” the company said.\n\nHowever, it won’t be business as usual for Demain following the tribunal’s decision that came to light this week. The startup’s parent company had entered accelerated ​​safeguard proceedings in June; but as a consequence of its insolvency, it will now be under judicial reorganization, a bad omen since this process often ends in liquidation.\n\nOf course, Luko can still be acquired; hence the upcoming notice in the newspaper. But despite the agreement the two companies entered in June of this year, it won’t be by Admiral: It is now confirmed that the British insurance group backed down on the deal on October 20.\n\nAdmiral was set to pay €14 million for Luko Cover — €11 million outright, plus an additional €3 million tied to specific milestones. This partly explains why the M&A process was bumpy: Luko raised €72 million during its solo journey, and it is easy to see how debtors may have been hard to accommodate. However, our understanding is that the main twist was Admiral’s withdrawal.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThere may not be a single reason why Admiral threw in the towel, and macro context may have played a role. But according to court proceedings, Admiral rather blamed a €2.3 million disagreement that emerged during due diligence on how to account for insurance premiums collected by Luko Cover on behalf of insurers, while the prospect of a VAT redress also raised eyebrows. TechCrunch reached out to Admiral and its French subsidiary, L’Olivier, for confirmation, but didn’t hear back.\n\nRegardless, Luko was surprisingly fast in finding an alternative, court documents revealed. On November 8, it received a formal offer from Allianz for the same assets that Admiral was set to acquire — but without any commitments on the HR side.\n\nWhile Allianz’s offer didn’t come with a guarantee to save jobs at Demain and its subsidiaries, it seemed to make sense at a strategic level. Indeed, the insurance incumbent is getting ready to launch a DTC insurtech platform in France called Allianz Direct. Meanwhile, even Luko’s detractors acknowledged that the company became emblematic of DTC home insurance in France before it expanded further.\n\nAs for how much Allianz offered, it depends who you ask; Demain presented the offer as being worth €14 million in total. The tribunal disputed this and concluded it was worth €8 million since the remainder would cover debt takeover. But of course, that’s yesterday’s price, not tomorrow’s.\n\nAllianz’s offer to Demain may still stand even with the company under judicial reorganization, but it would be a surprise if the price tag remained unchanged. On the other hand, its perimeter might change, too; Demain is less constrained in its dealings now than when it had to look for a match for Admiral’s offer.\n\nHowever, there are parts of Luko that are no longer for sale.\n\nEarlier this year, German insurer Getsafe already nabbed the German customer portfolio that was mostly a legacy of Luko acquiring multi-product insurer Coya in 2022.\n\nIn addition, while Luko entered the unpaid rent insurance business with the acquisition of Unkle that same year, that portfolio has now been acquired by French broker Solly Azar in partnership with Sada Assurances. Both acquirers confirmed that these deals are closed and independent from Demain’s judicial proceedings.\n\nStill, Luko might be able to sell more than what Admiral was interested in buying. But we are more curious to know who will buy Demain; will it be Allianz, which even offered Demain a €25,000 daily advance payment to keep the company afloat? Or could it be another of the prospective buyers whose names have been floated at some point, such as AXA, Ornikar or Leocare?\n\nThe worst-case scenario would be for all offers to vanish. If that were to happen, some may wish the court had been more flexible in light of Allianz’s offer. Its latest decision was already somewhat of a surprise for Luko, a source close to the matter told TechCrunch. But from a legal standpoint, it seemed unavoidable; in French law, safeguard proceedings don’t apply to companies that are insolvent, as Demain now is.\n\nEven if the tribunal had some leeway, it probably wouldn’t be keen to set a precedent, especially at a time when bankruptcy-related proceedings become more common. Earlier this month, French mobility startup Cityscoot declared itself insolvent and was subsequently placed under judicial reorganization. Maybe it will come out on top, and Luko might, too; but knowing the odds, not all companies will, even if they were once future unicorns.\n\nUpdate: Admiral replied to TechCrunch on Nov. 23 with the following statement: “Admiral had intended to purchase Luko’s French household business. Unfortunately, they were unable to meet the conditions set out in the transaction documents and the parties were unable to reach an agreement to enable this deal to complete.”\n\nIt is unclear whether Luko will publicly challenge this statement and Admiral’s decision, but a source close to the matter told TechCrunch Wednesday that rather than litigation, Luko’s priority was to put an end to the proceedings, which have been hard on its employees.\n\nSince then, the Luko employee representative that attended the hearing also clarified that Allianz’s offer included integrating the same number of employees that Admiral would have — some 130 staffers; our understanding is that the court’s comment noting that the potential buyer wasn’t making any commitments on the HR side therefore applied to what might have happened in the longer run."}