{"url": "https://techcrunch.com/2024/09/07/aptos-ceo-mo-shaikh-shares-his-journey-to-web3-and-market-opportunities-in-asia-and-middle-east/", "title": "Aptos CEO Mo Shaikh shares his journey to web3 and market opportunities in Asia and Middle East", "authors": ["Kate Park", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-09-07T00:00:00", "text": "As a young immigrant in Brooklyn, Mo Shaikh often pondered over his father’s taxi earnings. His father would say he made $100, but Shaikh couldn’t understand why only $60 made it home. (The rest, he learned, went to intermediaries.) This early experience sparked his curiosity about financial systems, as well as their shortcomings and the need for change.\n\nShaikh went on to study finance, economics and psychology at Hunter College, then got an MBA at University of Rochester. After he graduated, he started to cut his teeth in the professional world at places like BlackRock and Boston Consulting Group. But it was his move first to blockchain startup Consensys, and then Meta to work on its cryptocurrency efforts, that he realized that this was the solution to the inefficiencies he’d been witnessing since he was a child.\n\n“I knew this was the place that I wanted to be,” he said.\n\nTogether with Avery Ching, he co-founded Aptos in 2021.\n\nIt’s been a wild ride for Shaikh and Aptos. Within three months of leaving Meta in December 2021 and founding the startup, it raised $200 million at a valuation of over $1 billion, led by Andreessen Horowitz. Just three months after that, it raised another $150 million. But the wild ride had some bumps: Its investors included the ill-fated FTX.\n\nIn the interim, the company has continued to grow while also weathering many of the same problems other crypto companies have faced. In April, it launched Aptos Ascend, a full stack of financial features.\n\nAnd now Aptos and Shaikh have their eye on expanding in Asia.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAptos is already working with local partners. It announced on Friday a partnership with Libre, an investment infrastructure startup focused on tokenizing financial assets. Libre is a joint venture launched by Japanese bank Nomura’s digital asset unit Laser Digital and hedge fund Brevan Howard’s fintech and web3 incubation hub WebN Group.\n\nLibre launched a web3 protocol to access hedge funds and private credit funds on the Aptos Network. The partnership will enable eligible Aptos users to access a host of on-chain funds, including the Brevan Howard Master Fund, Hamilton Lane Senior Credit Opportunities, and BlackRock ICS Money Market Fund.\n\nTechCrunch sat down with Shaikh this week at the Korea Blockchain Week 2024 conference in Seoul to talk about Aptos’ expansion in Asia, particularly in countries like South Korea, Japan, Singapore and the Middle East; its partnerships with major Asian web2 companies; and how Aptos uses blockchain to make financial transactions seamless and cost-effective.\n\nMassive blockchain appetite in Asia\n\n“Asia probably has one of the biggest needs for web3. There are so many different disparate payment systems. There are so many financial institutions that have a lot of legacy infrastructure,” Shaikh said. “I used to live in Dubai when I was working at BCG, so I’m kind of familiar with all of that [East Asia, Southeast Asia and Middle East countries]. But when building Libra [at Meta], one of the main use cases was how people make money move easily, seamlessly and globally. … You want to be as transparent as possible. Financial institutions want that, regulators want that, and users want that.”\n\n“Instead of paying 15%, you pay 0% [via a blockchain payment system], so that means I get all the money that you sent me, instead of, you know, it being lost to all these fees … [In Asia,] they’re really excited to move forward.”\n\nThese factors contribute to the economic growth in Asia, leading to increased efficiency and profitability for companies and users, Shaikh said. Companies can cut their costs to reallocate funds, and people can save money by sending it worldwide without fees. Korean telco company SKT from SK Group, for example, sees the importance of building a crypto wallet for users to have better and more efficient forms of money, Shaikh told TechCrunch.\n\nAptos has established strategic partnerships with tech giants like Microsoft and Google, as well as with media conglomerates like NBCUniversal in the West. In Asia, Aptos has partnered with leading companies such as SKT, a major telco company from SK Group, Korean retail giant Lotte, and the web3 subsidiary of Japanese bank Nomura.\n\n“I think all of these things coming together in Asia has been phenomenal. But there’s one secret sauce, I would say, Asians are continental-wise, very excited to adopt new technology. They’re very mobile-friendly; they’re always entrepreneurial. They’re forward-thinking, and that’s amazing. When it comes to web3, they’re willing to try things in a very experimental way, but they know there’s an opportunity there. And so all of those problems that we’re solving, combined with the appetite of the user, make it a perfect place for Aptos.”\n\nMost recently, Aptos invested in a bunch of companies based in Hong Kong.\n\nShaikh also touts the performance of blockchain technology in terms of costs and speed. “A lot of people talk about muddy movement. Many folks claim they can do these cool things, but I don’t think anyone shows the power of blockchains,” he said.\n\n“So there’s a gaming company. A gaming company launched a game on our blockchain. They produce every transaction in that game on our blockchain on Aptos. That transaction, you would imagine, like, if you’re transacting on a blockchain, it’s going to cost you money on Solana. There’s a cost associated with Ethereum. Our blockchain is built incredibly efficiently. So the cost of that transaction is a 1,000th of a penny, so it’s pretty much free, and that makes this game run really well,” the CEO said. “If you’re a web2 game developer, you can launch on our blockchain and take advantage of that cheap transaction. But it also allows you to speed and throughput. If you’re setting a transaction on a game, let’s say each click of that game is happening on the chain. If there’s a two-second delay, even a one-second delay, your game is going to be slower. We had a sub-second finale so that transactions were happening in under one second, so the game was not interrupted, and the transactions that took place in a 24-hour window were 500 million transactions.”\n\nHe mentioned that 500 million transactions in 24 hours is the next best version of a blockchain Solana. And Solana is a previous-generation blockchain at this point; the most that it’s been able to do is 50 million transactions, Shaikh said. “We did 10 times that, which is crazy. And what happens with protocols like Solana is those networks go down,” he said.\n\nRegulations in Asia and the Middle East\n\nThe CFTC named Shaikh to its digital assets subcommittee in June. When asked if Aptos is working with local governments in Asia, Shaikh said the company loves talking with local governments in Asia and educating them about what they’re doing.\n\n“We’re actually doing stuff with not just talking to governments, but doing stuff with governments,” Shaikh said. “Governments want to feel safe; they want a blockchain that is going to protect their citizens. And we’re very lucky to be able to have those conversations with [local governments in Asia] and then also help them move up the model. Governments are getting smarter. They’re excited about this technology. It’s not just Bitcoin, but real technology underneath that powers the future economy. We love to work with the regulators and governments and make the solutions really come to light.”\n\nHe said Japan has done a phenomenal job in letting the industry know this is what you can do. “Japan is also paying attention to the work that we’re doing here in Korea. And I think Korean regulators are very excited about what can happen in real-world asset tokenization. RWAs are something that we’re very, very optimistic about. In the Middle East, for example, in Abu Dhabi, you have the Abu Dhabi global markets and Dubai as well. Different parts of Asia are moving very fast, and that’s good because now this technology can grow in these areas, and in these countries, cities like Seoul are getting to stay ahead of the curve. And so that’s awesome for Korea, and it’s also for Japan, Abu Dhabi, and even other places like Singapore.”"}