{"url": "https://techcrunch.com/2024/09/20/health-insurance-startup-alan-reaches-45-billion-valuation-with-new-funding-round/", "title": "Health insurance startup Alan reaches $4.5B valuation with new $193M funding round", "authors": ["Romain Dillet", "Senior Reporter", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-09-20T00:00:00", "text": "Alan, the French insurance unicorn, just signed a multi-faceted deal with Belfius, one the largest banks in Belgium, that includes a distribution partnership along with a significant financial investment in the startup.\n\nBelfius is leading Alan’s Series F funding round of €173 million (around $193 million at current exchange rates). Some of Alan’s existing investors are participating once again, namely Ontario Teachers’ Pension Plan (via Teachers’ Venture Growth), Temasek, Coatue, and Lakestar.\n\nIf you aren’t familiar with Alan, the company originally started with a health insurance product that complements the national healthcare system in France. French companies must provide health insurance to all their employees when they join.\n\nAlan has optimized its core product as much as possible so that its user experience is much better than a legacy insurance provider’s. For instance, Alan has automated many parts of the claim management system. In some cases, you get a reimbursement on your bank account just a minute after leaving the doctor’s office.\n\nOver time, the company added other health-related services, such as the ability to chat with doctors, order prescription glasses, and use preventive care content on mental health, back pain and more via its mobile app. More recently, the company has turned to AI to increase its productivity.\n\nEarlier this year, Alan shared some metrics about the company’s performance. The company had said that over 500,000 people were covered by Alan’s insurance products, and it could reach profitability without raising another funding round.\n\nBut Alan said the partnership with Belfius was a good opportunity to grow its customer base in Belgium — the bank will offer the startup’s health insurance products to its own corporate and institutional clients, which represent millions of employees.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“This privileged partnership with Belfius, whose transformation over the past decade has been truly inspiring, opens the door to a new era for Alan in Belgium. Belfius’ investment will allow us to accelerate our development and expand our capacity to offer cutting-edge, accessible health products and services to a wide audience,” Alan’s co-founder and CEO, Jean-Charles Samuelian-Werve, said in a statement.\n\nSince February, Alan has added another 150,000 customers, including at the Prime Minister’s office in France. It expects its annual recurring revenue to reach €450 million (around $500 million) this year.\n\nHowever, Alan isn’t a typical software-as-a-service company, and most of its revenue is set aside to fulfill insurance claims. Still, one thing is for sure — the company’s growth doesn’t seem to be slowing down."}