{"url": "https://techcrunch.com/2020/10/07/nobel-laureate-jennifer-doudna-shares-her-perspective-on-covid-19-and-crispr/", "title": "Nobel laureate Jennifer Doudna shares her perspective on COVID-19 and CRISPR", "authors": ["Darrell Etherington", "Editor At Large", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2020-10-07T00:00:00", "text": "CRISPR co-discoverer Jennifer Doudna was named a Nobel laureate in Chemistry today, sharing the honour with Emmanuelle Charpentier. We had the opportunity to speak to Doudna recently at our TechCrunch Disrupt 2020 event, and she shared her thoughts on CRISPR, and how it can be used to test and potentially treat COVID-19, as well as what it may do for our ability to address future pandemics and healthcare crises.\n\n“It’s really interesting to think about the ability to program CRISPR to be detecting not only the current coronavirus, but also other viruses,” she explained in the interview in September. “We were already working on a strategy to co-detect influenza and coronavirus, as you know that it’s really important to be able to do that, but also to pivot very quickly to detect new viruses that are emerging. I don’t think any of us think that, you know, viral pandemics are going away — I think this current pandemic is a call to arms, and we have to make sure that scientifically, we’re ready for the next attack by a new virus.”\n\nMuch closer to hand, CRISPR has the potential to greatly expand testing capabilities in the near-term, and to do so in ways that could change the pace, frequency and nature of testing. That could translate to very different front-line care and pandemic management, across both healthcare facilities as well as any shared workspaces.\n\n“I think from what I’ve seen that very likely before the end of the year, we’re going to see CRISPR diagnostic tests rolling out,” she said. “Whether they’re in laboratory settings — I think that may be the first format that we see — but also something that we’re working on right now at the Innovative Genomics Institute at Berkeley and UCSF and the Gladstone is a strategy for a point-of-care CRISPR tests, where we have a small device that we envision located in different floors of buildings and institutions and dormitories, where you could do very rapid surveillance-type testing of saliva or swab samples.”\n\nCheck out the full interview with Doudna above, which also ranges into the most recent advances in CRISPR science, and where it’s heading next for everything from therapeutics to crop modification."}