{"url": "https://techcrunch.com/2021/09/30/fairphone-4/", "title": "Fairphone 4 adds 5G and software support until 2025+", "authors": ["Natasha Lomas", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-09-30T00:00:00", "text": "Dutch social enterprise Fairphone has announced its first 5G smartphone, the Fairphone 4.\n\nThe “greentech” mobile maker differentiates from almost the entire smartphone industry through a promise of sustainability via repairable modularity.\n\nIt combines this with a big push around social responsibility and ethical electronics — touting fairly sourced materials and better conditions for workers (through a living wage program) across a supply chain that spans the dirty business of mining rare earth minerals and all the other components used in making mobile devices, as well as the handset manufacture itself.\n\nThe Fairphone 4 comes with a five-year warranty and a guarantee of software support until the end of 2025 — including upgrades to at least Android 12 and 13. (It runs Android 11 out of the box.)\n\nThe startup also hopes to be able to extend the phone’s lifespan even further — saying its goal is software support until 2027 and upgrades to Android 14 and 15 too.\n\nThe new flagship follows the launch of the Fairphone 3+ last year — which enabled owners of its prior top-of-the-range handset to upgrade to for as little as €70 just by swapping out a few modules.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPrioritizing reuse to reduce e-waste is a key goal for Fairphone — so even though it’s announcing another new phone this year it is taking steps to avoid being accused of creating more e-waste by generating demand for new hardware.\n\nThe Fairphone 4 is the first it’s made that’s being billed as “electronic waste neutral” — as it says it will “compensate” users’ phones and spare parts by “responsibly recycling one phone (or an equal amount of small electronic waste) for every Fairphone 4 sold”. Or else take back and refurbish at least one other phone to prevent the production of a new one.\n\nIn another development toward its ambitious goal of making truly sustainable and ethical personal electronics, Fairphones notes that it’s been able to expand its list of fairly obtained materials, adding six new ones. In the Fairphone 4 these include Fairtrade-certified gold, aluminium from Aluminium Stewardship Initiative (ASI) Performance Standard certified vendors, fair tungsten from Rwanda, recycled tin, rare earth minerals and plastics.\n\nConsumers have long been holding onto smartphones for considerably longer than upgrade cycles of the early years of the market as the space has matured and device refreshes have become increasingly iterative.\n\nSimultaneously environmental concerns are also stepping up driving changes in how consumers buy and use mobile devices. So the new shiny thing, in consumer demand terms, might actually be keeping the old shiny thing for as long as possible and responsibly recycling it when it finally comes to the end of its run.\n\nIn Europe, lawmakers are also considering right to repair legislation.\n\nFairphone’s modular design, which allows the user to easily swap out and replace components (like the screen, battery and camera) if a part of the device breaks or malfunctions, may provide a glimpse of the future of consumer electronics — if regulators go down the path of mandating repairability in order to tackle e-waste and incentivize reduced consumption as part of measures to decarbonize the economy and respond to the climate crisis.\n\nCommenting on the launch of the Fairphone 4 in a statement, Eva Gouwens, CEO of Fairphone, said: “We want to challenge the traditional way of designing devices, including the notion that thinner is better. The starting point in development was to produce a premium sustainable smartphone that is future-proof, easily repairable, designed to last and therefore more circular and fair.”\n\nThe tech specs of Fairphone’s latest device have also had a boost vs the previous flagship — so as well as 5G the phone comes with either 6GB or 8GB of RAM and 128GB or 256GB of storage, a Qualcomm Snapdragon 750G chipset, beefed up rear & front cameras and a 6.3-inch display, among other tweaks."}