{"url": "https://techcrunch.com/2025/03/26/the-tiktok-ban-is-losing-support-among-americans-study-says/", "title": "The TikTok ban is losing support among Americans, study says", "authors": ["Amanda Silberling", "Senior Writer", "Zack Whittaker", "Rebecca Bellan", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-03-26T00:00:00", "text": "Americans’ support for a TikTok ban is declining, according to a study from the Pew Research Center.\n\nThis survey of more than 5,000 U.S. adults found that just 34% of respondents supported banning the short form video app. When Pew ran a similar study in 2023, 50% of adults supported the TikTok ban.\n\nOver the same time span, the study also shows more Americans growing opposed to the ban. While 22% of respondents opposed it in 2023, that population rose to 32% in the recent study.\n\nThese trends were consistent across party lines, with support for the ban among Republican and Republican-leaning voters dropping from 60% to 30% since March 2023. Across the aisle, support dropped from 43% to 30%.\n\nBut Americans who don’t use TikTok were almost four times as likely to support the ban than those who do use the app — 12% of TikTok users supported the ban, as opposed to 45% of non-users.\n\nThough the popularity of this legislation has waned, TikTok’s fate in the U.S. remains uncertain.\n\nWith bipartisan support in the House and Senate, former President Joe Biden signed the TikTok ban into law last April, citing concerns about potential Chinese surveillance. This gave the Chinese TikTok owner ByteDance until January 19 — the day before the next presidential inauguration — to sell the app to an American company.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAs the deadline rolled around, and President Donald Trump prepared to assume office, the TikTok app went dark. But American users were only blocked out for around 12 hours before the app came back online; President Trump postponed ByteDance’s sale deadline another three months, until April 19.\n\nAmerican companies like Oracle, Microsoft, and Perplexity AI are rumored to have interest in buying TikTok, but ByteDance has not indicated that it plans to sell."}