{"url": "https://techcrunch.com/2021/11/08/taiwan-based-funnow-an-instant-booking-app-raises-15m-series-a/", "title": "Taiwan-based FunNow, an instant booking app, raises $15M Series B", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-11-08T00:00:00", "text": "FunNow is a booking app for spontaneous people. For example, you can reserve a manicure or restaurant seat and head right over. As people start to spend more time outside their homes, FunNow is prepping itself for expansion into more countries. The Taipei-based company announced today it has closed a Series B of $15 million.\n\nThe round was co-led by Perfect Hexagon Commodity & Investment Bank and Ascendo Ventures, with participation from the corporate venture arms of PChome, KKday and Wistron. It also included returning investors CDIB Capital, Darwin Ventures, Accuvest, Sanpu Travel Group and CSV Venture Fund, which is jointly managed by NEC Capital Solutions and Venture Labo Investment.\n\nCo-founder and chief executive officer TK Chen told TechCrunch that FunNow originally planned to start raising its Series B in 2020, before COVID hit. Despite dealing with the pandemic’s impact in all of its markets, including Hong Kong, Japan and Malaysia, the company began to see business improve during the second quarter of this year. Its Series B brings FunNow’s total funding, including its 2018 Series A, to about $22.5 million, and will be used to expand the number of categories in its app, adding night clubs, karaoke bars and catering, for example, and enter new countries, including Thailand and Singapore.\n\nDuring the pandemic, FunNow faced different challenges in each of its markets. For example, cases in Kuala Lumpur were low for most of this year before an outbreak that started in May. In Taiwan, FunNow’s biggest market, life was relatively normal until an uptick in cases triggered a lockdown from May to August, causing its revenue to decline sharply, but now it has returned to about 80% of its pre-pandemic performance.\n\nDuring the outbreaks, FunNow’s team adapted the app’s services. For example, in Malaysia, it talked to food and beverage merchants and discovered that customers prefer to pick up food instead of waiting for deliveries, so it added takeaway bookings. Based on that experience, it applied the same strategy when Taiwan’s lockdown began.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Within two months, our return for takeaway was almost the same as dine-in revenue,” said co-founder and chief global strategist CC Chang.\n\nThe app already had multi-channel reservation tools, so it began adapting the types of hotel reservations offered, adding daytime options, with stays of four, six or 12-hour increments. For example, people who wanted to dine somewhere, but not in a restaurant, could book a room for a few hours and order room service. Some users, tired of WFH, booked hotel rooms to work.\n\n“We kept innovating, developing the app, developing more functions” and acquired more merchants in Taiwan, Malaysia, Hong Kong and Japan, where the company has local teams, said Chen. The startup also expanded its Malaysian operations with the acquisition of Kuala Lumpur-based reservation app TABLEAPP one year ago. “We wanted to raise money now so we can expand market share as soon as possible, once the pandemic is under control.”\n\nHe added that COVID has changed consumer habits. For example, people now use online bookings more since walk-ins are discouraged in many places, and they prefer the convenience of FunNow over a phone call. People also started taking advantage of times when the COVID situation is relatively under control to do things like get salon services.\n\nFunNow is facing more competition, however, as startups that used to focus on international travel switched to “staycations.” For example, both SoftBank-backed Klook and PickTime now also offer local bookings for many categories that overlap with FunNow. Chen said he anticipates that “the competition between us will ultimately get bigger and bigger.”\n\nOne of the ways FunNow differentiates is its emphasis on “daily life” activities — for example, food, hair cuts, manicures or massages, instead of packages centered around destinations, like theme parks, tourist spots or other cities.\n\n“We are really focused on instant booking,” said Chang. “It’s important to our users because it’s more convenient. You don’t have to make a phone call and we have 10 different categories that are based on daily life, so if you are used to FunNow to do your hair, your nails, make salon appointments, order bouquets or cakes for parties, you won’t easily switch to other platforms.”\n\nFunNow’s Series B included the corporate venture arms of e-commerce platform PChome, tour and activity booking app KKday and electronics manufacturer Wistron. Chen said their investment means that FunNow will be able to work with all three companies to “accelerate the growth of a lifestyle ecosystem.”\n\nFor example, PChome, one of the most popular shopping apps in Taiwan, might feature FunNow activities during promotions. People browsing on PChome for Mother’s Day gifts could see FunNow bookings for restaurants in the app.\n\nBefore the pandemic, KKday offered international travel bookings, but is now focused on staycations, or local activities. By working together, Chen said the two companies plan to become more formidable rivals to Klook. “We can’t give a lot of details right now, but the basic idea is to combine resources. For example, they have a lot of activities and we have dinners and massages. If we come together, we can combine our suppliers and get more traffic and orders to merchants.”\n\nFunNow will seek other similar partnerships to drive low-cost traffic. Known for being one of Apple’s manufacturing contractors, Wistron’s role in FunNow’s booking ecosystem seems less obvious, but Chen explains it’s “not a pure strategy partner. Wistron has spent a lot of time focused on digitizing Taiwan’s market, and created a corporate fund to invest in startups, and we will get a lot of support from them.”\n\nIn a statement, Ascendo Ventures managing director Aaron Shin said, “FunNow’s performance during the COVID-19 pandemic shows that the company’s operating conditions are optimistic and have huge potential for overseas expansion.”"}