{"url": "https://techcrunch.com/2021/10/26/dehaat-raises-115-million-in-the-largest-agritech-round-in-india/", "title": "DeHaat raises $115 million in the largest agritech round in India", "authors": ["Manish Singh", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-10-26T00:00:00", "text": "DeHaat, an online platform that offers full-stack agricultural services to farmers in India, has raised $115 million in what is the largest funding round for an agritech startup in India, where farm produce yields two-thirds of the country’s $1 trillion in annual retail spending.\n\nSofina and Lightrock co-led the 10-year-old startup’s Series D financing round. Temasek and existing investors Prosus Ventures, RTP Global, Sequoia Capital India and FMO also participated in the new round, which brings its to-date raise to $161 million ($157 million of that has arrived in the last 30 months).\n\nDeHaat, which is Hindi for village, is addressing three of the biggest challenges farmers face in India (and elsewhere): working capital, securing agri-input items such as seeds and fertilizers, and finding buyers after producing the yields. Only about a third of the yield Indian farmers produce reaches the big markets.\n\nThe Gurgaon and Patna-headquartered startup has brought to one platform brands that sell agri-input products, institutional financers and buyers. It also works with microentrepreneurs — more than 3,000 of them — to provide last-mile aggregation and delivery.\n\nThe startup, which runs a helpline to engage with farmers, also operates an eponymous Android app that is accessible in multiple languages.\n\n“The uniqueness of its full-stack approach combined with the ‘phygital’ go-to-market strategy further reaffirmed our view that the company is on track to become a significant player in the farming industry in India,” said Yana Kachurina, principal at Sofina, in a statement.\n\nDeHaat said it serves over 650,000 farmers in Bihar, UP, Jharkhand and Odisha. On its platform, it offers more than 850 unique agribusinesses.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nShashank Kumar, co-founder and chief executive of the startup, told TechCrunch in an interview that the startup will deploy the fresh funds to expand to “all major agriculture clusters of India.”\n\nDeHaat has grown 5x in the past seven months, he said.\n\nOnce an overlooked sector, scores of startups and tech giants are exploring how to tap the world’s largest annual harvest of fruit and vegetables after China’s. India’s agri-tech industry has the potential to reach about $24 billion in revenue by 2025, according to EY.\n\nAmazon recently began offering real-time advice and information to farmers to help them inform their decisions on crops. Microsoft is working with 100 villages to deploy AI and build a platform.\n\n“Our team has grown to a brigade of 850+ professionals with deep expertise of growth and strategy, supply chain, technology and agricultural science,” Kumar said, adding that the startup is also looking to hire more talent."}