{"url": "https://techcrunch.com/2024/05/14/aws-ceo-adam-selipsky-steps-down/", "title": "AWS CEO Adam Selipsky steps down", "authors": ["Kyle Wiggers", "Ai Editor", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "Amanda Silberling", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-05-14T00:00:00", "text": "Adam Selipsky is stepping down from his role as CEO of Amazon Web Services, Amazon has confirmed to TechCrunch.\n\nIn a memo shared internally by Amazon CEO Andy Jassy and published this morning to the company’s blog, Jassy said that AWS sales chief Matt Garman will be promoted to CEO. Garman previously headed AWS’ EC2 cloud computing org.\n\n“We were fortunate that Adam agreed to step in and lead AWS, and has deftly led the business, while also developing his leadership team,” Jassy wrote. “Adam is now going to move onto his next challenge (after taking a well-deserved respite), and Garman will become CEO of AWS, effective June 3rd.”\n\nSelipsky was one of the first VPs Amazon hired at AWS in 2005, and spent 11 years heading up sales, marketing and support before leaving to become CEO of data visualization software Tableau. He returned to Amazon in 2021 to lead AWS.\n\nBefore running EC2, Garman — who joined AWS in 2006 as one of the first product managers — eventually became the general manager of all AWS compute services in 2016. In 2020, he moved to the “demand generation” side of AWS to spearhead worldwide sales, marketing support and professional services.\n\nIn a statement to employees, Selipsky wrote, “given the state of the business and the leadership team, now is an appropriate moment for me to make this transition, and to take the opportunity to spend more time with family for a while, recharge a bit, and create some mental free space to reflect and consider the possibilities.”\n\nSelipsky is perceived as having missed the boat on generative AI — which might’ve contributed to his ouster.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAccording to reporting from The Information, AWS originally planned to unveil its own generative AI model akin to OpenAI’s ChatGPT code-named Bedrock — which eventually became Amazon’s Bedrock model hosting service — at its annual conference in November 2022. But technical issues forced the organization to postpone the launch.\n\nUnder Selipsky, AWS also passed on opportunities to back two leading generative AI startups, Cohere and Anthropic. AWS later tried to invest in Cohere, but was rejected — and had to settle for a co-investment (albeit a large one) in Anthropic with rival Google.\n\nIn the memo, Jassy highlighted Selipsky’s accomplishments, saying that Selipsky “took over in the middle of the pandemic” and “made the right long-term decision to help customers become more efficient in their spend, even if it meant less short-term revenue for AWS.”\n\n“Adam leaves AWS in a strong position, having reached a $100 billion annual revenue run rate this past quarter, with YoY revenue accelerating again,” he continued. “I’m deeply appreciative of Adam’s leadership during this time, and for the entire team’s dedication to deliver for customers and the business.”\n\nIn 2023, AWS’ unit revenue growth slowed to record lows, and AWS underwent major layoffs as part of broader cuts at Amazon that resulted in more than 27,000 employees being let go.\n\nYet AWS remains the cloud leader with around 31% market share (versus Microsoft Azure’s 25% and Google Cloud’s 11%) and one of Amazon’s most profitable business divisions.\n\nIn the most recent fiscal quarter, AWS generated $9.42 billion in operating income, or about 62% of Amazon’s total. Jassy recently said AWS’ generative AI businesses alone have hit a combined “multi-billion dollar run rate.”"}