{"url": "https://techcrunch.com/2017/05/16/synthegos-genetic-toolkit-aims-to-make-crispr-more-accessible/", "title": "Synthego’s genetic toolkit aims to make CRISPR more accessible", "authors": ["Devin Coldewey", "Writer", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2017-05-16T00:00:00", "text": "We hear a lot about the potential and implications of the gene-editing technique CRISPR, but it’s not like just anyone can open up an app, pick a gene they don’t like, and build the molecular machinery needed to snip it out. That’s the goal, though, and Synthego is one of the companies pursuing it by creating a sort of ready-made CRISPR sandbox to start new researchers off.\n\n“80 percent of users getting into CRISPR have never done genetic engineering at all. So we simplified the process,” said Synthego founder Paul Dabrowski on stage at Disrupt today. “It’s a beautiful interface… but there’s a lot of heavy lifting in the background.”\n\nIf you want to use CRISPR, you need the genome of the animal you want to use, the DNA code gene you’re targeting, and a corresponding piece of RNA that leads the genetic scissors to the right location. And it’s as difficult to share and compare with others as it is to do in the first place.\n\nDabrowski compared it to GPS. It isn’t much use to the average person if it’s just a readout of code. You need a compass, maps, images, and an interface if you want it to be useful. The genetic engineering equivalent of that metadata, if you can imagine that, is what Synthego wants to provide, and empower would-be researchers in the process.\n\nPerhaps the most obvious benefit of the Synthego platform is its selection of genomes: 100,000 of them, belonging to 9,000 species. So if you’re a small research outfit looking to test the effect of an insecticide on local amphibians, you may not have to use up time and money sequencing them.\n\n“You can design CRISPR for pretty much any organism out there,” Dabrowski said with evident pride. Now, to be clear, a lot of that list is bacteria. I couldn’t find any bears, but I did find dogs.\n\nOnce you specify the gene you’re looking to disable (no adding genes yet — that’s more difficult and more ethically dubious), Synthego generates the “guide” RNA strand needed to take the CRISPR molecules to their targets. Or, if you already have the guide RNA, the platform can double check it for accuracy — and then you can order a few strands right there.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nDabrowski hopes that this vastly simplified interface will allow more people to perform more experiments, and generally increase the amount of work in the space. Part of that would also be from the ability to easily share your design or compare with existing work. Who knows what techniques or discoveries might help build a new vaccine or treatment, if only the data pertaining to these small-scale experiments were more liquid.\n\nOn stage, Dabrowski described the genesis of the company, which started just last year and is already shipping RNA to 35 countries. He and his brother both worked at SpaceX, and both left at the same time in 2009. (Not 2016, as this paragraph read originally — that’s just when Synthego was founded.)\n\n“There was an opportunity to apply a pure engineering, agile software mindset to biotech here,” Dabrowski recalled. (Unfortunately, “Elon wasn’t necessarily the happiest.”)\n\n“There are applications in therapeutics and in biofuels,” he said. “We’re starting to build out all the informatics behind the scenes, and over time we’ll become more of a software company.”\n\nBut for now he and Synthego are definitely focused on biotech: Dabrowski expects “an unprecedented level of understanding” when it comes to biology and genetics over the next decade, and demand for free, accessible tools like this one will go through the roof."}