{"url": "https://techcrunch.com/2025/03/19/a-key-deepmind-robotics-researcher-left-google-and-nvidia-has-already-backed-his-stealth-startup/", "title": "A key DeepMind robotics researcher left Google, and Nvidia has already backed his stealth startup", "authors": ["Charles Rollet", "Senior Reporter", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-19T00:00:00", "text": "A senior research scientist at DeepMind who worked on robotics and AI has left Google to create his own robotics startup, called Generalist AI, and has already obtained investment from Nvidia, TechCrunch has learned.\n\nPete Florence was listed as co-founder and CEO of Generalist AI on a panel at Nvidia’s GTC conference in San Jose yesterday. The panel was for portfolio companies of Nvidia’s VC arm, NVentures.\n\nNVentures has become an especially active venture capital firm since Nvidia has enjoyed skyrocketing financial success in this new age of AI.\n\n“We are largely still in stealth,” Florence told TechCrunch, explaining that the startup’s mission is “to make general-purpose robots a reality.”\n\nFlorence left DeepMind a year ago, per his LinkedIn profile. DeepMind student researcher Kamyar Ghasemipour has also joined Generalist AI as a founding technical staff member, according to Ghasemipour’s LinkedIn.\n\nFlorence joins a string of other DeepMind alums who have founded their own companies like autonomous coding startup Reflection AI, biotech startup Latent Labs, Mistral, and others.\n\nOutside of DeepMind but still within Alphabet, key leaders behind Google’s viral NotebookLM product left to found their own AI startup late last year.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nDeepMind has its own robotics division, which unveiled new AI models for controlling robots this month. Work co-authored by Florence is cited four times in the paper announcing the models.\n\nFlorence said he couldn’t specify exactly what his startup was up to during the GTC panel, but it’s clear it will focus on robotics.\n\n“We are dead set on making robots that can do absolutely anything,” Florence said in response to a question about what the world would look like if his startup was wildly successful.\n\n“So just imagine a world where the marginal cost of physical labor is driven to zero.”\n\nNvidia declined to comment. Google didn’t respond to a request for comment."}