{"url": "https://techcrunch.com/2023/04/18/netflixs-ad-supported-plan-gets-support-for-1080p-quality-and-two-concurrent-streams/", "title": "Netflix’s ad-supported plan gets support for 1080p quality and two concurrent streams", "authors": ["Ivan Mehta", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-04-18T00:00:00", "text": "Netflix is upgrading its ad-supported plan in terms of streaming quality and concurrent streams. The company said users subscribed to this plan will be able to see content in 1080p resolution (up from 720p) with support for two concurrent streams.\n\nThese benefits are rolling out to users in Canada and Spain today. People using the ad-supported plans in other 10 markets — including the U.S. — will get these features this month.\n\n“We believe these enhancements will make our offering even more attractive to a broader set of consumers and further strengthen engagement for existing and new subscribers to the ads plan,” the company said in its letter to investors.\n\nNetflix launched the ad-supported plan last November at $6.99 per month and it’s already seeing positive results.\n\nThe streaming company said that in the U.S., it’s earning more average revenue per membership through the ad-supported plan than the standard plan, which costs $15.99 per month.\n\nDuring the earnings call, Netflix’s CFO Spencer Neumann said that the company has rolled out new content to the ad-supported tier in the past quarter, bringing it to “95% plus” parity with other higher-priced plans.\n\nHe mentioned that the ad-supported plan is also showing beneficial results for the business.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“This [economics of the ad-supported plan] is all at a level that we believe is not just better for our members with a lower priced option but better for our business and we think we could do it with and are doing it in a way that’s, I would say, without being overly specific, think of it as like 50% or more incremental profit contribution to the business,” he said.\n\nAccording to Insider Intelligence, Netflix will bring in $770 million in ad revenues this year, and this number will grow to $1.9 billion in 2024.\n\nThe firm expects Netflix to have 170.6 million users (0.5% dip year-on-year) in the U.S. and 682.7 million users globally (5.6% jump year-on-year) by year-end.\n\nThe company also unveiled plans of rolling out restrictions on password sharing more broadly this summer. The company registered $8.16 billion in revenue for Q1 2023 — slightly lower than analyst expectations of $8.18 billion."}