{"url": "https://techcrunch.com/podcast/campus-wants-to-crack-the-code-to-get-community-college-to-work-for-everyone/", "title": "Campus wants to crack the code to get community college to work for everyone", "authors": ["Rebecca Szkutak", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": null, "text": "Community colleges aren’t immune from the current reckoning higher education is facing. Student enrollment is declining while institutions keep raising tuition prices, which can prevent students from finishing their programs. Clearly, it’s time for the industry to try something new.\n\nTade Oyerinde thinks startups can help. Oyerinde is the founder and CEO at Campus, a venture-backed, fully accredited, online community college. Campus pays its professors more than other institutions while students pay low tuition and receive laptops and mentorship. Oyerinde said this system helps attract great professors while keeping costs to students low — many go for free thanks to grant funding — creating a better environment for both sides to succeed.\n\nOyerinde said on a recent episode of TechCrunch’s Found podcast that he got the idea for Campus while working on an earlier iteration of the startup, CampusWire, which created online learning software. Oyerinde was meeting directly with professors to sell his software when he learned how little these professors were paid, and how many of them taught at multiple schools to make ends meet. He was surprised to learn that many of them also worked at community colleges. Once he did some research into the current state of community colleges, the next iteration for CampusWire began to click.\n\n“I thought what if we took our software, ran a community college way more efficiently using software, kept our tuition super low so that you could afford to pay your tuition completely with these federal grants and state grants without having to take on a debt,” Oyerinde said. “Knock out the first few years of college learning from these amazing professors from top schools. So that was the idea.”\n\nCampus was born. Oyerinde then talked about what happened next. From finding and acquiring an already accredited community college, deciding which subjects it made sense to focus on first and how to get students on board.\n\n“Originally, it was extremely hard [to get students to enroll], because I think everyone thought we were a scam,” Oyerinde said. “There’s been a lot of bad actors in the for-profit higher education space. I think now that we have graduates, and we’ve had more and more students come through the program, I think it’s a lot easier to acquire students and to get them involved. So that I think just gets easier and easier the more good outcomes we have over time.”\n\nOyerinde also talked about how he got interested in education in the first place as he’s been building startups in the edtech space since he was in college himself. He talked about how despite coming from a long line of educators both in the U.S. and Nigeria, he still managed to fall into this sector largely on accident.\n\nHe also talked about what it has been like to both hire and build a culture around a workforce made up of both operators from tech startups and folks from academia — two wildly different industries.\n\nThe company recently raised a $23 million Series A extension round and Oyerinde said Campus is ready to expand its course offerings and footprint.\n\n“I think what I would love to see is over the next five years, anybody in America can come to Campus, and eventually the world, and get that support that they need to build the life that they want,” Oyerinde said."}