{"url": "https://techcrunch.com/2025/01/15/meta-adds-200-megawatts-of-solar-to-its-12-gigawatt-renewable-portfolio/", "title": "Meta adds 200 megawatts of solar to its 12 gigawatt renewable portfolio", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-01-15T00:00:00", "text": "Meta this week announced that it was buying 200 megawatts of solar energy from multinational electric utility Engie, adding to the tech firm’s considerable 12-plus gigawatts renewable power portfolio.\n\nThe news comes as tech companies ramp up their AI ambitions, adding data centers at a breakneck pace and boosting demand for power to the point that half of all new AI servers could be underpowered by 2027.\n\nMeta has been steadily adding new capacity, announcing in December that it would be building a 2-gigawatt data center in Louisiana, though that campus reportedly will be powered by natural gas. The new solar farm is a short distance from one of Meta’s existing data centers in Texas.\n\nTech companies have been cozying up to nuclear startups, announcing a flurry of deals late last year. Google and Kairos have teamed up to deploy 500 megawatts of small modular nuclear reactors starting in 2030. Amazon has signed a deal with X-Energy for 300 megawatts that will come online in the early 2030s.\n\nMeta, not to be left out, announced in December that it was seeking proposals from nuclear power developers for 1 to 4 gigawatts of power by the early 2030s as well. Companies have until February 7 to submit plans.\n\nBut even as nuclear has grabbed plenty of headlines, renewable power sources have continued to quietly add capacity, allowing companies like Meta to expand their computing power today. Google is backing a $20 billion renewable deal with Intersect Power and TPG Rise, and Microsoft is working with Acadia Infrastructure Capital on a $9 billion deal.\n\nThe speed at which renewables can be deployed will be one of the largest challenges facing nuclear startups. Meta’s new solar farm, for example, is expected to come online in 2025."}