{"url": "https://techcrunch.com/2023/02/13/cleantech-qotto-embarks-on-growth-plan-backed-by-8m-funding/", "title": "Cleantech Qotto embarks on growth plan backed by $8M funding", "authors": ["Annie Njanja", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-02-13T00:00:00", "text": "Qotto, a solar kits provider with operations in Burkina Faso and Benin, has raised $8 million in a Series A equity-debt round led by the IBL group, a billion-dollar conglomerate headquartered in Mauritius with business interests in a number of sectors including energy, financial services, logistics, distribution and engineering.\n\nThe Off-Grid Energy Access Fund (FEI-OGEF), Cordaid and Qotto’s existing investors also participated in the round.\n\nQotto told TechCrunch it plans to scale in existing markets, and expand to Ivory Coast where it is set to begin operations by next month.\n\nFounded in 2016, Qotto designs and distributes standalone solar kits and lanterns to individuals residing in the least electrified regions of Africa. Through a pay-to-own model , it avails its products to individuals in sub-Saharan Africa that are off-grid owing to underdeveloped national power grids.\n\n“For Ivory Coast, due to its consistent pace of development relative to the broader West Africa region, and after having tested and optimized operations and services in Benin and Burkina Faso, Qotto is well prepared for a market entry. Moreover, the customers who have been able to test the Qotto products in the country have expressed a need and desire to see Qotto enter the Ivory Coast market,” said Qotto co-founder and president, Jean-Baptiste Lenoir.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nQotto says IBL is drawing its roadmap for East Africa expansion too, after signing a partnership and agreeing to offer off-grid solutions in the region. The expansion, to take place by September this year, will happen alongside that of IBL, which is planning “to strengthen its position in East Africa and to develop its renewable energies exposure.”\n\n“Together, we see a great opportunity for the essential services and large Solar Home Systems offerings provided by Qotto,” said Lenoir.\n\nThe growth bid follows the planned introduction of new products in the market, including financial services and internet access hotspots, as Qotto evolves into an all-rounded essential services operator.\n\n“Our edge is that our presence in rural areas allows us to understand the customers and their needs so that we can propose innovative products based on our technical platform,” he said.\n\nThe planned financial services include micro-insurance, micro-credit and micro-savings products, designed in collaboration with partners such as SUNU, a large insurer in West Africa. Qotto said it has already sold thousands of life insurance contracts.\n\nThe internet hotspots will be located in high foot traffic areas like shops, restaurants or bars.\n\n“In sub-Saharan Africa, 650 million people do not have access to electricity, 550 million do not have access to the internet and 800 million do not have access to financial services. Many of these customers are overlapping in their needs for off-grid solutions, connectivity and financial services,” said Lenoir.\n\n“Our model helps to solve these critical issues under a single solution — which we call ‘essential services,’ backed by our proprietary technology stack. In addition, we are aligned with the SDGs to serve customers and improve impact indicators in our markets,” he said.\n\nRenewable energy solutions by companies like Qotto are bridging the energy access gap in the least electrified countries like South Sudan, Burundi, Chad, Malawi, Burkina Faso, Madagascar and Tanzania, all located in sub-Saharan Africa, which accounts for 75% of the world’s population with no access electricity.\n\nQotto says its revenue has grown 50% year on year, and that it had 11,000 active customers by the end of last year, which it plans to more than double by the close of this year following its growth plans.\n\n."}