{"url": "https://techcrunch.com/2024/05/30/yola-fresh-a-grubmarket-for-morocco-digs-up-7m-to-connect-farmers-with-food-sellers/", "title": "YoLa Fresh, a GrubMarket for Morocco, digs up $7M to connect farmers with food sellers", "authors": ["Tage Kene-Okafor", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-05-30T00:00:00", "text": "The fresh produce supply chain in Africa and emerging markets is faced with a daily list of cascading challenges. They include everything from environmental and labor issues to logistical problems, food waste, and poor demand-supply synchronization. These various issues affect stakeholders differently: Farmers struggle with sales while retailers struggle to negotiate effectively.\n\nSeveral agtech startups have tried to solve these issues by taking control of the fresh produce supply chain, bypassing intermediaries, and directly connecting retailers and farmers; Frubana in Latin America, Meicai in China, and Waycool in India are a few examples. YoLa Fresh is one such startup that directly connects smallholder farmers with traditional retailers of fruits and vegetables, starting with Morocco.\n\nCo-founders and co-CEOs Youssef Mamou and Larbi Alaoui Belrhiti told TechCrunch that they drew inspiration from those similar startups and sought advice from their founders to launch YoLa Fresh in early 2023. Now the Casablanca-based agtech startup works with over 1,000 retailers across the North African country and records up to $1 million in monthly gross merchandise volume (GMV). Such growth shown in less than a year of launch has fetched the company $7 million in pre-Series A funding.\n\nThe investment is significant for any African startup at this stage, even more so one from Morocco, which recorded $93 million in total value of VC deals last year, according to a Partech report. The country, home to an emerging tech scene, has had a few sizable funding rounds over the years: YC-backed B2B e-commerce platform Chari and transport management software provider Freterium come to mind. Like these other companies, YoLaFresh’s lure to investors extends beyond addressing a prevalent issue in emerging markets to include the impressive backgrounds of its founders.\n\nFounders with experience operating at scale in the region\n\nBefore launching YoLa Fresh, Alaoui and Mamou had already established impressive careers in the country’s tech scene. Alaoui founded and sold the online classifieds site Avito before serving as CEO of Jumia Morocco; Mamou was the general manager of Uber’s Careem and led 212 Founders, an early-stage incubator and VC in Morocco.\n\n“I come from an agricultural family. So, it made perfect sense to me to build something impactful that could be internationalized, exported, and launched in different countries,” expressed Mamou, narrating why he joined Alaoui to build YoLa Fresh after the ex-Jumia executive approached him with the idea in late 2022.\n\nAlaoui had intended to start a small agricultural venture on the side, but he soon recognized the significant challenges within Morocco’s fragmented agricultural supply chain, a realization that led him to address this issue rather than pursue his initial plan. Collaborating with Mamou, the duo conducted extensive research on startups that had tackled similar challenges in countries like India, Brazil and Malaysia. After studying their models and conversing with other founders, it became evident that they could use technology to digitize Morocco’s fresh produce supply chain.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“When we looked at the Moroccan market, we found it to be similar in complexity to other emerging markets,” Alaoui said. “Smallholder farmers represent about 80% of agriculture, and traditional retail accounts for about 90 to 95% of distribution. Very few people buy their fresh produce in supermarkets. The supply chain here is also very fragmented, with many intermediaries, which is what we are aiming to solve.”\n\nDespite its relatively small size within the region, Morocco boasts a robust agricultural sector, contributing significantly to its GDP at 15%. Additionally, the nation exhibits a deep-rooted local consumption base, with estimates suggesting that between $5 billion and $6 billion is spent annually within the traditional trade sector alone. That’s an addressable market that mirrors other African countries where smallholder farmers and traditional retailers face similar issues with multiple intermediaries involved in the supply chain, typically spanning from two to seven steps.\n\nFixing supply chain issues between farmers and retailers\n\nAlthough YoLa Fresh plans to expand into these other markets, Morocco is the priority. By connecting farmers with retailers and food service companies, YoLa Fresh, which tracks produce from farm to retail, hopes to eliminate intermediaries in the food supply chain. This would allow retailers to pay less for produce and ensure farmers receive more profit quickly, thereby syncing supply and demand in a way that minimizes waste. In addition, YoLa Fresh uses data from both stakeholders to provide them visibility into harvests and access to financing.\n\n“Our solution offers farmers the convenience of placing their orders by midnight for delivery the next day, typically between 7 and 9 a.m., just six to seven hours later,” Mamou remarked. “Not only do we guarantee better quality produce at the same price as the wholesale market, but our daily transactions pave the way for potential financing opportunities once we partner with financial institutions. While we’ve seen reduced wastage, ranging from 25 to 40% of crop production, our wastage rate is around 6 to 7%, and we aim to further decrease it to three percent by 2026.”\n\nYoLa Fresh currently moves over 1,200 tonnes monthly to customers ranging from fruit and vegetable sellers to FMCG mom-and-pop shops. The agritech claims to register a customer retention rate of 85% while averaging four transactions weekly per retailer, indicating strong customer loyalty that will help the company hit a positive contribution margin by the end of 2024 or Q1 2025.\n\nMamou said the year-old company expects to execute this by doubling down on what already works: ensuring cash on delivery with traditional retailers, working closely with farmers to capture more margins (it has a take rate of over 20%), and focusing intensely on unit economics. YoLa Fresh is projecting to reach $40 million to $50 million in annualized top line by 2026, the same year it’ll gear up for expansion outside Morocco. Competition in other sub-Saharan African markets includes Vendease and Complete Farmer.\n\nOmar Laalej, the managing director at Al Mada Ventures, which spearheaded the funding round, expressed confidence in the company’s ability to deliver tangible benefits to its customers in Morocco’s evolving agricultural sector. He emphasized the significance of YoLaFresh’s position in offering value to its customers, not only in the North African country but also potentially across Africa as the continent’s agricultural industry undergoes a digital supply chain transformation.\n\n“The agri sector is a major contributor to economic growth and employment in our region and stands to gain significantly from tech solutions. YoLa Fresh is uniquely positioned to become a leader in that transformation in Morocco and beyond,” added Tarek Assaad, managing partner at Algebra Ventures, one of the investors in the round. Other backers include E3 Capital, Janngo Capital, and FMO, the Dutch Entrepreneurial Development Bank."}