{"url": "https://techcrunch.com/2021/11/25/why-soundhound-is-valued-at-5-shazams/", "title": "Why SoundHound is valued at 5 Shazams", "authors": ["Anna Heim", "Freelance Reporter", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block"], "publication_date": "2021-11-25T00:00:00", "text": "Voice AI company SoundHound is set to go public on the Nasdaq via a SPAC transaction at a nearly $2.1 billion valuation in early 2022, blank check company Archimedes and its target announced.\n\nThe last time you heard SoundHound’s name might have been several years ago when it was considered a lesser-known Shazam competitor. Now it’s worth 5.25x what Apple paid for the leading music recognition service – some $400 million, in a transaction that closed in the fall of 2018. That was five years after TechCrunch reported on SoundHound‘s “struggles to exit Shazam’s shadow,” despite boasting more than 175 million users.\n\nSo what happened that would make SoundHound now significantly more valuable than its British counterpart?\n\nThe Exchange explores startups, markets and money.\n\nRead it every morning on TechCrunch+ or get The Exchange newsletter every Saturday.\n\nWell, some of the discrepancy might be due to Shazam’s somewhat bumpy trajectory; after all, it was valued at $1.02 million post money in its 2015 fundraise. But it’s SoundHound we are looking at today, because if its SPAC deck is to be believed, it seems it is just doing magic in plain sight.\n\nTo find out more, let’s have a closer look at SoundHound’s history, and dig into the case it is making to argue for its double unicorn valuation.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nFrom tune identifier to voice AI\n\nSoundHound was founded as Melodis Corp. in 2005 by Iranian-Canadian computer scientist and entrepreneur Keyvan Mohajer. In its early days, it was mostly known for a Shazam-like tune identifier initially known as Midomi, and whose app was later rebranded (the web version hasn’t been renamed). It still exists, but let’s cut to the chase: Music recognition is no longer SoundHound’s core business.\n\n“In 12 months’ time, the association of Shazam and SoundHound will be much wider apart – they’ll be seen as very different companies,” then VP of Sales & Marketing Katie McMahon told TechCrunch’s Sarah Perez in 2013. It may have taken longer, as SoundHound simply went off the radar for the general public, perhaps except for its voice assistant, Hound. Still, anyone looking at its SPAC deck will acknowledge that the company now has little to do with Apple’s acquisition.\n\nNowadays, SoundHound introduces itself primarily as “a leading innovator of conversational intelligence” that “offers an independent voice AI platform that enables businesses across industries to deliver best-in-class conversational experiences to their customers.”\n\nHowever, this is arguably only possible because it spent 15 years developing voice-related technology, with innovation as a focus. For instance, Midomi didn’t only work with recorded tunes; it would let you hum a song and still come up with a match. As a result, SoundHound now prides itself in its 227 patents (“81 granted, 146 pending”).\n\nBut innovation without revenue wouldn’t warrant such a valuation. If Archimedes’ promoters think SoundHound is worth $2.1 billion, it is because it has found ways to monetize its technology. As its press release notes, SoundHound “powers the voice experience in leading global brands including Hyundai, Mercedes-Benz, Pandora, Mastercard, Deutsche Telekom, Snap, VIZIO, KIA, and Stellantis, among others.”\n\nFuture prospects\n\nThere are quite a lot of words and charts in SoundHound’s presentation, including some that require a temporary suspension of disbelief. Would it be a SPAC deck if not? But if we had to keep just one magic word, it would be “independent.” SoundHound isn’t Apple, Amazon, Microsoft or Google – its technology is its own, and it is precisely where it adds a lot of value for its partners.\n\nIn case “custom voice assistants powered by Houndify” sounds a bit abstract, here are some of the use cases, per the company’s press release: “Using SoundHound, businesses can voice-enable their products so consumers can say things like, “Turn off the air conditioning and lower the windows,” while in their cars, “Find romantic comedies released in the last year,” while streaming on their TV, and even place food orders from their devices or at a drive-through.”\n\nThis is where the monetization comes in. SoundHound helps its clients create better customer experiences and make more money, which is worth money, too, in the form of royalties, subscription income and ad-based monetization. But how much? This is where there is quite a substantial leap of faith: SoundHound estimates its net revenue around $20 million, but projects that this number will amount to $1.164 billion in 2026.\n\nColor us skeptical, but SoundHound does have big names that already backed its status as a unicorn and bought into its projections. Over the years, its cap table has become increasingly strategic, as shown by its $100 million round in May 2018, which entirely came from industry-tied investors: Tencent Holdings Limited, Daimler AG, Hyundai Motor Company, Midea Group, and Orange S.A.\n\nAs for its SPAC, the deal includes $111 million from a fully committed common equity PIPE which is “anchored by Oracle, Qatar First Bank, Koch Industries, and MKaNN Ventures as well as investments by Cota Capital, VIZIO, HTC, FIH Mobile (a Foxconn Technology Group company), Structural Capital, Provco Group, Sompo, Pejman Nozad, and others.” Now a founding manager partner at Pear VC, Nozad was one of SoundHound’s early investors.\n\nAll of this also goes to show that SoundHound isn’t just betting on the car industry; instead, its much broader tagline insists on “connecting people with brands through conversational technology.” And it does it with an element of AI, which ties it to opportunities that go well beyond our initial Shazam comparison.\n\nIndeed, news broke last April that Microsoft was acquiring Nuance Communications for the whopping sum of $19.7 billion – its second-largest acquisition to date after LinkedIn. At the time, our sources told The Exchange to expect an even hotter AI venture capital market in the mega deal’s wake, and we are not surprised to see this extend to exits – especially when it involves a company at the convergence of voice, AI and Internet of Things.\n\nPer SoundHound’s SPAC deck, its total addressable market could be worth more than $160 billion. It infers this from various data points, including projections that there will be 75 billion connected devices by 2025. There may well be, based on the current growth: Cisco expects 27.1 billion networked devices this year, up from 17.1 billion in 2016.\n\nIn addition, the presentation mentions Juniper Research estimates that consumers will interact with voice assistants on over 8.4 billion devices by 2024. How that converts into revenue remains to be seen, but the bullishness of SoundHound and of its backers is now easier to understand.\n\nWith that in mind, we expect the transaction to complete as planned in Q1 2022; but of course, we’ll be keeping an eye on SoundHound’s proposed ticker, SOUN – we are curious to see if the markets agree with that valuation."}