{"url": "https://techcrunch.com/2021/09/16/african-genomics-startup-54gene-raises-25m-to-expand-precision-medicine-capabilities/", "title": "African genomics startup 54gene raises $25M to expand precision medicine capabilities", "authors": ["Tage Kene-Okafor", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-09-16T00:00:00", "text": "Less than 3% of genetic material used in global pharmaceutical research is from Africa. The staggering gap is quite surprising because Africans and people of African descent are reported to be more genetically diverse than any other population.\n\nSince launching in 2019, African genomics startup 54gene has been at the forefront of bridging this divide in the global genomics market. Today, the company has secured $25 million in Series B funding to bolster its efforts.\n\nThis round comes a year after the company, founded by Dr Abasi Ene-Obong, raised $15 million in Series A and two years after closing a $4.5 million seed round.\n\nIn total, 54gene has raised more than $45 million since its inception.\n\nWith the world’s analyzed genomes coming mostly from anywhere that isn’t Africa, the continent remains a valuable source of new genetic information for health and drug discovery research.\n\nThis is where 54gene’s work is relevant. The company conducts and leverages this research to ensure Africans are recipients of upcoming drug and medical discoveries.\n\nLast year when we covered the company, CEO Ene-Obong disclosed that for 54gene to conduct this research, it recruits voluntary participants who donate genetic samples via swab or blood tests.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIt still very much works this way. However, instead of depending on third-party health centres like hospitals and sending the samples abroad for analysis, 54gene launched its own genetics sequencing and microarray lab in Lagos last September. The company did this in partnership with U.S.-based biotech company Illumina.\n\nSpeaking with TechCrunch, Ene-Obong says in addition to the genotyping capabilities offered, the lab also provides whole-genome sequencing (WGS) and whole-exome sequencing (WES).\n\nNot to bore you with the jargon, but here’s why this is important. Genotyping tends to show only 0.02% of an individual’s DNA; however, WGS can show almost 100% of the same person’s DNA.\n\nFor WES, although it represents only 1.5% of the human genome, it shows approximately 85% of known disease-related variants.\n\nWith these three in place, the company can advance genomics research and expand its ability to help scientists and researchers in Africa.\n\nUnlike fintech and other fast-moving sectors like e-commerce, innovation in health tech takes some time to take shape finally. 54gene is one of the few startups in the sector and even in Africa to have moved from seed stage to Series B in less than two years.\n\nIt’s this sort of frightening speed that makes one wonder what the company is doing right. I ask the CEO whether the company is indeed seeing significant progress in advancing African genomics; he answers in the affirmative.\n\n“Though the arc of conducting early research through drug approval can be long in biotech, we have taken the approach to building the backbone that is needed for short-term successes to long-term gains that provide better healthcare delivery and treatment outcomes from diseases,” he added.\n\nIn addition to setting its first lab, the CEO says the company is increasing its biobanking capacity by 5x and counts that as a major success.\n\nDuring its last raise, 54gene had a biobank capacity for 60,000 samples. If Ene-Obong’s comments are anything to go by, the two-year-old company currently has a biobank capacity for 300,000 samples, close to its longer-term aim to manage up to 500,000.\n\nAnother one is the recruitment and training of talent to generate and process data needed to produce insights for the company’s drug discovery efforts.\n\nNigeria has a dearth of experienced clinicians and with the remaining few leaving in droves, it is not hard to see why it is a win for the company. Knowing this, 54gene plans to use part of the new funding to recruit and train more professionals.\n\nOther use of funding will be to expand its capabilities in sequencing, target identification and validation, and precision medicine clinical trials. Also of great importance is its expansion across the African continent.\n\n54gene will have to sign off partnerships to aid this expansion. A recent partnership was made between the company and the Tanzania Human Genetics Organization and Ene-Obong says 54gene is in varying stages of conversations with more partners. However, he was tight-lipped on who they might be.\n\n“We are excited about our Africa-first approach which will see us expand to countries within East and West Africa in the coming year,” he added.\n\n54gene made some hires to this end: Michelle Ephraim, Colm O’Dushlaine, Peter Fekkes, Teresia Bost and Jude Uzonwanne — all of whom have decades of experience working with companies like Leica Biosystems, Regeneron Genetic Center, Novartis, Celgene and the Bill and Melinda Gates Foundation.\n\nPan-African venture capital firm Cathay AfricInvest Innovation Fund led this round. Lead investor from the company’s Series A funding, Adjuvant Capital, invested once again with participation from other VCs including KdT Ventures, Plexo Capital, Endeavor Catalyst and Ingressive Capital."}