{"url": "https://techcrunch.com/2023/09/13/spotifys-new-showcase-tool-lets-artists-pay-to-promote-their-music-in-the-home-feed/", "title": "Spotify’s new Showcase tool lets artists pay to promote their music in the Home feed", "authors": ["Sarah Perez", "Consumer News Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-09-13T00:00:00", "text": "Spotify this week launched a new tool called Showcase that allows artists to promote their work directly in the streaming app’s revamped Home feed introduced earlier this year. With Showcase, artists can create a mobile card that they can use to introduce their music, including new and catalog releases, which then appears as a sponsored recommendation on listeners’ mobile Home Screen.\n\nThis Home Screen is the most prominent position to advertise in Spotify’s app, as the company says it’s the most-visited place on Spotify and billions of streams originate from it every day. On average, users who see a Showcase promotion are six times more likely to stream the promoted release, the company claims.\n\nArtists can customize their cards with their own headlines, like “new music, recently released, release anniversary, getting buzz,” and more, Spotify suggests, so users know why the music is being promoted. The banner will appear at the top of Spotify’s Home.\n\nThe new feature was announced earlier this year at Spotify’s Stream On event in LA, alongside a range of other growth and discovery tools for artists, like the full-screen recommendations known as “Marquee” and a new “Discovery Mode” tool that allows artists and their teams to identify songs they want prioritized on the streaming service.\n\nThe company says that Showcase is opening up to artists and their teams with U.S.-based billing with 1,000 or more monthly streams in the last 28 days in at least one of the target markets. The feature will become broadly available to U.S. artists over the next few weeks in the Spotify for Artists dashboard.\n\nBy default, Spotify says it will show the campaign to those who are likely to stream the release — a broad audience. However, artists can customize their campaigns to reach certain types of listeners, ranging from their most dedicated and active listeners (“super listeners”) to lighter listeners. According to Spotify’s documentation, the minimum budget for campaigns is $100 and campaigns will run for 10 days or until the budget gets spent, whichever comes first. The price for campaigns can change based on factors like targeted audience or market.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We’re constantly talking with artists and their teams to better understand how we can help them grow their fan base more effectively,” explained Phoebe Deards, product marketing manager for Spotify for Artists, in an announcement.\n\n“While playlist pitching is an opportunity for artists to find new audiences and Marquee helps them make a splash for their new releases, today there are more moments than ever where promotion can drive impact. Artists want more ways to capture listener interest and drive engagement with more of their music. Showcase gives them the ability to do just that: now artists can amplify a new release, give their catalog an encore, turn viral buzz into long-term fandom, and more – right at the moments that matter most and on the most visited place on Spotify: Home,” she added."}