{"url": "https://techcrunch.com/2017/05/09/the-real-promise-of-regulatory-technology/", "title": "The real promise of regulatory technology", "authors": ["Kabir Kumar", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2017-05-09T00:00:00", "text": "The future of banking is algorithmic. Bringing together big data and predictive analytics is already enabling financial service providers to make better real-time decisions on loans and other products, with a more flexible, customer-centric user experience.\n\nBut if banking can be algorithmic, what about financial regulation and supervision?\n\nFinancial authorities could someday run digitally, but getting there is not going to be easy. In many countries, regulators today often use fax machines, let alone cloud-based software and analytics. And yet, the future of the financial sector depends on modernizing regulatory authorities.\n\nThe fallout from the 2008 financial crisis has led to regulators, especially in more developed economies, asking for more data from providers and more scrutiny of that data. Developed markets have seen a 492 percent increase in regulatory changes between 2008 and 2015, especially in anti-money laundering and consumer protection. It was famously reported that by the end of 2014, Citi had added a total of 30,000 people just working on regulatory compliance.\n\nAt the same time, the rapid growth of fintech has pressed regulators to consider new tools to regulate faster and quickly supervise new financial services solutions. India alone has seen 10x growth in digital lenders in the last three years and the Reserve Bank of India licensed close to 20 new entities in the last year — expanding the banking supply for the first time in decades.\n\nThe nascent regulatory technology, or regtech sector, is already aiming to help financial firms. Digitizing paper reporting processes alone could save billions in compliance costs. The global cost to the financial services industry of compliance with regulatory authorities is estimated at $100 billion per year — a number that’s risen drastically since the 2008 financial crisis. For many financial firms, compliance is 20 percent of their operational budget.\n\nSome of those same technologies can also help regulators. In fact, regtech is about more than just streamlining compliance for financial firms. That is the lucrative low-hanging fruit. The real potential of regtech is systems change: a complete re-architecting of how regulation works.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe future of regulation\n\nRedesigning regulatory processes requires working with both providers and regulators. Those of us working in fintech and financial inclusion see a future of regulatory supervision and policymaking that uses technology to make faster, targeted, more consumer-focused risk-based decisions. Technologies widely available today — including secure messaging, cloud-based analytics and software-as-a-service — will help authorities meet their expanding missions and promote innovation in fintech.\n\nThat’s why Omidyar Network is investing in regtech startups and accelerators, as well as convening leading financial authorities to showcase the benefits of this approach.\n\nRecently, we joined forces with other funders and BFA (Bankable Frontiers Associates) to support the RegTech for Regulators Accelerator (R2A): an accelerator for regulators. After publicly launching in March, R2A is now partnering with a select set of financial authorities to pioneer the next generation of regulatory tools.\n\nWith R2A, we’re bringing together software developers and tech startups to build relationships with financial authorities and develop a pipeline of proposed regtech solutions. The size of the market opportunity is exciting. According to one estimate, the global total spent annually on regulatory compliance technology will rise from $50 billion in 2015 to $118 billion in 2020.\n\nThe technology revolution in financial regulation has barely begun. As the regtech market develops, governments, providers and consumers all stand to benefit. For anyone interested in financial inclusion, giving regulators the tools to keep pace with market growth and innovation is just as important as backing new fintech startups. Modernizing financial supervision will make it easier for new, user-friendly solutions to reach consumers faster, and more importantly, to flourish."}