{"url": "https://techcrunch.com/2023/11/09/5-cant-miss-strategies-to-break-through-in-a-crowded-market/", "title": "5 can’t-miss strategies to break through in a crowded market", "authors": ["Josh Inglis", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-11-09T00:00:00", "text": "In June, TechCrunch highlighted an under-the-radar boom happening in HR tech: With the tenacity of remote work, more and more business leaders are seeking out tech to manage remote teams — and HR tech startups are rising to the challenge.\n\nThe good news (per a GP Bullhound report cited in that piece): HR tech startups are doing better at fundraising than startups in other industries. But this also means the space is getting – and will continue to get – more crowded.\n\nSo how are the most successful HR tech startups breaking through the noise? And what can startups in any industry learn from them? For answers, I spoke to a dozen founders and marketing leaders at this year’s HR Tech Conference. In our conversations, the following five themes came up over and over.\n\nBe bold: “Different is better than better”\n\nGal Fontyn, VP of global marketing at people enablement platform Leapsome, cited Sally Hogshead when asked how to stand out from the crowd: “Different is better than better,” he said. He noted that in the HR tech space, “a lot of companies use similar brand visuals and . . . the same kind of jargon that doesn’t mean anything.”\n\nHe wasn’t the only one. Jake Sorofman, CMO of people analytics platform Visier, said, “Too often, marketing suffers from compromise, defaulting to directions that are safe, expected, and conventional.” The impact? A dilutive effect on marketing investments.\n\n“You need to have the courage to get a bit ahead of your skis from time to time,” he added.\n\nOf course, “be different” is easier said than done. Even an article like this aims to help readers learn from — and imitate — what works. Still, that the imperative to differentiate came up so often can serve as validation for marketing leads in need of evidence to support their most exciting ideas. Go ahead and send your CEO this link. And then get to work on that quirky LinkedIn campaign you’ve been dying to try.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBuild relationships: “We’re not trying to get someone to sign a contract”\n\nBold may be good, but the people I spoke to by no means suggested a big splash was sufficient to win over prospective customers. Quite the opposite, in fact.\n\n“You’re not going to meet pushy salespeople at Immediate,” said Matt Pierce, founder and CEO of the company, which offers responsible earned wage access as a voluntary benefit. “We’re not trying to get someone to sign a contract at a first meeting. We’re trying to build a relationship.”\n\nThis was a theme we heard over and over.\n\nAccording to John Schneider, CMO of intelligent performance management platform Betterworks, the role of HR in enterprises is becoming more strategic. This means that selling effectively requires a less-aggressive approach.\n\n“We’re talking about building a relationship, not a transaction,” he said. He also noted that his team tries “to have a conversation with [prospects] on a sustained basis” — an effort supported in large part by content marketing. “That creates a relationship where they can trust us and be confident that what we’re telling them is useful and valuable.”\n\nWhen it comes to selling to enterprise clients in particular, “building relationships is the most important thing we can do.” That’s from Amy DeCicco, marketing vice president at Retrain.ai, which offers AI-powered talent intelligence. Why? Because enterprise sales cycles are long; to stay in touch with a potential customer for that amount of time, you need to have a relationship with them. And that means you have to intentionally build the relationship.\n\nHow are HR tech marketing leaders doing that? Glad you asked.\n\nOffer value from day one: From surveys and tools to donuts and chargers\n\nRight off the bat, it’s important to note that the starting point for the vendor-prospect relationship is not neutral. The vendor is trying to sell something, and the potential buyer knows that.\n\nAs Richard Mendis, CMO of AI interview analysis platform HireLogic, put it: “[HR buyers] should be skeptical of vendor claims.” It would be silly, in fact, for vendors to pretend otherwise. To overcome that skepticism, he noted, vendors have to charge out of the gate with value — in HireLogic’s case, a no-cost, no-risk pilot.\n\nSome other examples of how HR tech startups are providing value from the first interaction, including on the trade show floor:\n\nTemplates and frameworks helpful for the work HR professionals are doing (Leapsome).\n\nA sandbox where customers can try the product, plus a 90-day opt-out period when new customers sign (Praisidio).\n\nA public-facing tool that lets prospects test-drive the system (Retrain.ai).\n\nOriginal research that speaks to prospects’ primary pain point (Applaud).\n\nAnd what if your first interaction with prospects isn’t online? That was the case for Liv Anderman, marketing VP of AI talent acquisition and management platform Findem, when I met her at HR Tech. “We’ve got charging stations, we’ve got lounge spaces for meaningful conversations, we’ve got donuts and cocktails — instead of swag people won’t get any value from.” And indeed, the Findem booth was a hub of activity every time I went by.\n\nThe “right” offering? Anything that’s genuinely helpful and creates high-quality and meaningful experiences for where a person is in their relationship with a brand. In the early stages, that often means you have to . . .\n\nProvide access to existing customers: “No one wants to be the guinea pig”\n\nCase studies are table stakes in B2B marketing, and for good reason: They provide social proof.\n\nAmong the marketers we spoke to, though, the standard case study was just a jumping-off point. Take Praisidio founder Ken Klein, who noted that they have “a significant number of successful, referenceable customers who can vouch for the value we provide.” As in, they provide prospects direct access to current customers. That is what a good relationship looks like.\n\nRunae Lee, head of partnerships at Finch, a unified API for employment data, emphasized that they strive for case studies that are at least co-branded and often hosted by a partner or customer. “It lends additional credence and helps build trust via external validation,” he said.\n\nPerhaps the boldest strategy? Matt Pierce of Immediate says, “We’ll say, ‘Hey, sit down and speak with some of our customers . . . they’ll tell you the good, the bad, and the ugly. But it’s going to be mostly good!’” Again, think of how strong your relationship has to be for that to work.\n\nAnd when telling customer stories, don’t lose sight of what really matters: Impact. Simon Foley, head of sales and business operations at employee experience platform Welliba, recommended crafting stories so they spotlight the “meaningful impact” the product had on the customer.\n\nFontyn had a similar take, noting that Leapsome aims to connect the right customer references to the right buyers. “No one wants to be the guinea pig,” he said.\n\nEducate: “The literacy for what we do isn’t there yet”\n\nFor some startups, however, case studies aren’t enough to get great-fit customers on board. For those offering products and services that are unfamiliar to their target audiences, education has to be front and center.\n\nAs Lee put it, “The literacy for what we do isn’t there yet.” So he and the Finch team focus on educating their audiences about how unified APIs can make their lives better as a parallel path to traditional lead gen.\n\nIvan Harding, co-founder and CEO of employee experience platform Applaud, agreed. “We do a lot of educational content,” he noted. “And then hopefully [visitors] will follow on to do some discovery around our website.”\n\nThose offering AI-powered tools are acutely feeling the need for prospect education, especially in building trust. DeCicco said Retrain.ai tackles the problem head-on. “We built a responsible HR forum,” she said. “We brought together the EEOC [Equal Employment Opportunity Commission] commissioner, regulators, legal academics, and analysts in one room to talk about how responsible AI and responsible HR practices are so important.”\n\nAs a result, the company now has a responsible HR counsel that aims to put out unique research every quarter. This strategy can reap big rewards: Planned right, original research drives both media attention (which boosts credibility and authority) and inbound links (which boost SEO).\n\nTo break through the noise, be human\n\nWe live in an incredibly noisy time. If you’ve read this far, you no doubt had to fend off half a dozen notifications along the way. And that’s true for pretty much everyone alive today (and certainly anyone in the market for HR software).\n\nOver and over, what the most successful marketers in the crowded HR tech space told me was that the top-performing marketing “strategy” essentially amounts to this: Be human. Understand who you’re selling to. Listen to them. Help them. And keep listening and helping, because what they’re saying and what they need will change. What won’t change is that, when they’re ready for a solution, they’ll turn — as we all do — to people they know they can trust."}