{"url": "https://techcrunch.com/2024/05/31/general-catalyst-backed-jasper-health-lays-off-staff/", "title": "General Catalyst-backed Jasper Health lays off staff", "authors": ["Marina Temkin", "Amanda Silberling", "Reporter", "Senior Writer", "Kyle Wiggers", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-05-31T00:00:00", "text": "Jasper Health, a cancer care platform startup, laid off a substantial part of its workforce, TechCrunch has learned. Engineering and product design were among the departments impacted by the cuts, according to posts on LinkedIn from impacted employees.\n\nTechCrunch was unable to independently verify the exact number of people who were cut, but an industry source who knew impacted people believes it was approximately half of Jasper Health’s small team. According to PitchBook data, Jasper Health had about 48 employees before the cuts.\n\nThe company’s co-founder and CEO, Adam Pellegrini, didn’t respond to TechCrunch’s request for comment. TechCrunch’s attempts to reach Jasper Health’s chief operating officer, chief growth officer, and head of marketing via email were unsuccessful, with messages bouncing back.\n\nA little over two years ago, in February 2022, Jasper Health raised a $25 million Series A led by General Catalyst, with participation from Human Capital, W Health Ventures, Redesign Health and 7wireVentures. At that time, the company said it raised a total of $31 million in venture capital.\n\nMost significantly, Jasper is a General Catalyst portfolio company. The VC firm is one of the most active healthcare investors. It is so serious about bringing new startup-led technology into the US healthcare system that earlier this year, the VC firm purchased an Ohio-based health system called Suma Health, an unprecedented move in venture capital. But clearly, that doesn’t mean that all GC-backed health tech startups will flourish up-and-to-the-right without setbacks.\n\nJasper is also notable because it was conceived and launched in 2018 by Redesign Health, a venture firm and studio that creates new healthcare companies. Run by CEO Brett Shaheen (previously at Lone Pine Capital and Carlyle Group), Redesign says it’s built 50 healthcare startups that have collectively raised $1.3 billion. Redesign, which is itself backed by LPs like General Catalyst, CVS Health Ventures, and Samsung Next, also had its own layoffs earlier this year, Fierce Healthcare reported.\n\nJasper’s digital but human-led platform offers care navigation, patient support and remote patient monitoring. The company also provides psychosocial care. It says that approximately 12% of its users are in remission from cancer.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPelligrini, the company’s founder, started his career as a surgical specialist in the US Army. He also helped build the American Cancer Society’s website, which provides information to patients and caregivers about the disease. Before founding Jasper, he was the senior vice president of virtual care and consumer health innovation at CVS Health.\n\nJasper Health’s competitors include Thyme Care and Reimagine Care."}