{"url": "https://techcrunch.com/2022/08/09/to-optimize-for-growth-study-your-down-funnel-metrics/", "title": "To optimize for growth, study your down-funnel metrics", "authors": ["Jonathan Martinez", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-08-09T00:00:00", "text": "You’ve managed to acquire a million users. Amazing.\n\nBut if 999,999 of them don’t make it through the funnel, or churn, now that’s not so amazing.\n\nThat’s an extreme example, but it shows why optimizing your growth funnel is crucial in the early days of your company.\n\nWhat does a growth funnel look like? Although each startup’s will funnel will look different, at the core, it consists of three major pillars: acquisition, activation, and retention. I won’t go over these pillars in depth, but let’s talk about some key optimization concepts.\n\nAcquiring the right users\n\nAs your startup matures and robust user-level data starts flowing in, you should prioritize understanding which acquisition sources stand to attract the most users. As a bonus, try to measure which sources add the most users incrementally as well.\n\nCross-functional teams (i.e., product, growth and data) should continuously question the best sources of traffic at a defined cadence, too.\n\nWhile leading fleet growth at Postmates, I quickly learned to become numb to remarkable upper-funnel metrics. Here’s an example of how we prioritized budget allocation with down-funnel metrics:\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nEven though Indeed has the worst CPL of the channel grouping, it nets the highest revenue-producing fleet drivers, who are the most active in Y1.\n\nAs your traffic sources begin to grow, and the spending scale rises, testing for incrementality should be the next level up from only measuring ROAS or LTV. In other words, you should understand how many users would have been acquired if a specific traffic source had been turned off. How incremental is Facebook or a particular lifecycle marketing campaign?\n\nThe biggest takeaway here is: Double down on the highest LTV and incremental segments as quickly as possible.\n\nIt’s critical to divvy up users into buckets\n\nWhile there are three major pillars in the growth funnel, each bucket can be home to hundreds of segments. In the acquisition pillar, users may be bucketed by the channels they came through, while in activation, users may be bucketed by the number of days they’ve been waiting to get started.\n\nIt’s imperative to slice users into their respective buckets, because it opens the opportunity for unique targeting and messaging.\n\nHere are a few examples to get you thinking about user buckets for each pillar of the growth funnel:\n\nAcquisition\n\nSource\n\nCampaign\n\nAd creative\n\nActivation\n\nFunnel step\n\nTime lapsed\n\nActions taken\n\nRetention\n\nUser behavior\n\nLast sign-In\n\nPushing users through the funnel\n\nAfter sorting users into their respective buckets, it’s time to start thinking about how to communicate with each user.\n\nAt a basic level, varying messaging by user cohort will be your largest lever for moving users through the funnel. To put this into perspective: Would you communicate with a user who just came into the funnel in the same way as someone who hasn’t engaged with you for 90 days? Probably not.\n\nA few tactics for moving users through the funnel:\n\nPersistent messaging\n\nMultiple forms or engagement\n\nAlleviating common concerns\n\nContinuous A/B testing\n\nOf all the tactics above, nothing works better than continuous and well-crafted messaging for driving desired actions. It often takes B2B sales teams multiple calls, texts and follow-ups to close a deal. And that holds true for B2C startups as well, so you should create email drip campaigns, and stay persistent when communicating with your users.\n\nWhether you’re devising a strategy for your email campaigns or retargeting on Facebook, always test various styles of messaging. Below is a great framework that I’ve used to define the messaging:\n\nWhat step in the funnel is the user in? What concerns or blockers does this user have?\n\nThe fleet funnel we had at Postmates is a perfect example of this. This funnel would require people to submit their driver’s license and SSN. We built dedicated email drip campaigns for people who dropped off at the SSN step to alleviate concerns around entering sensitive information.\n\nAlways go for the low-hanging fruit\n\nThere will always be low-hanging fruit, whether it’s changing a subject line or simply adding emojis to retargeting ad copy. It starts with the basics: acquiring the right users, bucketing them the right way and pushing them along every step of the funnel.\n\nAs your testing throughput increases, the level of detail on metrics should increase to continue moving the needle. Out of all the metrics, my favorite at Coinbase was the incremental lift of each campaign, as it helped us understand accurately how many users acted because of a specific email.\n\nEvery successful startup that I have been at or advised has implemented BI (business intelligence) tools, such as Amplitude or Mixpanel, to find these low-hanging fruit or even the bigger swings. It empowers growth and product teams to create dashboards filled with cohorts to pinpoint and optimize funnel drop-off points.\n\nWith a possible recession on the horizon, an inefficient growth funnel has the potential to crush a business. You must optimize your funnels as if you need to squeeze every single user through them because of a short runway — you’ll be much farther along in the competition."}