{"url": "https://techcrunch.com/2022/08/18/kenyan-agtech-iprocure-raises-10-2m-to-grow-its-input-supply-network/", "title": "Kenyan agtech iProcure raises $10.2M to grow its input supply network", "authors": ["Annie Njanja", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-08-18T00:00:00", "text": "The shortage of agricultural inputs like fertilizer, unpredictable prices and the proliferation of substandard products into markets are some of the biggest challenges for Kenya’s agricultural sector. This impact is especially felt in the country because agriculture accounts for 23% of its gross domestic product (GDP), making it the single largest contributor to its economy, and its biggest employer — agriculture employs nearly 40% of the country’s population and 70% of its rural people.\n\nIt, therefore, is certain that difficulties in accessing the required resources for sustained production not only threatens food security but also family earnings and livelihoods. To bridge the input-access gap, iProcure, a Kenyan B2B agtech, has since 2014 been connecting agricultural manufacturers and distributors to local retailers (agro-dealers), through its unique distribution infrastructure that interlinks agricultural supply chains.\n\nIprocure told TechCrunch it is now on a path to grow its presence in Kenya and Uganda, which are its current markets, and to enter Tanzania after securing $10.2 million in series B funding. The latest round includes $1.2 million debt, and was led by Investisseurs & Partenaires (I&P), and it brings the total funding raised by iProcure, so far, to $17.2 million. Novastar Ventures, Ceniarth and British International Investment (BII), which recently took part in Apollo Agriculture’s $40 million Series B fundraising, also participated in the round.\n\n“We have built out a Pan-African distribution infrastructure, and we are using these funds to scale our operations in our two markets and to enter Tanzania. We’re also going to be allocating some of the resources toward introducing higher-quality cheaper products that we are sourcing from international players,” said iProcure co-founder and chief data and growth officer, Stefano Carcoforo — also the former CEO who has since been replaced by ex-Novastar partner Niraj Varia.\n\nCarcoforo co-founded iProcure with Nicole Galletta (head of innovation), Patrick Wanjohi (chief technical officer) and Bernard Maingi (chief commercial officer).\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIprocure currently connects 5,000 agro-dealers to different manufacturers but this number is set to grow as it onboards more partners and retailers across the three markets and as it doubles its distribution hubs to 20, boosting its last-mile delivery.\n\nAgro-dealers are the focal point for suppliers hoping to introduce new products into Kenya’s input markets, as they are trusted by millions of farmers to be sources of sound agricultural advice. They are also well spread across the country, giving them a broad coverage of farmer communities. Through agro-dealers, iProcure targets to double the reach of farmers to 2 million in the next one year.\n\nThe agtech provides the agro-dealers with an end-to-end enterprise resource planning (ERP) system that operates from mobile devices, helping them manage their sourcing and distribution.\n\nThis technology has introduced new efficiencies that control the penetration of substandard supplies as retailers are able to source directly from certified manufacturers and distributors. By helping manage stock-outs, the agtech ultimately helps stabilize product prices for the benefit of both the sellers and end users.\n\n“The agro-dealers use our technology to keep track of their sales, process sales, to manage inventory, to place orders and build CRMs that can help deploy loyalty programs to the farmers. It does everything they need. We provide a completely transparent system from the factory all the way down to the point when the farmer purchases the product,” said Carcoforo.\n\nFor added reach, iProcure plans to extend zero-interest credit to agro-dealers, increasing their ability to purchase the hardware required to use its ERP system. By plugging in more retailers to its system, iProcure will additionally get access to data required to inform its growth strategy, including a buy now, pay later (BNPL) service currently in the pipeline.\n\n“Work capital is an issue facing these retailers, and we’ve demonstrated that if we provide supplies on a BNPL model, retailers buy 30% more. This shows that retailers themselves are cash constrained and can’t buy all the inventory they can sell; meaning that farmers aren’t able to access all the inputs they need. The BNPL service we are introducing will sort this problem,” said Varia.\n\nAccording to Varia, iProcure has grown 16x over the last four years, doubling its revenue every year, except for 2020 due to COVID. In the short term, he expects further expansion through the onboarding of more retailers and the introduction of the BNPL offering."}