{"url": "https://techcrunch.com/2025/05/05/waymo-ramps-up-robotaxi-production-at-new-arizona-factory/", "title": "Waymo ramps up robotaxi production at new Arizona factory", "authors": ["Kirsten Korosec", "Transportation Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-05-05T00:00:00", "text": "Waymo has played coy for years about exactly how many Jaguar I-Pace EVs are in its autonomous fleet — a figure that covers vehicles used in testing and commercial robotaxi operations. On Monday, the Alphabet company finally provided a peek at the commercial side of the fleet.\n\nWaymo said Monday, as part of a larger announcement, that it has more than 1,500 commercial robotaxis in operation. And work is underway to expand it through a multimillion-dollar investment with Magna to build more than 2,000 autonomous I-Pace vehicles at a new factory in Arizona.\n\nWaymo has worked with Magna for years, namely at a now closed facility in Detroit. The new 239,000-square-foot factory in the Phoenix suburb of Mesa is strategically located in one of Waymo’s robotaxi markets and close to its other service areas across San Francisco, Los Angeles, and Austin.\n\nA Waymo spokesperson told TechCrunch the company looked at other locations, but ultimately it chose Mesa for its proximity to other markets and because the consistent weather made it ideal for the validation process required before the robotaxis can be used by the public.\n\nWaymo said in the blog post announcing the factory that it received final delivery from Jaguar earlier this year. From here, contract builder Magna and Waymo take over to integrate the self-driving system into the vehicles. Waymo emphasized a new process designed to speed up the production-to-validation-to-public use process, noting that the AVs can drive themselves out of the facility and directly into service.\n\n“In fact, these vehicles can pick up their first public passengers less than 30 minutes after leaving the factory,” Waymo said in its blog post. The company said that vehicles intended for other cities can be deployed into public service in a matter of hours after being shipped to their local depot.\n\nThe Mesa factory is designed to handle other vehicle platforms, notably to integrate the sixth-generation of Waymo’s self-driving system into the Zeekr RT later this year.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe plant will introduce an automated assembly line and other efficiencies over time, according to the company, which noted that the plant will be capable of building tens of thousands of fully autonomous Waymo vehicles per year when operating at full capacity."}