{"url": "https://techcrunch.com/2023/06/15/us-treasury-renewable-energy-investment/", "title": "New guidance from the US Treasury could unleash billions in renewable energy investment", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-06-15T00:00:00", "text": "There is a “missing middle” in the market for renewable energy that won’t be missing for much longer.\n\nThe U.S. Treasury Department on Wednesday announced new guidance, authorized under the Inflation Reduction Act, that will enable the development of a range of renewable energy projects that previously had been too onerous from a tax perspective to tackle.\n\nIt also allows cities and nonprofits, which have no tax liabilities, to receive direct payments when investing in a range of climate-friendly technologies. The changes could pave the way for hundreds of billions of dollars worth of investment in the coming decade.\n\nThe guidance around direct payments would allow tax-exempt organizations to put rooftop solar panels on schools, churches and temples. Electric school buses, already an attractive purchase for many districts, will be that much more attainable. And rural electric cooperatives will finally be on the same footing as investor-owned utilities.\n\nBut perhaps the bigger news is the guidance around transferability of tax credits. Previously, to make the most of the tax credits available to them, renewable energy project developers had to create complex and expensive tax equity deals.\n\nA solar project, for example, might be eligible for 30% to 50% of its total cost in tax credits. Utility scale projects routinely cost $100 million to $200 million, meaning that up to $50 million to $100 million in tax credits would be available.\n\n“The numbers get very large, very quickly in infrastructure,” said Andy Moon, co-founder and CEO of Reunion, a renewable energy tax credit marketplace. “As a result, most companies just don’t have the tax liability to absorb those credits.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe organizations that do are almost always banks, which have the expertise and tax liabilities to handle tax equity deals. Very large banks tend to dominate. Together, JP Morgan and Bank of America have accounted for up to half the market for tax equity. Since there’s a limit on the number of banks willing to enter into such deals (and a limit to their tax liability), only about $20 billion worth of tax equity deals are done every year.\n\nWith transferability, though, there might be as much as $90 billion worth of renewable energy tax credits available by the end of the decade, according to CohnReznick Capital, far exceeding the amount that today’s tax equity deals can absorb. Transferability opens the market to a much wider range of companies with lower tax liabilities.\n\nThe market is in its earliest days, but already companies like Reunion are popping up to handle such transactions. The startup is standardizing the process to transfer tax credits, streamlining everything from legal documents to due diligence and insurance. As it handles more projects, it plans to start digitizing more parts of the process. “The idea is to really automate it and make it such that we’re democratizing both the funding side as well as the project side,” Moon said.\n\nMoon and his co-founder Billy Lee started the company shortly after the Inflation Reduction Act was passed. The two had worked for years in renewable energy finance and recognized that transferability was poised to create an entirely new market. They raised a $2.9 million seed round led by Segue Sustainable Infrastructure, TechCrunch+ has exclusively learned, and they’ve spent the last several months lining up customers.\n\nMoon said his company is focused on companies with $500 million in revenue and greater, but the plan is to open up to smaller businesses and projects as Reunion gains experience and automates more of the process. A startup with $1 million in annual profit could, for example, buy six figures worth of credits, which would enable smaller projects to offload their tax credits.\n\nBuyers of tax credits typically receive a 7% to 10% discount, which compares favorably with the usual returns for tax equity, which are around 8%, Moon said. This year, Reunion has about $300 million worth of credits for sale on its marketplace.\n\nBy allowing the transfer of smaller amounts of tax credits, transferability promises to enable a range of renewable energy projects. One example might be a single warehouse that wants to install solar with batteries and would like to own and monetize the installation. Before transferability, tax liabilities weren’t nearly high enough to make such projects worthwhile. But with transferability, the upfront capital costs become more manageable and the payback period shortens dramatically.\n\nWhile solar is likely to represent a large portion of the transferred tax credits, a range of other climate technologies are eligible, including wind, geothermal, tidal, energy storage (like batteries), fuel cells and more. That should help create markets for a range of technologies that might have been too small to be profitable under the old tax equity regime.\n\nThat tidal microturbine startup you’ve been incubating? Now might be a great time to start looking for investors."}