{"url": "https://techcrunch.com/2025/05/08/vc-firm-insight-partners-confirms-personal-data-stolen-during-january-hack/", "title": "VC firm Insight Partners confirms personal data stolen during January hack", "authors": ["Zack Whittaker", "Security Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-05-08T00:00:00", "text": "Venture capital firm Insight Partners said it will alert an unspecified number of people that their personal information was stolen during a cyberattack in January.\n\nThe VC firm confirmed in an updated statement this week it was planning to notify affected people on a rolling basis beginning “in the next few days.” The company said the stolen data includes personal information about its current and former employees, and information relating to its limited partners — the investors who provide capital to Insight’s venture funds but whose names are typically kept private.\n\nInsight said the stolen data also includes information about certain funds, management companies, and portfolio companies, including banking and tax information.\n\nThis is the first time Insight has acknowledged that data was exfiltrated during the January cyberattack on the firm. The company previously attributed the hack to a “sophisticated” social engineering attack, but has not yet provided evidence for this claim. The specific nature of the attack remains unclear.\n\nA spokesperson for Insight Partners did not immediately return a request for comment.\n\nThe VC firm has more than $90 billion in regulated assets under management, making it one of the largest tech startup investors in the world. Insight has helped to fund cybersecurity giants, including Wiz and Armis.\n\nInsight Partners is the latest venture capital firm in recent years to experience a cyberattack. In 2021, Silicon Valley venture firm Advanced Technology Ventures was hit by a ransomware attack that allowed criminals to steal data on the firm’s limited partners."}