{"url": "https://techcrunch.com/2024/03/25/london-regtech-gss-raises-47m-to-help-banks-screen-for-global-sanctions/", "title": "London regtech GSS raises $47M to help banks screen for global sanctions", "authors": ["Paul Sawers", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-03-25T00:00:00", "text": "Global Screening Services (GSS), a London-based regulatory compliance platform that helps financial institutions meet their global sanctions obligations, has raised $47 million in a round of funding.\n\nThe raise comes amid a spike in economic sanctions, with the U.S. issuing trade restrictions and asset blocking against states including Russia, China, Iran and more.\n\nEnforcement\n\nGSS co-founder and CEO Tom Scampion was previously head of financial crime for Deloitte’s EMEA arm, leaving in 2020 to become general partner at consulting firm AlixPartner — where GSS was initially incubated before being spun out as a standalone entity in 2021.\n\nThe company actually raised a similar amount of funding last year from big-name backers including Japan’s Mitsubishi UFJ Financial Group (MUFG), one of the world’s largest banks. For its latest raise, GSS revealed another financial powerhouse as a backer: the Commonwealth Bank of Australia (CBA), which is joined by Cynosure Group and AlixPartner for this latest cash injection.\n\nBanks often find themselves at the forefront of sanctions enforcement, given their role in controlling the flow of money around the globe. But it’s not always easy figuring out who is sending money to whom. In 2019, Standard Chartered was hit with $1.1 billion in fines from U.K. and U.S. regulators for having insufficient money-laundering controls in place, including breaching sanctions that had been put in place against countries such as Iran. And five years previous to that, BNP Paribas was fined a whopping $8.9 billion for processing financial transactions for countries sanctioned by the U.S.\n\nAs such, investors have continued to back regulatory compliance businesses in recent years, with the likes of New York-based Droit raising $23 million last year, shortly after London’s SteelEye secured $21 million in financing.\n\nGSS sells a sanctions-screening platform to help banks and other financial institutions comply with regulations. These institutions feed transaction data into GSS’s cloud-based platform, which returns an alert if it finds a match against a standardized set of sanctions lists from around the world — GSS also “enriches” these lists with additional data points, such as dates of birth, International Maritime Organization (IMO) numbers for ships and data from the local financial transfer systems of sanctioned countries such as Russia and China.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nGSS also provides “enhanced” lists for screening, including companies that are partly owned by people / companies / governments that have been sanctioned by OFAC, the EU or U.K.\n\nWith another $47 million in the bank, GSS is now transitioning from “development phase” to fully operational, as it prepares to go live with its first customers."}