{"url": "https://techcrunch.com/2021/07/28/inkr-draws-in-3-1m-to-make-more-comics-accessible-to-worldwide-audiences/", "title": "INKR draws in $3.1M to make more comics accessible to worldwide audiences", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-07-28T00:00:00", "text": "INKR is a digital comics platform that crosses cultural and language divides, enabling creators to reach global audiences with its proprietary localization technology. Previously bootstrapped, the company announced today that it has raised $3.1 million in pre-Series A funding led by Monk’s Hill Ventures, with participation from manga distributor TokyoPop founder and chief executive Stu Levy.\n\nHeadquartered in Singapore with an office in Ho Chi Minh City, INKR was founded in 2019 by Ken Luong, Khoa Nguyen and Hieu Tran. The company says that since it launched in October 2020, its monthly average users have grown 200%. It currently partners with more than 70 content creators and publishers, including FanFan, Image Comics, Kodansha USA, Kuaikan, Mr. Blue, SB Creative, TokyoPop and Toons Family and has more than 800 titles so far, including manga, webtoons and graphic novels.\n\nLuong, INKR’s CEO, told TechCrunch that the platform will focus first on translated comics from top global publishers, but plans to open to small and indie creators in 2022.\n\nAt the heart of INKR’s platform is its localization technology, which the company says reduces the time spent on preparing comics for different markets from days to just hours.\n\n“Comics localization is more than just translation. It is a time-consuming process with many steps involving many people — file handling, transcription, translation, typesetting, sound effects, quality control, etc,” Luong said.\n\nIn addition to language, publishers also have to take into account the differences between comic styles around the world, including Japanese manga, Chinese manhua, Korean manhwa, American comics. For example, comics can be laid out page by page or use vertical scrolling. Some languages read from left to right, while others go from right to left.\n\nLuong says INKR’s proprietary AI engine, called INKR Comics Vision, is able to recognize different formats and elements on a comic page, including text, dialogue, characters, facial expressions, backgrounds and panels. INKR Localize, its tool for human translators, helps them deliver accurate translations more quickly by automating tasks like text transcription, vocabulary suggestions and typesetting.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSince localization is performed by teams, including people in different locations, INKR provides them with browser-based collaboration software. The platform supports Japanese-English, Korean-English and Chinese-English translations, with plans to add more languages. Some publishers, like Kuaikan Manhua and Mr. Blue, have used INKR to translate thousands of comic chapters from Chinese and Korean into English.\n\nINKR provides content creators with a choice of monetization models, including ad-supported, subscription fees or pay per chapter. Luong says the platform analyzes content to tell publishers which model will maximize their earnings and shares a percentage of the revenue generated.\n\nINKR is vying for attention with other digital comics platforms like Amazon-owned Comixology and Webtoon, the publishing portal operated by Naver Corporation.\n\nLuong said INKR’s competitive advantages include the diversity of comics it offers and the affordability of its pricing. Before launching, it also invested in data and AI-based technology for both readers and publishers. For example, users get personalized recommendation based on their reading activity, while publishers can access analytics to track title performance based on consumption trends.\n\nIn a statement, Monk’s Hill Ventures general partner Justin Nguyen said INKR’s “proprietary AI-driven platform is addressing pain points for creators and publishers who need to go digital and global — localizing for many languages quickly and cost-effectively while also helping them improve reach and readership through analytics and intelligent personalized feeds. We look forward to partnering with them to quench the huge demand for translated comics globally.”"}