{"url": "https://techcrunch.com/2021/06/28/all-the-tech-that-went-into-turning-columbus-ohio-into-a-smart-city/", "title": "All the tech that went into turning Columbus, Ohio, into a ‘Smart City’", "authors": ["Rebecca Bellan", "Senior Reporter", "Zack Whittaker", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-06-28T00:00:00", "text": "The U.S. Department of Transportation launched a Smart City Challenge in 2015, which asked mid-sized cities across the country to come up with ideas for novel smart transportation systems that would use data and tech to improve mobility. Out of 78 applicants, Columbus, Ohio, emerged as the winner.\n\nIn 2016, the city of just under a million residents was then awarded a $50 million grant to turn its proposal into a reality. $40 million came from the DOT, and $10 million from the Paul G. Allen Family Foundation.\n\nIn mid-June, the program ended, but Columbus said the city would continue to work as a “collaborative innovation lab,” using city funds to integrate technology to address societal problems. But what does that mean in reality?\n\nColumbus’s ‘Smart City’ looks nothing like the rapidly developing prototype Toyota is developing, Woven City, at the base of Mount Fuji in Japan, but it’s not supposed to.\n\n“We really focus on not just demonstrating technology for technology’s sake, but to look at the challenges we are facing in our city around mobility and transportation and use our award to focus on some of those challenges,” Mandy Bishop, Smart Columbus program manager, told TechCrunch.\n\nThose challenges involve lack of accessibility to mobility options, areas underserved by public transit, parking challenges, and terrible drivers with high collision rates. As you might expect, a lot of startups are involved in solving those challenges. Here’s who’s involved and what they bring to the table.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe Pivot app, built by Etch\n\nEtch is a Columbus-based geospatial solutions startup. Founded in 2018, the company cut its teeth with Smart Columbus, creating a multimodal transport app that helps users plan trips throughout central Ohio using buses, ride hailing, carpool, micromobility or personal vehicles.\n\n“The mobility problem in Columbus is access to mobility and people not understanding or knowing what options are available to them,” Darlene Magold, CEO and co-founder of Etch, told TechCrunch. “Part of our mission was to show the community what was available and give them options to sort those options based on cost or other information.”\n\nThe app is based on open-source tools like OpenStreetMap and OpenTripPlanner. Etch uses the former to get up-to-date crowdsourced information from the community about what’s happening in a given area, similar to Waze. The latter is used to find itineraries for different forms of mobility.\n\n“Because we are open source, the integration with Uber, Lyft and other mobility providers really gives users a lot of options so they can actually see what mobility options are available, other than their own vehicle if they have one. It takes away that anxiety of traveling and using that mixed mode of travel, knowing in real time where the bus is or where to find a scooter, and like using Uber or renting a bike or scooter.”\n\n$1.25 million of the total federal funds went to the Pivot app, which has 3,849 downloads to date, and the city will continue to fund the development and use of Pivot.\n\nSmart Columbus Operating System, made by Pillar Technology\n\nColumbus hired local smart embedded software company Pillar Technology, which was acquired by Accenture in 2018, to further develop the existing Smart Columbus operating system. The $15.9 million open source platform that hosts the city’s mobility data, including over 2,000 datasets and 209 visualizations, launched in April 2019.\n\n“The program will continue through at least January 2022 as Columbus works to develop mobility and transportation use cases and further define the value and use of the operating system,” said Bishop.\n\nThe Smart Columbus OS invites others to add their data to the set while also calling for crowdsourced solutions to problems like how to bring down crash rates or how to optimize city parking.\n\nPark Columbus, made with ParkMobile\n\nParkMobile is an Atlanta-based provider of smart parking solutions. For Smart Columbus, the startup created Park Columbus, an event parking management app, to help free up traffic and pollution from cars circling around looking for parking. Users can find, reserve and pay for parking all on the app.\n\nSmart Columbus’s event parking management program built enhancements within ParkMobile’s existing offering, according to a spokesperson for the city. The $1.3 million project had over 30,000 downloads from October 2020 to March 2021. The city will continue to fund the app which will also display on-street parking via predictive analytic technology.\n\nSmart Mobility Hubs, built by IKE Smart City\n\nThe Smart Mobility Hubs are interactive digital kiosks designed by IKE Smart City, a company that builds media displays to integrate into urban landscapes. The hubs bring the city’s transportation options together at a single location, like a physical manifestation of the Pivot app, which can actually also be accessed via the kiosks. The kiosks, which took another $1.3 million chunk out of the total federal grant pool, also have free WiFI and listings of restaurants, shops and activities.\n\nIKE Smart City’s kiosks can be found in cities like Denver, San Antonio and St Louis, and they display detailed, geo-located listings of restaurants, shops, activities, services and resources in real time. According to Smart Columbus, the kiosks, placed at six key locations, had over 65,000 interactions from July 2020 to March 2021, but the city hopes that number will drastically increase in the post-pandemic era. The hubs also include the city’s bike share program, CoGo, which offers both pedal and e-bikes, bike racks, designated dockless scooter share and bike share parking, rideshare pickup and drop off zones, car sharing parking and EV charging stations.\n\nConnected vehicle environment, in partnership with Siemens\n\nOhio has some of the worst drivers in the nation. This year, the state highway patrol released details about distracted driving in the state, and found 70,000 crashes attributed to distracted driving since 2016, with more than 2,000 involving serious injuries or fatalities. In 2019, an insurance agency rated Columbus the fourth worst driving in the country.\n\nThis might explain why the city wanted to experiment with connected vehicles. From October 2020 to March 2021, Columbus partnered with Siemens who provided both onboard and roadside units in creating a Vehicle-to-Infrastructure (V2I) and Vehicle-to-Vehicle (V2V) environment. Kapsch and Danlaw also provided roadside units. Connected vehicles would “talk” to each other and to 85 intersections, seven of which have the highest crash rates in central Ohio. The project cost about $11.3 million.\n\n“We were looking at 11 different applications including red light signal warning, school zone notifications, intersection collision warning, freight signal priority and transit signal priority, using the connected vehicle technology,” said Bishop.\n\n“We deployed about 1,100 vehicles in a region that has about a million residents, so we did not anticipate seeing a decreased crash rate, but we did see drivers using the signals coming from the connected vehicle environment to not run traffic signals, so we’re really seeing improvements in driver behavior, which ultimately we would anticipate long term to effectively improve safety.”\n\nLinden LEAP, made by Easy Mile\n\nSmart Columbus’s autonomous shuttle service, the Linden LEAP, cost about $2.3 million and ran from February 2020 until March 2021, with some breaks in between. Initially, two shuttles hitting four stops operated in the Linden neighborhood to provide transportation to underserved communities. That only lasted about two weeks before a passenger was somehow thrust from their seat when the vehicle, going no more than 25 miles per hour, stopped short. Then the pandemic happened, and it was a human shuttle service no longer. From July until the end of the program, the Linden LEAP pivoted to deliver 3,598 food pantry boxes or almost 130,000 meals.\n\nThe city will not continue to pay for the autonomous shuttle service now that federal funding has ended.\n\n“The city is not historically a transit operator, so we’re really staying close to how CoTa looks to incorporate connected and autonomous and electric technology into their fleets moving forward,” said Bishop. “Our anticipation is that the next demonstrations would be private sector led or ultimately led by our transit authority.”\n\nFrench startup Easy Mile ran the Level 3 autonomous technology behind the shuttle, according to a spokesperson for the company. The Society of Automobile Engineers describes Level 3 as still requiring a human operator in the driver’s seat.\n\nColumbus’s dalliance with autonomy initially began in late 2018 when Smart Columbus partnered with DriveOhio and May Mobility to launch the Smart Circuit, the city’s OG self-driving shuttle. The shuttle ran a 1.5 mile route circling the Scioto Mile downtown, giving out over 16,000 free rides to certain cultural landmarks until September 2019.\n\nSmart Circuit only cost about $500,000, but the city spent another $400,000 on general development for the entire autonomous shuttle program.\n\nCorrection: A previous version of this article named Orange Barrel media as the tech partner behind the Smart Mobility Hubs. Orange Barrel is a sister company to IKE Smart City.\n\nPrenatal Trip Assistance, built by Kaizen Health\n\nKaizen Health, a woman-owned technology firm, built its initial application after being dissatisfied with transportation options available to people undergoing health treatments. The Chicago-based company applied its model of streamlining the experience of ordering non-emergency, multimodal medical transportation for pregnant women and families.\n\nThe program got $1.3 million in Smart Columbus funds from June 2019 to January 2021, but only had about 143 participants due to the pandemic, but that includes over 800 medical care trips and over 300 pharmacy, grocery or other service-related trips. In a state that averaged 6.9 deaths for every 1,000 babies the year this program began, it’s a good thing the participating Medicaid managed care organizations are now modernizing how they deliver non-emergency transportation services, including access to such a mobile application.\n\nMobility assistance for people with cognitive disabilities, in partnership with Wayfinder\n\nThe tech partner for the final project was AbleLink Technology’s Wayfinder out of Denver. The Mobility Assistance for People with Cognitive Disabilities (MAPCD) study worked with Wayfinder to create a highly detailed, turn-by-turn navigation app specifically built for those who have cognitive disabilities, making it safer for those people to be more independent.\n\nThe pilot cost nearly $500,000 and lasted from April 2019 to April 2020. Thirty-one participants used the app to get more comfortable using public transport. According to a spokesperson for the city, Columbus is working with potential partners to find a way to sustain the program.\n\nLooking toward the future\n\nOne of the focuses of Smart Columbus was also electric vehicle adoption and charging infrastructure. The money from the Paul G. Allen Family Foundation and AEP Ohio, the state’s utility provider, helped incentivize and encourage multiunit dwellings, workplaces and public sites to install charging stations. Smart Columbus exceeded its goal of 900 EV charging stations, as well as its goal for 1.8% of new car sales to be electric, reaching 2.34% in November, 2019.\n\n“In the future I think something that’s here to stay is really ensuring that we’re solving resident challenges in a way that makes sense for our community,” said Bishop.\n\nCorrections: Kapsch and Danlaw also provided roadside units for the connected vehicle project.\n\nThe technology partner for MAPCD has been updated."}