{"url": "https://techcrunch.com/2025/04/10/what-is-bluesky-everything-to-know-about-the-x-competitor/", "title": "What is Bluesky? Everything to know about the X competitor", "authors": ["Amanda Silberling", "Cody Corrall", "Alyssa Stringer", "Senior Writer", "Audience Development Manager", "Zack Whittaker", "Rebecca Bellan", "Tim De Chant", "Connie Loizos", "Maxwell Zeff"], "publication_date": "2025-04-10T00:00:00", "text": "Is the grass greener on the other side? We’re not sure, but the sky is most certainly bluer. It’s been over two years since Elon Musk purchased Twitter, now X, leading people to set up shop on alternative platforms. Mastodon, Post, Pebble (two of which have already shuttered operations) and Spill have been presented as potential replacements, but few aside from Meta’s Threads have achieved the speed of growth Bluesky has reached.\n\nAs of February 2025, Bluesky has surpassed 30 million users. Its growth stems from several policy changes at X, including a heavily criticized change to the block feature and allowing third party companies to train their AI on users’ posts, which helped the app soar to the top of the U.S. App Store. Bluesky also saw a big boost following the results of the 2024 U.S. presidential election (which also contributed to an X exodus by Taylor Swift fans). But while the number is promising, the growth has slowed — and the network has a lot of catching up to do to compete with Threads’ 275 million monthly active users.\n\nBelow, we’ve compiled the answers to some of the most common questions users have about Bluesky. And if you’ve made the switch, you can follow TechCrunch here as well as our team with our Starter Pack.\n\nWhat is Bluesky?\n\nBluesky is a decentralized social app conceptualized by former Twitter CEO Jack Dorsey and developed in parallel with Twitter. The social network has a Twitter-like user interface with algorithmic choice, a federated design and community-specific moderation.\n\nBluesky is using an open source framework built in-house, the AT Protocol, meaning people outside of the company have transparency into how it is built and what is being developed.\n\nDorsey introduced the Bluesky project back in 2019 while he was still Twitter CEO. At the time, he said Twitter would be funding a “small independent team of up to five open source architects, engineers, and designers,” charged with building a decentralized standard for social media, with the original goal that Twitter would adopt this standard itself. But that was before Elon Musk bought the platform, so Bluesky is completely divorced from X.\n\nAs of May 2024, Dorsey is no longer on Bluesky’s board. Bluesky is now an independent public benefit corporation led by CEO Jay Graber.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nHow do you use Bluesky?\n\nUpon signing up, users can create a handle which is then represented as @username.bsky.social as well as a display name that appears more prominent in bold text. If you’re so inclined, you can turn a domain name that you own into your username — so, for example, I’m known on Bluesky as @amanda.omg.lol.\n\nThe app itself functions much like X, where you can click a plus button to create a post of 256 characters, which can also include photos. Posts themselves can be replied to, retweeted, liked and, from a three-dot menu, reported, shared via the iOS Share Sheet to other apps, or copied as text.\n\nYou can search for and follow other individuals, then view their updates in your “Home” timeline. Previously, the Bluesky app would feature popular posts in a “What’s Hot” feed. That feed has since been replaced with an algorithmic and personalized “Discover” feed featuring more than just trending content.\n\nFor new users, Bluesky introduced a “Starter Pack” feature, which creates a curated list of people and custom feeds to follow in order to find interesting content right out of the gate. You can find TechCrunch’s Starter Pack right here.\n\nUser profiles contain the same sort of features you’d expect: a profile pic, background, bio, metrics and how many people they’re following. Profile feeds are divided into two sections, like X: posts and posts & replies. In January 2025, Bluesky also added a new video tab to user profiles.\n\nThere is also a “Discover” tab in the bottom center of the app’s navigation, which offers more “who to follow” suggestions and a running feed of recently posted Bluesky updates. In January 2025, Bluesky also introduced a vertical video feed to compete with TikTok.\n\nWe’ve also put together a helpful guide on how to use Bluesky here.\n\nImage Credits: Natalie Christman\n\nWho’s on Bluesky?\n\nBy the beginning of July 2023, when Instagram’s Threads launched, Bluesky topped a million downloads across iOS and Android. Notable figures like Rep. Alexandria Ocasio-Cortez, Mark Cuban, Quinta Brunson, Dril, Weird Al Yankovic, Guillermo del Toro, Barbra Streisand, and Brazil President Luiz Inácio Lula da Silva have migrated to Bluesky.\n\nBluesky is also home to news organizations like Bloomberg, The Washington Post, and of course, TechCrunch! Since August 2024, Bluesky is also now allowing heads of state to sign up and join the platform for the first time.\n\nIn 2025, some prominent U.S. political figures set up accounts on the platform, like Barack Obama and Hillary Clinton.\n\nDoes Bluesky work just like X?\n\nIn many ways, yes. When it first started, Bluesky was much more pared down and didn’t even have DMs, but this key feature has since been implemented, even with emoji reactions. But DMs on Bluesky are currently limited to one-to-one messages, not group messages. Bluesky has also said it is interested in implementing something similar to X’s Community Notes feature. Additionally, X does not use a decentralized protocol like ActivityPub or AT. Bluesky has also been testing a Trending Topics feature and developing its own photo sharing app called Flashes, which is expected to be released in beta soon.\n\nIn October 2024, Elon Musk announced that X’s block feature would work differently than it has in the past. The new block functionality allows users you have blocked to view your posts and your profile, but not the ability to interact with your posts. Some users believe this update to be a safety concern, leading to an influx in Bluesky sign-ups as its block feature is more traditional.\n\nIn another move that separates Bluesky from X, the social network said it has “no intention” of using user content to train generative AI tools as X implemented a new terms of service that allows the platform to train AI models on public posts. But that doesn’t stop third parties from doing so.\n\nWhile Bluesky was initially kicked off as a project convened by Jack Dorsey in 2019 when he was CEO of Twitter, the social app has been an independent company since its inception in 2021.\n\nIs Bluesky free?\n\nYes, and it is now open to the public.\n\nHow does Bluesky make money?\n\nBluesky’s goal is to find another means to sustain its network outside of advertising with paid services, so it can remain free to end users. On July 5, 2023, Bluesky announced additional seed round funding and a paid service that provides custom domains for end users who want to have a unique domain as their handle on the service. Bluesky has also emphasized that it does not want to “require selling user data for ads” in order to monetize its platform.\n\nIn November 2024, Bluesky announced it raised a $15 million Series A round and is developing a subscription service for premium features. Bluesky, however, noted its subscription model will not follow in the footsteps of X’s “pay to win” premium offerings. Users have spotted mockups teasing the subscription feature, dubbed Bluesky+, which could include features like higher quality video uploads and profile customizations.\n\nIn December 2024, Peter Wang announced a $1 million fund, dubbed Skyseed, that will offer grants to those building on Bluesky’s open source AT Protocol.\n\nIs Bluesky decentralized?\n\nYes. Bluesky’s team is developing the decentralized AT Protocol, which Bluesky was built atop. In its beta phase, users can only join the bsky.social network, but Bluesky plans to be federated, meaning that endless individually operated communities can exist within the open source network. So, if a developer outside of Bluesky built their own new social app using the AT Protocol, Bluesky users could jump over to the new app and port over their existing followers, handle and data.\n\n“You’ll always have the freedom to choose (and to exit) instead of being held to the whims of private companies or black box algorithms. And wherever you go, your friends and relationships will be there too,” a Bluesky blog post explained.\n\nWhat third-party apps are built on the AT Protocol?\n\nMany developers are building consumer-facing apps on Bluesky or its underlying AT Protocol. These apps are built on open technology, as opposed to being siloed within big tech’s centralized, opaque ownership.\n\nSome social apps include Flashes, a photo viewing client; Spark, a TikTok-like app; and Skylight Social, which is backed by Mark Cuban.\n\nCheck out our more comprehensive list at various apps built within this ecosystem, including cross-posting apps, music apps, feed builders, and livestreamers.\n\nIs Bluesky secure?\n\nIn October 2023, Bluesky added email verification as part of a larger effort to improve account security and authentication on the network. The addition is an important step forward in terms of making Bluesky more competitive with larger networks like X, which have more robust security controls. In December 2023, Bluesky allowed users to opt out of a change that would expose their posts to the public web following backlash from users.\n\nIs Bluesky customizable?\n\nYes. In May 2023, Bluesky released custom algorithms, which it calls “custom feeds.” Custom feeds allow users to subscribe to multiple different algorithms that showcase different kinds of posts a user may want to see. You can pin custom feeds that will show up at the top of your timeline as different tabs to pick from. The feeds you pin, or save, are located under the “My Feeds” menu in the app’s sidebar.\n\nIn March 2024,​​ the company announced “AT Protocol Grants,” a new program that will dole out small grants to developers in order to foster growth and customization. One of the recipients, SkyFeed, is a custom tool that lets anyone build their own feeds using a graphical user interface.\n\nIs Bluesky on iOS and Android?\n\nYes. Bluesky has rolled out to Android users after it was initially launched to iOS users. Users can access Bluesky on the web here.\n\nHow does Bluesky tackle misinformation?\n\nAfter an October 2023 update, the app will now warn users of misleading links by flagging them. If links shared in users’ posts don’t match their text, the app will offer a “possibly misleading” warning to the user to alert them that the link may be directing them somewhere they don’t want to go.\n\nImage Credits: Bluesky on GitHub Image Credits:Bluesky on Github\n\nIn December 2024, the Bluesky Safety team posted that the company updated its impersonation policy to be “more aggressive,” adding that “impersonation and handle-squatting accounts will be removed.” The company said it is also exploring alternatives to its current domain handle verification process.\n\nHas Bluesky had any controversies?\n\nBluesky has been embattled with moderation issues since its first launch. The app has been accused of failing to protect its marginalized users and failing to moderate racist content. Following a controversy about the app allowing racial slurs in account handles, frustrated users initiated a “posting strike,” where they refused to engage with the platform until it established guardrails to flag slurs and other offensive terms in usernames.\n\nIn December 2024, Bluesky also faced criticism when writer and podcast host Jesse Singal joined the platform. Singal has been cataloged by GLAAD’s Accountability Project for his writings on transgender issues and other matters. Bluesky users have reported Singal’s account en masse, leading the company to ban him, reinstate him, and then label his account intolerant by its moderation service.\n\nWhat moderation features does Bluesky have?\n\nIn December 2023, Bluesky rolled out “more advanced automated tooling” designed to flag content that violates its Community Guidelines that will then be reviewed by the app’s moderation team. Bluesky has moderation features similar to ones on X, including user lists and moderation lists, and a feature that lets users limit who can reply to posts. However, some Bluesky users are still advocating for the ability to set their accounts to private.\n\nIn March 2024, the company launched Ozone, a tool that lets users create and run their own independent moderation services that will give users “unprecedented control” over their social media experience. In October 2024, Bluesky joined Instragram’s Threads app in an effort to court users who were frustrated by Meta’s moderation issues.\n\nIn January 2025, Bluesky published its 2024 moderation report that said it saw a 17x increase in moderation reports following the rapid growth on the platform. The report also noted that the largest number of reports came from users reporting accounts or posts for harassment, trolling, or intolerance — an issue that’s plagued Bluesky as it’s grown. To meet the demands caused by this growth, Bluesky increased its moderation team to roughly 100 moderators and will continue to hire.\n\nWhat’s the difference between Bluesky and Mastodon?\n\nThough Bluesky’s architecture is similar to Mastodon’s, many users have found Bluesky to be more intuitive, while Mastodon can come off as inaccessible: Choosing which instance to join feels like an impossible task on Mastodon, and longtime users are very defensive about their established posting norms, which can make joining the conversation intimidating. To remain competitive, Mastodon recently simplified its sign-up flow, making mastodon.social the default server for new users.\n\nHowever, the launch of federation will make it work more similarly to Mastodon in that users can pick and choose which servers to join and move their accounts around at will.\n\nWho owns Bluesky?\n\nThough Jack Dorsey funded Bluesky, he is not involved in day-to-day development and no longer sits on the company’s board. The CEO of Bluesky is Jay Graber, who previously worked as a software engineer for the cryptocurrency Zcash, then founded an event-planning site called Happening.\n\nIf you have more FAQs about Bluesky not covered here, leave us a comment below."}