{"url": "https://techcrunch.com/2016/05/26/this-algorithm-could-make-dna-origami-as-simple-as-3d-printing/", "title": "This algorithm could make DNA origami as simple as 3D printing", "authors": ["Devin Coldewey", "Writer", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2016-05-26T00:00:00", "text": "If you want to print something a few inches tall, extruded plastic is a good medium. But when you need something at the nanometer scale, DNA is a better bet — but who has the time to design and assemble it base by base? New research lets would-be DNA origami masters design the shape — while an algorithm determines where to put our friends A, T, G, and C.\n\nDNA’s structure doesn’t have to be just a double helix: by fiddling with the order of bases or substituting other molecules, the strand can be cause to make a hard right turn, or curve around in one direction or another — and with enough foresight, a single strand can make enough twists and convolutions that it forms a useful geometric structure.\n\nThese structures can be used to deliver drugs, encapsulate tools like CRISPR-Cas9 gene editing elements, or even store information.\n\nThe problem has been that designing, say, a dodecahedron is a tremendously complicated task, and few have the expertise to assemble such a complex molecule, composed of thousands of base pairs, by hand. That’s what researchers at MIT, Arizona State University, and Baylor University aimed to change, and their success is detailed today in the journal Science.\n\n“The paper turns the problem around from one in which an expert designs the DNA needed to synthesize the object, to one in which the object itself is the starting point, with the DNA sequences that are needed automatically defined by the algorithm,” said MIT’s Mark Bathe in a press release.\n\nBasically, all the user needs to do is provide a 3D shape with a closed surface. It could be a polyhedron, something more round, like a torus, or less symmetrical, like a teardrop. As long as it is designed within certain specifications, once you hand it off to the computer, your work is done.\n\nThe algorithm created by the researchers determines the exact order of bases needed to provide the “scaffold,” the single strand of DNA that will bend and twist around itself to produce the shape. It even has a cool name: DAEDALUS. (DNA Origami Sequence Design Algorithm for User-defined Structures — not an exact match, but we’ll forgive them.)\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIt works like a charm for all kinds of shapes — they checked, of course, using 3D single-particle cryo-electron microscopy, obviously:\n\nThe uses in medicine and gene editing are obvious, but the researchers hope that this sudden and drastic increase in the technology’s accessibility will lead to uses being pondered beyond those fields.\n\nDNA storage, for instance, is potentially made far more convenient by this. A unique structure could be created using the algorithm, with portions dedicated to encoded binary data — basically it would be a nanoscale ROM disk made of DNA. How cool is that?\n\n“Our hope is that this automation significantly broadens participation of others in the use of this powerful molecular design paradigm,” said Bathe."}