{"url": "https://techcrunch.com/2023/10/13/tiktok-scores-sizable-disney-deal-including-a-content-hub-and-publisher-partnership/", "title": "TikTok scores sizable Disney deal including a content hub and publisher partnership", "authors": ["Sarah Perez", "Consumer News Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-10-13T00:00:00", "text": "TikTok has landed Disney as its latest big-name publishing partner for its premium ad product, Pulse Premiere, announced earlier this year. The company will join other large publishers, including NBCU, Condé Nast, DotDash Meredith, BuzzFeed and more, which offer brand-safe videos for marketers to place their ads around. The new deal will also see TikTok offering Disney a dedicated destination within the video app where Disney fans can watch videos from Disney’s brands, create their own with Disney’s music and special effects, play Disney-themed trivia, and collect “Character Cards” of their favorite players.\n\nThe company describes this content hub as a “first-of-its-kind,” suggesting its Disney partnership stretched beyond Premiere Pulse, where it’s now one of the largest Pulse Premiere publishers, to include special accommodations — and potentially setting the stage for similar large brand partnerships in TikTok’s future.\n\nThe deal came about to help Disney mark The Walt Disney Company’s 100th anniversary, which called for a special celebration across social media. Disney remarked on its decision to work with TikTok — an app still facing government scrutiny and lawsuits over its ties to China and addictive nature — noting it had to do with TikTok’s reach. Explained Asad Ayaz, chief brand officer of The Walt Disney Company, in an announcement, Disney’s portfolio of brands and experiences has seen more than 240 billion views on TikTok.\n\n@tiktoknewsroom In honor of @Disney’s 100th anniversary, we’re launching the Disney100 Hub on October 16! It’s a first-of-its-kind destination for Disney fans on TikTok, offering a unique interactive experience where stories, magic and memories come together. ✨ Learn more about the Hub and our latest exciting partnership via the link in our bio! ♬ original sound – TikTok Newsroom\n\n“…TikTok has become a go-to destination for Disney fans to create, engage and connect around their favorite Disney films, shows characters and experiences, so we’re thrilled to partner with them as we celebrate the 100th anniversary of the company,” Ayaz said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe Disney activation on TikTok will be extensive, encompassing 48 Disney account handles who will participate for a four-week period across 24 regions around the world starting on October 16. This will include Disney brands highlighting content from Disney, Pixar, Star Wars, Marvel, ESPN, National Geographic, Disney Parks and more. Those Disney-run TikTok accounts have a total of over 150 million followers, but that number may grow with this event as TikTok notes fans should “expect daily reminders” of why they connected with “favorite Disney characters, franchises, movies and Disney memories.” This may also prompt users to create more Disney-related content on the platform.\n\nTo aid with that, Disney and TikTok will also release a Disney100 Playlist for the community which includes popular songs from Disney’s catalog, ranging from classics from movies like “Cinderella” and “The Lion King” to more current songs from “Toy Story,” “High School Musical” and the upcoming movie “Wish.”\n\nAs a Pulse Premiere publisher partner, marketers can run ads in brand-safe slots alongside entertainment and sports content from Disney. Though TikTok offers an endless, personalized feed of content for users to scroll through, Pulse Premiere guarantees the ads will run immediately after what TikTok refers to as “suitable videos” from its premium publishing partners. The company had previously partnered with big-name publishes for this offering, including NBCU, Condé Nast, DotDash Meredith, BuzzFeed, Hearst Magazines, Major League Soccer, UFC, Vox Media, and WWE .\n\nBecause of their placement, TikTok said its users are 2.6x more likely to interact with a Pulse ad versus a comparable ad on other video platforms. It also said that Pulse campaigns increased brand recall by +9.8%, on average, and awareness by +6.8%."}