{"url": "https://techcrunch.com/2025/05/06/amazon-owned-zoox-issues-recall-following-robotaxi-crash/", "title": "Amazon-owned Zoox issues recall following robotaxi crash", "authors": ["Kirsten Korosec", "Transportation Editor", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-05-06T00:00:00", "text": "Zoox, the autonomous vehicle company owned by Amazon, paused its driverless testing program for more than a week and issued a voluntary recall of its software following a crash in Las Vegas, according to the company and a filing with federal safety regulators.\n\nThe April 8 crash, which involved an unoccupied Zoox vehicle and a passenger car, prompted the company to issue a recall for about 270 vehicles equipped with a specific version of its automated driving system. The recall number doesn’t reflect the full fleet size, according to Zoox. The recall was issued over concerns the self-driving software could inaccurately predict the movement of another vehicle and increase the risk of a crash.\n\nThe company said no injuries were reported and minor damage occurred to both vehicles. The crash occurred after a passenger car quickly approached the lane from a commercial driveway where the purpose-built robotaxi was traveling, according to Zoox. The Zoox vehicle, which inaccurately predicted that the passenger car would proceed, slowed down and steered to the right. Instead, “the car came to a stop, fully yielding to the Zoox robotaxi and remaining in the shoulder lane,” according to the company. “The Zoox robotaxi braked hard, but contact was unavoidable,” the company wrote in its blog post.\n\n\n\nZoox said it paused all driverless testing operations on April 8 — the day of the crash — and launched an internal review. Operations resumed after a software update was released to all Zoox vehicles on April 17, according to a report submitted to the National Highway Traffic Safety Administration.\n\nThe crash, and voluntary recall, comes as Zoox pushes to launch a commercial robotaxi service in Las Vegas. A company spokesperson confirmed that Zoox is still planning to launch that service later this year.\n\nThe company has been testing its self-driving system in retrofitted Toyota Highlanders and its custom-built robotaxis, which don’t have a steering wheel or pedals in various cities, notably along the Las Vegas Strip and in certain San Francisco neighborhoods. Earlier this year, Zoox allowed employees, media, and other vetted guests to try the service. The company is also testing in Austin, Miami, and Seattle using Highlanders with human safety operators behind the wheel.\n\nThis is the second Zoox recall this year. In March, the company issued a voluntary recall for 258 vehicles due to issues with its autonomous driving system that could cause unexpected hard braking.\n\nLast year, the NHTSA conducted a preliminary investigation into the company after the agency received two reports of incidents in which motorcyclists collided with the back of Toyota Highlanders equipped with Zoox technology. The initial investigation found that in both cases, the Zoox vehicles were operating with their autonomous systems engaged."}