{"url": "https://techcrunch.com/2022/08/16/omni-looks-to-take-on-looker-with-its-cloud-powered-bi-platform/", "title": "Omni looks to take on Looker with its cloud-powered BI platform", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-08-16T00:00:00", "text": "There’s been an explosion of business intelligence (BI) tools in recent years, or tools that analyze and convert raw data into info for use in decision making. Investments in them are on the rise, but companies are still struggling to become “data-driven” — at least, according to some survey results. NewVantage Partners’ 2022 poll of chief data and analytics officers found that less than half (47.4%) believed that they’re competing on data and analytics. They cited company culture and the overwhelming growth of data as the top blockers, as well as concerns over data ownership and privacy.\n\nColin Zima believes that there’s another major challenge businesses adopting BI tools have to overcome: poor usability. He’s the co-founder and CEO of Omni, a BI platform that aims to simplify working with data across an organization. As such, Zima might not be incredibly impartial. But on the other hand, he’s a longtime participant in the data analytics community, having worked at Google on the Search quality team and at Looker as the chief analytics officer and VP of product.\n\n“In an era where every employee is expected to be a data user, getting the basics done is still way too hard: Looking up data across many different systems or waiting on the data team to pull data or being forced to learn structured query language (SQL) to answer questions,” Zima said. “The reality is business users need great, simple tools to do their jobs better and data teams need powerful tools to manage that process and do high-value work that complements core reporting.”\n\nZima co-launched Omni in early 2022 alongside Jamie Davidson and Chris Merrick, who spent several years at Looker and Stitch, respectively, before joining the startup. The three co-founders were spurred by a mutual desire to build a product that made it easier for data teams to perform “high-value” work that complemented core business reporting processes, Zima said.\n\n“There are … some painful trade-offs folks make when they use a centralized platform — it feels so heavy to make changes, so folks were complementing with analyst tools or other point solutions and this fragmentation has only accelerated. This creates trade-offs — and really, tension — between data people and business teams, or folks that want to move quickly and your board reporting,” Zima said. “While legacy BI platforms unified teams around reliable, centralized data, it still meant a heavy upfront data modeling process. With Omni, we’re filling the gap between instant-gratification analytics and the reliability and governance of mature enterprise BI.”\n\nInvestors believe in Omni’s vision, having pledged $26.9 million toward the startup, including a seed round joined by Box Group, Quiet and Scribble and a $17.5 million Series A led by Redpoint with participation from First Round and GV. Omni’s post-money valuation stands close to $100 million, according to a source familiar with the matter. As for the proceeds, Zima said they’ll be put toward go-to-market efforts; he claims that Omni still hasn’t spent the seed.\n\nOmni is comparable to existing BI tools like the aforementioned Looker and Tableau, Zima says. But the platform can also take raw SQL — the language used to communicate with databases — and break it into modeled components. Omni’s built-in tools generate data models and components from SQL, creating a “sandbox” data model and allowing users to promote metrics to the official, shared model that the whole organization can use. Beyond this, Omni runs “automated aggregates” in-database to accelerate queries and manage costs for users (and their employers).\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“The compromise most companies are forced to make with monolithic, centralized BI tools is that they hamstring employees and teams to work outside the core paths. That leaves the choice of either not using data or folding in shadow IT like Excel or isolated analytical tools to complete a workflow,” Zima said. To his point, research suggests that roughly half of organizations struggle to use and access quality data. “By bridging this gap between IT and business units, Omni is building a system that gives IT more control by promoting manageable decentralization versus just spinning up isolated tools to solve problems. Ultimately, this means all that business logic and data control can be retained and observed by IT and data teams, and thoughtfully integrated into core systems versus left on islands.\n\nLaunching a company during a downturn isn’t easy, although Zima says that Omni was insulated in many ways because of its founders’ longstanding relationships with Omni’s investors. Regardless of the macroeconomy, the core focuses this year will be hiring and customer acquisition, Zima says — Omni only worked with five development partners prior to today, which marks the platform’s public launch. Omni has about 16 employees currently and plans to expand that number by 25% by 2023.\n\nThe trick will be maintaining growth in the face of competition like Y42, Metabase and MachEye, the last of which raised $4.6 million in seed funding two years ago. More formidable is Pyramid Analytics, a business intelligence and analytics firm that landed $120 million last May. There’s also Noogata, Fractal Analytics, Tredence, LatentView and Mu Sigma.\n\nFor Zima’s part, he expects the down market to work in Omni’s favor at the expense of rivals as companies seek to consolidate their tools and “streamline their data stacks.”\n\n“[Omni] is the only BI platform that combines the consistency of a shared data model with the freedom of SQL … [and] enables this virtuous feedback loop between one-off speed work and the governed model,” Zima said. “A core part of our thesis is that the central challenge that remains in business intelligence is tackling and uniting the entire surface area, which is mostly made up of point solutions … The emergence of the cloud data era [opens] up new, more ambitious possibilities like proactively optimizing performance.”"}