{"url": "https://techcrunch.com/2025/02/07/hiveclass-a-platform-for-virtual-pe-classes-for-kids-raises-1-5m/", "title": "Hiveclass, a platform for virtual PE classes for kids, raises $1.5M", "authors": ["Lauren Forristal", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-02-07T00:00:00", "text": "When the COVID-19 pandemic struck in 2020 and schools transitioned to online learning, both Joe Titus and Paul Suhr were concerned about how to maintain their children’s activity levels in the absence of mandatory physical education classes and sports.\n\nThe two friends’ solution was Hiveclass, a New York-based edtech platform that hosts online courses for K-12 students to learn about fitness, sports, dance, yoga, nutrition, and mindfulness, among other things. There is also a self-defense course.\n\nEven in a post-pandemic world, the platform is attracting interest owing to a confluence of trends. Kids are becoming increasingly disengaged from P.E. classes in schools, often choosing to skip them entirely. Many students dread P.E. for its highly competitive environment, where bullying occurs often.\n\nAdditionally, parents across the U.S. are struggling to pay youth sports expenses. Titus and Suhr, who bonded over second-grade baseball, want their kids to experience the same enjoyment in sports that they once did, but many of these same experiences are becoming unattainable.\n\n“As a parent in New York City,” said Titus, “the inequities of the cost of sports was beyond me. I was my son’s first soccer coach, and the cost of it was just so high. I [wondered], ‘How does a family that lives in low-income housing afford soccer?’”\n\nImage Credits:Hiveclass\n\nInvestors also recognize the value of online P.E. courses. Hiveclass — where Titus is CEO and Suhr is chief product officer — just raised $1.5 million seed funding.\n\nThe funding will be allocated to product development. It will also be used to enhance a teacher portal that’s used by educators who use Hiveclass to increase engagement in their classrooms. Also on the roadmap: new services for students with special needs.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIndeed, instead of offering subscriptions directly to parents, Hiveclass markets its services to public schools and libraries.\n\nThe platform offers a collection of short-form videos that teach children various skills, such as how to dribble a basketball. In addition to the videos, there are quizzes in between clips that require written responses, helping to keep kids focused and engaged.\n\nAccessing that teacher portal on the platform, educators can view all their students and their quiz answers to ensure that everyone is completing their work. (Hiveclass says another selling point is that students can earn P.E credits outside of class.)\n\nHiveclass believes it stands out from other edtech platforms and even educational YouTube channels by emphasizing the P.E. and wellness field. The company claims to align with national standards set forth by SHAPE America, the Society of Health and Physical Educators organization that governs physical education in the U.S. Its closest rival, PLT4M, is also a SHAPE America member.\n\nThe company currently partners with more than 80 educational institutions and has over 13,000 students and teachers on the platform.\n\nHiveclass doesn’t publicly disclose pricing; it says that it’s tailored for each client based on their specific requirements, including student count. But it says it has generated more than $2 million in revenue and hopes to hit an additional $1 million by next month. The outfit is also exploring additional revenue streams, says Titus, including licensing agreements.\n\nThe recent round was led by Spring Mountain Capital. Other investors in the round included Georgetown Angel Investor Network (GAIN), New York State Venture Fund, Rethink Education, and Techstars.\n\nThe funding brings the startup’s total capital raised to over $3 million."}