{"url": "https://techcrunch.com/2024/05/16/sigma-is-building-a-suite-of-collaborative-data-analytics-tools/", "title": "Sigma is building a suite of collaborative data analytics tools", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-05-16T00:00:00", "text": "In 2014, Jason Frantz and Rob Woollen co-founded Sigma Computing, a platform that overlays data stored in data platforms such as Snowflake and Google BigQuery with a spreadsheet-like interface for data visualization and analytics. With Sigma, the two former software engineers sought to tackle what they perceived as the intractable data challenges faced by large corporations: unwieldy tooling and difficult-to-manage data stores.\n\nIn a 2023 survey from Oracle, the majority of business leaders said that they don’t believe their employer’s current approach to data and analytics is addressing their needs. Seventy-seven percent said that the dashboards and charts they get aren’t germane to decisions they need to make, and 72% admit the sheer volume of data — and their lack of trust in that data — has at times stopped them from making decisions altogether.\n\n“After recognizing the huge advances in cloud data infrastructure during the past decade, Jason and Rob identified a gap in the market,” Sigma Computing CEO Mike Palmer told TechCrunch in an interview. “Sigma is building a data workspace for everyone — where teams can analyze data in spreadsheets, build business intelligence in the form of dashboards and reports and create data workflows and applications where data never leaves a company’s data warehouse.”\n\nOut of the gate (in 2014), Sigma only offered a set of basic business intelligence and analytics tools to connect to a customer’s outside databases. But the firm — which Frantz and Woollen founded while entrepreneurs in residence at Sutter Hill Ventures, Woollen having come from Salesforce’s Work.com org — quickly grew from there.\n\nToday, Sigma’s product suite consists of tools that let users analyze data “in-place” in databases containing up to billions of records. Customers can tap the platform to build dashboards, reports, workflows and apps without data leaving its source.\n\n“We champion what we call ‘massive multiplayer business intelligence,’ a dynamic environment where professionals, regardless of their technical expertise, come together to leverage their distinct skills, all in real time, all within the same platform,” Palmer said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSigma offers a range of tools built for business intelligence and data analytics workloads. Image Credits:Sigma Computing\n\nThe go-to-market strategy has turned out to be a winning one.\n\nAccording to Palmer, Sigma’s revenue has grown 100% year-over-year for four straight years on the back of a ~1,000-company customer base. Those figures have investors pleased. On Thursday, Sigma closed a $200 million Series D funding round co-led by Avenir Growth Capital and Spark Capital that values the company at $1.5 billion, up 60% from its valuation in 2021 (when it raised $300 million).\n\nPalmer believes the key to Sigma’s success in the face of stiff competition like Tableau and Microsoft’s Power BI has been a continued focus on creating data analytics tools with a low barrier to entry.\n\n“Existing business intelligence platforms were primarily designed for ‘super-analysts’ — individuals who work within lines of business and grasp the intricacies of enterprise-scale data manipulation,” Palmer said. “For most people, business intelligence was — and remains — a significant hurdle. Jason and Rob believed there was a giant market of smart people that have either been ignored by more technical tools or have been given simple tools that only allow them to ask simple questions.”\n\nIt probably doesn’t hurt that the market for business intelligence and analytics tools is huge — and growing at a very healthy pace. According to Precedence Research, a market research firm, the business intelligence sector alone will climb from $27.24 billion in 2022 to 54.9 billion by 2023.\n\nWith Sigma’s massive war chest — $581 million in venture capital — and a staff of around 450, the company plans to grow its operations in the U.S. and internationally and invest in AI, specifically integrations with generative AI platforms like OpenAI’s to let users ask questions about their company’s data.\n\n“We believe, due to data volumes, speed of change and governance, plus security requirements, that data will increasingly be centralized in systems like Databricks and Snowflake,” Palmer said. “For competitive enterprises to work synchronously and at high velocity, you need to provide your employees with raw, live data and the tools to build and communicate together. And they need a platform that enables them to access that data with whatever skills they have.”\n\nSnowflake Ventures, Sutter Hill Ventures, D1 Ventures, Xn Ventures and Altimeter Capital also participated in Sigma’s Series D."}