{"url": "https://techcrunch.com/2018/09/27/our-3-favorite-startups-from-urban-xs-4th-demo-day/", "title": "Our 3 favorite startups from Urban-X’s 4th demo day", "authors": ["Arman Tabatabai", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2018-09-27T00:00:00", "text": "Urban-X, the urban-tech startup accelerator backed by MINI and early-stage urban-tech fund Urban.Us, hosted at its Brooklyn HQ a demo day today for its fourth cohort of companies. The seven presenting companies offered solutions to issues plaguing modern cities, including toll-road pricing, energy and construction management and even the inefficiencies of modern cycling helmets.\n\nIn a day that offered an impressive display of entrepreneurial talent, here are three of the companies that really stood out to us.\n\nRentlogic\n\nIn hopes of improving landlord transparency, Rentlogic uses years of city government data to create objective algorithmic letter ratings for apartment buildings. As CEO Yale Fox pointed out, despite city-dwellers spending half our paychecks on rent, urban housing hasn’t seen the same rating systems that we use to guide decisions on where we eat, what car we buy or what shows we binge. Rentlogic allows apartment hunters to screen buildings before signing a lease and avoid committing to unhealthy conditions or an absentee landlord.\n\nRentlogic partners with landlords looking to obtain a stamp of quality for potential renters, offering an added inspection feature that allows them to hang a letter rating outside their building. The company’s roster of customers already includes Blackstone and Phipps Houses, the largest for-profit and nonprofit landlords in the world, respectively.\n\nWhat stands out with Rentlogic is its ability to scale. Though currently only in New York City, the same data used in New York presumably exists across all major U.S. markets, and Rentlogic has minimized the cost of entering new cities by building out the back-end infrastructure required to ingest and analyze the data. From a demand perspective, as renters defer to Rentlogic for quality assurance and more competitors hang “A” ratings outside their buildings, landlords will face more pressure to maintain the same offering.\n\nThe idea hit home for a born-and-bred New Yorker with my own set of landlord horror stories, and the first thing I did when I left was look up my building on Rentlogic.\n\nCampsyte\n\nMost companies wish they had mega-campuses or “motherships” where they could offer employees access to sprawling outdoor working areas. For companies based in urban areas, offering outdoor space can be tough, with many parks often privatized, far from city centers or void of the amenities needed to be productive.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nCampsyte transforms underutilized urban outdoor spaces into productive and fun spaces that customers can book for co-working purposes, corporate off-sites or events. Similar to WeWork’s approach with buildings, Campsyte takes a parking lot and adds value by filling it with greenery, furniture, electricity, Wi-Fi and other services. With its services driving nearly 10x the annual revenue per square foot seen by traditional parking lots, the value proposition for lot owners is convincing.\n\nGiven the competition companies are facing when it comes to attracting and retaining talent, providing the same amenities as competitors based outside city centers seems invaluable, with Campsyte boasting an extremely impressive roster of partner companies, including LinkedIn, PayPal, Salesforce and Airbnb.\n\nODN (Open Data Nation)\n\nAs anyone who has driven in a city knows, car crashes or accidents can often be caused by the built environment around you. Yet insurers, which focus on personal characteristics like credit scores when underwriting a policy, lack the measurement tools to assess the risk of someone’s external environment.\n\nFounded by an MIT-trained city planner, ODN builds risk models using machine learning and public data records to help insurers evaluate risk and mitigate accidents. The resulting analytics eases the selection process for insurers, allowing them to drive more sales with less cost and risk. ODN is already partnered up with some of the world’s largest insurers, including Zurich and Travelers.\n\nThe potential use cases for ODN’s technology go far beyond the massive existing insurance market, with the eventual rollout of autonomous cars forcing insurers to ask how they construct policies when human behavior plays no role in accidents. ODN is working with carriers to help answer this question while helping create a more efficient and fair underwriting process today.\n\nOther members of Urban-X Cohort 4 included:\n\nAvvir: “Avvir automates quality assurance for the construction industry, providing real-time insights into the progress and potential defects on a project.”\n\nClearRoad: “ClearRoad helps government agencies automate toll road pricing for any section of road without the need for traditional proprietary hardware infrastructure.”\n\nPark & Diamond: “Park & Diamond makes biking better by reinventing the bike helmet, using next-generation materials to build a safer, more portable helmet that can roll up into the shape of a water bottle for easier carrying, while looking like a regular hat, cap, or beanie.”\n\nSapient Industries: “Sapient Industries has developed an autonomous energy management system that senses and learns human behavior in order to eliminate wasted energy in buildings.”"}