{"url": "https://techcrunch.com/2023/05/22/endua-funding/", "title": "Australian clean tech Endua fixes renewable energy’s intermittency problem", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-05-22T00:00:00", "text": "One major problem with renewable energy sources like wind, solar and hydro is intermittency. This means they cannot be relied on constantly since, for example, the sun might stop shining or it might be a still, windless day. To fill gaps, users often rely on diesel generators or batteries. But diesel generators produce emissions and batteries only last for a short time. Clean tech startup Endua says it has found the solution with its modular hydrogen generation and storage technology.\n\nThe Australian startup announced today it has raised AU$11.8 million (about $7.8 million). Participants in the round included new investors, Queensland Investment Corporation (QIC), Melt Ventures and 77 Partners, which together put in AU$7.5 million. The rest of the funding came from returning strategic investors Main Sequence (the deep tech fund founded by government science agency CSIRO), and Ampol, Australia’s largest transport energy provider.\n\nLaunched in 2021 by CEO and founder Paul Sernia, Endua uses stand-alone, modular hydrogen power banks that it says can drive power loads of up to 100 kW per module. This is enough to power water pumps, farm sheds or stand-alone telecom infrastructure. The amount of electricity used is scalable because excess renewable energy is stored as hydrogen and converted into electricity by fuel cells as needed.\n\nSernia told TechCrunch that storing excess renewable energy as hydrogen overcomes intermittency challenges, since users can draw on their stored energy whenever needed, or when renewable energy generation is insufficient. Endua serves a wide range of customers, including regional communities, farming and agriculture, telecom infrastructure, energy distributors and remote infrastructure.\n\nEndua designed and built electrolyzers that split water molecules into hydrogen and oxygen through electrolysis by using renewable energy sources like solar or wind power. Then that generated hydrogen is stored in its modular banks, which are high-pressure storage tanks that can preserve the integrity of hydrogen for months. Once Endua’s customers are ready to convert their stored hydrogen into electricity, the power banks use electrochemical technologies, mostly through hydrogen fuel cells, which creates no carbon emissions.\n\nSernia said Endua’s power banks are designed to integrate with existing energy systems, including renewable energy sources like solar panels and wind turbines, to capture excess energy. This helps ensure customers have a continuous power supply.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nEndua will use its new capital to scale its pilot systems and on hiring over the next 18 months. In addition to its funding, Endua has also received a total of $4.3 million in grands, including the Entrepreneurs’ Programme Accelerating Commercialisation Grant, the Cooperative Research Centres Project and the Advanced Manufacturing Growth Centre Grant. All of its products are manufactured in Australia and it is currently establishing manufacturing facilities in Queensland.\n\nIn a statement about the funding, Ampol managing director Matthew Halliday said, “Endua’s technology lays the foundation for off-grid and diesel energy users to meet decarbonisation commitments and become self-sustaining. We look forward to working with customers as the technology is scaled to further explore applications across our economy.”"}