{"url": "https://techcrunch.com/2024/09/13/telegram-ceo-durovs-arrest-hasnt-dampened-enthusiasm-for-its-ton-blockchain/", "title": "Telegram CEO Durov’s arrest hasn’t dampened enthusiasm for its TON blockchain", "authors": ["Rita Liao", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-09-13T00:00:00", "text": "Telegram has had a tough few weeks. The messaging app’s founder, Pavel Durov, was arrested in late August and later released on a €5 million bail in France, charged with running a company complicit in distributing child sexual abuse material and facilitating drug trafficking and organized fraud. Predictably, that crashed the price of the network’s cryptocurrency, Toncoin, by a third.\n\nBut last Wednesday, in the ritzy Dosan-daero part of Seoul, you could see no signs of gloom in the long line of people waiting to get into a party hosted by TON, the blockchain that runs on Telegram. Indeed, the crowd of developers, marketers, investors, and other players from the blockchain ecosystem was in the mood to celebrate: A few hours earlier, TON had announced at Korea Blockchain Week that transactions on the blockchain had crossed the 1 billion mark.\n\nUnexpectedly, Durov’s high-profile arrest has proved to be something of a boon for Telegram. Downloads of the app spiked soon after the arrest, and it seems to have improved metrics on TON as well.\n\n“Last week, TON hit all-time highs for active users and number of transactions during what, let’s be honest, is probably one of the worst weeks ever in news for TON,” Jack Booth, co-founder of TON Society, which manages the TON community, said during a conference at Korea Blockchain Week.\n\nA complicated relationship\n\nIn theory, Durov’s status shouldn’t have a material impact on TON. Telegram and TON Foundation, which develops the blockchain, claim to be two independent entities. But things are more complicated in reality.\n\nDurov started TON with his brother Nikolai Durov under Telegram, but the messaging app had to abandon the blockchain after the U.S. Securities and Exchange Commission sued Telegram for conducting a massive unregistered initial coin offering. The app has since tried to distance itself from TON — at least by separating its corporate structure.\n\nMeanwhile, a group of open source developers and blockchain enthusiasts founded The Open Network Foundation, or TON Foundation, to continue developing the blockchain. Since then, TON has spawned several entities to support its fast-growing operations, including TON Society and The Open Platform, or TOP, which created the TON-based crypto wallet that runs on Telegram.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAnd to address concerns that the app’s disproportionate holding of Toncoin could compromise the decentralized nature of the network, Durov in February announced plans to “limit Telegram’s share of TON at ≈10% of the supply.”\n\nTON Society’s Jack Booth speaking at Korea Blockchain Week 2024. Image Credits:TechCrunch\n\nStill, the fact that people panic-sold Toncoin speaks to the perception that TON and Telegram are closely related and somewhat interdependent. A person who identified himself as Minho told me at Korea Blockchain Week that he bought more TON since Durov’s arrest in the hopes that “prices will rebound following his release.”\n\nOperationally, Telegram’s ambition of becoming a super app like WeChat also depends heavily on the success of TON. To attract third-party developers, Telegram needs not only a proper tech stack, but also a solid payments network to support in-app commerce. Only, instead of using a fiat system, it chooses cryptocurrency.\n\n“When you’re tying your ecosystem to the success of the Telegram platform, then obviously when that comes into question, people start to doubt what could happen,” Booth told me. Still, he stressed that TON being a blockchain network gives it a level of independence that would let it survive without Telegram.\n\n“At the end of the day, TON’s ecosystem is just using Telegram as a front-end experience. The app works on the website, too, so even in the most horrible event that Telegram is shut down, TON will still be available to run,” he said.\n\nOptimism galore\n\nA billion transactions sounds like a big number, but how big is TON really? It’s tricky to compare on-chain activity, as decentralized networks are often tracked by different parties and measured by different metrics. But to give you a rough idea: Daily transactions on TON stood at 14.6 million on September 10 — that’s about 40% of the “non-vote” transactions on Solana, a more established blockchain that’s currently the fifth-largest by market cap. Toncoin, by market cap, stands at tenth place.\n\nNonetheless, the total value locked on TON is only $408 million, about 8% of Solana’s current worth of $4.77 billion, according to DefiLlama.\n\nThese numbers are in line with Booth’s remarks that TON’s current boom is driven by a handful of viral “tap-to-earn” games that reward users with in-game assets for simply clicking on a button, and players trade these assets on exchanges where they are accepted. Solana, on the other hand, attracts far more capital thanks to its vibrant and much more varied decentralized finance (DeFi) ecosystem.\n\nOne such TON-based game called Hamster Kombat, where people role-play as crypto exchange CEOs, has amassed 250 million monthly active users, according to Booth. That number is impressive, but it should be taken with a grain of salt, since the “tap-to-earn” mechanism used here is quite menial by modern video game standards and raises valid questions about such games’ longevity.\n\nBut for TON, and Telegram by extension, the value of clicker games lies in their ability to bring users to web3 with just a few taps (and keep them there with a financial incentive), Booth said during his speech. And it should be noted that playing web3 games requires users to jump many hoops in the first place — they have to download an app, set up a crypto wallet, and keep lengthy wallet passkeys safe — so anything that makes things easier is likely to be favored.\n\nThat’s not to say that studios aren’t trying to build more sophisticated titles for games for TON. One such title, called Catizen, lets players manage and optimize a colony of cats and has attracted 30 million monthly users, over 2 million of whom are active on the blockchain, Tim Wong, chairman at Catizen Foundation, told TechCrunch. In less than six months, the game has racked up revenue of $21 million.\n\n“Most web3 games acquire users without generating any in-game revenues,” Wong told me. “The mini-game ecosystem is already very established on WeChat, and it’s just starting on Telegram. We believe humans’ need for high-quality gameplay and their desire to spend on entertainment are universal.”\n\nToncoin may not be going to the moon anytime soon given the charges against Durov, or how often Telegram is brought up in relation to bad news. But as is often the case with crypto projects, there is a good amount of fervor and optimism on display here. Denmark-based Roy Chen, who has developed a console-inspired title, HypeSaints, that runs on TON, pointed out that the major impact of Durov’s arrest has been on Toncoin’s prices rather than the ecosystem itself.\n\n“After all, the potential for crypto mass adoption through TON is huge, thanks to Telegram’s 950 million users,” he said."}