{"url": "https://techcrunch.com/2024/06/05/eko-health-scores-41m-to-detect-heart-disease-earlier-and-more-accurately/", "title": "Eko Health scores $41M to detect heart and lung disease earlier and more accurately", "authors": ["Marina Temkin", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-06-05T00:00:00", "text": "In 1816, French physician René Laennec invented an instrument that allowed doctors to listen to the heart and lungs. That device — a stethoscope — eventually evolved from a simple wooden tube to a lightweight two-earpiece version most doctors today wear around their necks.\n\nEko Health, a startup founded in 2013, is bringing this ubiquitous medical tool into the digital age by enhancing it with AI. Over the past decade, Eko has sold its stethoscope to more than 500,000 physicians and healthcare providers. Because they’ve been used on millions of patients, the company has amassed a large dataset of chest sounds and electrocardiogram (ECG) information, which Eko used to develop various algorithms for detecting heart conditions.\n\n“The stethoscope exam is incredibly inconsistent and inaccurate. Patients get late diagnoses, or they get misdiagnosed,” said Connor Landgraf, Eko Health’s CEO and founder. “We want to bring precision using AI that could enable patients to get earlier, more competent diagnoses.”\n\nLandgraf explained that with a traditional stethoscope, a physician can’t always hear the subtle differences between health and disease. “With our AI, they can combine [heart sounds] with cardiac rhythm assessment and then have the AI interpret that. You almost have the skills of a cardiologist in the pocket of a primary care physician or even a nurse practitioner or a frontline healthcare professional,” he said.\n\nIn April, the Eko stethoscope received FDA clearance for using its AI to help detect the first signs of heart failure during a routine medical exam. That’s the company’s third algorithm to receive FDA approval. Eko’s AI has also recently been cleared to detect heart murmurs, which could be a sign of abnormal heart valves. (A Massachusetts General Hospital study found that Eko’s AI identified more than two times as many patients with heart disease compared to primary care doctors.)\n\nEko’s clinical milestones have helped it raise a $41 million Series D round with participation by Artis Ventures, Highland Capital Partners, NTTVC and Questa Capital. The latest capital infusion brings the company’s total funding to $165 million.\n\nThe fresh financing will go toward training AI algorithms to detect pulmonary conditions such as asthma and pneumonia, as well as for selling its device and companion software to doctors outside the U.S.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Of all the things that I invested in, Eko may be one of the most practical because you can easily use it to change outcomes,” said Vas Bailey, partner at Artis Ventures. Bailey lost his father to heart disease on his 11th birthday. “We can find more cases of cardiac abnormalities when you’re going to go see a doctor for a routine workup. Maybe as a part of your screening, we can help save your life. Maybe it could have helped save my dad’s life.”\n\nWhile no other company integrated AI into a stethoscope, other startups that use AI to detect heart conditions include Ultromics and CardioSignal."}