{"url": "https://techcrunch.com/2022/08/18/5-investors-explain-why-longevity-tech-is-a-long-term-play/", "title": "5 investors explain why longevity tech is a long-term play", "authors": ["Anna Heim", "Freelance Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-08-18T00:00:00", "text": "Of all the stories passed on through history, the tales of life unending have persisted in the human imagination without much change. The details differ, but nearly every civilization right from the time of the Egyptians has in some form or the other sought to delay death.\n\nWhile we’re still far away from achieving that lofty goal, science has advanced a lot and as life expectancy increased, longevity is now a realm of technology and medicine that aims to increase how long people can live healthily.\n\n“There is a common misconception in the general public that longevity means being frail and looking old for longer (“Curse of Tithonus”),” said Nathan Cheng and Sebastian Brunemeier of Healthspan Capital. “The goal is to slow the pace of aging, and even reverse the clock — this is possible in animals already. Longevity therapies mean we will live longer and in better health.”\n\nWe’re widening our lens, looking for more — and more diverse — investors to include in TechCrunch surveys where we poll top professionals about challenges in their industry.\n\nIf you’re an investor who’d like to participate in future surveys, fill out this form.\n\nBut the cost and time involved in developing longevity solutions presents a major hurdle, which means founders must be prepared to take the long view. “It is very difficult to convince people to do things that leave a visible impact only in the long term. Longevity is one of those things,” said Samuel Gil, partner at JME Ventures.\n\nBut Gil noted that the sheer breadth of opportunity the space offers is nearly unprecedented:\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThere are multiple angles to solve problems for very heterogeneous groups with different requirements. Health span versus life span, longevity for pets versus humans, biotech versus wellness, seniors versus young people, dependency versus autonomy, prevention versus treatment, analytics, education, infrastructure … Almost like how fintech was not just about creating credit card startups, we will see longevity APIs, back ends and many others.\n\nIt’s becoming clear that longevity as a theme has resonated with investors, though it appears it will be some time before more generalist investors take interest.\n\nTo get you up to speed on where the longevity market stands and where it’s headed, we spoke with:\n\nSamuel Gil, partner, JME Ventures\n\nWhat’s the most important thing first-time longevity founders need to know?\n\nLongevity is a loaded word. Although most people are interested in extending health spans (number of years you live with no major age-related health issues), not everyone is interested in (and some have prejudices against) extending life spans (delaying human death).\n\nThere are multiple reasons for this. Some think that life is meaningful because it is finite (who wants to live forever?). Others think about environmental or economic issues.\n\nSo my advice here is to use the term “longevity” with caution or use alternatives.\n\nAs we all know, it is very difficult to convince people to do things that leave a visible impact only in the long term. Longevity is one of those things. My advice here is that your product has to solve a problem for the user right now — help them relieve back or knee pain, look better and so on — to entice them to buy now. Then, you can use the longevity program as a way to retain the user for the long term.\n\nThere are multiple angles to solve problems for very heterogeneous groups with different requirements. Health span versus life span, longevity for pets versus humans, biotech versus wellness, seniors versus young people, dependency versus autonomy, prevention versus treatment, analytics, education, infrastructure … Almost like how fintech was not just about creating credit card startups, we will see longevity APIs, back ends and many others.\n\nAnalysts estimate that the market for delaying human death could be worth $610 billion by 2025. What would unlock more growth in this sector?\n\nLet me take the opposite point of view: I think the main challenge of the space is that the most audacious approaches and products have to be clinically tested in large samples of the population for very long periods of time. However, there are many other things that you can already try with a big upside and almost no downside.\n\nAs soon as a clinical trial shows positive results in humans, it will be a gold rush.\n\nWhat are you most enthusiastic about in the longevity space?\n\nWe all know how powerful technology can be in shaping behavior. I believe there is enormous potential in using technology for shaping health-positive behavior (sleep, exercise, nutrition) in the population. The impacts on the healthcare system may be tremendous.\n\nI am also very keen on quantified self-movement. I find it very gross that we know in real time what is happening in our cars, but we have no clue what’s going on inside our bodies. Continuous monitoring is going to be a reality at some point.\n\nI am also very enthusiastic about the intersection of longevity/health with general purpose technologies such as quantum computing and AI. I am pretty sure we will see tremendous advances in analysis and simulation of biological data and systems, and that is going to be massively helpful for the development of new drugs and treatments.\n\nWhat do you feel might be overhyped?\n\nImmortality and supplements.\n\nSome supplements, like NAD+, are overhyped. There is no sufficient research around them, and it is most likely to lead to a very tiny amount of life span increase in most people. Unfortunately, the supplements space is not regulated enough, and companies are making claims based on outdated papers.\n\nHas the longevity market already started paying off, or do you see it as more of a long-term bet?\n\nI see it as a long- or medium-term bet. A lot of people are still completely unaware of the work that’s being done, but with enough investment, we will find cures to help people live longer and healthier. At that time it will be the consensus. As an investor, it’s best to get into it early before there’s a consensus.\n\nAlthough the target market for most products is still very niche at the moment, I do believe that they will go mainstream in the medium term. The opportunities are endless, as the space is only getting started now and will infiltrate all aspects of our life in the next five to 10 years.\n\nFor you to back a team, does one of the founders need to have a research background, such as a Ph.D.?\n\nIt depends. We always look for the story behind the insight that was the origin of the company. If it is something that has to do with science, most probably, yes. In other cases, not necessarily.\n\nA clear understanding of the problem and specific area of longevity that one is going after, coupled with the ability to hire the right team, can lead to excellent outcomes.\n\nHow important is it for founders to incorporate an element of personalized medicine into their business?\n\nI think the longevity space is very wide. Some will be focused on niche biotech topics, while others will be more consumer-facing. For the therapies to work, I believe they will need to be personalized. We already see in modern medicine that there is no one-size-fits-all solution.\n\nHow do you prefer to receive pitches? What’s the most important thing a founder should know before they get on a call with you?\n\nThe best way to reach us is through our website. You can also drop me a DM on Twitter.\n\nThe most important thing a founder should explain is why the opportunity they are pursuing is interesting, and why they are the team best positioned to go for it.\n\nNathan Cheng and Sebastian Brunemeier, general partners, Healthspan Capital\n\nWhat’s the most important thing first-time longevity founders need to know?\n\nTo be a bona fide longevity biotech company, you must have data on healthy life span extension, ideally in multiple species. And the drug must be extremely safe for long-term dosing, or where intermittent pulsed dosing will achieve long-term benefits (e.g., senescent cell ablation or autophagy enhancement).\n\nThe drug mechanism must target one of the primary molecular drivers of aging (the oft-cited “Hallmarks of Aging” is one example framework but not to be taken as gospel), rather than palliating symptoms or downstream consequences of pathology (like most pharmaceuticals today).\n\nAs a founder, you should know that the road to longevity is long, and you must be extremely committed to see it through to the end. A traditional biotech founder can exit at or before the initial clinical indication(s) read out. To actually proceed with “label expansion” or a bona fide geroprotection trial will require a very mission-driven founder who will not relinquish strategic control over the company early. A drug that slows aging will work for many different diseases, so you should not stop at the first blockbuster indication.\n\nAnalysts estimate that the market for delaying human death could be worth $610 billion by 2025. What would unlock more growth in this sector?\n\nLongevity biotech is very new as an investment theme (less than 10 years old), and it’s growing exponentially in terms of the number of companies, investors and amount of inflowing capital. For a database of longevity companies and investors check out Longevity List here.\n\nDevelopments that would unlock more growth in longevity biotech include:\n\nSurrogate endpoints/biomarkers of the pace of aging. Measuring human life span in a clinical trial would take a long time and would be extremely expensive. Geroprotection trials (like the TAME trial) that measure delay of onset of age-related disease are not cheap either.\n\nOne solution to reduce the time and cost of clinical trials for longevity therapeutics would be to develop a surrogate biomarker/endpoint for aging using epigenetic clocks, frailty scores, composite (OMICS), etc. This would be similar to how drugs for cardiovascular disease only need to demonstrate the lowering of LDL cholesterol (the surrogate endpoint) for FDA approval instead of conducting a costly trial to show reduction of incidence of heart attacks.\n\nRegulatory progress. FDA will be slow to move, but other regulators in Japan and Singapore have been quick to recognize the importance of regenerative medicine and geroscience, likely due to their rapidly aging populations. In the U.S., there is a newly formed lobbying organization (A4LI.org) that is spearheading efforts to enact more favorable regulations around longevity therapeutics development.\n\nSuccess in clinical trials. The major watershed moment in the space may be when a drug developed by a longevity biotech company is approved for one indication (e.g., age-related kidney dysfunction), and then is approved for a second indication that’s unrelated (e.g., metabolic disease or cancer). This will prove the promise of the “geroscience paradigm” — that treating aging is more effective than “cutting off the heads of the hydra” of aging, the manifold manifestations as different diseases.\n\nPublic awareness. Greater public awareness of longevity is necessary to increase funding for basic aging biology research. Aging is responsible for an exponential increase in risk of getting diseases that kill the majority of Americans (cardiovascular disease, cancer, Alzheimer’s), but less than 1% of the NIH budget goes toward studying aging.\n\nThere is a common misconception in the general public that longevity means being frail and looking old for longer (“Curse of Tithonus”). The goal is to slow the pace of aging, and even reverse the clock — this is possible in animals already. Longevity therapies mean we will live longer and in better health.\n\nThere are over a dozen pharmacological interventions that achieve up to 30% healthy life span extension in mice, and there are already FDA-approved drugs like rapamycin and metformin, or supplements like glycine and alpha ketoglutarate. Furthermore, we know that caloric restriction/fasting is one of the most effective geroprotective interventions, and it’s practiced worldwide in specialized clinics and is part of many religions as well.\n\nA general increase in public consciousness about longevity could result from any “butterfly effect,” such as a blockbuster documentary or book, or famous person promoting longevity. For example, Vitalik Buterin, Peter Thiel and Jeff Bezos are prominent public figures who have been financing longevity biotech recently.\n\nWhat are you most enthusiastic about in the longevity space?\n\nClinical trial readouts. The general public is mostly unaware that aging is something that can be modulated. Few know that there are actual startups developing drugs that target aging, some of which are in the process of being tested in human clinical trials today. For example, BioAge and Unity Biotechnology both have drugs in Phase 2 trials that will likely have results later this year.\n\nEpigenetic reprogramming. There is a very promising new field of geroscience called “epigenetic reprogramming,” based on the 2012 Nobel Prize for “induced pluripotent stem cells” developed by Shinya Yamanaka.\n\nWith this method, you can transfect four transcription factors into an aged cell, and it will turn back the clock to a day zero, young, embryonic-like stem cell. If this could be done in the whole body in a controlled manner (“partial reprogramming”), it could potentially reverse many hallmarks of aging.\n\nA few prominent companies are working in reprogramming, including Google’s Calico Labs, Shift Bioscience (disclosure: We’re investors), NewLimit (co-founded by Coinbase’s Brian Armstrong), Retro Biosciences and Altos Labs.\n\nWhile this field is extremely promising, it’s also attracted a lot of hype. Indeed, delivering these genes to enough cells in the body is a challenge faced by the entire gene therapy field. Small molecule cocktails of Yamanaka-factor mimetics may be more tractable.\n\nDog longevity. Demonstration of healthy life span extending drugs in clinical trials of short-lived companion pets like dogs would be a major step in proving the longevity thesis and spreading awareness. Dogs age more similarly to humans than mice and are also considered by many to be part of the family. A clinical trial testing rapamycin to extend life span in dogs is already in the works at the Dog Aging Project.\n\nFrontiers in regenerative medicine. Replacement of aged cells, tissues and organs with young engineered counterparts represents an elegant solution to the problem of aging. Companies developing lab-grown cell and tissue transplants, 3D organ printing, xenotransplantation and bioelectric regeneration sound like science fiction but are very promising in the short and long term.\n\nWhat do you feel might be overhyped?\n\nThe entire field of longevity is underfunded relative to other areas of biotech and private investment. More capital is always welcome. That being said, there are areas in longevity that attract more hype and capital than others.\n\nNAD precursors are a bit overhyped. There have been beneficial results in many animal models of disease, but there is little life span extension data available, so it doesn’t meet the gold standard for longevity biotech. However, many credible scientists take these safe vitamin analogs and report acute enhancements of energy, sleep quality and amelioration of many ailments. Clinical trials are underway.\n\nHas the longevity market already started paying off, or do you see it as more of a long-term bet?\n\nAlmost all longevity biotech companies are privately held, but valuation uplifts have been quite robust as a function of time. There have also been a number of exits already in this relatively new sector.\n\nWe expect that it will be another five years or so before longevity biotech enters the general investor consciousness, but it will become [somewhat of a bubble] at that point. We have about five to 10 companies on our radar that have the potential to IPO in the next three years (Cambrian BioPharma, BioAge Labs, Juvenescence, Samsara Therapeutics, Aeovian Pharma, etc.)\n\nLongevity is, of course, a long-term bet, because it will take time to prove that these drugs extend health span in humans and cure multiple (apparently unrelated) diseases.\n\nFor you to back a team, does one of the founders need to have a research background, such as a Ph.D.?\n\nNo. Some of the longevity sector’s most creative founders are from fields outside of biology (physics, math, computer science, humanities, etc.). That said, these founders have the ability to recruit and collaborate with top scientists.\n\nGetting a Ph.D. (or dropping out of a top program) suggests competence and some level of conscientiousness, but it can also make founders less open-minded due to the conservative nature of academia.\n\nThere are plenty of examples of founders in longevity who don’t have Ph.D.s or don’t come from a traditional biology background. A Ph.D. is just one of many possible signals that the founder understands research and the scientific method. Even within our own team, Nathan and Sebastian both dropped out of our Ph.D. programs, one in physics and one in the biochemistry of aging, respectively.\n\nHow important is it for founders to incorporate an element of personalized medicine into their business?\n\nPersonalized medicine seems more popular in “regular” biotech. Aging happens to all of us, for common reasons. As a result, longevity-focused founders tend to target general mechanisms of aging that apply to all humans.\n\nThat said, for the regulatory process, since aging is not recognized by the FDA as a disease, companies often go after rarer and specific diseases even if their drug candidate targets a general mechanism of aging. That is not to say personalized medicine isn’t interesting — and there is certainly room for personalized optimization of geroprotective therapies — but it is not a requirement for the space.\n\nAnything else you’d like to comment on?\n\nThere has been an enormous amount of money (several billions) injected into the space in the last one or two years. There is a sense within the industry that we are reaching an inflection point for mainstream adoption of the longevity investment thesis.\n\nHow do you prefer to receive pitches? What’s the most important thing a founder should know before they get on a call with you?\n\nWe like to go over the deck and look into the founder backgrounds before scheduling a pitch. It’s important for founders to know that we are interested in much more than vision, budget and TAM.\n\nOur fund has significant drug discovery, regulatory and machine learning expertise. This can lead to in-depth technical discussions, and we like to dive deep into the data. We like to be the first institutional investor in companies, because we can offer a lot of support and guidance to new teams.\n\nWe are always looking to work with mission-aligned founders who are tackling aging. Feel free to reach out to us.\n\nChristian Angermayer, founder, Apeiron Investment Group\n\nWhat’s the most important thing that first-time longevity founders need to know?\n\nThat the only way to make an impact on extending human health span (i.e, the years we spend in good health) is by conclusively showing in a clinical trial that whatever therapy you’re working on can prevent people from developing the diseases of aging. If your organization isn’t set up to be able to test that, you’re not a longevity company. This has been a key focus for both the longevity companies I have founded — Cambrian BioPharma and Rejuveron Life Sciences.\n\nAnalysts estimate that the market for delaying human death could be worth $610 billion by 2025. What would unlock more growth in this sector?\n\nThis is a nonsensical, imaginary number that is almost entirely made up by the cosmetics and supplements industry. Right now, the industry for actually delaying human death is ZERO, because there are no products on the market being sold that have been shown to delay aging. Once the first ones are proven in a clinical trial, we expect that to go from zero to a trillion-dollar industry within a decade. It will be that fast.\n\nWhat are you most enthusiastic about in the longevity space?\n\nPeople who over-index on specific individual technologies often get burned because science is hard. But the things that I’m most excited for are new innovations that can follow clinical trial approval paths similar to drugs we already have.\n\nFor example, mTOR inhibitors extend health span by quite a lot in mice; they could get approved for preventing heart disease, cancer, frailty and immune decline at the same time. Those trials could look similar to those that have already been done for heart disease prevention with statins and antihypertensives.\n\nWhat do you feel might be overhyped?\n\nPartial reprogramming. It’s an extremely cool technology, but very far from clinical utility. Let’s get longevity drugs used by patients ASAP — that’s the way to make the biggest impact.\n\nHas the longevity market already started paying off, or do you see it as more of a long-term bet?\n\nIt is 100% a long-term bet. All of our companies in the space are focused on treating specific conditions first, then taking drugs that have been proven safe and effective, and applying them to multidisease prevention (i.e., longevity). It is one of the longest drug development bets, but we are creating massive value at every step along the way.\n\nFor you to back a team, does one of the founders need to have a research background, such as a Ph.D.?\n\nIt helps a lot, yes. Understanding both the science and the intricacies of drug development is vital for leading an organization developing drugs. Take Cambrian BioPharma, for example, where my co-founder James Peyer has a Ph.D. Between us, we have a combination of scientific, technical, entrepreneurship, finance and business skills to get things done. It’s the same at Rejuveron Life Sciences, where my co-founder came from a scientific background.\n\nHow important is it for founders to incorporate an element of personalized medicine into their business?\n\nPersonalized medicine is very interesting, because it’s a buzzword that we all agree is a good idea in principle: “If something will work for you but not for me, let’s use it for you and not me.” However, it’s actually a second-order problem.\n\nFirst, you must create tools that work for a chunk of people, then you can ask: “Okay, now that we know this is helping a lot of people, who does this not work as well for, and how do we identify those people or make it better?”\n\nThese processes should run in parallel, but if you study the history of drug development, drugs are released widely first, and then personalized medicine comes into play as we see how those drugs work in the real world on large numbers of people.\n\nAnything else you’d like to comment on?\n\nThe macroeconomic situation and biotech. With inflation high and the biotech markets depressed, this is one of the toughest times to be starting or running a biotech company. However, what we’ve seen in the past is that organizations with fantastic science and disciplined execution will emerge from a macro situation like this ready to make a huge impact.\n\nYou could even argue that one of the last two greatest innovations in terms of patient impact were born out of recessions: Recombinant protein technology emerged during stagflation in the ‘70s and therapeutic humanized antibodies around the dotcom crash (Humira was the first in 2002).\n\nHow do you prefer to receive pitches? What’s the most important thing a founder should know before they get on a call with you?\n\nSend them to James Peyer at Cambrian!\n\n[Editor’s note: Angermayer is chairman at Cambrian and has asked the company’s co-founder and CEO James Peyer to look at questions and pitches for him.]\n\nKeith Camhi, managing director, Techstars Future of Longevity Accelerator\n\nWhat’s the most important thing that first-time longevity founders need to know?\n\nI would say the first thing that people need to think about if they’re considering multiple potential markets for their products is that the longevity space is an excellent one to choose and a great way to cross the chasm on your product line. Specifically, building products and services for older adults and the people who care for them is massive.\n\nIt’s an underserved market. Fifty-six cents of every dollar spent on goods and services in the United States are spent by someone aged 50+, and this is growing, according to AARP. The baby boomers are going to be 65+ shortly, and in fact, older adults are going to outnumber children for the first time in the U.S. by 2030, according to the Census Bureau.\n\nIt’s a big market, but it tends to be underserved by founders, many of whom are young and solving problems that they see.\n\nYour direct consumer can be hard to reach because they’re not necessarily on the same platforms and using the tools in the same way. The caregivers taking care of older adults, of which there are 40 million in the U.S., according to AARP, don’t often self-identify as being caregivers. You have to figure out how to get to them in interesting ways.\n\nYour go-to-market strategy becomes really important to think through. What’s your lowest hanging fruit for the initial go-to-market that you can get traction on your path to serving this giant market?\n\nAnalysts estimate that the market for delaying human death could be worth $610 billion by 2025. What would unlock more growth in this sector?\n\nI’m pivoting this question by asking: Did you know that there is also another market for caregiving for these people as they live longer?\n\nThere are 40 million people providing billions of hours a year of unpaid family care, which, if accounted for at the proper market rate, would be over a trillion dollars, per research by the American Action Forum.\n\nThis would be one of the top few categories in the U.S. We are making our adult children the free caregivers in the U.S.\n\nI would say this is the path to unlock an additional market opportunity as people are living longer. Other segments are actually unfolding. And now there are several unicorns in that category already.\n\nWhat are you most enthusiastic about in the longevity space?\n\nI am excited about startups building innovative products and services for older adults and the people who care for them.\n\nCaregiver support: Support for family caregivers, including education, tools, respite care and social support; and solutions for formal caregiving to address staff shortages, training and care management tools.\n\nSupport for family caregivers, including education, tools, respite care and social support; and solutions for formal caregiving to address staff shortages, training and care management tools. Care coordination: Solutions that address the complex and fragmented nature of the healthcare system, particularly for older adults who have multiple health conditions. These include care transition, clinical collaboration, medication management, remote care delivery and care navigation.\n\nSolutions that address the complex and fragmented nature of the healthcare system, particularly for older adults who have multiple health conditions. These include care transition, clinical collaboration, medication management, remote care delivery and care navigation. Aging in place: Solutions that make it easier for seniors to remain in their homes as they age, including home retrofitting and accessibility, smart home devices, assistive robotics, fall prevention, homecare, health monitoring, digital accessibility, meal prep and delivery, emergency response systems, inclusive design of everyday devices and general support for daily living.\n\nSolutions that make it easier for seniors to remain in their homes as they age, including home retrofitting and accessibility, smart home devices, assistive robotics, fall prevention, homecare, health monitoring, digital accessibility, meal prep and delivery, emergency response systems, inclusive design of everyday devices and general support for daily living. Financial wellness and resilience: Solutions for financial security through longer life spans, including financial planning, later-life employment, retirement planning, fraud and scam prevention, longevity insurance solutions, financial monitoring and end-of-life planning.\n\nSolutions for financial security through longer life spans, including financial planning, later-life employment, retirement planning, fraud and scam prevention, longevity insurance solutions, financial monitoring and end-of-life planning. Preventive health: Solutions to support fitness, nutrition, wellness, behavior change, physical therapy, cognitive health, chronic disease management, digital health and wearables.\n\nSolutions to support fitness, nutrition, wellness, behavior change, physical therapy, cognitive health, chronic disease management, digital health and wearables. Social engagement: Solutions that address purpose, fulfillment and community engagement for older adults, including social connection, social determinants of health and overcoming isolation and loneliness.\n\nWhat do you feel might be overhyped?\n\nThis isn’t necessarily overhyped, but where we see companies go wrong is going with the mantra of, “If you build it, they will come.” This isn’t quite as easy in this category when you’re serving older adults.\n\nHas the longevity market already started paying off, or do you see it as more of a long-term bet?\n\nI think it’s a long-term bet for sure. We’re also seeing some payoffs now, though, with companies like Honor and Papa reaching unicorn status. So the answer is both, but I think it’s still early days.\n\nFor you to back a team, does one of the founders need to have a research background, such as a Ph.D.?\n\nNo, because we’re not strictly focused on the life sciences side. If we were life sciences, we probably would say yes. But for us, we’re looking for applied technologists who are solving problems in novel ways for older adults.\n\nHow important is it for founders to incorporate an element of personalized medicine into their business?\n\nFor us, it’s not as important, as this is more of a life extension question. We wouldn’t call it personalized medicine, but we do work with companies that create a personalized experience for preventive health.\n\nIs there anything we didn’t ask about that you want to comment on?\n\nWe think of longevity as broader than life extension. There’s this hidden trillion-dollar market, because caregivers are not getting compensated. The size and scope of the economy for unpaid family caregiving and what’s happening there is a key part of our healthcare system that shouldn’t be missed just because everyone’s doing it on a volunteer basis. It’s causing real economic turmoil and the people who can solve that are going to be extremely important.\n\nOur partnership with Pivotal Ventures (Melinda French-Gates) is a part of this. One of the key rationales for Pivotal’s caregiving focus, which is the strategy that Techstars’ Future of Longevity Accelerator is under, is that those 40 million unpaid family caregivers are not just a little bit of a problem.\n\nIt’s completely disruptive to careers and it’s disproportionately so to women. The oldest daughters of America are typically the unpaid family caregivers. This disrupts the workplace, not just for the individual, which is already terrible, but also for the corporations who employ them, who want to keep a diverse workforce.\n\nHow do you prefer to receive pitches? What’s the most important thing a founder should know before they get on a call with you?\n\nApplications are now open for the next Techstars Future of Longevity class! We prefer to receive them from our application process on our program page.\n\nJust remember to:"}