{"url": "https://techcrunch.com/2023/01/27/energy-transition-investments-hit-1-1-trillion-with-a-t-last-year/", "title": "Energy transition investments hit $1.1 trillion — with a T — last year", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-01-27T00:00:00", "text": "Here comes the hockey stick.\n\nAfter years of bumbling along, investment in the energy transition appears to be taking off. Businesses, financial institutions, governments and end users around the world sunk $1.11 trillion into low-carbon technologies, according to a new report from BloombergNEF. It was just over 30% more than 2021 and the second year in a row in which the growth rate exceeded that figure.\n\nPerhaps more notable is the fact that for the first time ever, money put into the energy transition matched funds spent on fossil fuel investments. If you count the $274 billion spent on improving the electrical grid, then energy transition investments shot well past the fossil fuel fossils, hitting $1.38 trillion.\n\nOver the last two decades, most low-carbon investments were targeted at renewables, including wind, solar and biofuels. They hit another record last year with $495 billion invested, up 17% from 2021. But in recent years, money has also been flowing into more diversified sectors, including energy storage, space heating, sustainable materials and electrified transport.\n\nLast year was no exception. Investments into electrified transport — think EVs and charging networks — grew a whopping 54% in 2022 to $466 billion. Hydrogen, which is often uttered in the same breath as battery-electric vehicles, contributed $1.1 billion toward the trillion-dollar total. While that figure may seem small, it’s triple the amount the sector received in 2021. Overall, investment was balanced between supply (energy production and storage) and demand (energy users like transportation, heat and sustainable materials).\n\nMost of the money has come from China. The country accounted for about half the total, $546 billion. The U.S. was second with $141 billion, and Germany was third with $55 billion. If the entire EU is lumped together, the bloc would have taken second place with $180 billion.\n\nIn particular, China dominates in areas like manufacturing capacity and supply chain development. Last year it spent heavily on electrified transportation and renewables like solar and wind. Given that combination, it’s possible that we’ll see Chinese solar panels flood the market once more, though this time they’ll be accompanied by cheap batteries. Inexpensive solar paired with cheap batteries is what’ll be needed to kick significant amounts of fossil energy from the grid.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIf there was a dim spot, it was global equity and private investment in climate tech. Those numbers were down 29% to $119 billion. That should come as no surprise; 2021 was a crazy year for venture capital and private equity.\n\nDown years are to be expected, but in the coming years, VC and PE investors will have to ramp up their commitments if climate tech is going to keep pace with demand. Take hydrogen, for example. While overall spending today is low because the technology isn’t mature, the energy source is expected to play a significant role in industrial operations 15 to 20 years from now. If that’s to happen, then startups today need to be refining that technology so it’s ready in time, and they can’t do that without committed capital.\n\nStill, the overall trend was a positive one for climate tech sectors. Does this mean everything is on autopilot now? Not at all. But it does mean that we’re less likely to be playing a game of catch-up in the near future. As I’ve said before, fears of climate tech underinvestment are probably overblown.\n\nThis report seems to support that sentiment. To hit net zero targets outlined in the Paris Agreement, BloombergNEF forecasts that annual investment should average $4.5 trillion through 2030, then $6.9 trillion the next decade, then $7.9 trillion through 2050. That sounds like … a lot. And it is. But if the current growth rate continues, it’s more than doable. Hell, if the market can sustain a 30% growth rate for the remainder of the decade, we’ll hit $7 trillion by 2030.\n\nGranted, it would be remarkable to sustain that kind of growth for that long. Even the software industry hasn’t ever posted that kind of sustained investment, for example. Business spending on software grew by 15% to 20% in the U.S. for a few years at a time in the 1970s, 1980s and 1990s, according to the Bureau of Economic Analysis, but it never hit 30%.\n\nThen again, the energy transition is unique in its scale and scope. Will we hit $7 trillion in seven years? Probably not. But the growth in investment over the last few years gives us reason to believe that while we might be behind now, we may not be for much longer."}