{"url": "https://techcrunch.com/2022/05/02/streaming-ad-spend-grew-57-in-2021-reaching-15-2b-market-to-more-than-double-from-2020-to-2022/", "title": "Streaming ad market to more than double from 2020 to 2022", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-05-02T00:00:00", "text": "Ahead of the start of the 2022 IAB NewFronts, where media and entertainment companies pitch their upcoming offerings to advertisers, the industry group behind the multi-day show released its annual report on the state of the video advertising industry. According to its findings, digital video advertising grew 21% in 2021 and is expected to grow another 26% in 2022 to reach $49.2 billion.\n\nLeading this growth is the Connected TV ad market — an indication of the sizable shift away from traditional TV viewing and toward streaming video. The “2021 Video Ad Spend and 2022 Outlook” report says Connected TV ad spend grew 57% in 2021 to $15.2 billion and will grow another 39% in 2022 to $21.2 billion. And between 2020 and 2022, Connected TV ad spend is projected to more than double, growing 118%. The IAB says that despite these figures, the ad industry hasn’t caught up to where viewers are paying the most attention.\n\nSpecifically, it notes that Connected TV viewing will account for 36% of the total time spent with both linear TV and Connected TV combined in 2022, the amount of Connected TV ad spend is not in line with that figure. Instead, only 18% of the total video ad dollars are being committed to Connected TV, which includes Connected TV (CTV) viewing, linear, social and short-form video.\n\n“Digital video is a driving force for buyers and will continue to be in 2022,” said Eric John, VP, IAB Media Center, in a statement. “However, while CTV leads the substantial growth of digital video ad spend, the amount of dollars currently allocated to CTV is not proportionate to the amount of viewer time spent with the channel. The time is now for brands and buyers to follow consumer attention.”\n\nAd buyers are also facing an industry where there are many more services available to address, including ad-supported streamers like Hulu (with Ads), Peacock, Paramount+ and others, including, in more recent months, HBO Max and Disney+, which announced plans. Plus, in a major turn of events, Netflix has just said it would introduce an ad-supported tier.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nOf course, the IAB also has a vested interest in making Connected TV a larger part of the market, as it notes that brand advertisers can access additional data like location or shopping data when making Connected TV ad buys, as compared with linear. And 59% of ad buyers said it was “very clear” where their Connected TV ads ran, versus just 50% for social video and 43% for digital video.\n\nHowever, the report acknowledged there are still challenges in the Connected TV market, including measuring incremental reach, managing frequency, and a lack of transparency and interoperability across platforms and publishers. It also pointed to the fragmentation of programmatic supply paths as another issue. But it said that nearly nine out of 10 (88%) of ad buyers are anticipating a coverage of linear TV and Connected TV in the years ahead."}