{"url": "https://techcrunch.com/2022/09/24/startups-are-building-businesses-out-of-devops-tools-for-existing-sales-platforms/", "title": "Startups are building businesses out of DevOps tools for existing sales platforms", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-09-24T00:00:00", "text": "The growing market for sales tools has given rise to a curious cottage industry: DevOps startups specifically targeting the software used in sales and marketing functions.\n\n(Here, “DevOps,” refers to tools that automate processes between software development and IT teams.) It’s become a blossoming sector all its own, with vendors selling DevOps platforms for software including Salesforce purporting to make sales tech easier to integrate into a company’s existing workflows.\n\nBut wait, you might say: Wasn’t the promise of sales software to minimize the need for custom coding to accomplish sales-related tasks? Well, yes — up to a point.\n\nTake Salesforce, for example. Built to be a customer relationship management platform, it evolved over time into a development platform — but without many of the components required to adapt it to organizations’ particular needs.\n\n“Salesforce has been dabbling in the DevOps space but hasn’t really committed,” Elodie Dupuy, the founder and managing partner at Full In Partners, told TechCrunch in an email interview. Full In Partners is an investor in AutoRabit, which provides CI/CD tools for Salesforce customer dev teams. “They rolled out the Salesforce Developer Experience in 2017 and the beta version of the Salesforce DevOps Center earlier this summer, but the solutions are incomplete for enterprise companies who are essentially running application development on the Salesforce platform.”\n\nAnother investor in the sales platform DevOps space, Sri Rao, sees tools in the vein of AutoRabit taking pressure off of developers tasked with building internal software products. Rao is a general partner at Silversmith, which recently led in a funding round for Salesforce dev tooling startup Gearset.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Salesforce has invested meaningfully over the past few years building DevOps Center as the developer has become a key persona. At the same time, while developers are an increasingly important persona, they must also continue to focus on building products for their core front office personas in sales, service, marketing and commerce.”\n\nRao continued: “Similar to traditional software development, ‘DevOps for X’ is needed to manage the proliferation of users contributing code and making changes [to platforms like Salesforce,]. Third-party tools help to bring order to the process and ensure deployments are successful and without the kinds of errors that can bring the rest of the system down.”\n\nThe accelerating pace of development is helping to drive the adoption of these tools, as well, according to Gartner research director Thomas Murphy. He pointed to surveys like a 2020 report from OverOps, a provider of software analytics tools, which found that nearly half of developers (45%) felt “pressure to move fast was one of their top software quality challenges,” while more than half (59%) were expected to release code and features anywhere from biweekly to multiple times a day.\n\n“It used to be that you bought software, spent a lot of time and money configuring, integrating and customizing a set of software, and then it would be updated by the vendor infrequently,” Murphy told TechCrunch via email. “However, vendors have faster and more frequent release cycles and customers have more frequent needs to make changes to business processes, deploy new functionality and more. This places the same pressure on the team to keep up and automate things just like we have seen with standard software development.”\n\nMurphy said that AutoRabit, Gearset and similar startups have simply recognized that there’s a market opportunity that general-purpose DevOps tools like GitHub or CloudBees don’t address. Rather than trying to compete where there are established players, these “DevOps for X” vendors are creating something focused on a specific product and platform, he said — and on users who don’t come from the same type of technical background.\n\n“Making this approachable means you have a stronger chance to succeed in your market,” Murphy added. “I do think the market will go through evolutions, that we are quite early in the process, and that there is a great opportunity. This opportunity will also impact implementation partners as they will need to shift to more automated processes as well as aid clients in implementing these types of platforms.”\n\nOf course, there’s always the risk that the Salesforces of the world build their own tooling to replace third-party solutions. But Murphy notes they haven’t historically been strong at doing this, preferring instead to acquire partners if they feel there’s a market or cash flow advantage (see: Heroku).\n\nWhere it concerns Salesforce specifically, Dupuy and Rao point to the company’s investments in supporting tech partners through efforts like AppExchange, Salesforce’s apps and extensions marketplace, as evidence Salesforce isn’t looking to build its own more robust set of DevOps tools.\n\n“Salesforce [knows] they can’t solve all their customers’ problems in a closed ecosystem, similar to why Apple or Google don’t try to build everything in their respective App Stores,” Dupuy said. “The role for integrated service partners partners to enhance Salesforce-native capabilities isn’t going away, as you can see with AutoRabit and multibillion-dollar companies in the Salesforce space like Conga, Veeva and nCino.”\n\nAs for what the future holds, Rao anticipates purpose-built DevOps startups expanding far beyond sales platforms. It’s already begun, with companies like Xtype building — and raising capital for — DevOps services around ServiceNow.\n\nMurphy, too, sees tailor-made DevOps tools evolving. But he argues they’ll go in the direction of predictive analytics and automation, following the lead of the rest of the DevOps market.\n\nThere’s certainly an appetite for it. According to one source, 65% of enterprises increased their analytics spending in 2020.\n\n“It is kind of a sequence — find a bottleneck and automate it, put the discrete automations together to drive more efficiency, then move from automation to measurement and predictive analytics,” Murphy said. “The market will move into, ‘Can these tools help me understand value attainment, opportunities to reduce spend and keep me in regulatory compliance?’”\n\nDupuy, focused on the nearer term, argued that DevOps for Salesforce solutions will grow in appeal to executives as new Salesforce developers enter the workforce.\n\n“These new developers will need guardrails to help them navigate a development process that’s overly complex without the right toolset,” she said. “The role of the Salesforce admin and developer will continue to merge as the concept of low-code and no-code development on the Salesforce platform takes hold. These admins and developers will need tools that support them across the entire Salesforce management process, whether that’s in service of promoting clean, safe code or managing Salesforce users and workflows.”"}