{"url": "https://techcrunch.com/2025/03/11/waymo-expands-its-robotaxi-service-across-silicon-valley/", "title": "Waymo expands its robotaxi service across Silicon Valley", "authors": ["Sean O'Kane", "Sr. Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-03-11T00:00:00", "text": "Waymo will start offering robotaxi rides to people in its “Waymo One” early rider program in Mountain View, Los Altos, Palo Alto, and “parts of Sunnyvale” starting Wednesday, an expansion that will bring its footprint in Silicon Valley to 27 square miles.\n\nThe Waymo vehicles will be available around-the-clock, and the new territories add to the 55 square miles of coverage already offered in the San Francisco Bay Area, the company said Tuesday.\n\nThe expansion is part of a busy year of growth in both commercial deployments and of geographic testing for Waymo.\n\nJust last week, Uber users in Austin, Texas could start getting matched to Waymo vehicles on the ride-hailing app. Uber and Waymo plan to bring the same service to Atlanta later this year. (Waymo employees have been taking autonomous trips in that city since January.) Waymo is launching in Miami, too, in partnership with African mobility startup Moove.\n\nWaymo also plans to test in as many as 10 new U.S. cities this year, including Las Vegas and San Diego — something it’s able to do thanks to a massive $5.6 billion funding round that closed late last year, valuing the robotaxi company at $45 billion.\n\nWith Cruise’s commercial business now dead, Waymo is racing ahead as the leading U.S. robotaxi company.\n\nTesla CEO Elon Musk has said his company plans to trial a version of its long-promised robotaxi service in Austin in June, and possibly in California and other locations by the end of this year. Uber and Yandex spinoff Avride also plan to launch a service in Dallas this year. Amazon-owned Zoox is also working to spin up a commercial launch in Las Vegas and, eventually, in San Francisco as well."}