{"url": "https://techcrunch.com/2022/12/01/5-ways-consumer-startups-can-leverage-digital-advertising-in-a-downturn/", "title": "5 methods for leveraging digital advertising during a downturn", "authors": ["Alex Song", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-12-01T00:00:00", "text": "For those on the sidelines, the story of digital advertising over the past couple of years has been as entertaining as a binge-worthy TV series. Apple’s App Tracking Transparency (ATT) policy kicked things off in spring of 2021, and the plot only thickened with rising inflation, a likely recession and an unexpected cast of new ad platform characters: Netflix, Uber, and, curiously, Apple.\n\nWhile dramatic, these headlines tend to gloss over what’s actually going on: Digital advertising may be in transition, but it is not dead. Consumer brands, especially direct-to-consumer (DTC), continue to rely on digital advertising and there are a growing number of ways to use it well.\n\nBased on our work with hundreds of brands, along with a recent survey of 158 consumer marketing leaders, outlined below is what we know about the current advertising landscape. We’ve also compiled tips for navigating these options to cost-effectively capture revenue this holiday season and beyond.\n\nSetbacks abound, but startups must be even more creative\n\nThe chaos of the past year has left advertisers with an ever-changing field of imperfect options and the need to continuously revise their approach. As changes driven by privacy concerns weakened the ability to target consumers, particularly on Facebook, 46% of consumer marketing leaders surveyed by Proxima said “difficulty targeting” and “limited budget” were their top two challenges to marketing effectiveness. About 40% specifically said changes to iOS’ privacy policies had a negative impact on their business.\n\nNot surprisingly, the impact has been disproportionately felt by smaller startups. Among those surveyed, 70% of large companies expect to exceed 2022 revenue goals, but only 52% of SMBs reported similar levels of optimism. The SMBs in the survey were also 20% more likely to report that changes brought by iOS’ privacy policies have had a negative impact on their business.\n\nDramatic headlines may be masking upside opportunities\n\nIt is important for consumer startups to sift the opportunities from the doom and gloom headlines. For example, Meta’s stock price is much less important to you than the number of users on Facebook, which saw 1.93 billion daily active users in Q3 2022.\n\nTikTok is more popular than ever, which is great for brands that want to experiment with a growing platform. But Instagram’s 2 billion monthly active users are hardly a thing of the past, which means the platform still presents a huge opportunity for brand building and engagement.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nDespite a rocky road, consumer advertisers are hanging on\n\nNot surprisingly, the levels of satisfaction with ad platforms included in the study — Facebook, Instagram, TikTok, Snapchat and Google — were notably low, with dissatisfaction rates ranging from 31% to 65% depending on the platform.\n\nHowever, more than 80% of respondents expected their digital ad budgets to increase or stay the same in 2023. It is worth noting, however, that SMBs were 35% less likely to report an increase in their digital advertising budgets, proof of the pressure startups are feeling.\n\nBut the stark difference between platform satisfaction and intent to spend makes it clear that consumer brands are not yet ready to walk away from the highly efficient and measurable world of direct response advertising.\n\nLow switching costs may be what startups need to stay successful\n\nWhile words like “chaos” and “upheaval” may signal fear, the shakeup we saw this year will certainly create opportunities for savvy marketers. Given the relatively low switching costs between platforms, digital advertisers should proceed with an open mind and an eye toward smart experimentation.\n\nAs major ad platforms look to recover from recent shortfalls, they will likely create incentives and other opportunities, such as lower prices, to bring more advertisers into the fold. They will also need to compete with newer platforms, which could create opportunities for more cost-effective advertising.\n\nThe ecosystem has a wealth of strategic options\n\nStartups looking to optimize their advertising strategy across platforms can learn a lot by taking a closer look at the satisfaction rates and intent to spend for each of the platforms included in the study.\n\nThe differences across platforms tell an interesting story about advertisers’ plans to balance safety with experimentation. Whether you are looking for reliability and predictability, or the opportunity to take a chance on an emerging platform, there are a variety of levers to pull in the pursuit of growth.\n\nHere is what we learned:\n\nStick with what’s familiar — Facebook\n\nWith respect to satisfaction, Facebook received the highest “ambivalence rate” among the platforms, with 37% of respondents feeling neutral about the platform.\n\nYet, advertisers just can’t seem to cut the cord completely. Nearly 70% of respondents appear to be reserving at least some of their budgets for Facebook — planned spend seems to be between 1% and 40% of budgets on the platform.\n\nSeek safety in paid search — Google\n\nBy and large, brands are still seeking safety in paid search: In our survey, no platform ranked higher in terms of satisfaction than Google (53%). Consequently, 85% of respondents planned to either increase or maintain their spend on Goolge over the next three to six months.\n\nWhile it was not part of the survey, it is worth noting that Amazon is gaining momentum with paid search. Paul Hebert of Adweek noted that “ … companies that boosted their investment in paid search during the third quarter of 2022 — a period that included Prime Day — tended to outperform competitors who maintained their level of spend or even gave it a slight lift.”\n\nBet on brand building — Instagram\n\nDespite significant levels of dissatisfaction (46%), advertisers still recognize that Instagram is a great tool for brand building. Even though the impact of branding is notoriously hard to measure, advertisers recognize its importance in building consumer loyalty.\n\nBecause of its high engagement rates and integrated marketing campaign capabilities, Instagram still holds significant appeal, and 45% of respondents planned to increase their Instagram spend, while 35% planned to maintain their spend levels.\n\nAs tempting as it may be to turn your back on branding during hard times, it is worth maintaining a small portion of your budget to generate familiarity and frequency of your brand for target consumers.\n\nMake new bets — TikTok and Snapchat\n\nThere appears to be a lot of curiosity about TikTok, and to a degree, Snapchat.\n\nTikTok is now reported to be the third-largest social media platform in the world, serving 750 million to 1 billion users per month, depending on how you parse the data. But TikTok is not yet a staple for many digital advertisers — 35% of respondents were not spending anything at all on the platform, and 47% reported being dissatisfied with the platform.\n\nBut TikTok has one of the highest “intent to spend” rates (83%), suggesting that brands are learning how to benefit from the platform.\n\nIncrease reliance on AI and third-party data\n\nBrands are addressing targeting issues head on and are making progress. Just over 30% of participants reported using AI and third-party data solutions to increase marketing effectiveness, and 60% said they improved targeting and increased return on advertising spend (ROAS).\n\nThe reality is that despite all the upheaval going on in digital advertising, customers are not looking away. For now, advertisers must remain committed to both old and new digital platforms — even those with the lowest satisfaction rates.\n\nFor the remainder of 2022 and beyond, the decision is not whether to advertise, but where, how much and how to augment performance. If companies can maximize their limited advertising budgets across platforms while taking advantage of this period of transition to innovate, they will boost both revenue and brand recognition.\n\nBy this time next year, you may just find yourselves breathing a bit easier."}