{"url": "https://techcrunch.com/2021/12/18/rooftops-for-rent-property-owners-should-partner-with-5g-carriers/", "title": "Rooftops for rent: Property owners should partner with 5G carriers", "authors": ["James Trainor", "Rick Varnell", "Matt Davis", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2021-12-18T00:00:00", "text": "The race to deploy 5G infrastructure has unlocked a new use for the rooftops of restaurants, hotels, residential buildings, and even hospitals and churches. These rooftops are quickly becoming prime real estate targets for telecommunication leaders eager to establish 5G technology in highly populated areas.\n\nIn fact, next-generation wireless deployments are positioned to be one of the largest allocators of lease revenue in the United States over the next five years, creating a seismic opportunity for landlords and other business owners.\n\nThe Biden administration has made expanding the country’s 5G infrastructure a national priority. The $1.2 trillion bipartisan infrastructure package earmarks $65 billion in funding to expand broadband coverage to rural and underserved communities. Despite its speed and power relative to other wireless technologies, 5G has a much shorter range, only reaching up to about 1,500 feet.\n\nIn addition to the major wireless communications providers, new entrants in the 5G deployment race include traditional cable companies and Big Tech firms. Together, these companies are forecasted to invest an additional $275 billion to deploy their 5G macro and small-cell sites. The only effective and efficient way to deploy the sheer quantity of deployment sites required is to leverage existing buildings. In other words, the solution to the 5G race is to adopt a rooftop deployment strategy.\n\nHistorically, the wireless communications market has been challenging to navigate for real estate and other business owners. Wireless carriers and tower companies have in the past entered into long-term agreements that often were less than advantageous to the property owner.\n\nIn many communities, there’s strong opposition to building new towers and, moreover, the construction, zoning and permitting process can be time-consuming. However, 5G technology is uniquely suited to deployment on existing building rooftops because of the reduced antenna heights for the next-generation wireless network. Now, major institutional commercial real estate owners are better positioned than tower operators for carriers to achieve a faster, more efficient solution for their wireless real estate requirements.\n\nA rooftop deployment strategy presents a solution that is mutually beneficial to the 5G carrier and the property owner. Carriers achieve their objective of deploying their infrastructure as quickly as possible in heavily trafficked areas, while property owners reap the financial benefits of leasing their rooftops and monetizing their existing buildings in new ways.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe impact on the net operating income for real estate owners and the revenue generated over the terms of a potentially 30-year lease can be substantial, increasing their access to capital. In addition to collecting payments in return for leasing its rooftop to the carrier, landlords are also able to provide better services to tenants with high-speed broadband connectivity.\n\nWhat’s at stake in the 5G deployment race\n\nThe deployment of 5G infrastructure is critically important for the United States to keep pace and remain competitive internationally. Certainly, 5G is about faster connectivity, increased capacity and zero latency, but it’s mostly about driving innovation that will enable a range of business services from autonomous vehicles and expansion of telehealth to efficiencies in manufacturing and agriculture and improved supply chain management.\n\nWith all of these benefits considered, 5G is expected to contribute over $1.5 trillion to the U.S. GDP by 2025.\n\nThe Biden administration has also identified 5G technology and universal broadband as an economic equalizer for rural America. According to policy statements, rural Americans are over 10 times more likely to lack access to reliable internet compared to urban residents.\n\nIn the recently signed infrastructure law, the president and Congress prioritized investments in rural broadband infrastructure to bridge that digital divide, expanding internet access to these underserved areas. Because of this emphasis, landlords with properties in rural areas could stand to benefit more from the expansion of 5G infrastructure.\n\nThe path to establishing a strong 5G network across the United States will be a long one. While it need not be a deterrent, property owners partnering with 5G providers and wireless carriers should also be informed and cognizant of the cybersecurity considerations of the technology as they house the infrastructure and offer the wireless network to their tenants.\n\nIn a recent Aon survey of more than 2,300 risk managers and other executives, cyber risk was listed as the No. 1 current and predicted future risk globally. Increased connectivity and 5G are the future, which means the cybersecurity industry must continue to innovate and expand its use of machine learning and artificial intelligence to enhance defenses.\n\nWe’ve also seen the creation of organizations such as Building Cyber Security to help provide guidance and a framework to improve cybersecurity resiliency in the real estate sector.\n\nFor property owners to effectively monetize their rooftops and participate in the race to 5G, government and private industry must continue to work collaboratively on an expeditious deployment of 5G infrastructure, including timely review of 5G installation requests.\n\nAdditionally, more work is necessary at the state and local levels to improve the zoning and permitting process for the deployment of 5G antennas. Numerous state legislatures are already considering legislation to better address and develop a 5G strategy for their constituencies, which would also provide new opportunities for landlords.\n\nThere is more policy and technical work to be done to fuel the race to 5G, but the revenue opportunity for property owners is immediate and tangible. For restaurateurs or hoteliers rebounding from the economic slowdown of the COVID-19 pandemic, monetizing their rooftops could be the difference between shuttering their storefronts and turning a profit."}