{"url": "https://techcrunch.com/2025/03/26/fintech-mercury-lands-300m-in-sequoia-led-series-c-doubles-valuation-to-3-5b/", "title": "Fintech Mercury lands $300M in Sequoia-led Series C, doubles valuation to $3.5B", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-26T00:00:00", "text": "Digital banking startup Mercury has raised $300 million in primary and secondary funding at a $3.5 billion post-money valuation, the company confirmed to TechCrunch on Wednesday.\n\nThe valuation is more than double the startup’s valuation when it last raised capital — a $120 million Series B round in 2021 that valued the company at $1.62 billion post-money.\n\nSequoia led the latest round — a Series C — alongside existing backers Coatue, CRV, Andreessen Horowitz, and new investors Spark Capital and Marathon. It’s the first check that Sequoia has written into Mercury since the startup was founded in 2017. The raise brings Mercury’s total primary and secondary funding to $500 million. The company declined to break down how much of the Series C was primary and how much was secondary with Mercury CEO and co-founder Immad Akhund saying the “majority” was primary.\n\nMercury is planning to do a broader employee tender offer at a later date, he added.\n\nAkhund also told TechCrunch that the startup notched $500 million in revenue in 2024 and that it has seen 10 consecutive quarters of profitability on both EBITDA and GAAP net income.\n\nThe company counts over 200,000 companies as customers and claims it has seen 40% year-over-year customer growth. Akhund declined to share revenue figures from previous years but noted that its payment volume increased by 64% to $156 billion. Its customers range in size, according to Akhund, and include tech companies such as Linear, Phantom, and ElevenLabs; venture capital firms; e-commerce companies; and a range of small businesses.\n\nMercury launched its first corporate credit card in 2022. Last May, Mercury told TechCrunch that it was layering software onto its bank accounts, giving its business customers the ability to pay bills, invoice customers, and reimburse employees. Those additional features put the company in even more direct competition with the likes of Brex and Ramp, two rival fintechs that have for years been fighting for market share in an increasingly crowded space.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nLater this year, Mercury plans to launch a consumer banking product that it first announced in April 2024.\n\nMercury will be eyeing acquisitions with its new capital, Akhund said. It will also be hiring. Presently, Mercury has 850 employees with plans to grow to more than 1,000 in 2025.\n\nThe startup was embroiled in drama with partner bank Evolve Bank & Trust and embattled BaaS startup Synapse in recent years. On March 12, Mercury announced that it had decided to end its relationship with Evolve and migrate customers to its other bank partners. Akhund told TechCrunch that Mercury had stopped sending new customers to Evolve in 2022.\n\nMercury’s Series C raise is believed to be the largest fintech funding round announced this year, one that is also seeing Klarna prepare to go public.\n\nReporter’s note: This article was updated post-publication with additional information and comments from Mercury’s CEO."}