{"url": "https://techcrunch.com/2020/07/21/ibm-research-develops-new-macromolecule-that-could-counter-antibiotic-resistance/", "title": "IBM Research develops new macromolecule that could counter antibiotic resistance", "authors": ["Darrell Etherington", "Editor At Large", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2020-07-21T00:00:00", "text": "There are other persistent, grave health crises brewing besides the ongoing COVID-19 pandemic: Antibiotic resistance is one, and the troubling trend is that it’s on the rise, leading to an increase in so-called “superbugs” that are difficult to treat. IBM Research, working in partnership with Singapore’s Institute of Bioengineering and Nanotechnology, has developed a synthetic macromolecule polymer that can potentially be used to significantly increase the effectiveness of existing antibiotics, rendering them able to fight off emerging superbugs.\n\nIn a new paper published in academic journal Advanced Science, the IBM researchers detail their work in creating a polymer that can be combined with a course of antibiotics that are used to treat non-resistant strains of infections, in doses equal or even lower to those that are found to be effective in treating the varieties of the infections that lack the ability to overcome antibiotics.\n\nThe macromolecule works by essentially hitching itself to the enzymes that bacteria modify when they are treated using antibiotics, but not completely eliminated. That’s a big reason why you’re always told to take the entire course of an antibiotic when it’s prescribed: If it isn’t completely wiped out, it can rebound and develop resistance to the treatment used when it comes back.\n\nThe IBM polymer basically shorts out the protective measures developed by the bacteria to counter the effects of the antibiotic, returning (or potentially even slightly improving) their efficacy.\n\nThis is still relatively early research that’s been done in the highly controlled environment of the lab, and would require a lot more development and testing, including proper clinical trials involving human patients before it actually becomes anything to be used in the real world. But these lab-based results provide a very promising basis upon which to build that work, having shown demonstrated efficacy with real multidrug-resistant bacterial infections."}