{"url": "https://techcrunch.com/2025/02/11/google-leads-230m-convertible-note-for-boston-quantum-computing-startup-quera/", "title": "Google-backed Boston quantum startup QuEra raises $230M debt round", "authors": ["Ingrid Lunden", "Europe Editor", "Kirsten Korosec", "Tim De Chant", "Kyle Wiggers", "Cindy Zackney", "Amanda Silberling", "Theresa Loconsolo", "Anthony Ha", "Maxwell Zeff"], "publication_date": "2025-02-11T00:00:00", "text": "Quantum computing, long relegated to the realm of the theoretical, feels like it is back on the agenda as a potentially viable alternative to the expensive race for even more computing power.\n\nOn the heels of some notable advancements in quantum chips and error correction (two key hurdles for quantum computing), a startup out of Boston called QuEra said on Tuesday that it has closed financing of $230 million from the likes of Google and SoftBank. The company will use the money to power its next stage of growth by building a “useful” fully quantum computer in the next three to five years.\n\nNotably, the financing is not equity. It’s a convertible note that QuEra’s team says will be converted into equity when the company next raises an equity round.\n\nThe company, currently being led by interim CEO Andy Ory (an enterprise tech veteran), declined to say when the next equity funding round would come.\n\nTo date, QuEra has raised just under $50 million, including a $17 million round that we covered in 2021. The company said the list of investors on the convertible note include Google, SoftBank Vision Fund, Valor Equity Partners, and QuEra’s existing investors — QVT Family Office, Safar Partners, and others.\n\nThe company is not providing a valuation, but Yuval Boger, QuEra’s COO, said it represented “a very substantial increase” compared to QuEra’s previous round. “I know you probably have a very good sense of what the valuation of a $230 million significant up-round might be,” he added.\n\nOur conservative guess is $400 million, but because this is a convertible note, anything can happen.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nOne detail does give QuEra a notable boost: The company is already generating revenue. Specifically, Ory cited the $41 million sale of a QuEra quantum computer to Japan that will be used alongside Nvidia technology (running classical computing) in a new supercomputer project.\n\nThe company has also been generating some revenue by way of its cloud services. In November 2022, it started offering quantum computing over AWS via its 256-qubit computer (its first-generation machine). Boger said the service is mostly used for pilots and proof-of-concept experiments.\n\nQuEra wants to expand that offering to other cloud providers, but so far has not announced anything. Boger said the financing from Google — supported by Google’s Quantum AI business unit — does not include any tie-ins of any kind with Google Cloud Platform.\n\nQuEra’s funding is part of a seemingly notable surge for quantum computing startups. Less than two weeks ago, Alice & Bob, another quantum computing startup based in Paris, snapped up $104 million. Cambridge, England-based Riverlane, which is building technology to correct quantum errors, raised $75 million last August, and quantum chip maker SEEQC raised $30 million last month.\n\nQuantum Machines in Israel is reportedly also raising $100 million. Quantum Machines declined to comment on those reports.\n\nPerhaps the biggest of all, last year, Quantinuum raised $300 million at a $5 billion valuation. There is now talk of it listing at a $10 billion valuation.\n\nBut since we are yet to see a fully functioning, commercially available quantum machine, a lot of the work these companies are doing is scattered across a range of approaches, all aiming for ways to improve error and fail rates when computations are carried out.\n\nQuEra is aiming to build a neutral atom quantum supercomputer, which relies partly on using lasers to cool atoms in the computing process to reduce errors.\n\n“We think we have the right architectural approach to actually get to what we would consider the holy grail, which would be quantum computing that is discontinuous with real quantum advantage,” said Ory in an interview.\n\n“Taking a partner like Google to look at what we’re doing, and the people we’ve been able to attract […] it’s all coming together, and we feel validated. QuEra is at a position where its resources, its science and its people are going to allow us to be one of a few companies to really deliver the first scalable, useful quantum computer,” he said.\n\nBut so far, with the multitude of approaches, it’s been more of a marathon than a race, and there’s no finish line. Alex Keesling, the co-founder and former CEO of QuEra who invented the technology at the core of the product, is now in a role overseeing the technical implementations as QuEra works to build out its hardware. The company, like others in the space, is working to flexible deadlines as it inches closer to bringing its ideas to reality.\n\nThe longer-term promise is tantalizing. As computing power gets more expensive and new technologies like AI put ever greater pressure on resources, the industry is looking for solutions that could leapfrog those workloads, or at least complement them, with something more powerful. Believers say quantum computing will be the solution.\n\n“We believe that if we can get to 100 logical error-corrected qubits with the ability to run a million instructions without an error, there will be useful applications for quantum computing that offer advantages over regular computers,” Ory said. “We believe that. We think that’s going to create a tremendous amount of value for material science, life science, simulation, optimization problems, and so forth.”\n\nUpdated to note that Google is not leading this financing."}