{"url": "https://techcrunch.com/2024/11/29/early-thanksgiving-online-sales-numbers-are-up-7-yoy-to-15-6b-on-par-with-pre-pandemic-trends/", "title": "Thanksgiving 2024: $33.6B spent online, 72% of that on mobile, says Salesforce", "authors": ["Ingrid Lunden", "Europe Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-11-29T00:00:00", "text": "Thanksgiving weekend has long been seen as the traditional start of the most important sales period for retailers, and so far, the indication is that we’re in for a strong holiday season for e-commerce.\n\nSalesforce is tracking activity in real time and said that yesterday, Thanksgiving, generated $33.6 billion in sales online globally, up 6%. The U.S. market alone was up 8% to $8.1 billion. Europe was also a standout, growing 10%.\n\nAdobe has also released its figures for the day, which are U.S.-only. Shoppers in the U.S. spent $6.1 billion yesterday, up from $5.6 billion last year. That works out to an increase of nearly 9%.\n\nThe two companies have different methodologies. Adobe says its analytics cover more than 1 trillion visits to U.S. retail sites. Salesforce said its 2024 figures are based on shopping data from 1.5 billion consumers captured across its customers and other data feeds in its Commerce Cloud, Marketing Cloud, and Service Cloud. You can see more here.\n\nBut overall, this is an encouraging bounce on 2023. Some more details:\n\n— Last year saw a sluggish Thanksgiving when it came to online shopping. Salesforce said the full day raked in online sales of $31.7 billion, with the U.S. seeing sales of $7.5 billion in 2023. Each was up only 1% from a year earlier. Adobe’s figures last year showed growth of just 5.5%.\n\n— The economy still remains wobbly in multiple markets, so retailers are sweetening the deal to get shoppers to part with their money. Both Adobe and Salesforce noted that discounts were being used to lure shoppers to sites and to make sales, with the average discount in the U.S. coming in at 27% off the listed price, both said. Salesforce added that average selling price increased by only 2% YoY on Thanksgiving, “marking one of the smallest increases we’ve seen since 2022.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n— Thanksgiving Day has shaped up to be a key mobile shopping day in the U.S. Most physical stores are closed, and many people are with friends and family, so people reach for their phones as an easier way to grab items on sale. Adobe said mobile hit an all-time high, accounting for 59.5% of online sales on the day.\n\nThis worked out to $3.6 billion spent online in the U.S. via mobile, up 10.5% YoY, Adobe said.\n\nSalesforce said 72% of all orders made on Thursday were on mobile devices, up 3% on 2023. Mobile accounted 80% of all online traffic, roughly the same as last year.\n\nCyber “week”\n\nThe internet has led to a lot of spread when it comes to holiday shopping. Black Friday used to be a uniquely American shopping phenomenon, coming the day right after Thanksgiving and kicking off the holiday shopping season.\n\nNow, not only can you find “Black Friday” sales events around the world (where Thanksgiving Day is non-existent except for in syndications of American TV specials), but those and other holiday sales days are now being packaged up as “Cyber Week,” which starts days before any turkey is carved or pumpkin is pied.\n\nSalesforce counted Tuesday of this week as the start of Cyber Week, and it said that sales were up 7% and 14% globally and in the U.S, respectively.\n\nIt sometimes feels like we may have reached an innovation lull when it comes to e-commerce, but generative AI might have something to say about that. Salesforce said that use of digital agents and GenAI by retailers is up by 32% compared to a week ago.\n\nSalesforce obviously sees a business opportunity in building these AI bells and whistles, so that could be why they’re teasing out those particular details. “Up by 32%” does not tell us how many actually have AI tools in place, let alone how useful they have been in sales conversions, or whether they have led to people fleeing sites in frustration. We’ll have to see if more concrete statistics materialize this year.\n\n“Holiday shopping momentum is building throughout Cyber Week with online traffic and sales on the rise. After waiting all year for the best deals of the season, shoppers are finally ready to make their holiday purchases and are flocking to their favorite sites via their mobile devices,” said Caila Schwartz, director of consumer insights at Salesforce, in a statement.\n\nWe’ll be updating on Black Friday sales later today."}