{"url": "https://techcrunch.com/2025/03/19/teraai-comes-out-of-stealth-with-7-8m-to-provide-visual-navigation-for-robots/", "title": "Tera AI comes out of stealth with $7.8M to provide visual navigation for robots", "authors": ["Kate Park", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-19T00:00:00", "text": "Robots are part of an exciting new frontier in tech, but here’s the challenge: Robots rely on arrays of sensors, external signals like GPS and Wi-Fi, and customized software to navigate their environments. Further, robotics often involves expensive, ready-made hardware solutions that include built-in software and sensors designed for specific tasks, like estimating relative motion. These products require complex integration and are limited to specific use cases.\n\nAs a result, most robots today cannot move between different locations, and only a small percentage of self-driving systems use AI for navigation.\n\nBut Tera AI founder and CEO Tony Zhang thinks software known as zero-shot navigation for robots can overcome these obstacles — and investors just gave him $7.8 million in seed funding to prove it.\n\nAt a high level, Tera AI is building a spatial reasoning AI system to provide affordable visual navigation for autonomous robots. This technology is used in various applications, including robotic manipulation, mobile robotics, and automated driving.\n\n“We take a pure-software, platform-agnostic approach through an over-the-air software update that works with any robot with a pre-existing camera and a GPU,” Zhang said in an interview with TechCrunch. “The system is cognition-inspired and can be applied during inference time to entirely novel scenarios — a bit like a large language model (LLM).”\n\nZhang founded San Francisco-based Tera in 2023 after leading machine learning efforts at Google X, where he worked on developing and commercializing geospatial models. He earned his PhD at Caltech under Pietro Perona, a pioneer in computer vision who studied how biological systems solve navigation in a general-purpose way.\n\nThe startup’s team includes AI and simulation researchers from Google AI, Caltech, MIT, and the European Space Agency.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhile much of the AI industry has been focused on LLMs, Zhang and his team have developed a new approach that enables AI to learn spatial reasoning independently. Spatial reasoning AI allows machines to navigate, recognize objects, and interact with three-dimensional space. General-purpose navigation software that eliminates hardware constraints could further drastically lower costs and implementation time, making robots 1,000 times more valuable, Zhang told TechCrunch.\n\n“It could also enable new capabilities for existing robots in areas where autonomy was simply impossible due to constraints on sensors,” he said.\n\nFor example, a Waymo vehicle costing $250,000 can afford a $50,000 localization sensor and $100,000 lidar system. But lighter robots priced under $50,000 need more affordable solutions to navigate autonomously, according to Tera AI. Additionally, a high-precision GPS receiver can cost $10,000, and a top-tier IMU (Inertial Measurement Unit) can reach $30,000 — expenses that put autonomous navigation out of reach for many smaller robots.\n\n“Our key unique value proposition is that we are completely hardware agnostic, which means we focus on solving general-purpose navigation in pure software form for any robot and any new environment without needing to be re-tuned every single time,” Zhang said. “For the first time in robotics, we can sell a piece of software that acts like an operating system, giving any mobile robotic platform the ability to live up to its full potential and deliver on its promises to its customers.”\n\nThe startup has been testing its product with various key U.S.-based players in the robotics industry. The company’s clients are primarily robotic manufacturers that already have customers but face challenges when expanding their solutions to different autonomy platforms, situations, and environments.\n\nThe new funding will help Tera deploy its initial solution on embedded devices this year and expand its technical team.\n\n“We see a future where software becomes the most valuable asset of robotic platforms. Once people realize that existing cameras that are already on robots are sufficient for positioning and navigation, they will be able to deploy cheaper robots more quickly at scale,” Zhang told TechCrunch. “Eventually, we envision a future where, like an iOS app store, you can install new capabilities simply by clicking download and boom — your robot has a brand new ability.”\n\nInvestors in Tera’s seed round include Felicis, Inovia, Caltech, Wilson Hill, and entrepreneur-investor Naval Ravikant."}