{"url": "https://techcrunch.com/2022/09/08/klim-seed/", "title": "Klim harvests $6.6M seed to get more farmers growing greener", "authors": ["Natasha Lomas", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-09-08T00:00:00", "text": "Berlin-based agriTech startup Klim is in a hurry to get farmers adopting so-called ‘regenerative’ methods — which are touted as less harmful to soils and biodiversity than conventional farming — arguing this evolution offers the best chance to shrink the global carbon footprint of agriculture fast enough to tackle the climate crisis.\n\nIts digital platform, launched in an early pilot phase in May last year, now has around 1,700 farmers signed up to get support to make a quicker switch away from conventional farming methods that are associated with denuded soils and broader environmental harms — not least climate change itself, with global food production responsible for a quarter of climate-heating greenhouse gas emissions, more than 80% of which comes from agriculture.\n\nKlim’s product includes an app that supports farmers to transition to regenerative agricultural methods by helping them set goals and determine the best combination of techniques to apply to their farmland (such as which cover crops to sow for their soil type etc).\n\nThere’s a financial support side too. Farmers use the app to chronicle the progress of their transition, e.g. by taking photos of crop growth, as a way of proving they’re sticking with the program (Klim also uses satellite data for monitoring and says it also undertakes some site visits); and — if they do that — they can earn revenue payouts for carbon sequestered as their farm’s soil health improves, over the years, or as they undertake other environmentally focused interventions (such as restoring hedges, reforesting or planting flower strips to boost biodiversity).\n\nThe startup does not currently offer loans to farmers via its platform but it says it’s looking into it — likely in conjunction with agricultural banks, where the interest rate could be linked to their climate performance as an added incentive — saying it may expand to providing farmers with financial support to get going with regenerative methods too. (“There’s a lot of different angles and tools where you can help farmers make a better living if they are doing something that’s better for the planet,” it suggests, emphasizing: “That’s the whole point. You want to set the incentives so that sustainable agriculture makes more sense than unsustainable agriculture — and that’s the challenge we’re all working on.)\n\nWhile Klim talks keenly of being on an environmental “mission”, it is a for-profit venture — so it’s also intending to monetize as it supports farmers to earn money for cultivating carbon sinks on their land.\n\nEcosystem services marketplace\n\nIts business model involves taking a commission on the sale of carbon ‘insets’ (as opposed to offsets; the idea being they will be sold to entities to shrink emissions within their own supply chains) — creating a marketplace where farmers can sell what it bills as “ecosystem services”, meaning they can generate revenue off of practices that suck up more CO2 than if they’d continued farming without adopting a regenerative approach.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBuyers of farmers’ “ecosystem services” might be food companies or other entities looking to green their supply chain, as emissions reporting requirements step up. So the upshot is a farmer following the program gets paid for ‘farming carbon’, as it’s sometimes called — in addition to selling any actual crops/food they produce — and Klim gets its cut of any sequestered carbon or other ‘eco services’ they sell.\n\n“It’s all an investment into the future,” says CEO and co-founder Dr Robert Gerlach. “We help the farmer to do that with a digital platform that gives the farmer a way to transition, it gives them the know-how to do it, and it gives them farm management tools to achieve that.”\n\nThe startup’s work doesn’t stop there. It’s also seeking to support farmers to transition to less environmentally damaging methods by working with food companies and retailers to raise their profile with consumers — with an eye on the extra value that might be squeezed out (i.e. via a higher price) for produce that can claim to have taken less of an toll on the planet prior to arriving on the plate vs conventionally farmed alternatives.\n\n“We position the farmer in public with the consumer as a climate hero,” Gerlach tells TechCrunch. “We work with industry — especially the food industry — [which] needs to transform its supply chain. They need to reduce the emissions in their supply chain and they need to secure the yields in their supply chain even though there’s ever more frequent droughts.\n\n“The only way they can achieve that is if they transition their supply chain to regenerative. But the food industry does not really have access, in some cases, to their own farmers — for example in the case of retail — or they do really know how to best actually transition their farmers and we then come in with our platform and help them to transition their farmers to regenerative agriculture.”\n\nThis includes a “Klim label” that can be put on food packaging — using a QR code to point consumers to information showcasing the farmer and their regenerative methods. “I can tell you that farmers love that consumers are learning about regenerative agriculture,” says Gerlach. “If a consumer appreciates that a farmer works in a climate-friendly way he’s probably also willing to pay more for that — and that gives farmers security that they can actually embark on the journey to transition because consumers will reward it.”\n\n“Farmers are in some form of crisis of meaning,” he adds. “They see that their profitability is dropping over the last decades, they see that the regulatory requirements are rising and they see that in public they are often unjustly portrayed as climate sinners — and what they really want is to gain a sense of purpose in what they do; they want to feel that what they’re doing makes sense and is appreciated, especially by the consumer.”\n\nSeed funding\n\nThe August 2020-founded startup has just closed a €6.5 million seed raise, led by Berlin-based food and green tech investor, Green Generation Fund to plough into further product dev and international expansion, as it races to get more farmers farming greener. Other investors in the round include biodiversity-focused fund Edaphon, early stage climate-focused VC Ponderosa and Silicon Valley-based agriculture foodtech and agtech fund Agfunder, with existing investors such as Ananda, FoodLabs and Wi Venture also joining the round.\n\nIn total, Klim has raised just shy of €8M since being founded — just two years ago. The latest cash injection is being put towards accelerating its mission to get as many farmers as possible tilling less, and sowing more, as quickly as possible. So while its early focus has been on its home turf it’s now shooting for internationalization.\n\nWhich markets it’ll be expanding into first are tbc but as it widens its net it will be going up against a broader crop of agriTech startups offering similar support for farmers to transform their methods — such as the likes of Danish startup Agreena; Regrow in the US; and veteran giant Indigo Agriculture, which has increased its focus on regenerative agriculture in recent years, to name three.\n\n“Our mission and purpose is to get as many farmers to adopt regenerative practices or ‘carbon farming’ as fast as possible,” emphasizes Gerlach. “Only if we can get many farmers to transition a lot of their farmland to regenerative agriculture do we have a chance to achieve the 1.5 degree temperature targets.”\n\n“There is a clear chance, we have as a planet, to achieve the 1.5 degree targets,” he also argues. “However it requires rapid action — and that’s the whole point for Klim.”\n\nBut what is regenerative agriculture?\n\nA few things to note upfront here: There is no fixed definition for ‘regenerative agriculture’ — hence it can refer to a different bundle of techniques in different regions (in the US it’s often talked about in association with cattle farming, for example, which means it can have a chequered reputation among environmentalists). Moreover, in recent years, hype about claimed environmental benefits from making tweaks to existing agricultural processes has seen the buzzy badge of ‘regenerative’ keenly taken up by some of the biggest names in (junk) food production, from PepsiCo to McDonalds.\n\nSome of this hype has — frankly — been unbelievable. Such as an unsubstantiated claim that if all the planet’s farmers switched to regenerative agriculture it could 100% reverse climate change. But while there’s a healthy dose of scepticism around what looks like very lurid greenwashing by certain vested interests (most notably those with an agenda to claim you can ‘green’ unsustainable livestock farming); there are more measured and/or pragmatic proponents — and plenty of soil scientists — who argue there is worthwhile substance here.\n\nThese more measured supporters argue that by applying regenerative agriculture methods broadly it can help restore soil health and improve biodiversity in a meaningful, impactful way — across millions (or well billions if you’re taking all farmed land on the planet) of hectares while still producing enough food to feed everyone in the world.\n\nThe claimed ‘regenerative’ transformation is done through the use of various soil-friendly (or, well, friendlier) methods — such as crop rotation and cover cropping, plus a reduction in mechanical tilling, along with promoting other beneficial activities like hedge restoration, reforesting etc — which, in turn, can allow farmers to avoid the conventionally heavy use of fertilizers, herbicides and pesticides; chemicals that are absolutely bad for biodiversity (and probably human health too) and more broadly damaging to the environment and the long term security of food production as they denude the health of the top soil, killing off the organic matter (humus) that’s good at retaining water and taking up carbon.\n\nImpoverished soils are a direct problem for farmers, of course, as they reduce the quality (and potentially the yield) of food that can be produced from land — as well as exacerbating the impact of climate-associated issues like droughts that can devastate crops (since poor soils dry out faster). So there’s a clear logic and interconnected web of potential benefits to be derived from adopting methods that can reduce some of the harms of conventional farming.\n\n“Since the beginning of modern agriculture we have released around 500 Gigatons of CO2 into the atmosphere. And, for example, in Germany right now each hectare (100m x 100m) of farmland releases 0.7 tonnes of CO2 into the atmosphere through the destruction of [organic matter in soils]. So we need to get farmers to convert quickly and if you want them to convert quickly you need to understand what is preventing them from converting in the first place. And that was our starting point,” Gerlach explains.\n\n“What’s really important is to know that we have reduced soil carbon over the last 100 years — globally, some studies say that we have lost 50% of soil carbon. If you look at some color-coded maps that show you where we have lost soil carbon and how much it looks pretty damn bad. Very red. So in order to build that up again you need decades — so you need to start now. And the more regenerative methods you use, the more confidence a farmer gains in using these methods, the more soil carbon you can actually build up.”\n\nAll that said, whether regenerative agriculture is — overall — net helpful or harmful for humanity when you consider the existential crisis of climate change facing all life on the planet and agriculture’s leading contributory role in fuelling the crisis through the release of greenhouse gases is a wider question. The answer is probably closest to ‘it depends’.\n\nThing is, if the buzzy term ends up greenwashing agriculture’s reputation to the extent that it acts as a barrier to the kind of wholesale transformation of global food production that’s needed to avoid catastrophic climate change — say by creating an excuse for food giants to continue industrial-scale livestock farming, rather than switching to deriving their products from low-carbon, plant-based (and/or other alternative) proteins (at least some of which are already being produced in abundance) — there’s an argument that the trend could end up doing more harm than good.\n\nBut, at the same time, we do face multiple sustainability crises in parallel. And the long term viability of agricultural food production is very evidently one of them — with no shortage of warnings that farmland simply won’t continue to produce if we continue to treat soils so poorly. So soil restoration looks like vital, necessary work in and of itself. Measures to stem biodiversity loss are also essential.\n\nAdditionally, if you take it as given that humanity won’t be saved from its need (and/or appetite) to eat certain proteins by some fancy new technology swooping in to enable a sudden mass low-carbon shift in food production that’s able to eliminate animal farming overnight (because the most potentially transformative, low carbon alternatives for growing and harvesting protein are still being developed and/or scaled up) — and also accept that we will need to rely on large scale, land-based agriculture for many more years to come (since plant-based nutrients constitute the bulk of many people’s diets right now and are likely to remain so for the foreseeable future) — then some environmental improvement of agriculture is better than nothing, is the regenerative pragmatist’s argument.\n\nTowards sustainable farming?\n\nDiscussing some of the environmental critiques of regenerative agriculture, Gerlach appears to entrench his support even further — straying towards backing a notion (which has, by the way, been heavily promoted by the meat industry) that even livestock farming could be made sustainable with the right interventions (and/or in certain contexts).\n\n“Even cattle you can raise in a way where you have significantly reduced climate impact,” he argues. “And that in itself is an advantage. Of course we all know we need to transition the popular away from a predominantly meat-based diet but then you have a question that others need to answer… whether there should still be a role for animal husbandry at all or zero?\n\n“But if you are in a space where you are raising cattle, for example, you can do so with significantly reduced climate impact. And there are scientific studies that claim you can even raise cattle in a climate positive way.”\n\nHe does not specify which scientific studies he’s referring to — but a five-month investigation into meat industry lobbying tactics conducted by DeSmog last year found suspiciously similar climatewashing claims featuring in its PR and lobbying. (DeSmog summarized its findings as follows: “Downplaying the impact of livestock farming on the climate; casting doubt on the efficacy of alternatives to meat to combat climate change; promoting the health benefits of meat while overlooking the industry’s environmental footprint; exaggerating the potential of agricultural innovations to reduce the livestock industry’s ecological impact.” So, yeah, uncanny.)\n\nOne thing is clear: The greenwashing pitfalls are real given how much meat industry cash is being sloshed around to try to deflect climate blame and derail change — but it’s also fair to say that so are the challenges of transitioning consumers to alternative proteins en masse fast.\n\nMany consumers are unlikely to stomach a too-swift transition away from traditionally farmed meat — although if the full environmental costs of meat production were reflected in the price people paid then their diets might be rather swiftly reconfigured. (And we may well soon see this effect in practice, as the energy crisis drives food inflation that’s hitting meat producers especially hard — given that it’s such an inefficient way of producing protein for human consumption.)\n\nMeat alternatives have traditionally been more expensive for consumers to buy but as that changes it’s likely a lot more people will find an appetite for textured vegetable proteins.\n\nAt the same time, food is of course cultural, personal and, at times, political — what we eat (or don’t) can often be incredibly polarizing. So while demand for plant-based diets is absolutely on the rise — especially among younger generations who understand the urgency of the climate emergency — societal tastes rarely change overnight. (Although, again, the cost of living crisis might just be the lever that flips the West to a predominantly plant-based diet.)\n\nBut the pragmatist’s view of regenerative agriculture is still that it’s a necessary evolutionary step on the road to reforming food systems, and that — by promoting the use of less environmentally harmful methods, even for heavily polluting industries such as dairy farming — it can at least help shrink the emissions toll of some major climate sinners in the meanwhile.\n\nGerlach also suggests that, unlike in the US, the predominant application for regenerative agriculture in Europe is plant-based farming in any case. And he says Klim’s platform does not currently include any livestock methods — although it is supporting some farmers who are producing animal feed (such as grass for dairy cows) — so it is attached to the supply chain of animal-derived foods. And as it begins to scale uptake of its platform via international expansion there is a question over whether or not it will end up feeling pressure to open up to livestock methods too.\n\nReduction and transition\n\n“We are agnostic. We are working with industries that are purely plant-based. And we are also working with the dairy industry — who need to reduce their emissions significantly,” says Gerlach of where Klim stands now. “Regenerative agriculture can play a huge role in reducing the emissions of also of industries that are in the dairy industry. And any reduction of emissions right now that we can achieve is a good thing.”\n\n“It would be a mistake to say regenerative is cattle — because it simply isn’t,” he also asserts. “We are currently rewarding only agricultural methods — for example the cover crop, the catch crop — so plant-based methods. That’s — at the moment — what we do.”\n\nOn the question of whether there is any tension between an approach that’s focused on encouraging a reduction in emissions, whatever the farmer is doing — and claims therefore to be “climate-positive” — but which isn’t supporting farmers to make a full-fat transition to low carbon agriculture (i.e. if they’re doing a type of farming that sustains high carbon livestock farming), Gerlach argues that both reduction and transition need to happen in parallel. He also suggests there are signs this is already happening, such as around dairy with the rise of plant-based milks and vegan cheeses.\n\n“Right now — at least in the most developed countries — there is a clear transition away from dairy-based products. If you go to the supermarket now and compare the milk shelves to ten years ago, currently you have over half a milk and almost nothing dairy based. That goes on in parallel,” he argues. “And at the same time what you already have right now and still have you need to reduce the impact — so you’re absolutely right; you need to tackle both things: Transition and reduction in parallel. Only then do you have a chance to achieve the climate targets.”\n\nBut isn’t there a risk that regenerative agriculture — by allowing farmers to apply an environmentally friendly sounding label to small changes in their methods rather than transformative leaps — it could actually slow the transition to low carbon food production that’s critically needed if we’re to avert climate disaster?\n\n“May I ask the question in return?” he responds. “Imagine you have a large company that is considering to reduce the emissions from their dairy production by 50%. Would you tell them not to do it because they should rather go out of business or would you help them to reduce the emissions?”\n\nWe counter by pointing out there’s another option: Provide support to those farmers to transition away from dairy to plant-based agriculture. “Well, you will have to offer both things,” Gerlach suggests. “Our role is actually to enable the transition to regenerative agriculture — and to that role we are, in a way, bound. So I think both things happen but the transition of moving from a meat-based to a plant-based economy is one that is driven by the consumer.”\n\nHe also argues — quite rightly — that climate change won’t have one simple ‘panacea’ fix. Change is certainly needed wholesale, everywhere, root and branch, across every industry and sector.\n\nHowever that shouldn’t be used as an excuse to sustain the unsustainable — and risk delaying an already dangerously overdue transition to sustainable food production. There are already plenty of viable low carbon protein alternatives that can take the place of animal-derived proteins on the plate. (Vegetarian food is not some fancy new invention, after all; large swathes of the developing world have long consumed a predominantly plant-based diet.)\n\nSo there’s undoubtedly a balance to be struck here between hand-holding farmers and consumers and express-fixing an industrialized food system that’s dragging us down the path to climate disaster at top speed.\n\nGerlach makes another point that if one region were to make a too radically sudden switch away from livestock farming or producing animal-derived proteins it could just drive demand for the same food to produced elsewhere but less sustainably — i.e. to cater to ongoing consumer demand which local farmers have stopped serving — with the risk of an overall net negative for the climate as emissions are ‘outsourced’, rather than shrunk.\n\nSo yes, there are certainly complex and intertwined impacts to consider. But, also, with the right policy nudges and incentives, there should be ways to mitigate such risks and create appetite for locally produced low carbon alternatives. (Such as, for example, by championing homegrown ‘true climate’ farming heroes.)\n\nCollective action\n\n“If you’re totally rational about it, the question you ask is precisely the right one: Where do you have the biggest climate impact?” Gerlach concedes. “If you now say dairy industry you should not reduce your emissions you should go out of business — or if you should say you should slowly reduce your production, because consumer demand does it, and what you still produce — or need to produce — you should reduce your emissions? I personally believe in a combination.\n\n“The question you ask — whether you slow down a transition — of course it’s a justified question. I personally don’t think you do. I think the transition towards a plant-based diet is such a strong movement right now nothing will slow that down and, if anything, regenerative agriculture will accelerate it.\n\n“Why? Because regenerative agriculture has another benefit: With regenerative agriculture I regenerate the soil, I improve the nutrition availability in the soil, and I improve the nutrition density of the vegetarian food — the plant-based food — that I generate so I make it a higher quality. So actually you increase the demand for regeneratively sourced plant-based food which should actually drive the ‘from red to green’ transition even faster.”\n\n“You have to always look at the reality of where we are now — and where we need to be in 10, and 20 and 50 years,” he also argues, suggesting that regenerative agriculture has an inescapable role to play in climate action as part of a cross-cutting collective. “I know that currently everything in the food sector is about alternative proteins and meat. It would not be fair to reduce regenerative agriculture to cattle raising and therefore compare it to meat alternatives… It would be misleading.\n\n“Even if you would assume we could raise protein and perhaps even other nutritions completely in the factory right now and even if you assume we can do so with an energy balance that is better than natural farming, which most people actually doubt, you would still need to create a roadmap to feed 8BN people this way. And on that roadmap there’s clearly a role for agriculture. If anybody tells you in the next 10 or 20 years there’s a case for feeding 8BN people without agriculture then I don’t know what to say anymore. So if you accept that you need agriculture to feed 8BN people at least in the next 20 years — and, I wager, much longer; permanently — then you also need to accept that reducing the climate emissions from this form of natural agriculture is a good thing.”\n\n“I don’t believe that with artificial proteins alone we can now achieve the 1.5 degrees temperature target,” he adds. “I don’t believe that we could scale up alternative proteins in the next five years to feed 8BN people so that we don’t need agriculture at all anymore and that we achieve the 1.5 degree target. That I don’t believe. If it’s possible then I would be very happy because I’m most of all concerned about the climate. But I don’t think it’s possible. So the simple answer is — if that hypothesis is true then you need agriculture and if you need agriculture then it is a good thing to reduce the emissions in agriculture.”\n\nFew would likely argue with Gerlach on the ‘moonshot’ artificial proteins point. But there may be more debate about whether the gentler, more incremental transition allowed for by regenerative proponents can really hope to shrink carbon emissions fast enough for us to avoid suffering major climate harms.\n\nClearly it will take massive uptake of regenerative methods — whole continents of farmers switching, not just a few villages’ worth of farms — to stand any chance of having the scale of impact requires. But Gerlach’s point is that if every industry takes up the baton to phase down emissions in collective parallel there’s reason for hope.\n\n“If we want to have any realistic chance of achieving the 1.5 degree temperature targets we need to A) stop dreaming about some far away, not ready technologies that will never be able to scale up to achieve that goal. B) we need to be able to reduce emissions in all sectors, massively, not only in food production — in industrial production, in home energy use, everywhere. And we need to capture as much CO2 from the atmosphere in the form of negative emissions and store as much as we can in soils, in biomass, or elsewhere,” he argues.\n\n“It’s a combination of all the technologies that are available — each one of them pushed like crazy. And only if we all work together, and if we all say it’s better to actually make an impact now, even though not perfect, than to say it’s not perfect and therefore I rather don’t do anything at all — only then do we have a chance.”\n\nSeen from that perspective, ‘climate sinning’ farmers doing their bit to go greener can form a meaningful piece of a ‘climate-positive’ collective action patchwork. Or, well, that’s the hope.\n\nThis report was updated with a correction: We originally reported that Klim’s platform does not currently include any livestock farmers, which was what we understood we were told — however Klim said that’s not right; rather it does not include any livestock methods in the regenerative mix it’s promoting"}