{"url": "https://techcrunch.com/2023/06/21/with-18m-in-funding-system-initiative-wants-to-modernize-devops/", "title": "With $18M in funding, System Initiative wants to modernize DevOps", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-06-21T00:00:00", "text": "The promise of DevOps is often frustrated by the reality of having to stitch together a bunch of products. System Initiative‘s co-founders believe that in order for DevOps to live up to its promises, it’ll take a wholesale reimagining of what this toolchain looks like. At the core, System Initiative is tooling that lets DevOps teams build simulations of their infrastructure that then lets them quickly update their production environments. This new platform is now available in private beta and the company plans to open source many of its core tools.\n\nThe company today announced that it has raised a total of $18 million, including a $3 million seed round led by Amplify Partners, with participation from Storm Ventures and Battery Ventures, and a $15 million Series A round led by Scale Venture Partners, with participation from existing investors.\n\n“The DevOps pioneers aspired to bring world-class agility, reliability and security to everyone in the industry. Unfortunately, the current implementations leave most organizations stuck in the mediocre middle, a seemingly insurmountable distance from our shared aspirations,” said Adam Jacob, CEO and co-founder of System Initiative. “System Initiative was born from the recognition that we must be willing to rebuild DevOps from the ground up, rather than stitching together various tools across complex and lengthy pipelines, if we want to improve practitioners’ lives and better the outcomes for the industry.”\n\nAs Jacob stressed when I first talked to him earlier this year, a lot of enterprises hoped to mimic the fast release cycles of cloud-native companies by adopting DevOps. In reality, though, many struggle to deploy more than once a week. And while every tool in the pipeline has been optimized over and over again, the overall system has grown more complex and the overall user experience has seen little improvement.\n\n“If we want to keep the cultural improvements we’ve gained and realize the full potential of what we can accomplish together, we need a second wave of DevOps tools,” Jacob explained in System Initiative’s launch post. “A reinvigorated movement of builders, who are willing to explore what’s possible when we are no longer constrained by the way the system worked in 2009. We can fix the user experience of doing DevOps work. We can re-imagine what it’s like to collaborate on application deployment, infrastructure automation, and observability. Or we can continue to ossify around the status quo.”\n\nUsing System Initiative’s Figma-like multiuser visual interface, infrastructure engineers create digital twins to model their production systems and test their configurations. The tool will automatically generate the code to then put these configurations into production.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“I love the automatically inferred configuration,” said Vlad Ionescu, AWS Container Hero and Independent Consultant. “I get exceedingly happy and giddy when I think about how this would work in different scenarios. I imagine how powerful this would be for complex chains of related resources — a ridiculous amount of configuration and pointless copy/paste work can be completely eliminated.”"}