{"url": "https://techcrunch.com/2023/03/01/sesamm-bags-37m-to-give-corporates-esg-insights-using-natural-language-processing/", "title": "Sesamm bags $37M to give corporates ESG insights using natural language processing", "authors": ["Paul Sawers", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-03-01T00:00:00", "text": "Sesamm, a French startup that helps financial firms and corporates adhere to their ESG goals by using natural language processing (NLP) to generate insights from digital content, has raised €35 million ($37 million) in a round of funding to expand internationally.\n\nDespite a growing backlash against ESG efforts from some politicians and vocal executives, companies are still cognizant of the reputational and commercial risks of ignoring their environmental, social and corporate governance (ESG) responsibilities — this applies both to their internal practices and those of third-parties they do business with.\n\nWith that in mind, Sesamm enables businesses to track textual data from across the web — including news portals, NGO reports and social networks — and convert this into actionable insights.\n\nSupply chain\n\nFounded out of Paris in 2014, Sesamm has amassed a fairly impressive roster of clients from across the financial realm specifically, including U.S. investment giant Carlyle Group, French corporate and investment bank Natixis, Japanese multinational insurance holding company Tokio Marine, and U.K.-based asset management firm Unigestion.\n\nCompanies can access Sesamm’s flagship product, TextReveal, via several conduits, including an API that brings Sesamm’s NLP engine into their own systems. But on top of that, Sesamm also offers a web-based dashboard where companies can access data analysis, visualizations, and push notifications for various due diligence, compliance and ESG scenarios.\n\nFor example, a company that wants to keep tabs on its supply chain partners can use Sesamm to track anything related to those partners that hits the public domain, such as emerging fraud litigation or other lawsuits. This allows them to proactively respond the instant they receive an alert via Sesamm — these ESG alerts, which Sesamm launched a few months back, can be delivered by email or system integrations, for example a customer relationship management (CRM) application.\n\nElsewhere, private equity firms can use Sesamm for due diligence on potential acquisition or investment targets. Indeed, Sesamm boasts a “20 billion article data lake” to which it applies its NLP algorithms to identify mentions on any type of company, with the data sliced, diced and categorized into user-friendly dashboards.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Private equity firms usually engage with consulting firms to perform due diligence on target companies,” Sesamm co-founder and CEO Sylvain Forté explained to TechCrunch. “The cost of doing this is very high, and the result is suboptimal as the amount of data on the web is enormous for individuals to go through it. Therefore frequently, the results are not comprehensive enough, leading to inaccuracies.”\n\nHowever, the Sesamm platform can be configured for any number of use cases, such as “share of voice” competitor analysis, or any other theme that might be relevant to a company.\n\n“With the current attention on ESG in the industry, many of our use-cases are focused on that — however, we provide insights into several types of information,” Forté said. “This includes sentiment on brands, thematic stock baskets and indices, company leadership reputation, and web insights on macro-economic indicators such as inflation, among others.”\n\nAccording to Forté, Sesamm pre-trains large language models, similar to that of ChatGPT, the generative AI poster child of the moment — on all the data it hoovers up, and fine-tunes the algorithms on its own datasets, which are annotated across the 100-plus languages it supports.\n\n“Sesamm integrates a variety of data — over 20 billion articles in 100 languages with 14 years of history,” Forté said. “Data sources include highly vetted news organizations, expert blogs and social media. Sesamm also manages licenses for proprietary data sources from premium news channels.”\n\nSesamm’s competition includes a swathe of well-funded rivals, including New York-based AlphaSense, which hit a $1.7 billion valuation last year and Dataminr, which most recently was a $4.1 billion company. And FactSet, a $15 billion financial data powerhouse, entered the realm of AI-powered ESG data when it acquired Truvalue Labs three years ago.\n\nHowever, against the backdrop of the ChatGPT hype train and burgeoning corporate ESG commitments, the fact that Sesamm has raised a significant sum of money at a time when investors’ cash has seemingly dried up tells something of a story.\n\n“Raising a significant amount during challenging market conditions highlights the relevancy of Sesamm’s focus on two key trends — AI and sustainability,” Forté said. “In turn, these tools enable organizations to make better decisions and fill the data gaps, particularly in ESG, on both public and private companies.”\n\nPrior to now, Sesamm had raised around €15 million ($16 million), and with its latest cash injection — which it’s calling a Series B2 round — the startup ushers in a slew of new and existing investors, some of which are also customers. These include BNP Paribas’ VC arm Opera Tech Ventures, which co-led the round alongside VC firm Elaia; Carlyle Group; Unigestion; Raiffeisen Bank International’s VC off-shoot Elevator Ventures; AFG Partners, CEGEE Capital; and New Alpha Asset Management.\n\nSesamm said that it’s planning to use its fresh capital to expand further into the U.S. and Asian markets."}