{"url": "https://techcrunch.com/2022/11/10/apple-pledges-450m-toward-expanding-the-satellite-infrastructure-powering-emergency-sos/", "title": "Apple pledges $450M toward expanding the satellite infrastructure powering Emergency SOS", "authors": ["Kyle Wiggers", "Ai Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-11-10T00:00:00", "text": "As a part of its Advanced Manufacturing Fund, Apple will invest $450 million in satellite network and ground stations to power Emergency SOS, its service for the iPhone 14 and iPhone 14 Pro lineups that uses satellite to route emergency calls, the company announced today. The majority of the funding will go to Globalstar, the satellite provider with which Apple has an existing partnership to deliver Emergency SOS when it launches later this month.\n\nIn part, Apple’s capital infusion will fund the installation of new custom-designed antennas manufactured by California-based company Cobham Satcom. Designed to receive signals transmitted by Globalstar’s satellite constellation, the antennas have already been installed in the satellite provider’s existing ground stations, including facilities in Nevada, Hawaii, Texas, Alaska, Florida and Puerto Rico.\n\n“The launch of Emergency SOS via satellite direct to iPhone is a generational advancement in satellite communications, and we are proud that Globalstar’s satellites and spectrum assets will play a central role in saving lives,” Globalstar executive chairman Jay Monroe said in a statement. “With Apple’s infrastructure investment, we’ve grown our teams in California and elsewhere to construct, expand, and upgrade our ground stations, and we look forward to the next chapter in Globalstar’s lifesaving technology.”\n\nAs CNBC notes, Apple’s investment — one of the largest to date out of its Advanced Manufacturing Fund, through which the company has furnished U.S.-based suppliers including Corning, Finisar, XPO Logistics and Copan Diagnostics with more than $1.4 billion dollars combined — underscores the costly nature of satellite-based communications. In addition to substantial technical and communications infrastructure, Emergency SOS requires human-staffed call centers. Apple says that more than 300 Globalstar employees will work on the service.\n\nEmergency SOS doesn’t support ordinary data, voice or text. But it alerts emergency services with a location and other key information. Once users point their phone at a satellite using an orientation guide in iOS, they can choose between preset messages to be sent along with the phone’s battery level and medical info to local EMS. If supported in the region where the emergency call is placed, iPhone users can have a two-way conversation with first responders. If not, Emergency SOS will route communications through Apple-operated local relay stations that act as intermediaries with emergency services.\n\nEmergency SOS will remain free for two years to Phone 14 and iPhone 14 Pro owners when it goes live in late November in the U.S. and Canada. But Apple has left open the possibility of charging for it after that."}