{"url": "https://techcrunch.com/2024/09/27/wordy-new-app-helps-you-learn-vocab-while-watching-movies-tv-shows/", "title": "Wordy’s new app helps you learn vocabulary while watching movies and TV shows", "authors": ["Lauren Forristal", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-09-27T00:00:00", "text": "Wordy is a new iOS app that offers a unique way to learning English. The app automatically translates and defines unknown words while you watch your favorite movies or TV shows. Wordy has over 500,000 titles available, including popular series such as HBO’s “The Penguin” and the new Disney+ show, “Agatha All Along.”\n\nCreated by indie developer Sándor Bogyó, a 23-year-old from Budapest, the app was born out of his frustration with looking up unfamiliar phrases in his non-native language while watching shows in English. His experience with Language Reactor, a Chrome extension similar to Wordy, led him to realize the need for a mobile app that would make it easier to use his phone while watching TV or using the computer.\n\nWhen a user selects an episode from Wordy’s library, the AI analyzes the subtitles, then extracts and lemmatizes each word. Using your phone’s microphone, a custom speech recognition model identifies spoken sentences from the audio coming from the TV or computer. This helps the app find where you are in the episode and follow along, scrolling down the transcript and highlighting certain words that may be difficult for non-native English speakers. When a new word appears, you can quickly glance at your phone for the translation.\n\nAdditionally, there’s a summary page for each episode, allowing you to view every word at once, which are sorted by difficulty level: Proficiency English, Advanced English, Upper-intermediate, Intermediate, Elementary, and Beginner. Wordy also provides the option to save words to your Library and practice them later using digital flashcards.\n\nImage Credits:Wordy\n\nWordy uses a combination of its proprietary and third-party AI models. Bogyó explained to TechCrunch that it leverages the largest open movie database, TMDB, for film and series data, along with OpenSubtitles.com via their API, which he has found to provide the most accurate and reliable subtitles.\n\nDuring our testing, we opened the app on our phone while watching Netflix’s hit TV show, “Wednesday” on a laptop. Wordy pointed out terms like “plagued,” “nefarious,” and “séance,” which are more sophisticated vocabulary that beginners just learning the language may not know. We found that the translations were accurate and easy to understand.\n\nOne caveat is that it’s currently only available in English, whereas rival Language Reactor supports all the major languages. Bogyó assured us that he is working on adding more languages. He plans to integrate Spanish into the app in November, with French and German to follow in the coming months.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“I prefer to maintain quality over rushing the process, so I’m taking the time to ensure each language integration meets my standards for accuracy and user experience,” he said.\n\nThe app costs $2.99 per month or $29.99 per year. An Android version will launch in November."}