{"url": "https://techcrunch.com/2024/12/19/with-neverless-former-revolut-execs-want-to-make-meme-coins-easy-to-buy/", "title": "With Neverless, former Revolut execs want to make meme coins easy to buy", "authors": ["Romain Dillet", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-12-19T00:00:00", "text": "There’s an ocean of meme coins beyond Dogecoin, and a new startup called Neverless wants to make it easier to get started with trading crypto, with a particular focus on providing access to small-cap tokens. This is an interesting new crypto startup, founded by three former executives at Revolut, the London-based fintech juggernaut.\n\nPhuc To was the global head of product for Revolut, and was in charge of the company’s crypto project back in 2021. Mikael Peydayesh was the head of core payments at Revolut, and later became the head of premium plans, and Arthur Johanet was the head of card payments for a while before he went on to lead Revolut’s cryptocurrency department.\n\nWhile crypto exchanges have greatly simplified the onboarding experience for new users over the years, the three believed it could still be improved, and so they teamed up to create a new app that makes cryptocurrencies more accessible.\n\nNeverless lets you buy over 400 crypto tokens from the app using Apple Pay or Google Pay. In addition to the most common cryptocurrencies, the startup has chosen to offer access to meme coins and relatively rare coins with low trading volumes.\n\nBuying these small-cap tokens can be challenging, as you usually need to find a crypto exchange that lists them. Alternatively, you can swap tokens on a decentralized exchange, which can be complicated if you don’t understand how decentralized applications (dApps) work.\n\nMoreover, there are some caveats when you’re trying to buy tokens with low trading volumes. Pricing can vary from one trading venue to another, and there can be a large spread between the buying and selling prices. Neverless says it can seamlessly route trades to the right trading platform to get its users the best prices.\n\nAnother issue regular people have with crypto trading products are the fees involved. While tech-savvy people often look at the fine print before buying crypto, and are willing to create yet another account, big exchanges often take advantage of their clout to charge higher fees if you just want to instantly buy and sell crypto without creating a market order.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nNeverless doesn’t charge fees to buy and sell cryptos using bank transfers, blockchain transfers, Apple Pay, and Google Pay. For transactions above $1,000 with Apple Pay or Google Pay, the startup charges a 1% fee. Of course, things could change in the future as Neverless becomes more popular.\n\nSo how does the startup make money right now? On some cryptocurrencies (BTC, ETH, DOGE, SOL, XRP, and AVAX), Neverless generates interest that is passed on to the users. The company also offers automated trading strategies that revolve around high-frequency arbitrage and market-making. Neverless can take a share of the returns generated from these yield-generating products.\n\nThe company has secured a MiFID license, which means that it is a regulated financial firm in Europe. It will have to comply with the Markets in Crypto-Assets (MiCA) regulation when it comes into force in the coming weeks.\n\nEarlier this year, the startup raised $6.7 million in a seed round led by Lakestar and Connect Ventures. Nordstar, Chad West, Dan Westgarth, Eamon Jubbawy, Xiao-Xiao, and David Chreng also invested in the round."}