{"url": "https://techcrunch.com/2022/03/02/snowflake-acquires-streamlit-for-800m-to-help-customers-build-data-based-apps/", "title": "Snowflake acquires Streamlit for $800M to help customers build data-based apps", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-03-02T00:00:00", "text": "Snowflake helps customers store and manage oodles of data in the cloud without cloud vendor lock-in. Streamlit is a startup that developed a popular open source project for building data-based apps. Seems like a pretty good match, and today Snowflake announced it was acquiring Streamlit for $800 million.\n\nBenoît Dageville, co-founder and president of products at Snowflake, said the company became familiar with Streamlit as customers were using it, as were people in-house, and as they talked it seemed increasingly like a good fit. “We have both the same vision — Streamlit and Snowflake — which is all about democratizing access to data. I would describe it very simply as making it super easy to interact with data,” Dageville told me.\n\nHe said that Streamlit fills in a big missing piece in the platform by allowing data scientists and others to interact with the data and build apps that bring the data to life for non-technical users. Snowflake has all the technical pieces for accessing and managing the data in the cloud, but they lacked a native data visualization piece, and that’s what they’re getting with Streamlit.\n\nStreamlit co-founder and CEO Adrien Treuille said that he and his co-founders began talking to Snowflake last fall and over time it became readily apparent that they would match up well together, not just technologically, but also culturally. “I think there’s a really deep cultural alignment beyond the technical and business alignment between the two companies,” Treuille explained.\n\nWhen the startup launched in 2018, it was the brainchild of some former GoogleX and Zoox employees looking to build an open source project to make it easier to build custom applications to interact with data. As Treuille told me at the time of the launch, they wanted to build a flexible tool:\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“I think that Streamlit actually has, I would say, a unique position in this market. While most companies are basically trying to systemize some part of the machine learning workflow, we’re giving engineers these sort of Lego blocks to build whatever they want,” Treuille explained.\n\nIt reached version 1.0 last October, and was working on a commercial cloud service. That piece will eventually become part of the Snowflake platform. While the company plans to integrate the Streamlit technology into the Snowflake platform, of course, the plan is to continue to build and support the popular open source project and the community behind it. Treuille says there are tens of thousands of people using the platform and millions using apps built on top of Streamlit.\n\nSnowflake launched in 2012 and raised $1.4 billion before going public in September 2020. Streamlit launched in 2019 and raised $62 million.\n\nThe deal is going to have to pass regulatory muster. The hope is that it gets done sooner than later, certainly this quarter, but Dageville said that would be up to the various regulatory bodies involved. Snowflake stock is down almost 23% in after-hours trading after reporting slowing revenue growth."}