{"url": "https://techcrunch.com/2025/03/19/mortgage-as-an-employee-benefit-kleiner-perkins-leads-23-5m-series-a-for-multiply-mortgage/", "title": "Mortgage as an employee benefit? Kleiner Perkins leads $23.5M Series A for Multiply Mortgage", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Kyle Wiggers", "Cindy Zackney", "Amanda Silberling", "Theresa Loconsolo", "Anthony Ha", "Maxwell Zeff", "Kirsten Korosec", "Sarah Perez"], "publication_date": "2025-03-19T00:00:00", "text": "After hitting record lows at the start of the pandemic, mortgage rates began to climb in 2022 and haven’t come down significantly since.\n\nWith 30-year mortgage rates hovering at over 6.5% today (they were as low as 2.49% in 2020!), buying a home is simply not that attainable for many people.\n\nOne Denver-based startup is out to help change that. Founded in 2022, Multiply Mortgage originally set out to help tech employees access some of the value of their equity compensation while their employers were still private.\n\nBut interestingly, the founders, Michael White and Gautam Gupta — alums of Square, Opendoor, DoorDash, and Uber — observed that most of the employees were using their liquidity offerings for home purchases and related expenses.\n\n“Homeownership has become increasingly out of reach for many Americans, and we don’t expect interest rates to fall to the levels we saw in 2020 ever again,” White told TechCrunch.\n\nSo in July 2024, the startup altered course to offer a mortgage benefit program that helps employees of its partner companies, which include the likes of Anduril and Ramp, navigate a home purchase.\n\nToday, Multiply offers employees 1:1s with mortgage advisors, employee education sessions around the home purchase and financing process as well as mortgage interest rate discounts of up to .75%. The startup works with a network of 15-20 lenders to access discounted interest rates.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nFor companies, claims CEO White, it’s a no brainer as they incur no costs and what he described as “low administrative overhead” to offer the program.\n\n“We’re really creating the category of mortgage as a financial wellness benefit,” he told TechCrunch. Traditional lenders are effectively its main competition, he said, but the startup aims to differentiate itself by a focus on financial wellness via employers in addition to its discounted rates.\n\nIts pivot attracted the attention of storied venture capital firm Kleiner Perkins, which just led its $23.5 million Series A, the company told TechCrunch exclusively. BoxGroup, A*, Mischief, and Workshop also participated in the financing, which brings the company’s total funding since its 2022 inception to $27 million. The company declined to reveal at which valuation this new round was raised.\n\nKleiner Perkins partner Mamoon Hamid said that “attracting and retaining top talent is a focus for every great company, and providing competitive benefits and compensation programs is table stakes.” He believes that Multiply stands out because it partners directly with employers and automates traditionally time-consuming back-end processes.\n\nNotably, co-founder Gupta is also a general partner at investor A*, which led Multiply’s $3.5 million seed round in early 2022. He started working on the concept behind Multiply with White in late 2021 before the pair founded the company together in early 2022.\n\nMultiply currently operates as a broker, and is licensed to originate mortgages in 19 states. It also has broker partners in 26 additional states plus the District of Columbia. In a few months’ time, the startup plans to do actual lending itself.\n\nHelping people finance their homes\n\nSince its pivot, the company has helped more than nearly 100 people finance their homes, White said.\n\nEmployees can log into Multiply’s web application through their company’s email address. Once they’re validated as an employee, they can set up meetings with advisors and then access its online application, transaction dashboard, and education curriculum.\n\nMultiply shops its network of lenders on the employees’ behalf, finds the lowest rates, then applies its own discounts. White said Multiply is able to offer discounts in that it has automated the mortgage origination process as opposed to a more traditional “very human labor intensive process.”\n\n“On the technology side, we’re building the workflow automations and AI-driven tools to take a lot of the back office human labor and make the people involved significantly more efficient,” he explained. “That leads to a lower cost structure for us, and we can pass along those savings in the form of lower mortgage interest rates.”\n\nMultiply is not the only company that aggregates potential lenders. Others such as LendingTree do as well. But White asserts that the biggest difference between Multiply and LendingTree is the latter is more of a self-serve marketplace to find lenders and compare them. Multiply’s model is more of a concierge one that is also paired with reduced interest rates, he added.\n\nPresently, Multiply has 25 employees.\n\nIt plans to use its new capital to continue investing in building out its mortgage origination platform, as well as scaling up its team of mortgage advisors and company partnerships. Today it has 23 company partners, which include a mix of public and private companies across a variety of industries.\n\nMultiply makes money by earning commission on mortgage originations."}