{"url": "https://techcrunch.com/2021/12/13/forwardx-warehoue-robot-series-c1/", "title": "Warehouse robotics startup ForwardX raises $31M in first Series C close", "authors": ["Rita Liao", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-12-13T00:00:00", "text": "ForwardX Robotics, a Beijing-headquartered company that makes autonomous mobile robots (AMR), said Tuesday it has closed the initial tranche of its Series C funding round as it looks to expand globally.\n\nThe startup is fundraising for the rest of its Series C round at a time investors are courting warehousing and manufacturing robot makers in China, the company’s chief operating officer Yaxin Guan told TechCrunch during an interview.\n\nThe new investment lifted ForwardX’s total raise to about $100 million since Nicolas Chee, a former vice president at Oracle, founded the company in 2016. The startup declined to disclose its post-money valuation or how much it plans to rake in for the entire Series C.\n\nThe C1 round was led by Taikang Life Insurance, a Chinese insurer, with participation from Qualcomm Ventures and Starlight Capital, an early-stage Chinese investment firm focused on industrial upgrades.\n\nIn 2014, Qualcomm announced that it had committed $150 million to fund Chinese startups advancing mobile technologies for the internet, e-commerce, semiconductor, health and education.\n\nHaving the chipmaking giant onboard will allow ForwardX to “work with a 5G technology leader to further advance the use of 5G in its smart warehousing and manufacturing projects,” the company said, though the startup is currently using chips from another major supplier.\n\nWith the new financial injection, the Chinese startup plans to accelerate its R&D timeline, ramp up its deployment capabilities in “key markets” such as the U.S., and expand sales into new markets.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMost of its revenues currently come from China, with e-commerce powerhouse JD.com and logistics behemoth SF Supply Chain China, which has a partnership with DHL, being two of its main customers. The robot maker so far has accured more than 5 million picks for JD.com’s warehouses, according to Guan.\n\nLike a few other Chinese robotics startups, ForwardX is making a steady foray into overseas markets. It already opened an office in Tokyo, is on course to launch a U.S. branch and plans to enter Europe next year.\n\nThat means it’s coming after its American counterparts like Locus Robotics and 6 River Systems. To compete, the company claimed its solution requires less initial investment than its competitors due to “competitive hardware costs and a need for fewer robots per person in its solutions.” Its robots can carry up to 1,200 kilograms of goods each.\n\nAside from selling AMR solutions, ForwardX also touts a fleet management system that can determine how robots roam about within a warehouse, not unlike algorithms used by ride-hailing platforms to optimize driver productivity.\n\nWith help from its lidar- and deep learning-enabled robots, workers can spend more time picking than walking around, and new hires are spared from having to memorize where everything is within the warehouse, Guan explained.\n\nChinese tech companies are increasingly under scrutiny abroad by regulators. From a “business perspective,” Guan doesn’t see how U.S.-China tensions could hobble the firm’s U.S. expansion.\n\n“There are even fewer people available in the U.S., so robots are what logistics customers need in the U.S.,” she said."}