{"url": "https://techcrunch.com/2023/02/06/breef-raises-16m-to-match-brands-with-marketing-agencies/", "title": "Breef raises $16M to match brands with marketing agencies", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-02-06T00:00:00", "text": "Breef, a platform that allows brands to manage and service marketing agency projects, today announced that it raised $16 million in a Series A round (an undisclosed portion of which was debt) led by Greycroft with participation from BDMI, UTA.VC, Afterpay’s Touch Ventures and UC Berkeley’s The House Fund. The new capital brings Breef’s total raised to $21 million, which co-founder and CEO George Raptis says will be put toward continuing to develop the company’s product and growing the size of Breef’s workforce from 30 people to roughly 60 by 2024.\n\n“Breef’s latest funding will be used to continue to evolve the product offering — a new ‘from the ground up’ platform is being launched with the funding announcement — and grow its global team, announcing its first international bases in the U.K. and Australia,” Raptis told TechCrunch via email. “The company will also invest further in its payment infrastructure, allowing structured payments for brands looking to ‘grow now, pay later.’”\n\nBreef was co-founded in 2019 by Emily Bibb and Raptis. Bibb previously worked in marketing and in-house ad agencies as well as startups such as PopSugar and VSCO. Meanwhile, Raptis helped to launch Credible.com, the online loan marketplace that was acquired by Fox in 2019.\n\nBoth Bibb and Raptis attribute their wanting to start Breef to a shift in the way of agency work. Full-time hires and the “big agency” model were no longer flexible — or affordable — enough to service the demands of today’s brands, they felt, while the challenges around outsourcing were steeply increasing.\n\n“The agency space has traditionally been a relationship-first business. The nature of work is long, with brands embarking on a search process spanning months despite inaccurate ‘scopes of work’ and often no guidance — hence the emergence of the ’boutique agency,’” Raptis said. “But the technology had not been created to vet and centralize agencies and give brands confidence throughout the search … In short, if someone could centralize agencies and help brands move faster, then ‘the old way’ of working with agencies was ready to be replaced.”\n\nBreef, Raptis claims, achieves this by offering a way to kick off agency search, contracting and payments in one place. An “agency marketplace,” Breef lets brands plan, scope and post projects for digital marketing, social media, PR campaigns, web and app development and branding to get pitches from agencies on the platform. Brands can select a team and kick off projects, managing contracts and payments from a dedicated dashboard.\n\nRaptis claims that more than 10,000 agencies and thousands of brands are on Breef, with turnaround times for pitches ranging from a couple of days to around a week.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“For brands and agencies alike, using technology as a way to qualify and connect the right partners is a game changer,” Raptis said. “Breef also levels the playing field for companies who otherwise may not get an opportunity to work together — often a point of contention for smaller agencies, minority-led agencies and up-and-comers — who now have an opportunity to work with some of the biggest brands in the world.”\n\nCertainly, Breef appears to be gaining traction (at least the way Raptis tells it), with brands like Netflix, Heineken, Spotify, Pantone and Free People recently joining the platform. Toward the end of 2022, the company achieved a major milestone — $100 million in projects created on the platform — and inked partnerships with spend automation platform Ramp, venue rental marketplace Peerspace and business marketplace Newity.\n\nRaptis wouldn’t answer questions about Breef’s revenue, save that the company grew “10x” last year — a vague figure to be sure. But he expressed confidence in the startup’s growth trajectory, despite competition from startups like BizBulwark (which offers a similar marketing marketplace) and Agency Spotter (an ad agency search tool).\n\n“For marketers, Breef means ease of planning, scoping and outsourcing — at the speed modern brands require. And more importantly, access to diverse talent, with innovative ideas,” Raptis said. “For CFOs, it means centralization of marketing spend through market transparency, payment flexibility and contract standardization. For the creative and boutique agencies, it means the opportunity to work with leading brands without needing an internal sales team. It also means safety and transparency around payments and contracts.”\n\nGreycroft investor Ali Schleider — not the most unbiased source, granted — agreed.\n\n“The amount of demand we are seeing from brands and agencies flowing through the platform shows companies are looking for a new way to get creative work done,” she said. “Our belief is that Breef is not only repositioning marketing spend, but creating an accessible solution for quality talent — no matter market conditions.”"}