{"url": "https://techcrunch.com/2025/05/06/newlimit-founded-by-coinbase-ceo-brian-armstrong-raises-130m-to-develop-age-reversing-therapies/", "title": "NewLimit, founded by Coinbase CEO Brian Armstrong, raises $130M to develop age-reversing treatments", "authors": ["Marina Temkin", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-05-06T00:00:00", "text": "NewLimit, a startup that aims to increase how long people can live a healthy life by genetically programming their cells, has raised a $130 million Series B led by Kleiner Perkins.\n\nNew investors Nat Friedman, Daniel Gross, and Khosla Ventures also invested, as did returning backers Founders Fund, Dimension Capital, Elad Gil, Garry Tan, Patrick Collison, and others. The fundraise comes two years after the company raised a $40 million Series A.\n\nFounded over four years ago by Coinbase CEO Brian Armstrong (pictured above), former GV partner Blake Byers, and stem cell professor Jacob Kimmel, NewLimit claims it has made significant progress toward developing treatments that can restore youthful characteristics to aged cells.\n\nKimmel told TechCrunch the company has discovered three prototype medicines that reprogram liver cells. NewLimit’s lab experiments, he said, demonstrate this rejuvenation can restore the cells’ ability to process fat and alcohol.\n\nThe company measures its progress by contrasting how cells from a younger individual and an older person respond to the substances. An older liver cell that has gone through NewLimit’s epigenetic reprogramming behaves more like a younger cell, Kimmel said.\n\nPromising early results notwithstanding, NewLimit is still a few years away from starting human trials.\n\nIn the meantime, the company wants to continue developing new anti-aging medicine using an AI model and then testing the most promising of these machine-generated drugs in its laboratory. “What the AI model allows us to do is run all those experiments in simulation and then only follow up on the most promising subset,” Kimmel said, adding that the data points from the experiment are then used to retrain the AI model in a process known as “lab in a loop.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nOther noteworthy biotech startups developing drugs that aim to increase lifespan include Retro Biosciences, which raised $180 million from OpenAI CEO Sam Altman two years ago and is reportedly raising a $1 billion Series A; and Altos Labs, which launched with $3 billion in 2022 and is backed by Jeff Bezos."}