{"url": "https://techcrunch.com/2025/05/01/whatsapp-now-has-more-than-3-billion-users/", "title": "WhatsApp now has more than 3 billion users a month", "authors": ["Ivan Mehta", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-05-01T00:00:00", "text": "WhatsApp now has more than 3 billion people using it every month, Meta CEO Mark Zuckerberg noted during the company’s Q1 results conference call on Wednesday.\n\nFounded in 2009 and acquired by Facebook for $19 billion in 2014, WhatsApp remains free to use and doesn’t serve any ads. The app reached the 2 billion monthly active user mark back in 2020, but with the latest milestone, it’s now one of the few apps to cross the 3 billion user mark, besides Facebook.\n\nThat humongous user base makes WhatsApp a key business for Meta, especially now as the company has bet the farm on its AI strategy. The company has previously said that the app is one of its biggest distribution platforms for AI services.\n\n“We see people engage with Meta AI from several different entry points. WhatsApp continues to see the strongest Meta AI usage across our family of apps,” Meta’s CFO, Susan Li, said during the conference call. She also noted that most WhatsApp users engage with Meta AI in one-on-one chats.\n\nZuckerberg said that while WhatsApp provides easy access to AI features, Meta has had to take a different approach to spur adoption of its AI products in markets like the U.S., where the majority of people still prefer to use their phones’ stock messaging apps to text each other. That’s where the company’s newly released Meta AI app comes in.\n\n“We hope to become the leader over time [in the U.S. messaging market], but we’re in a different position there than we are in most of the rest of the world on WhatsApp. So I think that the Meta AI app as a stand-alone is going to be particularly important in the United States to establish leadership in — as the main personal AI that people use. But we’re going to keep on advancing the experiences across the board in all of these different areas,” he said.\n\nThe company said the chat app’s business platform, WhatsApp Business, is growing, and accounted for a large portion of the $510 million in revenue brought in by its family of apps.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMeta has been testing AI tools for WhatsApp Business, and Li said on Wednesday that the company is building a new AI agent management interface and dashboard that would let businesses train Meta’s AI on their information. That information could include a business’ website, WhatsApp profile, or their Instagram and Facebook page. It’s also testing letting businesses activate Meta’s AI chatbot in chats with customers."}