{"url": "https://techcrunch.com/2019/12/10/125-million-for-inscripta-may-usher-in-the-next-wave-of-genetic-engineering/", "title": "$125 million for Inscripta may usher in the next wave of genetic engineering", "authors": ["Jonathan Shieber", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2019-12-10T00:00:00", "text": "In these waning days of the second decade of the twenty-first century, technologists and investors are beginning to lay the foundations for new, truly transformational technologies that have the potential to reshape entire industries and rewrite the rules of human understanding.\n\nIt may sound lofty, but new achievements from businesses and research institutions in areas like machine learning, quantum computing and genetic engineering mean that the futures imagined in science fiction are simply becoming science.\n\nAnd among the technologies that could potentially have the biggest effect on the way we live, nothing looms larger than genetic engineering.\n\nInvestors and entrepreneurs are deploying hundreds of millions of dollars to create the tools that researchers, scientists and industry will use to re-engineer the building blocks of life to perform different functions in agriculture, manufacturing and medicine.\n\nOne of these companies, 10X Genomics, which gives users hardware and software to determine the functionality of different genetic code, has already proven how lucrative this early market can be. The company, which had its initial public offering earlier this year, is now worth $6 billion.\n\nAnother, the still-private company Inscripta, is helmed by a former 10X Genomics executive. The Boulder, Colo.-based startup is commercializing a machine that can let researchers design and manufacture small quantities of new organisms. If 10X Genomics is giving scientists and businesses a better way to read and understand the genome, then Inscripta is giving those same users a new way to write their own genetic code and make their own organisms.\n\nIt’s a technology that investors are falling over themselves to finance. The company, which closed on $105 million in financing earlier in the year (through several tranches, which began in late 2018), has just raised another $125 million on the heels of launching its first commercial product. Investors in the round include new and previous investors like Paladin Capital Group, JS Capital Management, Oak HC/FT and Venrock.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Biology has unlimited potential to positively change this world,” says Kevin Ness, the chief executive of Inscripta. “It’s one of the most important new technology forces that will be a major player in the global economy.”\n\nNess sees Inscripta as breaking down one of the biggest barriers to the commercialization of genetic engineering, which is access to the technology.\n\nWhile genome centers and biology foundries can manufacture massive quantities of new biological material for industrial uses, it’s too costly and centralized for most researchers. “We can put the biofoundry capabilities into a box that can be pushed to a global researcher,” says Ness.\n\nEarlier this year, the company announced that it was taking orders for its first bio-manufacturing product; the new capital is designed to pay for expanding its manufacturing capabilities.\n\nThat wasn’t the only barrier that Inscripta felt that it needed to break down. The company also developed a proprietary biochemistry for gene editing, hoping to avoid having to pay fees to one of the two laboratories that were engaged in a pitched legal battle over who owned the CRISPR technology (the Broad Institute and the University of California both had claims to the technology)."}