{"url": "https://techcrunch.com/2022/01/24/telemedicine-startups-can-survive-and-thrive-under-renewed-regulation/", "title": "Telemedicine startups can survive and thrive under renewed regulation", "authors": ["Nathaniel M. Lacktman", "Jacqueline N. Acosta", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-01-24T00:00:00", "text": "As the pandemic shifts from an acute phase to one in which we learn to live with COVID-19 as an endemic presence, some entrepreneurs and investors may fear what comes next for virtual medicine.\n\nNearly half the U.S. states have ended emergency legal waivers introduced during the pandemic that allowed patients to be seen by doctors who practiced elsewhere. To some, the end of these waivers might portend daunting headwinds for telemedicine: a return to old regulations that snuff out the promise of new technology.\n\nYet there’s another thesis – one driven not by fear but by strategic insight – where the return of regulations could mean something much more beneficial for telemedicine startups and those invested in their success: a moat.\n\nTelemedicine companies that research and understand the varied patchwork of state and federal regulations, analyzing them to identify patterns and build scalable business models, will survive and thrive in the coming environment. Those that do not prioritize this work and shoot from the hip will not fare as well, because patients and enforcement authorities alike will step in. It might mean a classic shakeout.\n\nEven with the return of regulation, the opportunity in digital health will expand. While state laws might change, the macroeconomic rule of supply and demand remains, and patient demand for healthcare far outstrips the supply of available clinicians. That imbalance only accelerated during the pandemic, as physicians and nurses downshifted productivity, moved into less stressful roles or quit the field entirely.\n\nOn the demand side of the equation, there are more patients in need of care. Due to the aging Baby Boomers, the Affordable Care Act’s insurance plans, and a proliferation of affordable retail health care options, more people have access to care today than a decade ago.\n\nOn the supply side, telemedicine builds efficiency and access. While the increase in telemedicine may benefit doctors and nurses struggling with burnout — a reduced need for in-person visits may lead to less stress, goes the thinking — it does nothing to change the denominator in the equation. Surging inbound demand has, and will continue to, overwhelm the number of new clinicians graduating each year.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThis dynamic all but guarantees that telemedicine startups offering a quality user experience, more medically nuanced/specialized services, and a wider variety of virtual-first access points will remain in high demand.\n\nTelemedicine was previously reserved for academic medicine or Medicare beneficiaries living in rural areas, with broad restrictions on who could receive the services and which providers could be paid to deliver them. While less than 1% of medical services were provided via telemedicine in January 2020, that figure is now estimated to be 38 times higher than the pre-pandemic baseline. Indeed, some startups have been conceived, launched and funded entirely during the era of COVID-19 waivers.\n\nStartups that gained traction at a time when the rules were relaxed are now going to have to raise their game. Regulators expect it and patients deserve it.\n\nThe pressure for some form of regulatory clarity is only likely to increase. Along with the number of digital health startups transitioning to virtual provider groups and online clinics, there are giant players accelerating their digital transformation, reducing the footprint of brick-and-mortar locations, and increasing virtual care, including virtual primary care alternatives.\n\nNo market participant should be lulled into inaction by temporary extensions of crisis waivers. The smart founders (and their investors) will waste no time in launching or modifying a business that can flourish in an environment where regulations revert to the pre-COVID standards.\n\nIt’s a development that will allow telemedicine to mature, moving from a convenient replacement in a crisis to earning its own seat at the table in the healthcare industry as an essential participant in the continuum of care."}