{"url": "https://techcrunch.com/2022/03/30/ycombinator-open-source-startups-winter-22-demo-day/", "title": "8 open source companies from YC Demo Day W22", "authors": ["Amanda Silberling", "Senior Writer", "Zack Whittaker", "Rebecca Bellan", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-03-30T00:00:00", "text": "Wicked fast VPNs, data organization tools, auto-generated videos to spice up your company’s Instagram stories … Y Combinator’s Winter 2022 open source founders have some interesting ideas up their sleeves. And since they’re open source, some of these companies will let you join in on the fun of collaboration too. Here are all of the open source related companies presenting at Demo Day in the Winter 2022 cohort.\n\nFounded: 2021\n\nLocation: Salt Lake City, Utah\n\nWhat it says it does: Tuva cleans messy healthcare data to help the healthcare industry build scalable data products.\n\nPromises include: Tuva wants to become the open standard for healthcare data transformation and build the data network for multisite benchmarking and research.\n\nHow it says it differs from rivals: Tuva uses machine learning to further develop its technology.\n\nFounders: Co-founders Coco (Jorge) Zuloaga and Aaron Neiderhiser have worked in healthcare data science for a decade. They’re using that experience to help digital health companies get their data ready for analytics and machine learning.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nOur thoughts: Have you ever gone to the doctor and waited for minutes while the nurse’s computer — running Windows 2000 — struggles to open your chart, only to find that they don’t have updated information about what meds you’re on? We can only imagine how mind-numbingly tedious it would be for health tech companies to organize all this stuff, so it seems like Tuva Health is doing a good service by making their software open source. Now, to get that nurse off of Windows 2000…\n\nFounded: 2021\n\nLocation: Mountain View, California\n\nWhat it says it does: Firezone is building an open source alternative to OpenVPN and Cisco AnyConnect using a new VPN protocol called WireGuard. The company is targeting businesses to help remote workers access private networks.\n\nPromises include: Apparently, using WireGuard makes Firezone faster than its competitors.\n\nHow it says it differs from rivals: Speed! Cryptography! It’s also worth noting that fellow cohort members Netmaker are also developing open source software based on WireGuard.\n\nFounders: Co-founder Jamil Bou Kheir spent eight years at Cisco, a direct competitor! Spicy! Bou Kheir also lived in a “tiny hacker house” for two years, which … while we don’t want to know what the tiny hacker house smells like, we appreciate the out-of-the-box idea.\n\nOur thoughts: Faster VPN options? Sounds good to us. We’re a bit more fixated on the tiny hacker house, though. What’s going on there?\n\nFounded: 2020\n\nLocation: Palo Alto, California\n\nWhat it says it does: GrowthBook is an open source platform to help companies make data-driven product decisions with feature flags and A/B tests.\n\nPromises include: GrowthBook focuses on feature flagging and experimentation and operates under the ethos that this is the best way to build products at scale.\n\nHow it says it differs from rivals: GrowthBook says that an existing SaaS solution, LaunchDarkly, requires a company to send them all of their data, which poses high costs and security concerns. GrowthBook says it solves this by using a company’s existing data infrastructure and business metrics.\n\nFounders: Co-founders Jeremy Dorn and Graham McNicoll both used to work at Education.com as chief architect and CTO respectively. After Education.com’s exit in 2019, the two of them began working on GrowthBook.\n\nOur thoughts: Startups will likely be more comfortable using open source software to help them make product decisions rather than sending all of their data to a third-party provider.\n\nFounded: 2022\n\nLocation: San Francisco, California\n\nWhat it says it does: Eventual is a data warehouse for images and video, making it easier for enterprise machine learning teams to design continuous pipelines that ingest, organize and process imaging data.\n\nPromises include: Eventual wants to help companies save time and money by optimizing workflow.\n\nHow it says it differs from rivals: Eventual says that it’s the first turn-key data warehouse for images and video. Instead of using SQL, Eventual’s query interface is a Lambda function that can be written in the programming language of your choice.\n\nFounders: Jay Chia and Sammy Sidhu both have backgrounds in deep learning — they worked together on Lyft Level 5 to build autonomous driving technology that was acquired by Toyota.\n\nOur thoughts: If these founders can get cars to drive autonomously, data organization via machine learning should be a piece of cake, right? (At least it’s a business endeavor less likely to result in an accident.)\n\nFounded: 2021\n\nLocation: Asheville, North Carolina\n\nWhat it says it does: Netmaker is an open source tool based on the WireGuard VPN protocol.\n\nPromises include: Netmaker claims to operate 15 times faster than OpenVPN.\n\nHow it says it differs from rivals: Netmaker and its cohort-mate Firezone are both open source, faster alternatives to existing VPN software.\n\nFounders: CTO Dillon Carns and CEO Alex Feiszli left their software engineering gigs to develop Netmaker. Feiszli formerly served as a senior engineer at IBM, a consultant at Deloitte and a contractor for Red Hat.\n\nOur thoughts: Without testing the products, we can’t really say whether Netmaker or its cohort-mate Firezone is faster, but we do know that Netmaker’s CTO has a dog named Pepper. The ball’s in your court, Firezone.\n\nFounded: 2021\n\nLocation: Mountain View, California\n\nWhat it says it does: Per Toolchest’s website, “We have felt the pain of implementing and scaling computational biology tools. We’re here to build better core tooling for bioinformatics.”\n\nPromises include: Toolchest says it will make it possible for drug discovery companies to get analysis results up to 100 times faster.\n\nHow it says it differs from rivals: Users don’t need to migrate their data or learn how to use a new platform. Toolchest makes implementing and scaling computational biology tools just three lines of code.\n\nFounders: CTO Bryce Cai has an academic background, researching computational chemistry and mathematics at Stanford. CEO Noah Lebovic previously lead software engineering at a now-acquired microbiome startup.\n\nOur thoughts: Toolchest is so open source that its signature three lines of code are literally just on the homepage of their website.\n\nFounded: 2021\n\nLocation: San Francisco, California\n\nWhat it says it does: Unai is developing a VR headset and virtual world that aims to help people feel connected to one another in the virtual world.\n\nPromises include: Unai wants to make VR interactions look, feel and sound like they do in real life.\n\nHow it says it differs from rivals: Unai believes that “virtual presence” is the “first killer use case” for VR, not gaming.\n\nFounders: Maxim Perumal built Relativity, an open source VR headset, at age 15. Now, as CEO of Unai, Perumal recruited a team with former senior engineers from companies like Apple, Nvidia, Intel, Activision, Meta and Sony.\n\nOur thoughts: Since Unai is still in stealth, it’s hard to say what makes its technology different from mainstream headsets like the Meta Quest 2. But we cannot understate Unai’s biggest advantage, which is that Mark Zuckerberg is not its CEO.\n\nFounded: 2022\n\nLocation: Victoria, Canada\n\nWhat it says it does: Instant Domains claims that in less time than it takes to create a social media profile, businesses can buy a domain, launch a site and start collecting revenue.\n\nPromises include: Instant Domains is encrypted and promises to never collect data about its users.\n\nHow it says it differs from rivals: Technically, you can set up a Squarespace or a Wix site pretty fast too — but Instant Domains says it’s even faster and easier. It may not be as flexible as other no-code website builders, but it’s less expensive ($10 a year for a domain, plus an optional $5 a month for extra features). Some business owners might not need all of the bells and whistles on other platforms.\n\nFounders: Instant Domains is an outgrowth of Instant Domain Search, a side project that CEO Beau Hartshorne built in 2005, which now makes around $1 million in annual revenue. Hartshorne is joined by CTO Dirkjan Ochtman, a 20-year veteran in software engineering and accomplished open source maintainer.\n\nOur thoughts: Hot take: Squarespace is expensive. Normally, I urge people to just make a free WordPress site and attach their own domain to it, but if Instant Domains can accomplish what it sets out to, maybe we won’t have to mess around in cPanel to get an affordable website up and running. Instant Domains kind of feels like Linktree but with custom domain management built in.\n\nFounded: 2021\n\nLocation: Seattle, Washington\n\nWhat it says it does: Uberduck calls itself “Canva for programmable video,” making video that can be automatically generated via API.\n\nPromises include: Within minutes, Uberduck will generate dynamic videos that can be personalized with customer data. Uberduck can also be used to develop advertisements and social media posts. You can also … clone your voice? Deepfake yourself? Use wisely.\n\nHow it says it differs from rivals: Uberduck boasts a Discord community of almost 3,000 members who collaborate to turn AI research into design tools for the app.\n\nFounders: Samson Koelle holds a Ph.D. in statistics and has worked for places like Amazon and the National Institutes of Health. Koelle is joined by co-founders William Luer and Zach Wener, who was once an editorial fellow at The Atlantic (is the tech journalist to tech founder pipeline a thing?).\n\nOur thoughts: Finally, a startup that calls itself “Canva for [use case]” that actually makes sense in comparison to Canva."}