{"url": "https://techcrunch.com/2024/03/11/solarmente-solar-energy-spain-dicaprio/", "title": "Leonardo DiCaprio backs YC alum SolarMente to democratize solar power in Spain", "authors": ["Anna Heim", "Freelance Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-03-11T00:00:00", "text": "Not all countries in Europe get lots of sunlight. You’d think Spain would be big on solar energy generation since it’s one of the sunniest countries in Europe — peak sun hours in Spain put it on par with the U.S. West Coast, after all. However, Spain still lags behind Germany and the Netherlands in terms of installed domestic solar panels, which could be partly due to a historical “sun tax,” a tax on solar installations, that the country scrapped only in 2018. Several years on, some startups are finally taking steps to make the most of this opportunity.\n\nBarcelona-based SolarMente aims to turn solar installations into a mainstay of Spanish houses. Its CEO and co-founder, Wouter Draijer, told TechCrunch that he was spurred to start the company when he flew to Barcelona and had a bird’s-eye view of how few Spanish rooftops had solar panels compared to his home country, the Netherlands. He teamed up with Victor Gardrinier, a French national who studied at HEC Montreal and Stanford, to start the company.\n\nDraijer said the company started off as an installer of solar panels in Spain, but after the pandemic, it decided it should offer a solar energy management system. In hindsight, that was probably a wise move, considering the panel installation market is already covered by specialized companies, and the falling cost of panels could make DIY efforts more attractive for homeowners. It also has a few startups to compete with, including Lumio Solar, which won the most sustainable startup award at Madrid’s South Summit 2023, and Tornasol, whose kits can be installed on balconies and paid for in installments through BNPL platform seQura.\n\n“Solar is not a product,” Draijer said, explaining why most Spaniards can’t or just don’t want to pay upfront for solar panels. What he means is that people care more about what panels can do for them rather than owning them.\n\nThat’s why SolarMente offers subscription-based energy management services, which include installing solar panels without upfront costs. And instead of targeting people who live in apartments, the company prefers to sell to individual houses because it’s easier from a regulation standpoint and because the opportunity is bigger, Draijer said.\n\n“We start with solar, but most of our customers can come back to us because we analyze their data, and we put a battery and EV charger, a heat pump, and then we start managing that energy.”\n\nRecently, the Y Combinator alum added actor Leonardo DiCaprio to its cap table, becoming his first investment in Spain.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSolar arbitrage\n\nManagement of how much energy is consumed and when is a must with solar, because, as Gardrinier explained in an X thread back in 2023, “there is an arbitrage between the price at which households buy energy from the grid and the price at which households sell energy back to the grid.”\n\nGardrinier told TechCrunch that the arbitrage was what inspired him to focus on the company’s energy management, and he was initially interested in seeing how households with solar panels could trade their solar energy with peers on the blockchain.\n\nThat interest helped SolarMente win a blockchain-focused hackathon and launch a virtual battery service, but the next step of the startup’s journey doesn’t involve full-on trading. Instead, the startup wants to enable homeowners to optimize their energy consumption with a super app that helps them decide when to consume or sell the energy the solar panels generate.\n\nOf the team, Gardrinier is also the most closely involved with fundraising, and gave some context on SolarMente’s financing so far: “As I like to think of it, with every round you de-risk your company and your team a little bit more. So with our YC round, the first $2 million seed round, with a very basic team, we showed that solar could maybe work in Spain. And then we did a much bigger round last year of mostly debt; we built a huge debt structure to finance our solar installations. And with that we wanted to prove that you can offer solar as a subscription service at the price of your gym membership, and make it democratized.”\n\nDiCaprio’s newly announced investment is part of a larger seed round of equity financing focused on getting SolarMente where it needs to be to raise a Series A. “We’re using this round to really power our super app for home energy,” Gardrinier said.\n\nCelebrity endorsement\n\nAlthough this is DiCaprio’s first investment in Spain, the actor has been investing in tech startups since at least 2011. He has also been famously vocal about climate change, to which he called attention in his acceptance speech at the 2016 Oscars ceremony.\n\nNot all of the actor’s investments have to do with climate and green tech, but sustainability is a theme across many of those, which include Allbirds, Beyond Meat and Styrofoam replacement company Cruz Foam. For SolarMente, it also helped that one of their summer 2021 YC batch mates, water risk management platform Waterplan, was already in touch with DiCaprio.\n\nDraijer and Gardrinier eventually met DiCaprio, Gardrinier said, and “every time we discussed the business and vision for energy transition, [DiCaprio] would put up his phone and show us one of the projects he’s working on — decentralized storage, etc.”\n\nIt likely helped that SolarMente’s approach wasn’t entirely new to the actor. DiCaprio previously invested in Bright, a startup that works on installing solar power in homes and businesses across Mexico. Just like SolarMente, it graduated from Y Combinator, and in July 2023 raised a $31.5 million Series C.\n\nCould Bright and SolarMente partner one day? We’d say maybe. But first, SolarMente wants to further expand across Spain, where its subscription solar offer just became available nationwide, Draijer told TechCrunch.\n\nConsidering how sunny Spain is and how underequipped it still is, there’s no doubt that SolarMente has room to grow. Solar is one of the cleanest forms of energy, and the EU is determined to make sure it taps the giant ball of nuclear fusion in the sky to reduce its dependence on fossil fuels. Indeed, as part of the REPowerEU plan, the European Commission is considering a path to introduce rules that would mandate installation of rooftop solar energy panels on most new and public and commercial buildings by 2026.\n\nWhile SolarMente’s focus on individual homes makes it a somewhat “upscale” offering, it can still play a part in reducing the stress that fluctuating energy prices have caused Spanish households. As a bonus, its approach could also play a role in facilitating EV adoption, another area in which Spain has room for improvement."}