{"url": "https://techcrunch.com/2023/02/07/palm-hr-raises-5m-embarks-on-mena-growth/", "title": "Palm.hr raises $5M, embarks on MENA growth", "authors": ["Annie Njanja", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-02-07T00:00:00", "text": "A few years ago, Richard Schrems was working as a human resources consultant in Riyadh, and at one point sought to implement a tech solution for his clients to help them better their huge teams, but he couldn’t find a localized solution.\n\nSchrems told TechCrunch he needed a system that was employee-focused but found much of the HR software he interacted with to be “very complex” with “a lot of features, a lot of functionalities focused on making life easier for HR managers” but with little regard for ease of use by employees. “This makes adoption hard,” he said.\n\nHis findings were not unique to him, as a recent study showed an increasing dissatisfaction with HR tech providers — half of the respondents said they planned to change their systems for new technologies that offer better user experience and take remote work into consideration.\n\nDriven to bridge the gap, in 2019, Schrems (CEO) teamed up with Christoph Czichna (COO) and Dragan Nikolić (CPO) to launch Palm.hr. The company is based out of Riyadh and its clients include Hala, Thmanyah, the Saudi Venture Capital Company, Mozn, Jeeny, Rabbit. Schrems says the HR-tech startup has experienced great growth since launch, doubling its annual recurring revenue (ARR) every six months.\n\nFollowing this growth, it is planning on expanding to Egypt and the UAE, while doubling down on Saudi Arabia, against the backdrop of $5 million pre-Series A funding it has raised, in a round led by Europe-based VC Speedinvest, which marked its debut into Saudi Arabia, and RAED Ventures, with participation from MENA-focused VC firm Wamda Capital.\n\n“We are on a mission to transform HR tech and employee experience across the Middle East and North Africa, and ideally beyond…by creating a mobile first experience,” said Schrems.\n\nPhilip Specht, partner at Speedinvest, said in a statement: “As EU-based investors, we have seen how companies such as Personio and Factorial are creating billion dollar outcomes in the HR space. With a similar, but localized approach, we believe that Palm.hr is poised to become the leading player in the MENA region, and the wider Arab world. The company has an outstanding team, a superior value proposition in terms of features, integrations and UX, and strong customer love. We are thrilled to back Palm.hr, which reflects our excitement about the wider start-up ecosystem in the MENA.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPalm.hr automates payroll, tracks leaves and absences, and follows on staff performance, in addition to employee self-service features that make internal communication between staff easy. It also automates other workflow functions related to HR, including on- or off-boarding employees, and is configurable across borders, making it easy for it to match local labor laws and employee regulations in different markets.\n\nFor instance, in Saudi Arabia, Palm.hr has integrated with government services such as Mudad for digital payroll and compliance, mandated by the country’s ministry of labor; the General Organization for Social Insurance (GOSI), and Muqeem, the foreign employee’s data platform.\n\n“With Palm.hr, you can fully process your payroll, you can actually do the payments because we are integrated with the government payroll system; apply for visas because we are integrated with the government visa system, and update people’s social insurance because we’re integrated with the social insurance system,” said Schrems.\n\nThe company is also set to add new features and products that will, for instance, make it possible for employees to easily access loans, asset-financing, and insurance products.\n\n“We want to merge HR-tech with fintech and insurtech…for employees to be able to do everything like purchase or rent assets, sign up to health or travel insurance, within our solution. We want to make Palm.hr part of employees’ daily lives,” said Schrems.\n\nAs it embarks on expansion and more product development, Palm.hr hopes to capture a sizable portion of the global HR tech market, which is envisaged to grow at 9.08% CAGR to reach $53.3 billion by 2028."}