{"url": "https://techcrunch.com/2024/01/03/i-broke-my-wrist-meta-quest-3-and-supernatural-helped-me-through/", "title": "I broke my wrist: Meta Quest 3 and Supernatural helped me through", "authors": ["Darrell Etherington", "Editor At Large", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-01-03T00:00:00", "text": "A few weeks ago, I broke my wrist (in a very stupid way, e-scooters are bad) and the prospect of a protracted recovery period with extremely limited mobility in that arm was really not something I was looking forward to. Generally, I’m an extremely active person who primarily enjoys weight training, and it’s a key component of my mental well-being as well as my physical health. What I didn’t expect was finding relief by way of virtual boxing.\n\nI had been using Supernatural on my Meta Quest 3 headset since picking one up at launch, and found it surprisingly compelling even before my injury — despite my long-held opinion that no one wants to work out in a sweaty headset. It provides a good full-body workout with a cardio component, which is accessible at a variety of skill and comfort levels, and the virtual elements make the whole thing far more engaging, and far less likely to inspire boredom over time, when compared to just trying to shadowbox on your own.\n\nWhere it went from fun diversion to virtual lifesaver was after my injury. The fracture required surgery, and the doctor anticipated a total of around six weeks of recovery time before I’d even be able to think about putting any kind of substantial strain on my wrist joint proper. That looked like a lot of downtime to someone who relies on physical activity as a key outlet for stress relief and, frankly, sanity maintenance.\n\nBecause of how my wrist injury was treated (surgery to install a plate, followed by a protracted period of wearing a splint, but luckily no fixed cast) I was able to hold a Quest controller while also doing all the arm movements required of a Supernatural boxing workout (with the exception of turning my wrist inward for uppercuts, but that didn’t stop them from registering as hits).\n\nSupernatural is also helping with my rehabilitation as I build back range of motion and flexibility in my now mostly healed wrist. I’ve ditched the brace and I’m getting the turns back in on the upper cuts, plus I’ve graduated back to medium intensity from low intensity. It has also been very rewarding to see my punch speed creep back up to full over time as I gained confidence and my arm got healthier.\n\nMeta’s Quest 3 was already turning me around on the value and appeal of consumer VR, because of its improved capabilities and seemingly more casual approach thanks in part to its use of mixed reality. The injury just made me realize at a very accelerated pace what the company saw in Supernatural in terms of lasting, sticky appeal for home VR use."}