{"url": "https://techcrunch.com/2022/10/26/devtron-raises-fresh-capital-for-its-cloud-devops-platform/", "title": "Devtron raises fresh capital for its cloud DevOps platform", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-10-26T00:00:00", "text": "The cloud-native market has seen the introduction of a range of open source DevOps tools — tools that combine software development and IT operations — built to address very specific use cases. As a result, DevOps teams today have too many narrow choices that don’t work together seamlessly or that can’t be integrated into a single platform.\n\nAt least, that’s the opinion of Prashant Ghildiyal, one of the co-founders of Devtron, a startup offering a platform to address what he believes are the top challenges facing the DevOps space. A container management system, Devtron offers a low-code delivery platform optimized for Kubernetes. (“Containers” are packages of software that contain the necessary elements to run in any environment.) The platform handles app management, security and more, providing an interface that abstracts away the underlying infrastructure.\n\nTo Ghildiyal’s point, there’s evidence to suggest that there’s a gap between DevOps adoption and success. In a 2019 Harvard Business Review survey, only 10% of developers said that their companies were successful at building and deploying software quickly, with less than half (48%) saying their organization always relies on DevOps methodologies. A separate, more recent poll by infrastructure automation company Puppet found that companies were hitting a number of DevOps speed bumps in the race to be cloud native, including a skills shortage, issues with legacy architecture, organizational resistance to change and limited or lack of automation.\n\nInvestors are keen on Devtron, as evidenced by the company today closing a $12 million funding round led by Insight Partners. “Devtron integrates with products across the lifecycle of microservices, and in particular Kubernetes, enabling its users to deploy faster and automate their CI/CD pipelines without worrying about Kubernetes knowhow,” Insight Partners principal Josh Zelman told TechCrunch via email.\n\nGhildiyal says that he and Devtron’s other co-founders, Nishant Kumar and Rajesh Razdan, experienced the challenges of scaling DevOps firsthand in their previous roles as heads of technology and software architects at various startups. Their experiences informed Devtron’s design, which Ghildiyal describes as “DevOps in a box,” with tools that provide audit logs and metrics showing the state of an organization’s DevOps maturity.\n\nDevtron also provides tools for access controls and policy management, as well as environment orchestration, software delivery workflow and cost. “This saves significant time and resources to build and deploy in production,” Zelman added.\n\nGhildiyal sees Devtron competing against formidable incumbent vendors like GitLab and Harness in a DevOps market that was worth an estimated $4 billion in 2020, according to Global Market Insights. (That’s not to mention startups like Render, which raised $20 million last November after winning our Disrupt SF 2019 Startup Battlefield.) When asked about clients, Ghildiyal said Devtron has “several” unicorns and growth-stage companies as commercial customers, but he declined to reveal names — or Devtron’s revenue.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nGhildiyal said that India-based Devtron’s principal focuses post-fundraise will be resources and cost optimizations to “enable DevOps automation and efficiency at scale.”"}