{"url": "https://techcrunch.com/2024/09/17/londoners-will-soon-see-drones-ferrying-blood-between-hospitals/", "title": "Londoners will soon see drones ferrying blood between hospitals", "authors": ["Mike Butcher", "Editor At Large", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-09-17T00:00:00", "text": "As part of a new, joint pilot program by U.K. startup Apian, Alphabet’s drone company Wing, and the U.K.’s National Health Service, drones will soon be used to fly urgent blood samples between two hospitals in London.\n\nThe six-month pilot program will see drones delivering urgently required blood samples for surgery patients who are at high risk of complications from bleeding disorders between Guy’s Hospital and St Thomas’ Hospital in London. Deliveries that used to take vans or motorbikes more than 30 minutes could now happen in less than two minutes, according to officials.\n\nThe pilot will be regulated by the Civil Aviation Authority, which will oversee the airspace concerned.\n\nIt’s likely the pilot will herald other types of drone deliveries between other London hospitals. A similar trial for blood platelets is being planned.\n\nThe NHS has previously conducted trials in other parts of the U.K. and found no significant differences in the blood that was flown via drone, versus the blood delivered via vans or motorbikes.\n\nOfficials said CO 2 emissions associated with blood delivery will also be drastically cut during the trial, given that neither electric nor gas vehicles will be needed.\n\nApian and Wing have previously partnered to use drones for medical deliveries in Dublin, Ireland, and Apian has trialed medical drone deliveries in rural areas of the U.K.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIn a statement, Dr Hammad Jeilani, co-founder of Apian, said, “Drones can increase the responsiveness and resilience of healthcare logistics, allowing clinicians to be more productive and patients to get the care they need sooner. An NHS drone delivery network in London, starting with this innovative trial, will provide on-demand, automated and sustainable deliveries, helping the NHS create more efficient models of working and our doctors and nurses to deliver the highest quality care for patients.”\n\nJeilani certainly has “skin in the game” when it comes to the civilian use of drones. His parents came to the U.K. as refugees from Afghanistan, and he has previously said that “there’s no one on this planet more than myself that would like to see drones used in a better way.”\n\nApian raised £5 million in seed funding in 2022 from a number of venture investors, including LocalGlobe and KHP Ventures, the venture fund founded and backed by the NHS."}