{"url": "https://techcrunch.com/2024/02/21/change-healthcare-cyberattack/", "title": "US health tech giant Change Healthcare hit by cyberattack", "authors": ["Zack Whittaker", "Security Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-02-21T00:00:00", "text": "U.S. healthcare technology giant Change Healthcare has confirmed a cyberattack on its systems. In a brief statement Wednesday, the company said it was “experiencing a network interruption related to a cyber security issue.”\n\n“Once we became aware of the outside threat, in the interest of protecting our partners and patients, we took immediate action to disconnect our systems to prevent further impact,” Change Healthcare wrote on its status page. “The disruption is expected to last at least through the day.”\n\nThe incident began early on Wednesday morning on the U.S. East Coast, according to the incident tracker.\n\nThe specific nature of the cybersecurity incident was not disclosed. Most of the login pages for Change Healthcare were inaccessible or offline when TechCrunch checked at the time of writing.\n\nMichigan local newspaper the Huron Daily Tribune is reporting that local pharmacies are experiencing outages due to the Change Healthcare cyberattack.\n\nScheurer Health, a healthcare provider in Michigan, said on its Facebook page that it cannot currently process prescriptions through patients’ insurance, citing the “nationwide outage from the largest prescription processor in North America,” referring to Change Healthcare.\n\nChange Healthcare is one of the largest healthcare technology companies in the United States. Change Healthcare handles patient payments across the U.S. healthcare system. The tech giant boasts on its website that it handles 15 billion healthcare transactions annually and that one-in-three U.S. patient records are “touched by our clinical connectivity solutions.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIn 2022, health insurance giant UnitedHealth Group completed its merger of U.S. healthcare services giant Optum and Change Healthcare in a $7.8 billion deal, which allowed Optum broad access to patient records on tens of millions of Americans.\n\nOptum provides technology and data to insurance companies and healthcare services. Both Optum and Change Healthcare are owned by health insurance giant UnitedHealth Group.\n\nWhen reached by email Thursday, Optum spokesperson Andrew Krejci declined to comment beyond what was published on the incident tracker. Krejci would not say for what evidence Optum has to suspect a cybersecurity incident.\n\nNeither spokespeople for Change Healthcare or UnitedHealth Group have commented.\n\nLate Thursday, UnitedHealth attributed the cyberattack to likely government-backed hackers, without saying which nation state.\n\nUpdated with response from Optum, and corrected the start of the cyberattack to early Wednesday.\n\nRead more on TechCrunch:"}