{"url": "https://techcrunch.com/2024/11/30/climate-vcs-are-cautiously-optimistic-about-a-second-trump-term-heres-why/", "title": "Climate VCs are cautiously optimistic about a second Trump term — here’s why", "authors": ["Tim De Chant", "Rebecca Szkutak", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-11-30T00:00:00", "text": "President-elect Donald Trump made no secret during his campaigning that he doesn’t think the U.S. should take an aggressive stance on climate change. From leading chants of “drill, baby, drill” to frequently criticizing everything from wind turbines to electric vehicles, he appears poised to cast a shadow over the climate tech sector for the next four years.\n\nOr will he?\n\nLike many of Trump’s positions, it’s hard to pinpoint his exact stance on climate change and technologies that serve to mitigate or adapt to it. What’s more, some of his proposed policies might stand to benefit climate tech broadly, even as they prop up oil and gas.\n\n“If you deregulate and you ‘drill, baby, drill,’ you can get more natural gas and oil. You can also get heat like geothermal. You can potentially get geologic hydrogen,” Leonardo Banchik, investment director at Voyager Ventures, told TechCrunch.\n\nBanchik and other climate tech investors are cautiously optimistic that policy changes being considered by the second Trump administration won’t be universally detrimental to climate tech.\n\n“A lot of the climate tech wave started during the Trump administration,” Banchik said. “Regardless of which administration is in power, these technologies are going to continue coming down the cost curve.”\n\nSophie Bakalar, a partner at Collab Fund, agreed, and added she wouldn’t be surprised if this second Trump administration also inspired more entrepreneurs to start building in the sector. “Climate does not operate on a four-year cycle, these are very long-term trends and problems,” she added.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMuch of investors’ optimism stems from lessons learned from the clean tech cycle that went bust over a decade ago. Then, many companies grew too quickly, building massive factories and supply chains before demand had fully materialized. They also grew overly dependent on government subsidies, whether through grants, loan guarantees, or otherwise.\n\n“We are not investing in companies that are relying on federal subsidies or really bold ESG mandates from corporates. We are only investing in companies that provide a concrete value to their customer that is independent from climate,” said Bakalar.\n\nJoshua Posamentier, managing partner at Congruent Ventures, echoed that sentiment. “We don’t invest in anything that we think will require subsidies forever in order to have any unit economics.”\n\nNot all clear skies\n\nStill, some companies will be in for a rough ride. Anything that’s reliant on tax credits for consumers will be vulnerable, several investors told TechCrunch. Some expect that wind power and related industries will take a hit, given Trump’s vocal distaste for the renewable power source. One investor predicted the Environmental Protection Agency could see budget cuts too.\n\nLack of federal support might push some companies that were close to the brink over the edge. “It’s going to be a distillation, a thinning out of the herd,” Posamentier said. “I think they were probably already on death’s door.”\n\nStartups that survive might benefit from some clarity when dealing with potential customers, said Shaun Abrahamson, managing partner at Third Sphere. “The really hard thing, at least in the last four years, was the gap between what [companies] say in public, or what they feel they have to say, and then what happens when you ultimately run into the CFO. You’ll get purer signal.”\n\nA less climate-friendly administration could also hurt climate VCs themselves. Bakalar said that while we will likely see climate startups change their messaging and branding, to avoid being associated with the sector if it does fall out of favor, venture firms can’t really do that and climate-focused VCs could see less LP interest over the next four years.\n\nSilver linings\n\nBut there are plenty of sectors that could get a boost. Anything involving drilling, as Banchik mentioned earlier, including geothermal and geologic hydrogen, will likely ride the coattails of policies that are favorable to oil and gas extraction. Grid-related startups are likely to benefit from proposed permitting overhauls, both Posamentier and Banchik said.\n\nCompanies that generate power stand to gain, too. Surging AI investments have pushed companies to expand their infrastructure rapidly. The breakneck pace has strained electric utilities and independent power producers to the point that just under half of all new AI data centers could be underpowered by 2027.\n\nNuclear startups building small modular reactors (SMR) and geothermal companies will likely be among the beneficiaries, Banchik said. SMR startups Kairos and X-Energy are already riding the AI wave, having signed deals with Google and Amazon, respectively. Geothermal startups are playing the game, too, with Fervo Energy partnering with Google and Sage Geosystems working with Meta to power their data centers.\n\nBoth technologies have a potential ally in Chris Wright, who Trump has tapped to be his energy secretary. Wright is on the board at Oklo, an SMR startup, and his company, Liberty Energy, has invested in Fervo.\n\n“He’s oil and gas all day long, but he’s a smart guy,” said Posamentier, who has spent time with Wright in the field. There, Wright explained to Posamentier that he was electrifying his company’s fracking equipment because it was the better technology. “This is a guy that’s being pilloried for being anti-climate. He’s not anti- or pro-climate. He’s just like, ‘Do the economic thing.’”\n\nInvestors, and their portfolio companies, will have to wait and see what predictions actually play out in a new administration and which ones don’t come to fruition.\n\n“The only constant is change and instability in the next four years,” Posamentier said."}