{"url": "https://techcrunch.com/2024/09/19/upchieve-online-tutor-app-low-income-students-launches-free-tool-teachers/", "title": "UPchieve, an online tutor app for low-income students, launches a free tool for teachers", "authors": ["Lauren Forristal", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-09-19T00:00:00", "text": "UPchieve, the free, 24/7 online tutoring and college counseling app for low-income students, announced Thursday it’s giving teachers in Title 1 middle schools and high schools a new tool to ensure their students get the academic support they need.\n\nThe new offering, called “UPchieve for Teachers,” allows teachers to offer 1:1 support to their students. They can invite students to sign up for tutoring, create classes, and monitor students’ platform usage. Previously, students had to sign up for tutoring services themselves, but with this new product, teachers can now recommend students for 1:1 tutoring at no cost. In the coming weeks, they’ll also be able to assign tutoring sessions to entire classes.\n\nUPchieve for Teachers is available to educators working in Title 1 middle schools and high schools. Title 1 is a federal aid program provided to K-12 schools with the highest number of low-income families within school districts. Approximately 43% of public schools qualify for Title I funding, with fewer than 50,000 schools benefiting from the program.\n\nThis new offering is expected to help UPchieve expand its user base by reaching students who may not be aware of free services like this or who may not be actively seeking additional assistance.\n\n“The product is going to be really valuable to teachers because it’s going to help them accomplish some of the hardest parts of their job,” founder Aly Murray told TechCrunch. “Students are coming into the class with different gaps in their foundational skills. Teachers have to try to support all of their students, but there’s not enough time to support each student individually, so that’s a natural place where a tutor can help. We’re really excited about launching a product that’s going to give teachers more control.”\n\nImage Credits:UPchieve\n\nUPchieve was founded in 2016, shortly after Murray graduated from the University of Pennsylvania. As a former low-income student herself, she struggled to access academic support services throughout her schooling and wanted to make it easy for other students to be able to get help whenever they needed it, even when working on homework late at night.\n\n“I was raised by a single mom, and as an immigrant to the United States, she often wasn’t able to help me with schoolwork and with my college applications. And so that had a big impact on my life. It made things very difficult, and I found that I often needed help late at night when there was really nowhere I could turn to for support,” Murray said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nUPchieve says it has matched over 190,000 tutoring requests from more than 20,000 students across all 50 states. Its 24/7 online tutoring sessions are conducted in the in-app messenger or via voice chat on the web or mobile app. UPchieve covers over 30 subjects, including math, science, English, history, humanities, and more.\n\nTutors can volunteer by signing up on the website. Volunteers can even be students themselves; however, they must be in 9th grade or higher. UPchieve currently has around 2,400 tutors active on the platform.\n\n“All of the volunteers on UPchieve go through a background screening, training, and certification process to become a volunteer tutor. Before they’re ever going to work with a student, they have to pass a quiz in every subject that they want to help students with,” Murray explained.\n\nImage Credits:UPchieve\n\nSimilar to other edtech companies, the company utilizes OpenAI’s GPT-4o to assist tutors in providing AI-generated feedback and progress reports to students after the sessions are over. In the future, the company also plans to use AI to help tutors create practice problems and offer AI-generated summaries of student sessions through its Teachers product.\n\n“We have no plans to replace our human tutors with AI tutors anytime in the near future,” Murray added.\n\nAs a nonprofit organization, UPchieve relies on charitable donations, grants, and paid partnerships with schools, districts, and corporations. Donors include Atlassian, AT&T, the Bill & Melinda Gates Foundation, Guggenheim Capital, Goldman Sachs, J.P. Morgan, the Skyline Foundation, and Verizon.\n\nUPchieve has partnered with over 50 schools, and each school or organization pays a $10,000 partnership fee per year or is sponsored by a donor or corporation who pays the fee on their behalf. The company also graduated from Y Combinator’s Winter 2021 batch.\n\nIn 2023, UPchieve raised over $4 million through philanthropy and earned revenue from paid partnerships. The company claims its annual recurring revenue (ARR) is currently $840,000, which comes solely from paid and sponsored partnerships."}