{"url": "https://techcrunch.com/2024/08/22/cache-energys-mysterious-white-pellets-could-help-kill-coal-and-natural-gas/", "title": "Cache Energy’s mysterious white pellets could help kill coal and natural gas", "authors": ["Tim De Chant", "Senior Reporter", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-08-22T00:00:00", "text": "Wind and solar power have become so cheap to install, and at times so abundant, that utilities don’t know what to do with it all. Sometimes they’ll even pay the owners of other power plants not to generate electricity.\n\nIn response, scientists and engineers have been racing to find inexpensive ways to store that power for later, ultimately hoping to store renewable energy so that it’s available 24/7 and at a price that’ll put coal and natural gas out of business.\n\nCache Energy is the latest startup to attempt the feat, and it’s taking a slightly different tack than most. Rather than store power as heat using sand or specially made bricks, Cache is storing it in chemical bonds inside pellets made of lime derived from limestone. Founder and CEO Arpit Dwivedi likes to call the approach “coal without consequences.”\n\n“It’s a low-cost solid that is able to produce heat and can use some of the similar infrastructure built around fossil fuel,” he told TechCrunch.\n\nDwivedi said that the pellets can be stored in piles or silos, moved around using conveyor belts and transported via rail cars. “As long as you physically contain it — it could literally be a tarp — that is enough to hold its charge almost forever.”\n\nCache Energy’s pellets can be stored in simple containers without losing charge. Image Credits:Cache Energy\n\nCache has been operating stealthily until now. Dwivedi started the company in 2021, shortly before finishing his PhD at the University of Illinois, and he gave TechCrunch an exclusive look at Cache’s technology, which seeks to replace fossil fuel’s role in providing heat to homes and industries.\n\nThe startup begins with calcium hydroxide, a widely available material that’s used in everything from paper making and sewage treatment to pickling and nixtamalization, the process that turns cornmeal into masa for tortillas. On its own, calcium hydroxide is a powdery substance, which isn’t ideal for Cache’s process. If the granule size is too small, it’s liable to blow away, so the company figured out how to bind the powder so it holds up over time.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBut the pellets can’t be too large, either, or they’ll stymie the next step in the process: the reaction that stores and releases energy. “We iterated a lot on the size,” Dwivedi said.\n\nWhen Cache’s pellets are heated, they give off water vapor, leaving behind calcium oxide, or quicklime. That’s the “charged” state for the battery. To discharge, Cache feeds the pellets through the same gravity-fed reactor, suffusing them with moisture to reverse the reaction and produce heat. The overall efficiency of the system is around 95%, Dwivedi said.\n\nCache’s pellets can produce heat at up to 550 degrees C, which would cover the bulk of industrial processes as well as the heat and hot water needs of commercial and residential buildings. Dwivedi said one shipping container worth of Cache’s pellets would be enough to get a couple office buildings through the winter. The company is working on a new version that will be able to generate heat at up to 900 degrees C, widening the range of industries it can sell to.\n\nThe startup recently raised $8.5 million in seed funding, and it’s looking to raise a Series A by the end of the year. Investors in the seed round include Cantos, Climate Capital, Evergreen Climate Innovations, Grantham Foundation, Halliburton Labs, Muus Climate Partners, Unshackled Ventures and Voyager Ventures. The startup has one pilot reactor that’s currently with a customer, and Dwivedi said future funds would go toward shipping more reactors to customers.\n\nCache’s goal is to keep the costs of its equipment and materials as low as possible. It’s using as many off-the-shelf parts as possible, and even at its current hourly production rate of about 500 kilowatt-hours, the pellets themselves only cost about 20 to 40 cents per kilowatt-hour.\n\nWhether Cache can be competitive with fossil fuels depends heavily on how much electricity costs. Where wind and solar are plentiful, the pellets could be charged on the cheap. Like any arbitrage opportunity, the key is to buy as low as possible.\n\nIf Cache’s pellets can withstand the rigors of real-world use, it’s possible to envision them being charged in regions where solar and wind are plentiful, like Texas or Arizona, and shipped around the country to help run industrial facilities or heat office buildings. “Even a basement of a house, if needed, can host and store it,” Dwivedi said. Imagine a Cache truck delivering pellets before the start of every winter, just like heating oil trucks still do in the Northeast. It could go a long way toward decarbonizing heat, one of fossil fuel’s last bastions.\n\nUpdate: Added Cantos as an investor."}