{"url": "https://techcrunch.com/2024/11/13/nokia-acquires-rapid-the-api-company-once-valued-at-1b/", "title": "Nokia acquires Rapid, the API company once valued at $1B", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-11-13T00:00:00", "text": "Nokia, once the world’s biggest mobile phone company but now mainly a provider of infrastructure and services to carriers, has made an acquisition in its bid to be a bridge between the worlds of tech and telecoms. It’s acquiring Rapid, formerly known as RapidAPI, a startup that operates an API marketplace. Nokia will be integrating Rapid into a platform it’s building to help 5G operators open their networks to more developers.\n\nFinancial terms of the deal are not being disclosed in the official announcement. Rapid was once valued at $1 billion and counted as many as 4 million users tapping into some 40,000 APIs, but it’s seen a significant decline in its business in the last couple of years. The companies are not disclosing Rapid’s active users as of today except to note that it is a number in the thousands, and that APIs are in the hundreds. As Nokia is publicly traded, more financial details may come through in a future filing. (Update: some have conjectured that the deal could be for as little as $100 million.)\n\nThe deal will include a public marketplace, enterprise services, and an enterprise-grade API hub designed for building, testing, and sharing APIs internally and externally; and Nokia is pitching it as a move to help carriers work more easily with developers.\n\n“Operators need a bridge to connect to thousands of developers to drive enterprise and consumer value creation and monetize their networks,” said Raghav Sahgal, president of Cloud and Network Services at Noka, in a statement.\n\nOn Rapid’s side, the landscape for technology has shifted drastically over the last couple of years, and many later-stage startups have found it challenging to meet the lofty forecasts they had set while raising big funding rounds in more buoyant years. Rapid’s $1 billion valuation was based on a funding round from 2022.\n\nRapid rose to prominence amid a boom of interest in APIs a decade ago, when APIs were first emerging as the webbing between businesses and developers building services around them. Rapid’s pitch was that it provided a one-stop place to find and use APIs in what appeared to be a very fragmented market.\n\nBut it’s not clear that Rapid found a route to profitability in providing that service. Rapid’s founder Iddo Gino (a wunderkind who started the company aged just 17 in 2015), stepped down as CEO in April 2023, replaced by Marc Friend, and in the weeks following, the startup saw at least two major rounds of layoffs that reduced headcount by 82% (cue headlines of the company’s “Rapid descent“).\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nRapid, based out of San Francisco, had raised nearly $273 million in venture funding from big-name investors that included Andreessen Horowitz, Microsoft, and SoftBank, among others.\n\nIt’s not clear how many people are actually at Rapid as of now, nor how many would be joining Nokia in the deal. Nokia’s statement emphasizes product more than people, noting that it is acquiring “technology assets, including the world’s largest API hub used by thousands of active developers globally, and its highly skilled research and development unit.”\n\nFor Nokia, the acquisition is an interesting and slightly ironic turn given the Finnish company’s history as a pioneer in the world of mobile.\n\nBack in the 1990s, Nokia set the pace for building mobile networks around the world, and alongside that, it became the world’s No. 1 handset maker.\n\nIn the first decade of the 2000s, however, it missed the boat in the shift to smartphones, which became dominated by Apple and Google (and Samsung and the hundreds of others building on Google’s Android operating system). Some argued that one of Nokia’s biggest failings was its inability to establish an extensible ecosystem for apps and third parties (and developers) to build for its smartphones. So it’s interesting that it is now positioning itself as an enabler for that very purpose.\n\nSpecifically, Nokia sees an opportunity for carriers to encourage more developments on costly 5G networks that are now in place but in many cases underutilized.\n\nCarriers, they say, want more third parties building applications and other services on these networks, and they have launched a new “Network as Code” platform to that end. Rapid’s API framework will exist as part of that initiative. Nokia said that carriers and other service providers signed up to the platform include BT, DISH, Google Cloud, Infobip, Orange, Telefonica, and Telecom Argentina, as well as 20 others.\n\n“We are pleased to join forces with Nokia,” Friend, the CEO of Rapid, said in a statement. “The combination of Rapid’s API technology and R&D expertise with Nokia’s scale and network and API domain expertise will enable us to expand the broader API ecosystem.”\n\nUpdated with more detail on price."}