{"url": "https://techcrunch.com/2025/01/23/tom-bradys-autograph-merges-with-digital-fitness-company-future/", "title": "Tom Brady’s Autograph merges with digital fitness company Future", "authors": ["Dominic-Madori Davis", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-23T00:00:00", "text": "Autograph, the NFT company co-founded by Tom Brady, is merging with the digital fitness company Future. As part of the merger, Brady will join the board of directors of Future and serve as co-chair of the company.\n\nBrady co-founded Autograph in 2021 to find ways to connect athletes and artists with fans, ultimately launching an NFT marketplace and raising more than $200 million valued at $3.1 billion, according to PitchBook. The company relaunched late last year, without the NFT component, as a platform that tracks fan engagements and rewards them for it. It counted the likes of Naomi Osaka and Tony Hawk on its board of advisers and was backed by Andreessen Horowitz and Lightspeed Venture Partners.\n\nFuture, meanwhile, connects people with digital fitness coaches and builds personalized fitness routines for users.\n\nAutograph faced some challenges, especially after the crypto market crashed and the NFT market cooled. In 2023, the company had layoffs and at one point was down to 30 people, as reported by Fast Company.\n\nRishi Mandal, co-founder and CEO of Future, made the announcement on LinkedIn. Speaking to TechCrunch, Mandal said he and Brady met through Richard Rosenblatt, co-founder of Autograph, and discussed partnerships but ultimately decided they should be one company, he said. While all parties are calling this a merger, not an acquisition, the company will retain the name Future. Mandal said it was too early to announce new products but said that Future will look to combine Autographs’ celebrity connections with Future’s athletic mission. The goal is to find a way to let people train with top athletes and receive expert coaching.\n\nFuture has raised more than $100 million and was last publicly valued at $275 million, according to PitchBook.\n\nThis story was updated to clarify how Mandal and Brady met."}