{"url": "https://techcrunch.com/2023/09/19/reed-jobs-on-how-his-venture-firm-tackles-cancer/", "title": "How Reed Jobs’ venture firm tackles cancer", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-09-19T00:00:00", "text": "Reed Jobs’ new venture firm can change the lives of the estimated 18.1 million diagnosed cancer patients worldwide. Yosemite, Jobs’ fund for cancer-fighting biotech, launched in August with $200 million in funding from investors like MIT, Memorial Sloan Kettering Cancer Center and John Doerr. Jobs first became interested in oncology as a teen after his father, Steve Jobs, was diagnosed with pancreatic cancer, passing away while his son was an undergraduate at Stanford.\n\n“All I really care about in this world is making a huge difference for cancer patients and what we do at Yosemite, and what I’ve wanted to do my entire life, is to make cancer nonlethal in our lifetimes,” Jobs said onstage during TechCrunch Disrupt today.\n\nYosemite is notable not just for its focus on cancer, but also its unique structure, which Jobs says he “hopes other people will eventually copy.” It runs a traditional venture fund, but dedicates 2.5% of it for a donor-advised fund that operates as a nonprofit entity. That capital is earmarked for grants, which Yosemite gives without taking any IP. The model was first tested out at Emerson Collective, the business and philanthropic organization founded by Jobs’ mother Laurene Powell Jobs.\n\n“The reason why we’re doing this is we’ve really piloted this at Emerson and through partnering with the best researchers in the world on their best projects, we can not only de-risk science that we then turn into companies, but we also get a network of the best KOLs in the world,” said Jobs. “We’ve done this long enough that we’ve been lucky to support about 500 labs so far, and have a really big footprint across the academic ecosystem.”\n\nJobs is optimistic about the development of next-generation therapies, including immunotherapies and gene-editing therapies, and how quickly they can come to fruition. He recalls that when he started working at Stanford University’s cancer research labs at the age of 15 (Jobs is now 31), genomic sequencing was still relatively new. Jobs’ lab used it to do research on a hereditary type of colorectal cancer that was usually lethal.\n\n“We found the mutational signatures there and basically, it had a crazy load of mutations, like millions of mutations. These cells were so out of control. But from the beginning of immunotherapy, when it began to be tested in that, the difference between those cancer cells and the rest of your body is so stark that even today’s immunotherapy works marvelously in that type of colon cancer,” Jobs says. “In my lifetime, I’ve already seen one area go from just absolute, really poor prognosis to something that is now widely treatable and has a really great long-term survival rate.”\n\nOne technology Jobs finds promising is liquid biopsies for early detection. Screening currently includes procedures like prostate-specific antigen (PSA) tests, mammograms and colonoscopies. “These work quite well, but for the rest of cancers, it’s really a crapshoot and more often than not, things are caught when they’re late and they’re metastatic and far more dangerous.” Things like liquid biopsies and AIs in MRIs and PTs have become very precise at picking up early cancer markers. “We’re still in the early days of the liquid biopsy space, but that’s an area that is going to be increasingly important for catching things early. Once you do that, you just have far more options.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nJob is especially animated when talking about epigenetic engineering. “You basically have your DNA rolled together with these various proteins and you can chemically, without changing the DNA, turn on or off various areas of the genome,” he explains. “So your skin cells will just turn off all the liver genes. It doesn’t need it, right? But how that works can actually now be perturbed and we can change it a bit. It turns out a lot of diseases are not caused by mutations or by the wrong gene. They’re caused because gene expression goes down.”\n\nThese include many autoimmune and neurodegenerative diseases, which happen when immune systems slow down. What epigenetic engineering can do is turn gene expression back up by creating a “dial.” “That dial is really interesting and you can actually touch a whole new class of diseases with it that are much more interesting than just going in and changing things,” Jobs says.\n\nWhile Yosemite launched last month, Jobs has been making investments through Emerson Collective for eight years. When asked which investments he’s the proudest of, Jobs mentioned two things. The first was a grant to Yale, working with their main hospital system to get clinical trial representation from across the state. “It’s a small state with one of the big academic medical hubs in it, and they actually got representation to be demographically proportional, which I’m really, really proud of. That’s first for that entire institution.” And on the company investment side, Jobs cites Tune Therapeutics in the epigenetic editing space, which is an example of the kind of company incubation that Yosemite does.\n\n“We paired up the best experts on this type of editing plus the delivery mechanisms you need to get into cells,” Jobs says. “They didn’t even know each other. We introduced them in my living room and sketched out a business plan. I’m just proud to say it’s really become a leader in this space in the last three years.”\n\nWhen asked if he’s ever thought about starting his own company, Jobs said, “I think I can have much more impact doing what I’m doing at this stage. Given the trends in the market, and really in science, it’s really outpacing what any one company is likely able to do. I also am, you know, just innately very competitive and in my family, if you’re going to start a company, it’s got to be a hit.”\n\nDeveloping new treatments for cancer is difficult, but Jobs is optimistic. “I’m all for being ambitious. Biotech is never as linear as tech, it always abounds in mystery and difficulty, which can be very exciting. What I believe is that major cancers that claim most lives are right now seeing the greatest progress and that really motivates me. That’s lung, it’s breast, it’s prostate, colon, these are the really, really big killers. I do believe in the next 20 years, we’re going to see a very significant decrease in mortality there.”"}