{"url": "https://techcrunch.com/2022/04/06/6-questions-investors-should-ask-when-evaluating-psychedelic-biotech-companies/", "title": "6 questions investors should ask when evaluating psychedelic biotech companies", "authors": ["Matias Serebrinsky", "Greg Kubin", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-04-06T00:00:00", "text": "As a venture firm that invests in psychedelics, we receive hundreds of pitches every month from founders developing psychedelic therapeutics.\n\nStartups are developing treatments for depression by combining psilocybin with psychotherapy, creating new delivery methods, like dissolving strips and patches, and even formulating compounds that rewire neural circuits without hallucinogenic effects.\n\nOnce fringe, underground, illegal or just limited to ceremonial use by Indigenous cultures, psychedelics are going mainstream in medicinal form. Psychedelic medicine is spawning new companies in every part of the healthcare and life sciences ecosystem, including areas within drug discovery, manufacturing, clinics and retreats, telemedicine and other digital therapeutics, as well as consumer packaged goods.\n\nOur fund has invested more than $15 million in companies developing psychedelic therapeutics. We believe psychedelic medicine and progress in digital therapeutics, precision psychiatry and neurotechnology will revolutionize how mental health is treated. Unlike traditional antidepressants and pharmaceuticals, psychedelic medicine has the potential to help people address the root causes of their mental health concerns rather than just symptoms.\n\nA landmark study by Johns Hopkins found that psilocybin treatment for major depression is four times more effective than traditional antidepressants. Other benefits include their ability to promote the development of new neural pathways and increase empathy and openness, which can be beneficial states to facilitate healing.\n\nWe believe in a future where psychedelic therapy will be as common as going to the dentist. But the path won’t be easy: Many biotech companies working with psychedelic compounds must complete multiyear clinical trials that can cost over $100 million before winning FDA approval, similar to any other biotech company.\n\nSo how do we pick which companies to invest in? Here are six key questions we ask when evaluating psychedelic biotech companies:\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nDoes the team have the skills, experience and values to bring a product to market?\n\nThe most important factor that can make or break a psychedelic biotech company is its team. Psychedelic medicine is a multidisciplinary domain, so it’s important that the team has a strong foundation in psychedelics, biotechnology, neuropharmacology and/or psychiatry.\n\nThat means in biotech, unlike traditional tech companies, it’s rare for a wunderkind first-time founder to start a successful company given the scientific expertise and network required, which may need decades of experience.\n\nIt’s also important that the team shares our values when it comes to safety and patient well-being. We especially like teams that have psychedelic experience and are grounded in psychedelic history through academic research, field work or personal exploration. These companies will have a leg up on the competition in areas like product development, culture and recruitment.\n\nSome of the strongest founders and executives we’ve seen are best-in-class scientists like Tom Ray from Mindstate Design Labs, David Olson from Delix Therapeutics and Matthew Baggott from Tactogen. It’s helpful to have a team member who has experience taking novel molecules from early-stage clinical trials all the way through to the FDA approval process, as well as people who have experience structuring successful deals with big pharmaceutical companies.\n\nSimilar to backing any company, we bet on founders who have a strong motivation and drive, long-term commitment and are truly passionate about this space and its potential.\n\nCan the company demonstrate meaningful therapeutic efficacy?\n\nMany psychedelic compounds have decades, if not centuries, of anecdotal evidence, but science is all about having a strong hypothesis and testing it effectively. Translating anecdotal evidence into effective modern clinical trial design is the crucial challenge. It’s easier to assess a company’s future value if it has previously demonstrated evidence of efficacy.\n\nFor example, Reset Pharma is a clinical-stage biopharma company developing psilocybin and novel psychedelic therapies for anxiety, depression and demoralization in patients with life-threatening cancer and other illnesses. The company has the exclusive license of NYU’s cancer research by Dr. Stephen Ross, including Phase 2 clinical trial data from 2016, which demonstrated psilocybin therapy’s ability to alleviate symptoms of demoralization in cancer patients.\n\nWe invested in Reset Pharma as we were comfortable knowing the company has a body of data and a clinical trial already in a good place.\n\nDoes the clinical trial have a good shot at approval?\n\nClinical trials are expensive, tedious and can make or break a drug development program. Some pointers we consider when evaluating if a clinical trial is on the right track include:\n\nIt’s more important that clinical trials answer clinical questions instead of being a mechanistic study. Mechanistic studies, designed to understand a biological or behavioral process, do not reliably predict actual clinical utility. The focus should be on a validated measure of clinical response — e.g., reduction in the GRID-Hamilton depression scale.\n\nTrials should also involve a large enough sample size with a diverse population set, including the patient population for which the drug will be in the market for.\n\nBe aware of misleading clinical trial data: work based on old studies that weren’t robust, had short periods for measuring outcomes, low sample sizes and uncontrolled dosages.\n\nIt’s important to evaluate the trial’s timeline and if there’s a route to expedited approval. For example, companies developing new chemical entities may not need to comply with DEA-controlled scheduling regulation. There’s also a pathway for expedited review.\n\nThe FDA has developed a few different programs, such as the Breakthrough Therapy Designation, to expedite drug development and review of therapies that fill unmet medical needs for the treatment of serious conditions and can potentially be significantly better than existing therapies.\n\nA few psychedelic organizations have already received Breakthrough Therapy Designation, including Usona Institute, which uses psilocybin for MDD; MAPS for MDMA-assisted therapy for PTSD; and COMPASS Pathways for psilocybin-assisted therapy for TRD. It’s a positive signal if your company has received such a designation or has a chance of doing so.\n\nHow robust is the drug development pipeline?\n\nWe believe that having a robust drug development pipeline is significant in de-risking the company against biological randomness. We like biotech companies that are focused on core competencies — e.g., a method for discovering new compounds or a way of delivering the drug — and are diversified within their core competency.\n\nCompared to every other area of medicine, psychiatric drugs have the lowest probability of success in going from inception (pre-clinical trials) through approval and market launch. The overall likelihood of approval in psychiatry is only 6.7%. This underlines the importance of having multiple “shots on goal.”\n\nDelix Therapeutics is a great example of a company developing a diversified portfolio around a core competency. Its novel molecules, dubbed “psychoplastogens,” are inspired by the molecular structure of traditional psychedelics, with the aim of promoting neuroplasticity without hallucinogenic and other side effects.\n\nSome of its early studies show the reversal of cortical atrophy in animal models, and now its pipeline is being tailored to specific disease indications, ranging from PTSD to neurodegeneration.\n\nDo you have an ethical and defensible IP strategy?\n\nMost biotech companies seek patents to protect their intellectual property. A U.S. patent lasts 20 years. Many founders and investors believe patents are needed to compensate for the amount of risk and capital (most often over $100 million) required in the drug development process.\n\nWe seek to invest in companies developing compounds for which there isn’t “prior art,” or another existing patent that can potentially be a barrier. We aim to invest in companies that are pursuing novel claims and aren’t land-grabbing to block innovation through their patent strategy.\n\nAlthough highly debated within the psychedelic world, we believe patents should not interfere with Indigenous or shamanistic psychedelic use, and effective patents should not restrict how researchers, and people in general, will interact with psychedelic medicine.\n\nCompanies developing entirely new compounds have a more defensible patent position than companies working with classic compounds such as psilocybin and LSD. Lastly, intellectual property will effectively dictate how easy (or not) it will be for a therapy to work within the existing healthcare ecosystem, build a defensible moat and engage participants, including doctors, patients and payers.\n\nAre there any red flags?\n\nUnfortunately, when any potentially significant innovation comes into the spotlight, so do companies that overpromise and make shortsighted decisions.\n\nSome red flags that make us wary include:\n\nEarly-stage biotech companies (especially before Phase 2 clinical trials) that look to go public within the next one to two years before hitting key inflection points to validate the business.\n\nExcessive spending on marketing and PR rather than focusing on hitting key milestones.\n\nEarly and clinical-stage biotechs that focus too much on diversifying between additional verticals such as CPGs, clinics/retreats, manufacturing and digital therapeutics. Diversification is good, but not at the expense of progressing in your core competencies.\n\nCompanies that have already priced their next financing rounds.\n\nCompanies that have incentives for their early team and investors misaligned with long-term strategies (i.e., lockups that are short post-IPO, fully vested or short vesting periods, and no equity for advisers and the strategic advisory board).\n\nBankers or “chief fundraising officers” that reach out for early-stage fundraising instead of the CEO.\n\nIt’s impossible to know who the winners in psychedelic medicine will be. The psychedelic renaissance will transform many parts of the life sciences ecosystem, but the categories we are most interested in include new chemical entities with improved therapeutic profiles, as well as technologies that allow care to be delivered more efficiently, affordably and safely.\n\nWe believe psychedelic medicine will revolutionize how we treat millions of patients suffering from chronic and mental illnesses. Hopefully, these questions will help you make balanced decisions when evaluating which companies to invest in.\n\nDelix Therapeutics, Tactogen, Mindstate Design Labs, and Reset Pharma are all PsyMed Ventures portfolio companies."}