{"url": "https://techcrunch.com/2022/03/22/hex-scores-52m-series-b-to-grow-data-science-collaboration-platform/", "title": "Hex scores $52M Series B to grow data science collaboration platform", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-03-22T00:00:00", "text": "Hex has been moving briskly along its startup evolutionary path with its data science collaboration platform growing at a rapid pace, so much so the company attracted the attention of fundraising mega-firm Andreessen Horowitz and a pair of key industry strategic investors, Snowflake and Databricks.\n\nCompany CEO and co-founder Barry McCardel said that it’s because his company isn’t just targeting a specific group of highly trained data scientists like so many products in this space — it is attempting to reach a much broader group of business users who are analytically savvy but lack the full data science skill set.\n\n“Our target audience is this really large population of people that are sort of analytically fluent,” he said. “They might be coming from Excel, or they might be SQL-proficient, or they might write Python. All of these people can come into Hex. They can collaborate, they can analyze data, and they can share it.”\n\nHe sees Hex as the interface for the modern stack, which could include lots of tools, notably including investors Snowflake and Databricks. “We want that data to be useful. And we want people to be able to access and analyze it. Hex is an unlock for that,” he said.\n\nSarah Wang, general partner at a16z, who will be joining the Hex board as part of the funding deal, sees the startup as reimagining data collaboration. “Hex is transforming the data space by enabling data scientists to connect their data, analyze it, and then share it through interactive and collaborative apps that get both technical and non-technical teams to the right decisions faster,” she said in a statement.\n\nWhen we last spoke to Hex in October around its $16 million Series A, the company was talking in terms of dozens of customers. McCardel said that since that time, the number of customers and revenue has grown 4x, and that’s just in five months.\n\nThe company has also almost doubled the number of employees since October, growing from 18 to 35, with plans to roughly double again in the next year. At the time of its Series A, McCardel said his company was putting a lot of focus and intentionality on building a diverse team, and as it grows, that continues to be the focus.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We’re firm believers that diverse teams do their best work. And so we’re continuing to prioritize that. And I think if you look at the results we’ve been able to drive, it’s really a reflection of that incredible group of people we’ve brought together,” McCardel said.\n\nThe company announced the $52 million Series B today. In addition to a16z and the two strategics, existing investors Redpoint and Amplify Partners also participated in the round. The investment builds on the $5.5 million seed in 2020 and the $16 million Series A in 2020 for a total of over $73 million raised."}