{"url": "https://techcrunch.com/2022/07/14/okendo-wants-to-turn-your-shoppers-into-buyers-through-better-customer-reviews/", "title": "Okendo wants to turn shoppers into buyers via reviews", "authors": ["Christine Hall", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-07-14T00:00:00", "text": "No merchant likes a bad customer review and Okendo, a customer marketing platform, announced $26 million in Series A funding today to continue developing its customer review tools for e-commerce brands.\n\nBase10 Partners led the funding round and was joined by Craft Ventures and existing investor Index Ventures. It gives the company $33.5 million in total capital raised to date.\n\nMatthew Goodman and co-founder Matt Garven started Okendo in 2019 after working together at VidTitan, a company Goodman started that was an app for Shopify merchants to collect video testimonials and reviews from customers. They found e-commerce to be the sector that had the most traction for VidTitan and evolved the company into Okendo.\n\nToday, the company is working with over 5,000 consumer brands, mainly direct-to-consumer merchants operating on Shopify, to attract more shoppers, drive sales and increase customer lifetime value. Customers include Skims, Haus, Crunchyroll, Magic Spoon, Frame, Nomad, Buck Mason and Liquid Death.\n\nHere’s how it works: Okendo enables merchants to collect high-impact content directly from customers, including product ratings and reviews, customer-generated photos and videos, questions and answers and other individual points of customer data like preferences and behaviors.\n\nThose merchants can then showcase the ratings and reviews on their website or on social media to tell more personalized marketing stories.\n\n“Merchants can utilize the power of their customers to increase confidence, drive conversion and deliver better performance and customer experiences,” Goodman told TechCrunch.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nRecent tests conducted by Okendo showed that, on average, shoppers interacting with its tools had a 2.5x higher conversion rate and a 15% higher average order value.\n\nIn terms of competition out there, Goodman considers Yotpo, an e-commerce marketing company that raised $230 million in funding last year, to be Okendo’s closest competition. However, he says his company differentiates itself by taking a customer-centric approach and focusing on that Shopify community, which means it can have a deeper integration and better utilization of the marketplace’s technologies. As a result, merchants can more easily customize and deploy Okendo.\n\n“We also have a unique approach to the way we generate customer content that combines utilization of customer audit data to be able to deliver more personalized content, collection invitations, and then that’s combined with a unique approach to content collection that has a mobile-first approach along with some various gamified elements to maximize the amount of content that we collect,” Goodman added.\n\nThe company employs 83 people across Australia and the United States. Over the last 12 months, the company doubled its annual recurring revenue.\n\nThe new funding will enable Okendo to accelerate its go-to-market and product development, which includes some releases lined up for the end of 2022. The company also expanded to North America in early 2021, so the capital infusion will help with expansion. Goodman plans to add 50 roles to the team this year across all departments, but also particularly in engineering, sales and marketing.\n\nTJ Nahigian, managing partner at Base10 Partners, says his firm has made around nine investments into the e-commerce category, and identified Okendo as a leader in reviews.\n\n“We learned that this was a lot more than just a customer review platform, that this was the initial wedge, but that there was a desire to turn it into much more than that,” Nahigian told TechCrunch. “When we spoke with customers, we saw how much ROI they were getting. It’s more and more important for merchants to get closer to their customers to help build credibility, sell products and build trust, and Okendo is by far the No. 1 platform and product in our mind doing that.”"}