{"url": "https://techcrunch.com/2024/05/29/after-co-founders-murder-at-the-hands-of-hamas-cloud-startup-firefly-raises-23m/", "title": "Firefly forges on after co-founder murdered by Hamas", "authors": ["Ingrid Lunden", "Europe Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-05-29T00:00:00", "text": "A startup called Firefly that’s tackling the thorny and growing issue of cloud asset management with an “infrastructure as code” solution has raised $23 million in funding. That comes on the heels of strong demand for its tech and increasing revenue fourfold in 2023.\n\nThe firm’s latest success also comes on the heels of tragedy, as co-founder CTO Joseph “Sefi” Genis was among the hundreds killed by Hamas in October 2023 at the now-infamous Nova music festival.\n\nThe firm finds itself at the intersection of technology and major world events for the second time. Firefly was hatched in 2021 in the wake of the COVID-19 outbreak, amid a huge burst of “digital transformation.” Suddenly faced with remote workforces, organizations turned to the cloud in a big way to manage those workers and to launch new services.\n\nThose migrating into the cloud seized on a big opportunity to work more flexibly and efficiently, but their move also carries risk. As companies spread their work across multiple containers, clouds, apps and devices, ops teams have trouble tracking their digital assets — living or dormant — and that can have major implications for cost, security, and operations.\n\n“How do you handle so much complexity?” asks Firefly CEO Ido Neeman (sitting in the center in the picture above). “You can’t. The proliferation of tools is too overwhelming.”\n\nFirefly’s services address this with tech that can scan assets in clouds from major providers, including Google, Microsoft Azure and Amazon Web Services, along with private clouds, containers, apps and more.\n\nUsing AI technology, the company creates a snapshot of the situation and immediately begins to highlight what might appear to conflict with something else, along with suggestions for how to remediate the problems.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nFirefly’s remediations are delivered in the form of “infrastructure as code,” which is used by DevOps and related teams as a way to provision and manage cloud resources, using code rather than physical or interactive tooling.\n\n“We do this by automatically and instantly discovering your entire cloud footprint across all the clouds, all the technologies, all the infrastructure’s code,” Neeman explained. “We discover everything on your cloud footprint. Then we scan it to detect which part of your cloud is properly controlled and qualified. You control it, you own it, it’s well-governed versus unmanaged, misconfigured, or inefficient. Once we find such chaos, we’ll give you automatic remedies to fix it.”\n\nThe company had recently launched an AI that suggested and could execute the code automatically, but it disabled that feature for some bigger customers, who were concerned about hallucinations and simply getting things wrong. We still have a ways to go before everyone signs up for all AI, all the time.\n\nRegardless, just as HubSpot might be used for marketing assets, or ServiceNow for infrastructure resources, Firefly wants to be “the source of truth, the cloud control pane” for the cloud, Neeman said. The company’s remediation by default comes in the form of suggestions, and it’s ultimately up to DevOps to decide whether these should be implemented.\n\nVertex, a previous backer, led this Series A with participation from two other returning investors — Hanaco and SoftBank — as well as new strategic backer InMotion Ventures (the investment arm of Jaguar Land Rover) and Redseed, a fund created by ex-DST partners and founders. Firefly had previously raised $6.5 million, and it’s not disclosing its valuation.\n\nHuman chaos\n\nRaising money as a successful startup these days can feel like a major win in itself. But it’s even more of an achievement when the funding comes after a crushing blow.\n\nThe startup has headquarters in Foster City in the Bay Area, and most of its customers are in the U.S., but it was founded and retains significant operations in Israel, which put it on the front lines of tragedy when Genis was murdered. (He is on the right side in the photo above.)\n\nGenis’ death came after a protracted attempt to evade the attackers, an effort he shared through text messages with his wife. Ultimately, Genis and a friend went into hiding. Cornered, they could see that there was no escaping a particular armed Hamas attacker. Without an option to flee further, the pair tried to overtake him. They both died. But the effort had a heroic ending: The distraction they provided saved the lives of others who had been hiding with Genis and his friend.\n\n“Thanks to the fact that they attacked the terrorist, they prevented him from entering the shelter and seeing that there were other people there,” one of the survivors said in a TV interview.\n\nThe attack at the Nova festival and surrounding villages kicked off a protracted and controversial war in Gaza, resulting in tens of thousands more casualties amid the destruction of an entire territory.\n\nFirefly represents the contradictions and complexities of the situation for the people and businesses in Israel and Gaza, many of whom are inherently involved in a conflict bigger than themselves, whether they want to be or not. Some will try to find a way to a brighter place despite that.\n\nNeeman, who co-founded Firefly with Genis and CPO Eran Bibi (pictured far left), said that the startup had been planning to raise money before this happened — a plan that was paused in the immediate aftermath.\n\n“We needed to handle this awful, awful situation,” Neeman explained. “He was not just the CTO, not just the co-founder, of Firefly. He was a very close friend to me, to Eran, to the entire team. Sefi was such a beautiful soul, just smiling and happy and honestly, a genius. So it was hard.”\n\nThey delayed funding for months, but also thought of how to soldier on (short of becoming soldiers in the literal sense).\n\n“I think that the entire team became stronger out of it,” he said. “We are now all committed to making his vision come true. Sefi wanted to solve cloud complexity, so for us, his legacy lives on through making Firefly a big, successful company.”\n\nGrowth began to accelerate, with the company growing fourfold over 2023 and doubling sales and customer counts in the last six months.\n\n“We signed some of the largest logos in the Fortune 500, and we created some amazing new capabilities to make cloud operations much more simple. We’ve added some great team members. We know we will always remember our good friend, but we’re optimistic. We’re seeing the future.”"}