{"url": "https://techcrunch.com/2025/01/07/fermata-uses-computer-vision-to-detect-diseases-and-pests-in-plants/", "title": "Fermata uses computer vision to detect diseases and pests in plants", "authors": ["Rebecca Szkutak", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-07T00:00:00", "text": "When Valeria Kogan started her PhD program in bioinformatics, the scientific field that uses computation and software to analyze biological data, in 2017, she imagined her career would always be within the fields of mathematics, medicine, or biology. But after the first AI boom in the late 2010s, she got an intriguing opportunity in a sector she hadn’t considered: agriculture.\n\nKogan (pictured above in the middle) told TechCrunch that when she was approached by a friend of a friend, a tomato grower looking for someone who understood AI and could help apply the tech to agriculture, she was intrigued. When she heard that they were looking to use AI to monitor plant health, she realized a lot of her bioinformatic background was transferrable.\n\n“When they started sharing with me the challenges they had, plants have health and their health is important, and how they monitor the health of plants, it was clear that technically the challenge is very similar,” Kogan said. “You want to see and make the diagnosis as fast as you can.”\n\nShe decided to launch Fermata in 2020. The Tel Aviv-based startup uses computer vision and AI to monitor and diagnose greenhouse crops with diseases or pests. Fermata’s software works with any off-the-shelf camera and takes pictures of a greenhouse’s crops twice a day. Its inhouse AI model analyzes the pictures and sends alerts of infestation or disease to farmers through an app.\n\nKogan acknowledged that companies looking to bring AI to farms have struggled to gain meaningful traction in the past. While she doesn’t think her company has garnered meaningful market share just yet, she thinks Fermata’s approach has allowed the team to gain traction for a few reasons.\n\nFor one, she said, they approached the market with genuine curiosity, looking to find out what greenhouse farms needed, as opposed to trying to sell them tech they didn’t want.\n\n“The original idea that I had was let’s build the robots that will be moving through the greenhouse, and we even built the first project,” Kogan said. “We did the first mistake, we built things before talking to anybody, and it still sits in my dad’s garage. When we started talking to people, it was very clear that no one needs that, the robot is a bad idea.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nShe added that their approach to training their AI model has likely also helped them stand out. Since the beginning, Fermata has kept its data labeling team in-house, as opposed to outsourcing it, which Kogan attributes the company’s accuracy to. When they started, they used publicly available data, but now they train their models on their customers’ data and have a research and development center where they infect plants with different diseases too.\n\n“We love customers who have a lot of problems because it brings us a lot of data, especially if they have some deadly diseases,” Kogan said, followed by a laugh. “We’re like, okay, let’s look serious on the call, and that we’re worried because that is bad news for them but for us it’s amazing news.”\n\nWhen Fermata launched, Kogan said they thought it would make sense to partner with companies that were already selling to farms. That approach didn’t garner a lot of callbacks when Fermata started it in 2020, but when AI started gaining momentum in 2022 that changed. Now, Fermata works directly with farms but also partners with large agriculture enterprises like Bayer and Syngenta. The company declined to share growth metrics but has deployed more than 100 cameras.\n\nFermata also recently raised a $10 million Series A round. The $10 million came entirely from Raw Ventures, a European VC. The firm was an existing investor and Kogan said when they set out to raise this current round, they didn’t feel the need to dilute the cap table with more investors.\n\nThe round will be used to help the company scale and to reach its goal of being profitable by 2026. Kogan said that they’ve been able to grow thus far without a sales team, and largely from inbound interest, but are looking to bulk up their sales team. Fermata currently just works with greenhouse-grown tomatoes but is actively working toward expanding into new crops and growing its partnerships.\n\nTechCrunch has an AI-focused newsletter! Sign up here to get it in your inbox every Wednesday."}