{"url": "https://techcrunch.com/2024/04/24/former-magic-leapers-launch-a-platform-for-ar-experiences/", "title": "Former Magic Leapers launch a platform for AR experiences", "authors": ["Brian Heater", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-04-24T00:00:00", "text": "When Trace’s future co-founders Greg Tran, Martin Smith and Sean Couture joined Magic Leap in spring/summer of 2015, it was about as hot as startups come. After years of secrecy, the augmented reality company captured Silicon Valley’s imagination with in-device footage, before capping the year with an $827 million raise.\n\nThe story of the intervening years is one of a massively funded and extremely promising startup struggling to find market fit. Tran exited his creative director role in January 2020, while Couture and Smith left in July 2020 and February 2021, respectively.\n\nTrace was founded in 2021, with Tran, Smith and Couture stepping into the respective roles of CEO, CTO and head of 3D art. The startup, which builds location-based branded augmented reality experiences, is a product of some of Magic Leap’s early content struggles.\n\n“It’s really hard to make AR content,” Tran tells TechCrunch. “It’s really early in the ecosystem. There were a lot of partners with Magic Leap. Whenever they wanted to make content, it would take three to six months to do, take experts in development and 3D art and whole teams of people. We saw an opportunity to make that process a lot easier.”\n\nTrace is a far more modest firm than Magic Leap. In addition to its three founders, the company employs a handful of contractors. Magic Leap’s funding now tops $4 billion. Trace, on the other hand, is announcing a $2 million pre-seed this week, co-led by Rev1 Ventures and Impellent Ventures. Still, the company has already teamed with some high-profile names, including Qualcomm, Telefónica, T-Mobile and Lenovo.\n\nIf you attended Mobile World Congress this year, you may have encountered the AR experience it built for Deutsche Telekom. Or perhaps you saw the mixed-reality offering it built for the Hip Hop 50 Summit last year in New York.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nTrace’s offering centers around a creator app designed to easily add AR content to a real-world space. Tran likens it to a Squarespace for AR experiences. Once in place, a user can access the digital content through Trace’s app or a web browser.\n\nThe creator experience has thus far been limited to a private beta, but Trace expects to open it to the public over the next few months. When that happens, companies will be able to produce experiences as part of a subscription-based offering.\n\nOne way the company is very much in line with Magic Leap, however, is its focus on enterprise clients.\n\n“The partners that we’ve had so far have been some of these big brand companies,” says Tran. “We’re focused on some of those enterprise-level partners first. … This is a consumer-facing product, in a way, but we see there being more opportunity in the enterprise space right now.”"}