{"url": "https://techcrunch.com/2025/03/03/dutch-startup-quantware-seeks-to-fast-track-quantum-computing/", "title": "Dutch startup QuantWare seeks to fast-track quantum computing", "authors": ["Anna Heim", "Freelance Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-03T00:00:00", "text": "Big Tech companies aren’t sleeping on quantum chips: Amazon Web Services introduced Ocelot; Microsoft, Majorana; and Google, Willow. But although all of these can be considered to be breakthroughs, quantum startups often focus on more practical advancements — and they are making progress.\n\nFounded in 2020, Dutch startup QuantWare is one of these, which claims that the hardware it manufactures already powers quantum computers for customers in 20 countries. Its core offering, VIO, focuses on scaling bottlenecks in quantum processing units (QPUs).\n\nEveryone in the quantum computing field is striving for more qubits, the quantum equivalent of bits — but integrating more qubits on a single chip is more powerful and less error-prone than networking several smaller systems together. QuantWare’s proprietary 3D chip architecture, VIO, “is the missing link in scaling up QPUs,” according to its CEO, Matthijs Rijlaarsdam.\n\nA spinout of TU Delft and its affiliated research institute, QuTech, QuantWare has now raised a €20 million Series A (approximately $19.27 million) — including the €5 million equity portion of the €7.5 million it previously secured from the European Innovation Council after its €6 million seed round (the remaining part is a grant).\n\nEuropean funding aside, this all-equity round was co-led by Dutch state-owned entity Invest-NL Deep Tech Fund and regional economic development agency InnovationQuarter, solidifying QuantWare’s position as a frontrunner in the Netherlands’ growing quantum ecosystem.\n\nThe new funds will be used to scale QuantWare’s team and technology, which was also recently updated: In February, the startup announced it would accept preorders for Contralto-A, its first QPU for quantum error correction.\n\nWhile Google’s Willow processor brought quantum error correction into the spotlight, QuantWare aims for a roadmap-focused strategy. It’s designed for upgradability to larger VIO-powered QPUs, and Contralto-A’s claim to fame is that it is “almost twice as large as competing solutions that are commercially available.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBig Tech companies, too, are engaged in the race to see who has the largest QPUs with the most qubits. But from the perspective of startups that risk not surviving long without revenues, the race is also about making quantum hardware commercially accessible to all — sooner than later.\n\nOn that front, QuantWare is pursuing two paths: Distributing its own designed QPUs, and allowing other companies to use its technology via its Foundry and Packaging Services. The new funding will also be deployed in these two directions — further developing VIO and building out its chip-fabrication facilities.\n\nIn addition to research institutes, users include several well-funded quantum startups, such as Alice & Bob, which recently raised $104 million. Two of these — Quantum Machines, which raised $170 million last month, and SEEQC, which announced $30 million in new funding in January — are also working together with the Dutch startup on the development of technology and products.\n\nIt is too early to tell which of these companies, if any, will come up with a quantum architecture that can provide a million qubits; Microsoft is in this race, too, and estimated that its Majorana announcement puts that horizon “within years, not decades.”\n\nWhat’s at stake, Rijlaarsdam told TechCrunch, is the ability for quantum to solve meaningful, industrial-scale problems.\n\n“There is a large and valuable class of problems that even a gigawatt AI cluster will not be able to solve — but quantum computers will,” he said. “That is why we are building these systems. Some examples include calculations on quantum systems, such as creating better materials, discovering new catalysts to break down microplastics, or improving the sustainability of fertilizer.”\n\nBut for QuantWare, which believes in quantum open architecture, the question is not who will build these million qubit systems; with VIO, it just wants to do its part in pushing for it to happen quickly."}