{"url": "https://techcrunch.com/2023/05/19/odyssey-energy-solutions-series-a-seven-months/", "title": "From seed to Series A in 7 months: Why and how Odyssey Energy Solutions moved quickly", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-05-19T00:00:00", "text": "Want a sneak peek at the electrical grid of the future? Don’t look to the U.S., Europe or China. Instead, head to Nigeria, where Odyssey Energy Solutions has been hard at work. There, a shaky and incomplete grid has driven many businesses and communities to invest in mini- and microgrids that are powered by renewable energy and capable of running independently.\n\nOdyssey has been building a platform to help developers launch, build and manage distributed renewable energy projects in emerging markets like Nigeria, Kenya and Sierra Leone. Those efforts helped the company raise a $5.3 million seed round last summer.\n\nNow, just seven months later, Odyssey has closed a $15 million Series A, TechCrunch+ has exclusively learned. The round was led by Union Square Ventures, with participation from Equal Ventures, Twelve Below, Transition, Equator, MCJ Collective, Abstract Ventures, Founder Collective and Climate Capital.\n\nThe company collects data on each project that flows through its platform, which it then uses to help investors vet future projects. Some of that data also helps developers procure equipment for their projects, be it solar panels, inverters or other key supplies. And on the tail end, Odyssey has software to control the energy flowing through developers’ mini- and microgrids.\n\nWhen the company raised its seed round last year, business was good. Odyssey co-founder and CEO Emily McAteer told TechCrunch+ that her company had already built up a network of project developers and had a significant amount of capital in its target markets flowing through the platform. Its software products were also helping developers procure supplies for less and more easily manage the mini- and microgrids that they had built. At the time, raising a Series A in short order wasn’t in the cards.\n\nBut that changed in the months that followed. “We had some proof points that we wanted to hit in launching those products, and we sort of hit them very quickly,” McAteer said. Some key hires also helped them rapidly understand some other pain points that Odyssey customers frequently experience. McAteer referred to this combination of team and product as “a springboard.”\n\n“We decided to pull forward our Series A because we felt we had proven that we could use this springboard to start to solve some of the other problems in the sector,” she said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThose wins weren’t just luck — they were the product of some deep knowledge of the sector and lessons learned over the past few years.\n\nMcAteer and chief business officer Piyush Mathur founded Odyssey in 2017. Both had extensive experience in the field. McAteer had been chief revenue officer for SunEdison’s distributed renewable energy subsidiary, and Mathur had been CEO of Simpa, a solar financing company that helped people and businesses in rural India buy solar power systems. Plus, after years of working with project developers in Nigeria, the Odyssey team was intimately familiar with their challenges.\n\nFor one, distributed renewable energy projects in Nigeria tend to be smaller than in places like the U.S. or Europe. As a result, project developers have a hard time buying materials. “That’s such a pain point for developers that are signing projects, but then needing to wait six months to get their panels or batteries,” McAteer said. Such delays can often mean the difference between a project working or not.\n\n“It’s an issue everywhere,” she said. “It’s particularly acute for our buyers because they’re small- and medium-sized. They’re the lowest priority for the equipment manufacturers, so they don’t have much say over lead times. And most of them don’t have the working capital to pre-purchase and have it ready by the time they sign an agreement with an off-taker,” she added, referring to the customers who ultimately buy the energy. Such delays can scuttle deals since off-takers essentially start paying for electricity as soon as they sign the contract.\n\nTo solve those problems, Odyssey began by aggregating demand for equipment so developers could negotiate better terms. The startup also offered to pay upfront on behalf of developers, requiring a down payment of only 15% or so. “That helps bridge that working capital gap that project developers face,” McAteer said.\n\nThe agreements aren’t structured like a loan, though. If the developer’s project falls through, Odyssey can turn around and sell the equipment to another developer on the platform because local demand is so high.\n\n“We have confidence that we can mitigate risk by using equipment that’s so widely needed in the market.”\n\nWith the new funding, McAteer said that Odyssey plans to expand to South Africa and countries in East Africa, with plans to expand farther into Southeast Asia and Latin America. The startup intends to continue focusing on emerging markets, she said, because in many places “the infrastructure is missing and so in some ways, it’s easier to start fresh.”\n\nThose markets will likely come with their own challenges, but Odyssey’s quick successes in Nigeria suggest that it’s up to the task. The speedy Series A suggests that investors think so, too. If Odyssey is able to tackle other African markets and move on to Southeast Asia and Latin America, expect a Series B before too long. That’ll be a good thing for Odyssey — and the rest of the world, too. Solving decarbonization challenges in emerging markets will pay dividends for everyone."}