{"url": "https://techcrunch.com/2024/12/05/amp-robotics-raises-91m-to-build-more-robot-filled-waste-sorting-facilities/", "title": "Amp Robotics raises $91M to build more robot-filled waste-sorting facilities", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-12-05T00:00:00", "text": "Recycling today kind of sucks. People are generally confused about what can be recycled and where. As a result, only about 32% of eligible waste actually gets recycled.\n\nIt would be a lot easier if people could dump everything into one bin and let the waste-management companies deal with it, but that’s proven to be too expensive with humans in the loop.\n\nEnter robots. Myriad companies, from small startups like Glacier to large multinationals like Apple, have been working to automate recycling. Most of that work has centered on the robots, placing them in existing facilities to help humans recover more waste.\n\nMore recently, Amp Robotics, an early entrant, changed its business model to focus on running entire facilities. That shift has now netted the company $91 million in fresh funding.\n\nThe decade-old company has deployed around 400 robots, and it operates three facilities with another in the works. Companies can specify how many sorting modules depending on how much trash they need to sort or which material they’re looking for. Inside, cameras watch the flow of trash, using AI to identify what can be recycled, and robotic arms pluck bits from the conveyor belt.\n\nAmp handles operations, maintenance, and upgrades, with the contracting company handling waste sourcing, offtake of any valuable materials, and disposal of anything that can’t be recycled. It’s basically another “as a service” business model, with the company charging per ton of waste sorted.\n\nThe new funding round, a Series D, was led by Congruent Ventures with participation from Blue Earth Capital, California State Teachers Retirement System, Liberty Mutual Investments, Wellington Management, Range Ventures, Sequoia Capital, Tao Capital Partners, and XN.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe round is a little smaller than Amp’s Series C, which after additions ended up raising $104 million, per SEC filings, highlighting the challenging fundraising environment that many mid- to late-stage startups face."}