{"url": "https://techcrunch.com/2024/06/05/dive-goes-cloud-native-for-its-computational-fluid-dynamics-simulation-service/", "title": "Dive goes cloud-native for its computational fluid dynamics simulation service", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-06-05T00:00:00", "text": "Computational fluid dynamics (CFD) simulations are complex, computationally expensive and not typically something that startups focus on. But that’s exactly what Boston- and Berlin-based Dive is doing. The company aims to change how manufacturers use computer simulations by using both modern mathematical approaches and cloud computing to disrupt a market that is mostly dominated by a small number of incumbents.\n\nDive’s customer list includes the likes of BMW, BSH, Kärcher, Siemens and ZF.\n\nImage Credits:Dive\n\nThe company, which on Wednesday announced that it has raised a $10 million Series A round led by D.E. Shaw Group, was spun out of German multinational Bosch in 2018. Dive co-founder and CEO Pierre Sabrowski tells me that he started working at Bosch during his PhD studies. His first few years were spent trying to simulate washing machines.\n\n“The washing machine seems like such a small thing, but there are, I think, 700 or 800 engineers these days — maybe even more — in Berlin, dedicatedly working on the washing machines of Bosch. So this is huge. It’s a huge market, and we were part of simulating that. And we simply failed,” he told me.\n\nThe techniques available at the time simply weren’t good enough to simulate something as complex as fluids moving in a washing machine. But after a few years of trying, the team happened upon a technique used by astrophysicists that treats fluids as being made up of particles instead of as an interconnected mesh, like older techniques did.\n\nImage Credits:Dive\n\nThe team at Bosch started extending an open source tool to perform those mesh-free simulations for its own needs, all while working on the fundamental science behind it, too. “The team around that group is pretty big and in 2017, our department lead said: ‘Hey, OK, the team is too big. We can’t afford that anymore in Bosch alone. The number of applications is also limited to what we can do at Bosch, so maybe you guys should start as a spin-off.’”\n\nAt first, the team was mostly doing projects for clients because, as Sabrowski told me, the software itself wasn’t at a point where anybody outside of Dive could really use it yet. By 2021, though, Dive started selling licenses and then raised its seed round, even before it had a real 3D user interface to visualize the results.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nImage Credits:Dive\n\nSome of Dive’s earliest customers came from the automotive industry, which is maybe no surprise, given its experiences with simulating liquids in closed, rotating environments. In that respect, washing machines and gear boxes aren’t all that different. The company also still targets household appliance manufacturers, as well as companies building dispensing systems.\n\nOffering a better simulation is definitely an incentive for Dive’s customers, but Sabrowski also stressed that the team spent a lot of time on how it wants to deliver its solution. In the end, Dive decided to go with a cloud-enabled solution, where the interface lives on the desktop.\n\nDive’s Series A round was led by D.E. Shaw, with First Momentum Ventures, Segenia Capital and Senovo Capital participating in Dive’s seed round. The company plans to use the new funding to expand its simulation portfolio to cover a wider range of use cases and strengthen its data analytics and data governance programs. Dive’s customers are already storing their engineering data in Dive’s cloud platform, after all, so helping them best analyze and leverage that data is an obvious next step.\n\n“We’re excited about Dive’s potential to transform the manufacturing and computer-aided engineering industries,” said Jean Nations of the D. E. Shaw Group. “Dive’s mesh-free and cloud-native approach is designed to enable engineers to create simulations that reduce industrial production timelines and costs, leading to greater efficiency in the engineering process.”"}