{"url": "https://techcrunch.com/2021/08/03/south-africas-khula-closes-1-3m-seed-to-scale-its-software-for-agriculture-platform/", "title": "South Africa’s Khula closes $1.3M seed to scale its software-for-agriculture platform", "authors": ["Tage Kene-Okafor", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-08-03T00:00:00", "text": "The myriad challenges faced by farmers in Africa — inadequate financing, education and input distribution — persist and greatly affect the agricultural output on the continent. But startups are providing innovative solutions to these problems, and South Africa’s Khula is an example. The startup, launched in 2018, is finding its niche in the ever-growing industry.\n\nToday, it announced a $1.3 million seed round to scale operations across the country.\n\nOn the surface, it would seem agritech in Africa hasn’t taken off as exponentially as other tech-operated industries. But it has: The agritech sector grew 44% year-on-year between 2016 and 2019, and the continent has the highest number of agritech services in the developing world, reaching more than 33 million smallholder farmers, according to a report from Farmers Review Africa.\n\nKaridas Tshintsholo, Matthew Piper and Jackson Dyora founded Khula three years ago. Khula provides small-scale and commercial size farmers with software and a marketplace to grow their business. But this description doesn’t do justice to the painstaking problem Khula is solving.\n\nBefore Khula, Tshintsholo and Piper were school and business partners. They worked on consulting gigs after dropping out of college a year before graduation. But while it allowed them to meet with clients in various disciplines, the consulting business wasn’t exhilarating enough.\n\n“We always wanted something to do something more impactful, something more meaningful, something that could really change the way that the world works,” Tshintsholo told TechCrunch. As time went on, agritech seemed like the path to take due to both founders’ experiences.\n\nAfrica is home to 60% of the world’s arable land. Research also shows agritech in Africa is projected to reach a value of $1 trillion by 2030. But a trip to Israel made Piper wonder why the country — although half of its land is considered a desert — had more agricultural produce than African countries.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“It didn’t make sense that we have more land than any other continent,” Tshintsholo said. “And pretty much everyone on the continent is a farmer and we’re buying food more than we were selling. We wondered how that was possible, considering how big of competitive advantage agriculture is?”\n\nFurther research and spending time with farmers exposed another problem: how intermediaries ripped off farmers in the country.\n\nThe agricultural industry in South Africa is known to favor industrial agriculture. And like most parts of Africa, smallholder farmers have it rough as they face a plethora of challenges, from marketing and selling to transportation of their goods and produce.\n\nTypically, farmers take their produce to a large warehouse where big aggregators pick up the produce and sell it. The problem here is that most products are sold on consignment, which means there are no guarantees farmers will make a sale. The goods, mostly perishable, are also bound to experience drops in price, and there’s a huge lack of transparency, allowing middlemen to rip off farmers.\n\n“I think the penny dropped for us was when we started playing detective. We followed these farmers and noticed what big companies listed on the stock exchange did: Go to these physical markets, pick up the produce and then sell to the formal market. They’d pick it up for R3.50 and sell it for R11.00. They literally added nothing to the value chain other than just picking it up and dropping it off.”\n\nIn some cases, farmers could sell their produce to a processor who subsequently sells it to a supermarket at a much higher price. The supermarket also makes a profit by selling to individual consumers. So what a farmer sold for R3.50 ($0.24) might end up at R30 ($2.07) in an individual consumer’s hands. That’s not all; farmers must also pay commissions to these middlemen and municipalities they operate in.\n\n“This was when we knew that this was a struggle, and this was the problem we wanted to address,” Tshintsholo said. “But then, in addressing that problem, we didn’t go live initially. Agriculture can be very complex. What we have now is something that we call the Khula ecosystem, and this is because the industry is very interconnected.”\n\nKhula wants to tackle all these issues at once and provide farmers with liquidity, access and a market. The platform is an ecosystem made with three products.\n\nThe Inputs App allows farmers to access approved agricultural inputs and services from local and international suppliers.\n\nThe second is the Fresh Produce Marketplace, targeted at farmers with challenges cited earlier. It allows farmers to sell produce directly to local and international formal bulk buyers. By allowing farmers to engage and negotiate prices with suppliers, the platform aims to reduce the access middlemen have that has led to the exploitation of farmers.\n\nThen, the Funder Dashboard connects institutional investors with farmers who meet their funding mandates.\n\n“The reason we’ve gone with this ecosystem approach is that it’s more of a sticky business model,” Tshintsholo said. “So we want to allow farmers to use our ecosystem to buy the products they need and get the services they need.”\n\nKhula has seen reasonable traction since launching. The company has signed up more than 3,000 farmers, and over 100 suppliers now work with the company. This year, the startup was accepted into the Google for Startups Accelerator Class 6 alongside 14 other African companies.\n\nWhile the company is just announcing this investment, it closed the round last year. It was led by AECI, one of the continent’s biggest agrochemical companies. South African impact investor E Squared Investments also participated.\n\nIn addition to the financial firepower Khula receives from its lead investor, it will also get access to AECI’s wide distribution network to scale its inputs app. With 132 depots across the country, Khula says it can deliver products in every province, in every major agriculture region.\n\nTshintsholo says AECI is the kind of investor Khula hopes to have as it progresses: a long-term partner interested in execution and not quarterly updates.\n\n“We did not want an investor at the table who was only going to ask us how we’d performed in a specific quarter. We wanted a long-term partner that would execute with us. A partner with a great reputation in the industry and an incredible distribution network, a partner whose long-term success was tied to a business model like ours. And AECI fits that description perfectly for us.”\n\n“Khula has very attractive fundamentals, a sizable addressable market, app development capabilities, key agri-business networks and a management team that wishes to work with AECI as their preferred agri-input and technical advisory partner,” Quintin Cross, the managing director of AECI Plant Health, said in a statement."}