{"url": "https://techcrunch.com/2022/05/13/to-boost-early-stage-growth-adopt-a-jobs-to-be-done-approach-to-marketing/", "title": "To boost early-stage growth, adopt a jobs-to-be-done approach to marketing", "authors": ["Michael Popchuk", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-05-13T00:00:00", "text": "The jobs-to-be-done (JTBD) approach provides a framework for defining, categorizing, capturing and organizing all your customers’ needs.\n\nIt teaches us to think about users’ needs and develop a product to meet those needs. The framework also lets us communicate with the user through the lens of the tasks they seek to do, and stay focused on developing features that align with what they need.\n\nHere are three ways an early-stage startup can use the JTBD framework for marketing:\n\nGet initial organic traffic for the website.\n\nIncrease conversion of information pages.\n\nIncrease product virality.\n\nHow to employ JTBD at an early-stage SAAS\n\nThe startup I’m building aims to develop an ecosystem of apps for sales and accounting automation, each of which can solve a specific problem. These apps are integrated under the hood to enable customers to use other apps for related tasks.\n\nFor example, when a customer uses our invoice maker app, we’ll automatically extract the income and account receivables information into our personal finance app, should they opt-in. And if in the user needs to track mileage in the future, they can just download our Mileage Tracker app, and all their information will already be in there.\n\nWe employ the same approach to our marketing.\n\nOptimize your website with JTBD keywords for SEO\n\nTo get traffic with a small budget, you should first analyze what your prospective users need to do, discover how they search for ways to do these tasks, and use those keywords on your website.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nFor example, instead of fighting for the “best invoice maker” keyword on SEO for our invoice maker app, we could use more direct search terms like “printable blank invoice” or “medical records invoice template.”\n\nApplying the JTBD framework for search queries, we hypothesized that many people want to find an invoice template for specific services, such as plumbing or medical records. These search terms are all very similar, but this is how people look for solutions.\n\nSo we created simple landing pages with templates of invoices for different industries and tasks. We have hundreds of these templates now, and they generate 80% of our new incoming traffic.\n\nAfter doing this for six months, we saw:\n\n300,000 website views via search per month.\n\n25% conversion of inbound traffic into views of our templates.\n\nLanding pages made with the JTBD framework converted more than 15% visitors to registration.\n\nThe traffic from search engines to our templates is growing much faster than from our blogs, since the template pages have excellent characteristics in terms of view time and interactions on page.\n\nBoost conversion of pages\n\nGoing back to our invoice maker example, we’ve found that blog posts that get traffic for queries like “How to create an invoice in Excel” don’t really convert well. People find the answer and go implement what they learned.\n\nWe found that adding a simple call to action (CTA) with the JTBD framework in mind boosts conversion significantly.\n\nAs our CMO Ivan Burban explains, we added CTA blocks to our blog after conducting user surveys and segmentation. These blocks, in the form of actual templates and quotes, helped increase the blog’s conversion by 17% and more than double the session time for people who visited the website from this page.\n\nWe also created unique landing pages to advertise the solution for specific jobs and relinked articles and other non-commercial pages to these landing pages. This resulted in about 10% conversion to registration.\n\nMake sure people share\n\nThe JTBD framework can also be used when you’re building your social media strategy. We’ve learned that it’s crucial to choose carefully where and how you offer the option to share and keep in mind the jobs customers want to accomplish.\n\nSharing with Facebook buttons on generic blog pages does not work. They come off as indifferent, and people have to do the sharing and write an accompanying message, which takes a lot of cognitive effort.\n\nWe wanted to make it so that sharing serves a practical purpose (following the JTBD strategy) and also carries a message with the shared post.\n\nConsider which of the following scenarios makes for a good experience:\n\nSharing a generic blog on bookkeeping for small businesses via a Facebook share widget.\n\nOr, directly sharing an invoice template for medical services.\n\nOur users demonstrated that directly sharing links to invoice editors works well. Moreover, when built well on the back end, page previews speak for themselves. For example, ours says: “Download a medical invoice template,” and users don’t have to add a message to explain what they’re sharing.\n\nIt’s best to build sharing into your product so users can access your product seamlessly. For example, every invoice our customers’ clients receive has the message: “This invoice is made with Invoice Maker by Saldo Apps.”\n\nFollowing the JTBD strategy, this approach enabled us to implement a way to let people who received an invoice also make one with just a click, and as they know exactly what the result will look like, conversion also benefits.\n\nIt’s not easy, though\n\nIt can be difficult to employ the JTBD framework early on, as young startups won’t have enough data to come up with ideas for high-quality jobs that customers want to do, or how to phrase the search terms the way people do. It is also difficult to test which of these ideas are better at converting visitors to registering.\n\nUnfortunately, not all of the pages we make for each job convert well — I estimate less than 10% of the pages actually work. That’s why it’s important to collect a large semantic core of search phrases and words that your customers use when looking for solutions. We are working with over 2,000 search terms.\n\nI recently spoke with the founder of a unicorn in our niche, and he said his company has over 4,000 pages and an in-house analytics tool that helps to highlight the pages that convert better than average.\n\nBut building such a tool is not an easy task for a startup. None of the external tools give you useful search term analytics for pages that get low traffic, which makes it hard to test which search phrases work well.\n\nTo put together your semantic core for jobs, I suggest using:\n\nSearch terms used by visitors to your competitors’ sites from SEO analytics tools like Semrush or Serpstat.\n\nQuotes from user interviews. I always try to capture the exact words customers use, as it helps come up with marketing messaging and search terms.\n\nSocial media and messenger groups for your audience can provide an invaluable source of good quotes and phrases that customers use to look for solutions.\n\nThere are many ways to attract your initial audience for free. These methods are highly scalable and you’ll use them even more as your resources increase and demand for your product rises.\n\nI believe that the key to a loyal audience is to keep in mind the tasks they want to accomplish not only during product development but also when defining marketing strategy.\n\nThinking of and using the jobs users want to accomplish to inform your strategy will help boost SEO, improve conversion on generic pages and increase the virality of your product.\n\nLastly, employ the tactics that work and adapt them to your situation. You don’t have to reinvent the wheel — spice it up with unconventional techniques and perfect it."}