{"url": "https://techcrunch.com/2025/04/30/uk-retail-giant-co-op-warns-of-disruption-as-it-battles-cyberattack/", "title": "UK retail giant Co-op warns of disruption as it battles cyberattack", "authors": ["Zack Whittaker", "Security Editor", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-04-30T00:00:00", "text": "U.K. retail conglomerate The Co-operative Group said it has shut down some of its IT systems, citing an attempted cyberattack.\n\nCo-op spokesperson Mark Carrington said the company “recently experienced attempts” by hackers to break into some of its systems and took “proactive steps” to keep those systems safe. The spokesperson said the company’s back office and call center functions are facing some disruption as a result.\n\nIt’s not clear if the attempted intrusions were successful.\n\nThe Co-op — one of the largest food retailers in the U.K. with more than 5 million members — said its stores were operating normally and that it was not asking customers “to do anything differently” at this time.\n\nWhen asked by TechCrunch, The Co-op would not describe the specific nature of the incident, such as ransomware, or if it is known, nor would it say if it has disclosed the incident to the U.K.’s data protection regulator, the Information Commissioner’s Office, as is required in the event of a suspected data breach. The company confirmed it is working with the National Cyber Security Centre.\n\nThe Co-op’s spokesperson also would not say if the company had any communication with the threat actors, such as a ransomware gang.\n\nNews of the disruption at The Co-op comes days after U.K. retailer Marks & Spencer confirmed a cyberattack that left customers unable to pick up their orders. The retailer said it notified the U.K. data regulator of the incident, indicating a possible data breach. The ongoing disruption at Marks & Spencer has since entered its second week."}