{"url": "https://techcrunch.com/2025/03/07/sxsw-2025-what-were-paying-attention-to/", "title": "SXSW 2025: What we’re paying attention to", "authors": ["Kirsten Korosec", "Transportation Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-03-07T00:00:00", "text": "TechCrunch will be on the ground at SXSW 2025 — the annual tech, music, comedy, and film conference that kicked off Friday in Austin — in search of the zeitgeist of this AI-centric era.\n\nYup, we’re one sentence in and AI has already made its entrance. And why not? A quick scan of the massive SXSW schedule illustrates that AI is on center stage in Austin — and globally. It’s worth noting that this year there seems to be an emphasis on how AI is being applied to the real world, not just speculation on what it could be.\n\nSXSW tends to reflect what the tech ecosystem of founders and backers are working on. And it often coincides with the hype cycle. Autonomous vehicles, scooter mania, crypto, psychedelics — they’ve all had their moment at SXSW.\n\nThe tech portion of the annual event kicked off Friday and will run through March 13. The conference begins with several tracks that fall squarely in TechCrunch’s area of interest, including the creator economy, culture, startups, health and medtech, and energy. The AI track officially begins Sunday, but it’s already making cameos. For instance, Signal President Meredith Whittaker, who was interviewed onstage Friday, called out agentic AI as a security and privacy threat, and a health expert warned that it can be dangerous for people to be too reliant on AI for companionship.\n\nDeep tech like space and quantum computing will also make its mark at the show, as will climate, sustainability — look out for Rivian founder and CEO RJ Scaringe’s keynote March 11 — and transportation.\n\nAutonomous vehicles are back, but this time they’re on the road — not just the topic of conversation in a panel. Earlier this week, Uber and Waymo launched a robotaxi service in Austin. The so-called “Waymo on Uber” robotaxi service is available to any member of the public who has an Uber account. And you better believe TechCrunch will be hailing those robots and talking to human Uber drivers about what they think.\n\nTechCrunch will also be talking to the VCs, founders, and industry experts at SXSW to get the pulse of how the tech world is adjusting to the Trump administration and, of course, to find the next new new thing. We’ll also be paying attention to the numerous keynotes and interviews with tech and business luminaries, notably Alan Baratz of D-Wave Quantum, Qualcomm President and CEO Cristiano Amon, Colossal Biosciences founder Ben Lamm, and Arm CEO Rene Haas.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nDon’t worry, we’ll have a bit of fun, too.\n\n"}