{"url": "https://techcrunch.com/2024/04/02/quadratic-is-reimagining-the-spreadsheet-with-a-focus-on-data/", "title": "Quadratic is reimagining the spreadsheet with a focus on data", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-04-02T00:00:00", "text": "Not a lot of thought goes into the average spreadsheet. Yet, increasingly, spreadsheets are becoming an essential tool for data teams.\n\nEntrepreneur David Kircos knows this well; he previously worked at Techstars, the accelerator program, where he built financial models for startups.\n\n“Building data models is best done in Python, but many of my team members only understood spreadsheets,” Kircos told TechCrunch. “So I built code to generate spreadsheets. This was painful; I was spending about 10% of my time on valuable analysis and 90% on building infrastructure and pipelines to generate reports.”\n\nThis experience led Kircos — who previously launched and exited a fintech firm called Challenger — to work on what would become Quadratic, a startup launching out of stealth this week. Kircos describes Quadratic, which he co-founded with fellow entrepreneur Peter Mills, as “a spreadsheet that speaks Python and other programming languages natively.” It allows data analysts and devs to communicate with the rest of their organization using a tool (spreadsheets) most people know how to work with.\n\n“Quadratic is on a mission to build the best tool for understanding data,” Kircos said. “It’s a platform that lets users pull data from its source — software-as-a-service platforms, databases, CSV files, APIs and so on — and then works with that data using the most popular data science tools today, including Python, Pandas, SQL, JavaScript and Excel formulas.”\n\nUsing Quadratic, users can bring in hundreds of thousands of rows of data, write analyses in their preferred programming language and share the results with outside stakeholders. The platform offers workspaces for teams, support for elements like charts and plug-ins to collaborate in real time.\n\n“Quadratic is a brand-new type of spreadsheet, not an Excel clone,” Kircos said. “We believe in the power of the spreadsheet as the primary interface for working with data, but traditional spreadsheets no longer cut it.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMany companies are trying or have tried to “disrupt the spreadsheet” — to varying degrees of success. Kircos didn’t answer directly when asked which vendors he sees as Quadratic’s chief rivals.\n\nThere’s Sourcetable, whose headlining features include real-time document collaboration, data syncing with business apps and an editor for querying large data sets. Neptyne, which launched in March 2023, is building a Python-powered spreadsheet targeting data scientists. Coefficient and Actiondesk focus on live data integration. And Equals looks to supercharge existing spreadsheets with additional analytics tools.\n\nBut Kircos sees Quadratic standing out in two ways: It’s highly performant thanks to an underlying engine built on Rust and WebGL, and it’s free for individual and educational use. Only businesses and teams have to pay for access.\n\n“Quadratic is an open-access project, built by six-plus full-time contributors and 18 total all-time contributors,” Kircos said. “The ability to integrate data from various platforms for analysis creates a more efficient data and coding process for enterprises.”\n\nBoulder, Colorado-based Quadratic, which has around 45,000 users at present, recently closed a $5.6 million seed round led by GV (Google’s venture division) with participation from Catapult Ventures, Betaworks, The Fund Rockies and angel investors including Pandas creator Wes McKinney, Repit CEO Amjad Masad and Cockroach Labs founder Spencer Kimball. The capital will be put toward expanding the team and acquiring new customers, Kircos said."}