{"url": "https://techcrunch.com/2023/05/10/vast-and-spacex-aim-to-put-the-first-commercial-space-station-in-orbit-in-2025/", "title": "Vast and SpaceX aim to put the first commercial space station in orbit in 2025", "authors": ["Darrell Etherington", "Editor At Large", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-05-10T00:00:00", "text": "Artificial gravity space station startup Vast announced that it intends to put the first commercial space station in orbit in August 2025 via launch partner SpaceX — which will also provide the first human occupants of said space station a short while later using SpaceX’s Dragon crew capsule.\n\nVast, which last year debuted its ambitious goal of building a 100-meter long, modular artificial space station featuring artificial gravity powered by rotational velocity, has dubbed its first station Haven-1. The station is intended to operate on its own initially, but will eventually become one module in a larger Vast station when it connects with others launched later.\n\nHaven-1 is small enough that it can be launched atop a SpaceX Falcon 9 rocket, and it’s designed to accommodate up to four crew at once. It features a docking hatch designed for Crew Dragon, and looks to be a little over double the height of SpaceX’s human-rated spacecraft.\n\nIn its initial, single-module form, the Vast station is mostly intended to provide an extended-stay destination for Dragon flights, offering four people a bit more room to stretch their legs — along with opportunity for “science, research and in-space manufacturing” for stays of up to 30 days on orbit. The station also provides power, round-the-clock connectivity via onboard Wi-Fi and “consumables” (a mini bar?) throughout the stay.\n\nVast-1, the mission that the company says will provide the station’s first four human occupants, is actually available for booking — the company is open to both space agencies and their professional astronauts, as well as private individuals aiming to do either scientific or philanthropic work. Vast also has an option on the books with SpaceX for a second mission, Vast-2, which would fly in 2026 — I guess depending on demand?\n\nThe 2025 date, if it sticks, will beat other planned commercial space stations to operational status — including the private Starlab project by Nanoracks, Lockheed Martin and Voyager space, which is aiming for 2027, and Axiom, which is so far targeting “late 2025” for the launch of the first section of its planned orbital platform."}