{"url": "https://techcrunch.com/2023/08/30/voxel/", "title": "Voxel uses computer vision to increase workplace safety", "authors": ["Catherine Shu", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-08-30T00:00:00", "text": "The International Labour Organization estimates that there are 340 million workplace incidents every year. Voxel was created to increase workplace safety through computer vision. The startup announced today it has raised $12 million in strategic funding led by manufacturer Rite-Hite, with participation from returning investors Eclipse Ventures and MTech. This brings its total funding raised since 2020 to $30 million.\n\nOne of Voxel’s differentiators from other computer vision startups is that is technology integrates with existing security cameras, so companies don’t have to invest in new equipment. It can identify hazards, like near-miss vehicle collisions, blocked exits, improper ergonomics (for example, if a worker is bending in a way that can lead to injury) and spills. Real-time alerts are sent to on-site personnel.\n\nVoxel is currently used by companies like Michael’s, Dollar Tree, Clorox, PPG Industries and Office Depot. It was founded by CEO Alex Senemar, who previously launched Sherbit, an AI-powered remote health monitoring system for hospitals that was acquired in 2018 by Medopad. Other co-founders include CTO Anurag Kanungo, another Sherbit co-founder who also a software engineer at Uber’s self-driving unit; Harishma Dayanidhi, who developed self-driving car tech at Uber and Aurora; and former Google software engineer Troy Carlson. Voxel has a team of 50 employees.\n\nSenemar told TechCrunch that despite the advancements in AI and computer vision, the technology remained largely untapped when it came to workplace safety. Voxel was created to identify hazards, risky behaviors and operational inefficiencies.\n\nMost companies still rely on manual supervision, spot checks and after-the-fact incident reporting, said Senemar. But these processes often overlook near-miss incidents and don’t help companies come up with real-time solutions. Voxel automates the process, and instead of just monitoring, it has video-based coaching and analytics safety teams can use to implement changes. Voxel has an ethics policy that means it doesn’t use facial recognition or identify individuals in its systems. Facial blurring is also available by request, and if there isn’t a safety risk identified, then captured footage is discarded.\n\nVoxel’s target customers include Fortune 500 companies in high-risk sectors like warehousing, retail, manufacturing and energy.\n\nAfter implementing Voxel, Senemar said Americold (the world’s largest cold-storage company) saw a 77% reduction in injuries, resulting in savings of $1.1 m million. Voxel helped identify and decrease risk factors like speeding forklifts, speeding at the end of aisles, blindspots and drivable zones that were blocked. It was also able to spot behaviors that can lead to injuries like improper ergonomics and unsafe lifting postures.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSenemar said Voxel’s plans include expanding into more industries, especially ones that haven’t traditionally utilized AI for safety. It also plans to integrate more predictive anlaytics to pre-empt potential risks, and expand into markets outside of North America.\n\nRite-Hite CEO Micaela Bomhack said, “We’ve seen first-hand the impact Voxel’s technology has had on workers and workplaces and are excited to continue paving the path for future workplace safety with the Voxel team.”"}