{"url": "https://techcrunch.com/2024/02/16/the-hard-tech-renaissance-accelerates-as-yc-spotlights-space-manufacturing-and-defense/", "title": "The hard tech renaissance accelerates as YC spotlights space, manufacturing and defense", "authors": ["Aria Alamalhodaei", "Reporter", "Space", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-02-16T00:00:00", "text": "Y Combinator is putting hard tech in the spotlight. On Wednesday, the accelerator released an updated list of ideas it would like to see in applications — with categories like space, manufacturing and defense featured prominently.\n\nYC has backed plenty of hard tech startups before. Launch companies Stoke Space and Relativity Space and satellite broadband provider Astranis are among its alumnus. The accelerator’s biggest exit is still General Motors’ $1 billion purchase of autonomous vehicle company Cruise Automation in 2016.\n\nBut overall, hard tech comprises a very small fraction of the companies that have passed through its program. The accelerator is better known for nurturing breakout software startups in sectors like consumer and fintech. So the spotlight on hard tech suggests that YC sees hard tech as underinvested, and more likely to generate the massive valuation spikes required for a successful venture portfolio.\n\nIn particular, the exit market for SaaS companies has been on the decline since 2016. As engineer and a16z scout Andrew Cote put it on his Substack, “the number of new venture-scale software opportunities is shrinking outside of strong network effects as software reaches better overall penetration and barriers to entry continue to drop.”\n\nAs a result, more funds, including Sequoia and Bessemer Venture Partners, are diving into sectors like defense. As more venture investors get involved, valuations are likely to rise — it’s already happening in defense — but YC’s attention could help attract new talent and larger institutional investors, spurring a hard tech startup boom.\n\nThe “new request for startups” list “is a recognition of what a number of people that have been investing in this space for many years now have been seeing, which is there’s the potential to generate venture returns across an entire portfolio of investments that have technologies that are not exclusively software based,” Mike Annunziata, managing partner at Also Capital, said in a recent interview.\n\nAlso is a pre-seed fund that has invested in many hard tech businesses, including Varda Space Industries, Radiant, and K2 Space. Annunziata added that YC’s incredible ability to catalyze entrepreneurial talent will be a plus, because “the real bottleneck in scaling the impact that [hard tech] companies can have in the physical world is talent.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAaron Slodov’s company Atomic Industries, which is working on one of the most challenging problems in manufacturing, automating tool and die making, joined Y Combinator in its Winter 2021 cohort. Even since that time, Slodov said he’s seen more investors move into the space, particularly at the early stages.\n\nIn some cases, it’s VCs looking for differentiation, but Slodov said that as more companies “attempt to be VC scalable and hard tech at the same time,” the more will make it through to help solidify the case for the investing thesis.\n\n“If we get more people working on nuclear and solar and manufacturing and space, more people will ultimately get pushed through the filter and have impact,” he said.\n\nSlodov notes that global tensions and an increased focus on securing supply chains (among other government directives) has helped push more funding to hard tech: “There are much larger trends at play here that back into building companies in manufacturing and hard tech, like being able to actually do that stuff [in the United States],” Slodov said. I think it’s exciting that a lot of people are actually looking at it seriously now and trying to figure out where they can add value.”\n\nIn some ways, even software’s intense saturation is a boon: as Cote notes, although software startups are approaching commodity-like returns, that commodification has meant much lower software costs and greater flexibility for all kinds of startups, and that will unlock “the next golden age of atoms.”\n\nSlodov notes a similar dynamic: “Ultimately, the long tail of these types of companies happening now is that they get to build on top of the entire existing ecosystem that has come out of the last 40 years of Silicon Valley, like being able to build your startup on AWS, for instance,” he said. “Building these companies that are hard tech on top of all this existing tech for the last 40 years is a very late mover advantage. [It’s possible that] more trillion dollar companies are built today, and they’re all going to be actually hard tech and not software. They will have a software component, no question, but they will be things that touch and deal with the physical world.”"}