{"url": "https://techcrunch.com/2017/04/18/in-the-smart-city-race-were-betting-on-transit/", "title": "In the smart city race, we’re betting on transit", "authors": ["Colin O Donnell", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2017-04-18T00:00:00", "text": "After years of talk about smart cities, people are wondering when — and where — will we start to see them really begin to take shape. What will they look like? How will we interact with them?\n\nA smart city is more than the sum of its parts. With a street light here, a sensor there — when solutions are not clearly connected and without critical mass — you don’t get the combinatorial benefit of different systems working together.\n\nBut that’s all about to change. Comprehensive and large-scale smart city innovations will start to emerge where we least expect them. Not in our streets or in our buildings, but below them, in the subways, commuter rail and mass transit of global cities. Here’s why transit systems around the world are positioned to take center stage in a smart city revolution.\n\nTransit systems are ripe for disruption (the good kind!)\n\nWhile the rest of the world has been in a constant upheaval over the past decade, reinventing itself with technology and new business models, mass transit systems have stayed largely static — doggedly, determinedly moving millions of people each day with little influence from outside tech. Just the fact that your mobile device works underground is cause for celebration, and a single line of text on an LED readout telling you when the next train is arriving is a small miracle.\n\nCompare that with how in just a few years’ time we’ve seen ridesharing transform how we move by car. Push button, get chauffeur. There is room to make a massive impact in transit.\n\nMass transit takes the human experience of cities and turns it up to 11\n\nIf culture clashes are what makes cities thrive — where ideas bump up against each other and swirl together to make new things like jazz, hip hop, the kimchi burger, the Cronut — nowhere does this friction play out more than within a transit system.\n\nWhile suburban car commuters sit by themselves in little boxes, mass transit exposes us to new forms of art, music and culture. But more importantly, transit exposes us to humanity itself — where people of every racial, religious and socioeconomic background and of every ability get uncomfortably close to one another. It is truly the great humanizing and democratizing asset of cities.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe thing that gets us so excited about smart cities is the potential to take the solitary experience of the internet — a person and a screen — and bring it into this heaving cultural mashup. Those self-selected, self-affirming circles of our internet experience need to be offset by the kind of diversity that exists in any 10-square-feet of mass transit. And when we add the intelligence of the internet to that kind of shared, democratic experience, we just might be able to reveal the true potential of the internet — to connect humans and make us more tolerant, understanding and empathetic.\n\nAnd if you want to see the impact of new technology in cities, transit is where you can get the most immediate and intense feedback from people of all kinds — from digital natives to senior citizens, from financiers to refugees.\n\nTransit authorities can get things done\n\nThere are so many barriers to entry that make getting things done in cities hard. The competing interests, distributed decision-making and regulations among a million committees, departments, community groups, private businesses — plus politics — it’s what makes cities great, but it also makes it difficult to move at the pace of technology.\n\nBut transit systems are different. They are generally operated and managed by a sole authority and act more like a corporation than a government bureaucracy. And because they are autonomous organizations, they have control over everything that happens inside them. Decisions and changes can be made quickly, and implemented with relative speed universally within the system. If you a want path toward accelerating innovation at city scale — transit is the place to do it.\n\nTransit systems have what innovation requires to be successful — a built-in user base with massive scale\n\nTransit already has built-in scale — millions of people use it every day, in every major city. And, unlike the complex web that makes up cities, transit is a complete, contained ecosystem. Every conceivable touchpoint of a journey exists, from planning to wayfinding, safety and security; from operational enhancements to advertising, communications and point-of-purchase.\n\nThis built-in user base and multifaceted journey opens the door for outside investment and innovation. Introducing even a small data-driven improvement that can be immediately deployed onto a flexible digital infrastructure can yield massive benefits.\n\nThere is an expectation gap\n\nGetting around today in cities looks nothing like it did five years ago, let alone 10. A single trip a few miles away can easily involve two or three modes. And the cockpit of the rideshare I took recently had seven interactive displays with real-time information and services — the number in the typical train car? None. We have choices, and we want information and convenience.\n\nAnd this hasn’t gone unnoticed by transit authorities. There’s been a subtle but important shift in the way they operate: Users are no longer simply riders, but customers. Providing safe, reliable service is table stakes — transit authorities know they need to deliver an experience in line with expectations.\n\nAnd, now more than ever, the tech is there — inexpensive sensors, computer vision and high-resolution digital displays, location networks that provide contextual services to mobile devices, and data science and machine learning — to unlock that potential.\n\nThe consumer world has reinvented itself many times over in the past decade alone, but those advancements haven’t made it to mass transit in a comprehensive way. By bringing the best digital minds and ideas to the table alongside the institutional expertise of transit authorities, we can break down the barrier to let innovation in.\n\nWe don’t have the luxury of rebuilding centuries-old systems from the ground up, but we do have the ability to radically change them. A smart city approach — manifesting the internet in public space — will be the enabler of a transit experience that is more reliable, safer and efficient. And, in a place with such intense diversity, we hopefully will spark not just the digitization of physical space, but the enablement of a more human internet, and a more connected humanity."}