{"url": "https://techcrunch.com/2023/03/07/soci-raises-120m-in-debt-and-equity-to-grow-its-marketing-management-platform/", "title": "Soci raises $120M in debt and equity to grow its marketing management platform", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-03-07T00:00:00", "text": "Soci (pronounced “soh-shee”), a marketing automation platform with customers including Ace Hardware, Jersey Mike’s, Pet Supplies Plus and Ford, today announced that it raised $120 million in a financing round led by JMI Equity with participation from Vertical Venture Partners, Blossom Street Ventures and Renew Group Private Limited.\n\nCo-founder and CEO Afif Khoury says that the new capital — a combination of debt and equity of which Khoury wouldn’t provide a very detailed breakdown — will be put toward mergers and acquisitions, customer success and international expansion. To date, Soci has raised nearly $240 million.\n\n“The pandemic drove consumers inside and online, inciting a shift to digital channels and fundamentally changing how consumers communicate and engage with brands,” Khoury told TechCrunch in an email interview. “Soci became an essential partner to brands for this transformation, which led to an increased need for brands to turn to technology to manage their presence in local digital market channels.”\n\nLaunched in 2012 by Khoury and Alo Sarv, Soci’s platform is designed for organizations that have hundreds — or even thousands — of people managing their marketing across various channels. Soci provides customers marketing-focused workflows, a permissioning system, approval processes and analytics and management tools that integrate with popular ad networks. Beyond this, it delivers a database for consolidating marketing info including data from search, social media, reviews, surveys and chatbots.\n\n“An enterprise business with hundreds to thousands of locations must determine how they’re going to win the digital marketing battle at every location. This requires the collection and visualization of an incredible breadth of local insight and data, the development of hundreds of local strategies based on that data, and a sophisticated tool and process to deliver on such strategies across tens of thousands of digital pages,” Khoury said. “This is a daunting task for any enterprise and may require a small army to execute without the proper tech partner, but not doing this work means missing out on true optimizations that would drive tremendous revenue.”\n\nKhoury has a colorful background. A neuroscientist and attorney by education, with a genetics degree from UCSD and law degree from Northwestern, Khoury previously held roles as a geneticist, an attorney and a venture fund manager.\n\nKhoury says he was inspired to found Soci by the dearth of options for brands to manage their presence across digital marketing channels. With Sarv and Rindsberg, Khoury spent two years building the product before launching it in a limited beta.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Between search, social, reviews and ad networks, a brand might have had 20 to 25 digital marketing pages that their consumers were interacting with to find, consider, review and otherwise interact with the brand,” Khoury said. “However, there was a new trend swelling [several years ago] whereby brands’ consumers were no longer interacting with the national digital marketing pages but rather the local digital marketing page. This meant that the brand that had 5,000 locations, and had to manage 25 national digital marketing pages, suddenly had to manage 125,000 digital marketing pages.”\n\nTo Khoury’s point, the pandemic normalized the idea that businesses maintain a local, but still digital, presence — one personalized to customers across different geographies and demographics. According to a survey by marketing startup Uberall, there was a more than 11% increase in customer engagement with local businesses in 2020 versus 2019 and more than 35% increase in conversions via websites and phone calls during the same time frame.\n\nOne of the ways Soci helps to wrangle these pages and channels is through AI, Khoury claims. This year, Soci began to roll out what it calls “Genius,” a layer of services that do local data analysis on behalf of brands and deliver recommendations and suggestions for automating aspects of brands’ marketing strategies.\n\nFor example, Soci’s Review Genius — powered by AI startup OpenAI’s tech — collects reviews and analytics across review networks (e.g. Yelp) and then automatically responds to those reviews. Given recent examples of AI gone haywire (see: Bing Chat), that doesn’t necessarily sound like the best approach. But Khoury claims Review Genius’ auto-generated responses must be reviewed by a human before they’re published, and says that Soci conducts “extensive testing and sampling” to refine both its AI and safeguards.\n\n“Soci’s AI models are used both to inform and to automate,” Khoury explained. “On the information front, Soci receives inputs from dozens of marketing channels across hundreds of locations. The Soci team has developed models to analyze the data and its correlation to outcomes such as customer engagements, foot traffic, calls, clicks and other customer lead, loyalty and revenue data. Soci has also developed compliance features and other safeguards such as approval processes to ensure that certain terms and phrases are never used and flagged prior to distribution.”\n\nThere’s probably some truth to that. Still, even the best filtering systems for text-generating AI can let toxicity and biases slip through the cracks.\n\nThose risks don’t appear to be dampening enthusiasm for Soci’s platform among its customers. The startup recently notched a 149% year-over-year increase in annual recurring revenue and grew its client base to over 700 businesses in verticals, including food and beverage, retail, auto, telecom, grocery, health and fitness, beauty, financial services and insurance.\n\nWhat’s perhaps helped matters are the challenges companies continue to face in marketing, which presumably make Soci’s platform all the more attractive pitted against rivals like Sprout Social and Sprinklr. In a recent HubSpot poll of marketers, 19% said that generating traffic and leads remained their biggest hurdles followed by hiring talent and marketing strategy pivots.\n\nKhoury pointed to the investment from Renew Group, which owns 5-hour Energy International, as “strong validation” of Soci’s current growth trajectory. “From the impact of COVID-19 on local sales to the recent recession, brands are assessing their budgets and marketing more closely than in years past,” he added. “With that said, Soci experienced some of its strongest growth during this period.”\n\nIn terms of expansion plans, Soci — coming off its first acquisition — intends to grow its roughly 600-person workforce by 10% to 20% this year as it “prepares for the next phase,” as Khoury put it. That likely won’t be an IPO, but Khoury didn’t pour cold water on the idea, either — albeit not anytime soon.\n\n“Despite the challenging economic environment, Soci has continued to thrive, innovate and drive value,” Khoury said. “Coming out of a year of record revenue growth, we have complete confidence in our ability to continue to grow as we have shown in years past.”"}