{"url": "https://techcrunch.com/2022/11/07/hr-platform-worktorch-raises-2-2m-seed-round/", "title": "HR platform WorkTorch raises $2.2M seed round", "authors": ["Dominic-Madori Davis", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-11-07T00:00:00", "text": "WorkTorch, previously known as QuickHire, announced today the closing of a $2.2 million seed round led by Tenzing Capital. Along with the raise comes the name change, with the goal of encapsulating the business’ focus on employee recruiting and retention.\n\nSpeaking to TechCrunch, its founders, sisters Deborah Gladney and Angela Muhwezi-Hall, said the rebrand was a year and a half in the making as they realized the changing relationship between employees and employers.\n\n“Finding the right talent is just half the battle,” Gladney said. “Where companies are really being hit the hardest is losing people faster than they’re coming in the door.”\n\nThey realized that their hard work to help companies find the right talent was fruitless if those businesses weren’t doing anything to keep those workers.\n\n“We started leaning into what was happening to people post-hire and have started to focus on career development and talent retention tools,” Gladney continued. “So our new name is WorkTorch. We want to be a guiding light to a better career, a better workforce.”\n\nLaunched last April, the company says it has a roster of more than 40,000 service industry applicants actively looking for a job, with at least 1,000 interviews a month scheduled via the platform. As part of its rebrand, users will now have access to a career development portal where they can track professional growth, as well as connect with others who have similar interests.\n\nAt the same time, employers will now be able to access new retention tools to look at national and regional data trends, as well as receive feedback from their employees on their current working experiences.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nInvestors were drawn to WorkTorch due to shifting U.S. working conditions. TechCrunch previously reported that VCs remain bullish on HR platforms despite “The Great Resignation.” In the first two months of 2022, investors poured over $1.4 billion into the sector. This follows the more than $12.3 billion HR tech startups raised last year.\n\nGladney said it took about six months for WorkTorch’s seed round to close because the founders felt pressure from investors amid the economic downturn.\n\n“Every check felt like a fight to get,” Gladney said. The high of this fundraise was that most of their existing investors returned. Based in Kansas, the returning capital helped make the duo two of the few, if any, Black women to raise more than $1 million in the Midwest. “As two Black women in Kansas, we’re super proud of that.”\n\nThen there were lows, naturally, where they felt as if investors were stringing them along — even more than the last time they raised, when they picked up more than $1 million in funding. “I felt like people were talking to us to check a box or make it feel like they’re doing their part,” Gladney said.\n\nMuhwezi-Hall said people would give soft commitments, perform extensive due diligence, and then back out, saying they actually never wanted to get into HR.\n\n“It was very odd,” Muhwezi-Hall said. “A lot of these individuals have social media presences that are focused on diversity and inclusion. We were excited to meet with them. But when push came to shove, it was like any other — probably even worse than the VCs that just wouldn’t respond to our emails because they strung us along and wasted so much of our time.”\n\nThey overcame the bias, though, and nabbed top investors such as Bloomberg Beta, MATH Venture Partners, Ruthless for Good Fund and Graham & Walker. The fresh capital will help WorkTorch expand into several new cities, including Chicago, Denver, Dallas and Atlanta. The Hackett Group found earlier this year that spending on HR Tech would probably increase by the year’s end. This is Gladney and Muhwezi-Hall finding space in the current trend.\n\n“Employers need better tools and capabilities to meet the needs of their workforce, and service-industry professionals thrive when offered opportunities to develop and grow their careers,” Josh Oeding, the founder of Tenzing Capital, told TechCrunch. “WorkTorch has figured out how to deliver value to employers, and professionals and the market is responding.”\n\nLeslie Feinzaig, the founder of Graham & Walker, added to that: “I was deeply impressed by Deborah and Angela and had one of those magical first meetings where I immediately know I want to invest,” she told TechCrunch. “It was striking to me that this team deeply understands and respects the service workers, in a way that is rare in startup pitches. And this translates to metrics that are undeniable and unheard of for a startup at this stage.”\n\nNext, Gladney and Muhwezi-Hall are hoping that WorkTorch becomes the go-to platform for anyone looking to see what’s next for their careers. “This is what makes us different,” Gladney said. “WorkTorch is empowering people to pursue whatever they are passionate about. And then we come alongside them to help them get there.”"}