{"url": "https://techcrunch.com/2019/08/22/frontier-technologies-are-moving-closer-to-the-center-of-venture-investment/", "title": "Frontier technologies are moving closer to the center of venture investment", "authors": ["Jonathan Shieber", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block", "Margin-Top Flex Font-Size Var"], "publication_date": "2019-08-22T00:00:00", "text": "As the technologies that were once considered science fiction become the purview of science, the venture capital firms that were once investing at the industry’s fringes are now finding themselves at the heart of the technology industry.\n\nInvesting in the commercialization of technologies like genetic engineering, quantum computing, digital avatars, augmented reality, new human-computer interfaces, machine learning, autonomous vehicles, robots, and space travel that were once considered “frontier” investments are now front-and-center priorities for many venture capital firms and the limited partners that back them.\n\nEarlier this month, Lux Capital raised $1.1 billion across two funds that invest in just these kinds of companies. “[Limited partners] are now more interested in frontier tech than ever before,” said Bilal Zuberi, a partner with the firm.\n\nHe sees a few factors encouraging limited partners (the investors who provide financing for venture capital funds) to invest in the firms that are financing companies developing technologies that were once considered outside of the mainstream.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Broadly speaking, in the enterprise IPOs that have been absolutely wonderful recently you see the same few firms and the same few people involved. For people to break into enterprise it’s not that easy,” Zuberi said. “[Meanwhile] consumer has been a pretty quiet space for the last few years now… So, LPs are looking around for what are the firms that are consistently seeing their investments get marked up and growing.”\n\nIn many cases, these markups are occurring for companies that are leveraging new innovations at their core. “Silicon Valley is learning biology all over again,” says Zuberi. “And you’re seeing a lot more stuff in neurocomputation, brain-computer interfaces and broadly speaking the cloud intersecting with large industries.”\n\nLux isn’t the only firm to see success by investing in companies that are focused on subjects that are farther afield than a new social network.\n\nSOS Ventures, which counts hardware and life sciences accelerators among the mix of early stage investment vehicles it manages also saw a significant uptick in the amount of money it was able to raise for its most recent venture fund. After closing on $150 million for its second fund, the firm is on track to hit the $250 million target it had set for fund three.\n\nTechnical risk over market risk\n\n“Technical risk is easier than market risk,” says Arvind Gupta, the founder of IndieBio and a partner at SOS Ventures. “It’s hard to fight [Facebook, Amazon, Apple, Netflix, and Google] and get to that billion-dollar market size.”\n\nGupta says that a return to focusing on companies that have taken significant technical risks with and have built the intellectual property moats that can defend their business against competition are more likely candidates for big exits than the latest social network or SaaS company.\n\n“When you’re talking about markets that can return funds the size of DCVC or Lux Capital… A new treatment or potential cure for cancer has that massive market size, massive reward and massive technical risk,” says Gupta. “It’s hard to find enterprise [software-as-a-service] companies that you can predict in the same manner.”\n\nThe benefits of focusing on hard technology seem to be accruing across every stage of the startup investment lifecycle. That’s been true for the early-stage investment fund, Fifty Years, which raised $50 million for its second fund in July after closing on a scant $5 million for its inaugural fund.\n\nFounded by two Y Combinator graduates, who first met as part of the same summer cohort in 2012, Fifty Years may have the most rapid growth of any of the early investment firms to be placing bets on frontier technologies. Neither Seth Bannon nor Ela Madej had operated a fund before starting their firm.\n\nThe two entrepreneurs came together over a shared belief that investment in technology could be most transformative if the investment targeted large social problems.\n\n“You have impact investors on one side who don’t understand startups,” says Bannon. “On the other side you have Sand Hill Road which sees investing as a cash on cash business only.”\n\nThe two reunited in 2015 after conversations with mutual friends and formed the fund. At first, the two were investing from a $5 million pool of capital committed by connections through their Y Combinator networks. Bannon and Madej took their firm’s name from an essay in Popular Mechanics written by Winston Churchill, which forecast many of the innovations that would be central to the startups that the two investors would go on to back. Churchill’s timing was off by about 35 years, but the technologies Churchill predicted are at the core of the firm’s portfolio.\n\nWith their initial pool of capital Madej and Bannon invested in 30 different companies including standouts like the satellite communications company, Astranis; cultured meat developer, Memphis Meats; bio-chemical manufacturer, Solugen; and Starsky Robotics, the autonomous truck manufacturer.\n\nCollectively these companies have gone on to raise $100 million since nabbing their first checks from Fifty Years. That’s a sign that the potential Fifty Years sees in companies can be validated by the broader market, but these companies will need hundreds of millions of dollars in additional funding if they’re to be successful in reshaping massive industries like farming, chemicals, trucking and logistics and telecommunications.\n\n“We have a Venn diagram,” says Bannon. “There has to be deep tech [and] the path to $1 billion in revenue in a year if everything goes well… and a path to massive social or environmental impact if things go well.”\n\nAccording to Madej two-thirds of the companies in the firm’s portfolio are generating revenue already. What’s more impressive neither Madej nor Bannon have a background in the sciences they’re investing in.\n\n“When we started we were both looking at everything because it was still very much a learning curve for both of us,” says Madej. “Now I tend to focus on food technologies, technologies for well being, neuroscience, neurostimulation and software that can be used to help people feel better.”\n\nMeanwhile, Bannon spends most of his time looking at genetic engineering.\n\nAs funds like Fifty Years and accelerators like IndieBio step into the early stage breach to finance companies, new later stage funds like Lux and Future Ventures have emerged to usher these companies through the later stages of their development.\n\nAnd some firms in Silicon Valley — like Khosla Ventures, Data Collective, Bessemer, Menlo Ventures, and Mayfield never completely lost their appetite for investments in ambitious companies predicated on deep technology. And despite its profligate spending, even the SoftBank Vision Fund has taken some bets on companies that look… well… visionary.\n\nLimited partners buy in\n\n“There’s a motivation from a group of LPs to really back the type of investors who want to back world-changing companies,” Maryanna Saenko of Future Ventures says. “Possibly it’s hubris but it’s largely well-placed and there seems to be a movement to invest in… world-positive technologies.”\n\nFund of fund investors are embracing frontier technology investments as a strategy. In a blogpost from the tail end of 2018, Top Tier Capital Partners wrote about why it saw frontier tech investors as a promising thesis.\n\n“Frontier tech resides on the higher-risk edge of venture capital investing. When venture capitalists contemplate allocating capital to these technologies, some special considerations are required. Unlike the more common venture capital focus areas, in frontier tech, there could be a very long research and development period with no customers or revenue in sight. At the time of the investment, the business cases can be unclear,” the firm wrote. “Nevertheless, the role of venture capital is to identify trends and invest early. Timing the market is impossible and investors may run the risk of investing too early into certain technologies. Despite the risk, many venture funds started making investments in frontier tech areas several years ago with the belief that these investments would eventually pay off.”\n\nAdding fuel to the fire is the changing nature of limited partners. Many new family offices have become unbelievably wealthy on the back of technology innovation and these new money billionaires want to put their investment dollars to work in companies that have a broader vision. Perhaps it takes the fantastically wealthy to invest in companies that are trying to make science fiction and fantasy a reality?\n\n“The LP landscape is shifting away from pension funds and much older family offices to this new capital from new family offices that has a different risk tolerance and a different motivational set,” says Saenko.\n\nThere are few places where this generational and institutional shift is more apparent than in the realm of cleantech.\n\n“There was this valley of death after everybody lost a lot of money in cleantech,” Saenko says. “Frontier tech firms suffered because they were over-leveraged… the reasonable ideas that came out in 2010 lost out on a lot of funding.”\n\nNow there’s a fundamentally different approach to sustainable investing, according to Saenko. “When you look at it, a lot of those earlier technologies were bent pipe rather than real, defensible technology. But the research didn’t stop. Now you have a maturation of different type of battery technologies, energy storage more broadly, and carbon sequestration.”\n\nCritically, changing consumer behavior has created a new category for environmentally sustainable products and pushed companies to adopt more policies that drive renewable energy adoption and create demand for some frontier technologies.\n\nDemand for increasing operational efficiencies in companies and a shrinking labor pool is pushing increased adoption of automation technologies like robotics.\n\nAnd, as Saenko points out, with the exponential advancement of knowledge in multiple fields of study, the goalposts for what’s on the frontier are constantly shifting.\n\n“One of the nice things about frontier investing is that it’s a moving target,” Saenko says. “We promise to be investing in things that the core of the market isn’t… there’s a lot less competition. If you look at all of the brilliant enterprise SAAS funds. Their deals are much more competitive.”"}