{"url": "https://techcrunch.com/2023/12/20/ar-platform-really-launches-fandime-nfts-avalanche-blockchain/", "title": "AR platform Really launches ‘Fandime’ NFTs to reward users with exclusive movie-related content", "authors": ["Lauren Forristal", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-12-20T00:00:00", "text": "Traditionally, being a hardcore movie fan means collecting physical memorabilia like autographed posters to show dedication. However, in recent years, a number of companies have started betting on digital collectibles to become the new symbol of a fan’s devotion.\n\nReally (formerly Moviebill) — an AR platform that provides digital collectible movie tickets and interactive experiences related to the latest blockbuster films — announced a partnership with blockchain platform Avalanche to help power its “Fandime” NFTs, a new way for movie studios to engage with audiences. The company also announced today it’s expanding its AR collectible tickets to cinema partners in the Asia-Pacific region, including Japan, Korea, Australia, the Philippines, Thailand, Malaysia and Singapore.\n\nThere are three ways to earn Fandime tokens — attending movie theaters and events, buying merchandise and interacting with Really’s AR experiences like weekly trivia, scavenger hunts and a “Pop-a-Corn” game that involves throwing kernels into a popcorn bucket. Users can also purchase a Fandime directly in the Really app (available on iOS and Android devices).\n\nEach Fandime gets a unique Blockchain-based ID and is minted on Avalanche’s blockchain network and stored in a user’s Really account.\n\nUsers can redeem Fandime for digital rewards, movie-related AR content, exclusive opportunities, “AR trophies and wearable face filters,” the company explained. The tokens can also be used in Really games, like extending playtime for trivia and getting extra lives and levels for the bucket toss game.\n\nAmazon MGM Studios has already launched a collection on Really, likely as part of its marketing strategy to promote movies that are less mainstream, like “American Fiction,” “The Boys in the Boat” and “The Beekeeper.” Moviegoers who collect all three AR tickets can earn exclusive Fandime tokens. The production company recently rolled out an AR collectible for the hit psychological thriller “Saltburn.”\n\n“Augmented Reality is the future of content and media. Blockchain is the future of data. If we combine those two things today, which Really is doing, we believe we are ahead of the game,” Really AR founder and CEO James Andrew Felts told TechCrunch. “Specifically, Augmented Reality brings an entirely new user interface to our interactions with digital. As we transition from 2D screens like smartphones and desktop computers to 3D screens like headsets and holograms, our interactions with the digital world will become more tactile and more personal. Blockchain unlocks the ability for a digital file to be truly yours, in the same way a physical object or item is in the real world. In many ways, the intersection of Web3 and AR will make our digital world more human and more familiar.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nNext year, Really will expand the ways users can earn Fandime tokens and redeem rewards. For instance, users will be able to purchase movie tickets and merchandise via their Really account, receive discounts and collect Fandime tokens when watching content at home.\n\nIn the long term, Really plans to create original AR content and branch out to other areas besides the entertainment industry, Felts revealed to us.\n\n“We will be rolling out ‘Really Originals,’ which will be first-to-market AR stories that you can experience on your coffee table or in your backyard… Our digital collectible program will grow to include other sectors and industries like travel, retail and sports. Ultimately, this content network will also be a place where brands can reach audiences with 3D messages at scale,” Felts said.\n\nReally was founded in 2017 and garnered the most attention from movie fans when it teamed up with Regal Cinemas to launch exclusive AR content, including interviews and AR games for the release of “Avengers: Infinity War.” To date, Regal customers have claimed more than four million of Really’s AR collectibles across 200 wide-release films, including the most recent titles like “The Marvels,” “Napoleon,” “Killers of The Flower Moon” and “Wish,” among others.\n\n“Initially, our aim was to deliver the ultimate entertainment experience to the most dedicated customers — the ones willing to spend a premium price for premium content. Back then, AR represented a cutting-edge way to view content. Looking back, we were ahead of our time and now, as AR/VR becomes mainstream, we are able to use our technology to engage moviegoers with immersive experiences that drive them back to the theaters at scale.”"}