{"url": "https://techcrunch.com/2022/09/21/codacy-nabs-15m-to-improve-code-reviews-with-automation/", "title": "Codacy nabs $15M to improve code reviews with automation", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-09-21T00:00:00", "text": "Code review is a key step during the software development process — it’s when people check a program by viewing and reading parts of the source code. But despite its importance, not all developers are pleased with the way traditional code reviews work. For example, a Microsoft study found that the outcomes of code reviews often don’t match the motivations, whether because of unrealistic expectations or insufficient developer resources.\n\nAiming to change code reviews for the better, Jaime Jorge co-founded Codacy, which provides info on code quality, security, compliance and performance. Fresh off the launch of a new product designed to measure engineering performance metrics, Lisbon-based Codacy has closed a $15 million Series B funding round led by Bright Pixel Capital, the corporate VC of one of Portugal’s biggest employers, the Sonae Group.\n\nTo date, Codacy has raised $28 million.\n\n“In order to stay competitive in a world where every company is software led, companies need to balance quality with speed of delivery,” Jorge told TechCrunch in an email interview. “The industry adoption of remote work has sent companies into disarray, creating tension between engineers who earn for flexibility and freedom and managers who are accountable for results. Many companies have wrongly taken to monitoring as solutions, which long term deteriorate culture and hinder them from hiring and keeping the best talent possible.”\n\nJorge did a master’s thesis focused on identifying duplicate code, which piqued his interest in the business of code review. He teamed up with Codacy’s other co-founder, João Caxaria, to launch the startup in 2012.\n\nSince Codacy’s founding ten years ago, the code review market has grown substantially, with companies like SonarSource and DeepCode — whose platforms scan codebases for bugs — raising hundreds of millions of dollars in venture capital. Incumbents like Amazon have thrown their hats in the ring, too (see: CodeGuru).\n\nBut Jorge argues that the scale of Codacy’s platform is indicative of its success. Over the last 12 months, the platform spotted more than 20 million vulnerabilities and, Jorge claims, decreased the time developers spend on quality reviews by up to 60%.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWe’ll have to take his word for it — stats like those are tough to independently confirm. But what is verifiable is that Codacy sees a strong business opportunity beyond code reviews in the area of engineering performance monitoring. That’s the focus of Pulse, the company’s second product, which aims to measure things like software deployment frequency, lead time for changes to code and other aspects of software development that correlate with “business impact.”\n\n“Pulse gathers metrics that enable teams to understand performance without compromising a healthy culture,” Jorge said. “We’ve seen firsthand in our customers the struggles of maintaining a healthy performance culture over remote work. Pulse aims to help in this process.”\n\nSurely not every developer will be on board with the idea of close watch over their work. On the other hand, it might not matter if managers see a benefit to quantifying, or at least attempting to quantify, individual contributions to projects.\n\nJorge said that Codacy “routinely” deletes customer data, including performance metrics, that are “no longer required to maintain the normal functioning operation of [the company’s] product[s].”\n\n“We’ve found over time that … leadership tends to care for metrics that are closer to larger business outcomes. In other words, leadership cares for the forest and not the trees. This is why we designed Pulse: to provide a meaningful, cohesive set of metrics that leadership cares about,” Jorge said, asserting that Pulse isn’t invasive by nature. “This way, they follow what their colleagues in other departments are already doing by measuring performance while not compromising their engineering culture.”\n\nCodacy appears to be doing something right, with a customer base of around 870 brands, including Panasonic and Delivery Hero, and a user base exceeding 300,000 developers. Jorge says that the funding will be put mostly toward product R&D, including adding new capabilities to Codacy’s existing services, bringing new services to market and hiring senior talent across the company’s engineering, support, and success teams as well as sales and marketing. (Codacy’s headcount stands at 100 staffers today.)\n\n“The broader slowdown in tech is proving to be beneficial to us as companies are hoping to automate processes while keeping quality solid and understand their engineering performance. Despite the frequency of layoffs in the industry, we’ve seen many of our customers actually expand in usage of our product suite,” Jorge continued. “We’re really bullish on the timeless, dependent nature of software development. It does not depend on cycles and its momentum is built on the back of a worldwide digital transformation. Now is the time to be greedy on the fact that every company wants to be software-led.”"}