{"url": "https://techcrunch.com/2023/04/24/haltian-nabs-funds-to-equip-office-buildings-with-smart-sensors/", "title": "Haltian nabs funds to equip office buildings with smart sensors", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-04-24T00:00:00", "text": "Adopting Internet of Things (IoT) tech for the office isn’t easy — especially at enterprise scale. Companies have IoT device administration to worry about, and also building out the infrastructure necessary to keep those devices connected and operational.\n\nTo make it easier, five former co-workers — Pasi Leipälä, Teemu Vaattovaara, Jyrki Okkonen, Ville Ylläsjarvi and Toni Leinonen — founded Haltian, a startup that provides a portfolio of sensors, cellular gateways, device management dashboards and software to help companies orchestrate IoT in the workplace.\n\nShowing investors are keen on the idea, Haltian recently closed a €22 million (~$24 million) funding round led by Mandatum Asset Management Growth Equity with participation from Varma, Tesi, Ventic and Inventure. Bringing the company’s total funding to date to €40 million (~$43.7 million), Leipälä, Haltian’s CEO, says that it’ll be put toward supporting international expansion in Central Europe and North America, as well as Haltian’s recruiting efforts.\n\nKitty Laine, an investment manager at Mandatum Asset Management, said via email: “We were drawn to Haltian as they are able to digitize the built environment and create savings for their customers from data that was not available before. Their cloud-connected smart sensors and top-notch R&D has received excellent feedback from demanding U.S.-based customers, and we have been excited to see how Haltian’s products are gaining traction in international markets.”\n\nThe IoT market has proven resilient to the ups and downs of the broader technology space, with data from Crunchbase showing that the average amount of capital raised by IoT startups in 2022 reached the highest point in over a decade.\n\nUnsurprisingly, Haltian isn’t the only startup vying for a slice of the substantial VC pie. Recently, a startup called Memfault raised $24 million for its platform designed to help companies manage their growing IoT device fleets. Elsewhere, Fleet has secured tens of millions of dollars for its device management software. There’s also Esper, which landed $30 million in May 2021 to grow its IoT DevOps platform.\n\nWhat sets Haltian apart, Leipälä — the CEO — says, is the exhaustiveness of its product offering. Leipälä and Haltian’s other co-founders previously worked at Nokia in one of the firm’s smartphone divisions, where the seed of the idea for Haltian came from.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Haltian was first concentrating on providing premium engineering services to other companies. Our own IoT products started to be developed after a couple of years, with income earned from engineering services,” Leipälä told TechCrunch in an email interview. “Haltian is one of the few companies able to provide a full stack IoT solution. We’re able to customize any . . . element according to customer requirements.”\n\nThrough a combination of sensors and AI algorithms, Haltian’s platform can count the number of people in an office or building or track things like CO2 and humidity levels. It can also monitor for light usage, leaks and dips in temperature as well as detect when paper, towel and soap dispensers are about to run low.\n\nIt’s a lot of sensitive data that Haltian is collecting. But Leipälä asserts that it’s anonymized and stored in a private cloud. (Absent a glance at the customer service agreement, we’ll have to take his word for it.)\n\n“For Haltian, scalability is not only about how many devices can connect to a single gateway, but how thousands of implementation locations can be served logistically as well as how easy and fast the installation, onboarding and life cycle management can be done,” he added.\n\nA factor working in Haltian’s favor is the growing interest in IoT among the enterprise. In a 2021 survey by Omdia, the London-based consultancy firm, 90% of organizations said that they saw IoT as core to their digital transformation plans or being deployed across multiple areas of their organization. A separate report by Gartner, published a year earlier, estimated that 47% of organizations plan to increase their investments in IoT, with the goal of reducing costs and bolstering their overall digital transformation efforts.\n\nInterestingly, around 75% of Haltian’s revenue comes from sales of its IoT devices, Leipälä says.\n\n“We’ve grown annually at a rate of nearly 50% over the last three years, reaching revenues of around €20 million (~$21.85 million) last year,” Leipälä said. “Since the pandemic, there has been increased focus on making office designs aligned with the company cultures, accompanied by supporting technologies — e.g., IoT solutions. At the same time, IoT sensor solutions have become more affordable, cost-effective and easier to implement.”\n\nRiding the upward trend, Haltian recently expanded to the U.S. and Amsterdam, opening offices in California and Holland. So far, it’s raised a total of €40 million (~$43.71 million) and plans to grow its employee base from 145 people to around 170 by the end of the year."}