{"url": "https://techcrunch.com/2022/09/08/arize-lands-38m-to-grow-its-mlops-platform-for-the-enterprise/", "title": "Arize lands $38M to grow its MLOps platform for the enterprise", "authors": ["Kyle Wiggers", "Ai Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-09-08T00:00:00", "text": "Arize AI, a startup developing a platform for machine learning operations, today announced that it raised $38 million in a Series B round led by TCV with participation from Battery Ventures and Foundation Capital. Bringing Arize’s total capital raised to $62 million, CEO Jason Lopatecki says that the new cash will be used to scale R&D and double the company’s 50-person headcount over the next year.\n\nMachine learning operations, or MLOps, has to do with deploying and maintaining machine learning models in production. Similar to DevOps, MLOps aims to increase automation while improving the quality of production models — but not at the expense of business and regulatory requirements. Given the interest in machine learning and AI more broadly in the enterprise, it’s no surprise that MLOps is projected to become a large market, with IDC putting the size at around $700 million by 2025.\n\nArize was founded in 2019 by Lopatecki and Aparna Dhinakaran, after Lopatecki sold a previous startup — TubeMogul — to Adobe for around $550 million. Lopatecki and Dhinakaran first met at TubeMogul, in fact, where Dhinakaran was a data scientist prior to joining Uber to work on machine learning infrastructure.\n\n“After watching team after team — year after year — fail to understand both what was wrong with models delivered into production and struggle to understand what models were doing once deployed, we came to the conclusion that something was fundamentally missing,” Lopatecki told TechCrunch in an email interview. “If the future is AI-driven, then there needs to be software to help humans understand AI, break down problems and fix them. AI without machine learning observability isn’t sustainable.”\n\nArize certainly isn’t the first to tackle these sorts of challenges in data science. Another MLOps vendor, Tecton, recently raised $100 million to build out its machine learning model experimentation platform. Other players in the space include Galileo, Modular, Gantry and Grid.ai, the last of which secured $40 million in June to launch a gallery of components that add AI capabilities to apps.\n\nBut Lopatecki claims that Arize is unique in several aspects. The first is a focus on observability: Arize’s embeddings product is designed to look inside deep learning models and understand their structure. “Bias Tracing” complements it, a tool that monitors for bias in models (e.g., facial recognition models that recognize Black people less often than subjects with lighter skin) — and attempts to trace back to the data causing the bias.\n\nMost recently, Arize debuted embedding drift monitoring, which tries to detect when models become less accurate as a result of outdated training data. For example, drift monitoring might alert an Arize customer if a language model answered “Donald Trump” in response to the question “Who’s the current U.S. president?”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Arize stands out … [because] we’re laser-focused on doing one difficult thing well: machine learning observability,” Lopatecki said. “Ultimately, we believe machine learning infrastructure will look like software infrastructure with a number of market-leading, best-of-breed solutions used by machine learning engineers to build great machine learning.”\n\nArize’s second differentiator, Lopatecki says, is its domain expertise. Both he and Dhinakaran hail from academia and draw from practitioner roots, he notes — having built machine learning infrastructure and managed problems with models in production.\n\n“Even for teams that are experts and thought leaders, it’s becoming impossible to keep up with every new model architecture and every new breakthrough,” Lopatecki said. “Just as quickly as teams are finished building their latest model, they are typically leaping onto the next model the business needs. This leaves little time for deep introspection of the billions of decisions these models are making on a daily basis and the impact these models have on both businesses and people … That’s why Arize spent over a year building a product to monitor deep learning models and designed workflows to troubleshoot where they go wrong.”\n\nSome might argue (correctly) that Arize’s competitors have experts among their ranks as well, and observability and monitoring solutions in their product suites. But judging by Arize’s impressive client list, the startup is making one heck of a convincing sales pitch. Uber, Spotify, eBay, Etsy, Instacart, P&G, TransUnion, Nextdoor, Stitch Fix and Chick-fil-A are among Arize’s paying customers, and the company’s free tier — which launched earlier this year — has over 1,000 users.\n\nMum’s the word on annual recurring revenue, however. Lopatecki was adamant the capital from the Series B will give the company “ample runway,” macroenvironment be darned.\n\n“In healthcare, there are teams using Arize to ensure that cancer detection models using images are consistent in production across a wide spread of cancer types. Additionally, there are teams using Arize to ensure the models used in standard of care decisions and the insurance experience are consistent across racial groups,” Lopatecki added. “As models get more complex, we’re seeing that even the largest and most sophisticated machine learning teams are realizing they would rather invest their time and energy in building better models rather than building a machine learning observability tool … Arize helps practitioners improve the return on investment of models and quantify the results for business leaders [and provides] the market-leading software to monitor the risks of AI investments.”"}