{"url": "https://techcrunch.com/2023/07/27/terragons-9m-raise-gives-credence-to-the-market-maturity-in-africas-cloud-and-martech-space/", "title": "Terragon’s $9M raise gives credence to the market maturity in Africa’s cloud and martech space", "authors": ["Tage Kene-Okafor", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-07-27T00:00:00", "text": "As one of the well-known data and cloud martech companies in Africa, Terragon, via several products, gives its clients (primarily telecommunications and financial services companies) data on the continent’s growing consumer markets.\n\nAdrenaline, one of its main products, is a telco-data monetization solution that lets telcos diversify their income and marketers access specialized audiences otherwise unavailable through traditional marketing channels. Finally, these tools enable Terragon corporate clients to drill down on various combinations of behavioral and demographic information, reach consumers via multiple channels both online and offline and link to various touch points, including online sales and payment systems.\n\nThe cloud analytics and marketing platform earned $5 million in Series A funding in 2018, which it utilized to further develop Adrenaline into the Terragon Marketing Cloud with over 150 million segmented profiles in Nigeria. Today, the firm, which converts telco channels into mobile advertising inventory, announced a $9 million Series B round to expand its focus on offering mobile B2C messaging backed by deep consumer insights from “big data.” The round was led by Orange Ventures with participation from TLcom Capital, LoftyInc, Sango Capital, VestedWorld and Western Technology Investment (WTI).\n\nThe investment, according to the business, would allow it to strengthen cloud-native capabilities on its platform as well as develop and accelerate localized ML and AI to provide the foundations for increased enterprise communication. The company hopes to kickstart its Pan-African expansion (which it is already doing in Ghana and Kenya), according to founder and CEO Elo Umeh in an interview with TechCrunch. Umeh said that the growth investment, together with interest from French telecom giants and collaborations with AWS and Microsoft, lends credence to Africa’s market maturity in cloud and martech.\n\nIn February, four of Europe’s largest carriers (Germany’s Deutsche Telekom, France’s Orange, Spain’s Telefónica, and the U.K.’s Vodafone) formed a joint venture to target mobile consumers with opt-in advertising. Furthermore, these telcos want to use this partnership (TrustPid) to capitalize on high-level changes to the third-party tracking cookie status quo in order to generate ad income by developing cross-operator ad-targeting infrastructure based on first-party data.\n\nGoogle has said that third-party cookies would be phased out to improve user privacy. According to the ad giant, third-party cookies violate users’ privacy by allowing websites to follow them without their knowledge. The elimination of third-party cookies will have several consequences for the online advertising industry, as advertisers will no longer be able to track users across multiple websites, and they will need to find new ways to collect, analyze, and tailor customer data to provide personalized ads and experiences to customers.\n\nBusinesses will need to integrate various identification solutions instead of relying on third-party cookies to achieve this. And, to accurately profile customers, a central Customer Data Platform (CDP) that relies on a first-party data source (like TrustPid) and combines this with other online data sources appears to be the solution, similar to what Terragon has done with various telcos in the African market for several years, including MTN Nigeria.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSo how did Terragon develop something that Europe is playing catch-up on? The development of Adrenaline was aided by Africa being a mobile-first continent. Since email addresses, and not mobile phone numbers, have traditionally been the unique identifiers for digital services in Europe, this has limited the multiple sources that can be harnessed by solutions like TrustPid to identify and track customers. As a result, Europe and the Global North generally find themselves on the back foot.\n\nAs a mobile-only continent, Africa has experienced significant internet connectivity growth in recent years. Nearly half a billion users subscribe to mobile services in Africa, and mobile numbers remain the unique identifiers for digital services, as many users do not have email addresses. So, in signing up for platforms like Jumia and Netflix, customers use their phone numbers, not email addresses, like in Europe. Therefore, this structure (including Terragon’s DSP, which is connected to major online publishers, including Google ad exchange) allows advertisers and marketers on the continent to continue running targeting customer engagements required.\n\n“We placed a bet on the mobile phone number as a unique ID. In other parts of the world, most of the unique IDs have been email. Digital advertising has been driven by email up to three years or four years ago because that’s the evolution in the West. But now we’re seeing a migration from email to mobile phone numbers because of trends in emerging markets,” Umeh said on the call. “And Europe is noticing an intersection between what happens on the mobile phone and eventually what will happen in enterprises because retail media has grown astronomically. So how can they solve for privacy? By coming closer to the supply side (telcos), and changing the unique identifier to the mobile phone number because that is what Facebook, Google and others are using. When the European platform comes on stream, I think the entire world will migrate to it.”\n\nNonetheless, it’s worth noting that Africa has less stringent comprehensive privacy regulations for consumers than Europe, making it easier for Terragon to grow its services on the continent. Umeh stated that the company’s revenue has risen 10x since its Series A in 2018, with a 100% year-over-year growth rate projected until 2023.\n\nMicrosoft, Unilever, Access, Fidelity, and FCMB are among Terragon’s partners and clients, as well as telecoms such as MTN. According to Umeh, the company has a customer retention rate of more than 50% quarter over quarter.\n\n“Terragon is poised to ride a wave that will intersect software, traditional telcos, enterprise and digital native businesses. The size of the opportunity was very convincing to us, their existing ambition and investment in Africa-focused software products was compelling, as well as the vision of how African mobile users will evolve in coming years, fit right into the strategy of Orange Ventures,” Grégoire de Padirac, partner at Orange Ventures, said of the investment.\n\n“They are Africa’s pioneer specializing in cloud-native data software, which serves as the fundamental building blocks for enterprise AI across the continent. With protected intellectual property, an inventive business model, and a strong presence in multiple markets, they are well-positioned to establish a strong leadership across the continent.”"}