{"url": "https://techcrunch.com/2024/08/29/south-korean-tech-giant-naver-launches-crypto-wallet-in-partnership-with-chiliz/", "title": "South Korean tech giant Naver launches crypto wallet in partnership with Chiliz", "authors": ["Kate Park", "Reporter", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-08-29T00:00:00", "text": "Many tech companies are expanding their reach into the web3 market, integrating blockchain and web3 technologies into their products and services. In the latest development, South Korean internet giant Naver is launching its first digital asset wallet, Naver Pay Wallet, for the Korean market. It is partnering with Chiliz, a blockchain provider for sports and entertainment, as the inaugural blockchain for the wallet.\n\nNaver Pay is a mobile payment service from Naver. With its new crypto wallet, Naver Pay Wallet, the company is offering a non-custodial wallet, meaning users directly control their private keys and digital assets.\n\n“The Naver Pay Wallet is not aiming to become a typical crypto wallet, but a service around utility and loyalty blockchain technology,” founder and CEO of Chiliz Alexandre Dreyfus said in an interview with TechCrunch.\n\nIn South Korea, more than 97,000 online and offline merchants use Naver Pay, a payment service that started its life on Naver’s e-commerce platform Naver Shopping. The digital asset wallet serves as a valuable testing ground for potential loyalty programs for merchants on Naver utilizing Chiliz blockchain technology, Dreyfus told TechCrunch.\n\nNaver’s digital assets wallet, which is in beta, allows 33 million users to manage their digital assets and enable users to store NFTs. It will also add other functionalities, such as integration with decentralized apps, fan tokens and a loyalty program for Naver’s merchant network, Dreyfus noted.\n\n“The target customers are tech-savvy South Koreans who are already using Naver Pay for digital transactions and are interested in exploring blockchain technology, particularly in the realms of sports, entertainment and digital assets,” Dreyfus said.\n\nNaver Pay CEO Park Sang-jin (left), Chiliz CEO Alexandre Dreyfus (right) Image Credits:Naver\n\nNaver Pay Wallet can compete with other Korean digital payment platforms that are exploring blockchain integration. Still, Naver’s vast user base puts it in a strong position to dominate the market and become the “Google Pay / Apple Pay” of South Korea, Dreyfus explained. Its user-friendly platform will lower the barrier to entry for blockchain technology, accelerating mainstream adoption, Dreyfus added.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe wallet will support the Chiliz Chain as its first blockchain — the strategic partnership between Naver and Chiliz does not involve a direct investment, Dreyfus noted. Naver could add support for more blockchains in future Naver Pay Wallet updates."}