{"url": "https://techcrunch.com/2022/09/13/industrial-iot-startup-litmus-automation-bags-new-cash-to-grow-its-product/", "title": "Industrial IoT startup Litmus Automation bags new cash to grow its product", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-09-13T00:00:00", "text": "In recent years, a cottage industry has sprung up around the industrial internet of things (IoT) landscape — and the data generated by it. It’s already overfull with platforms recording, analyzing and acting on data from temperature, motion and other sensors along those lines in buildings, warehouses and factories. Companies like Dabbel are attempting to automate HVAC controls in commercial buildings to cut CO2, while startups such as Traction and Augury offer products that plug into existing machinery to predict wear and tear. Amazon’s even thrown its hat in the ring with Lookout for Equipment, launched in April, which ingests sensor data from industrial equipment and then trains an algorithm to anticipate machine failure.\n\nDespite the crowdedness in the industrial IoT sector, Vatsal Shah argues that there’s room for one more competitor. He’s somewhat biased in this belief given that he’s the co-founder of Litmus Automation, which helps manufacturers collect edge device data so they can use it for applications such as AI. But proving his point somewhat, Litmus today closed a $30 million Series B funding round led by industrial automation company Belden, $20 million of which came from Belden and $10 million of which was furnished by a “large strategic” investor that Shah wouldn’t reveal by name.\n\nThe fresh capital brings Litmus’s total raised to $42.6 million to date.\n\n“The idea for Litmus came to me based on my experience at Rockwell Automation as an industrial design engineer,” Shah told TechCrunch in an email interview. “I was working on one of the largest oil and gas pipeline projects in the world, where collecting pipeline data from heterogenous industrial systems and storing it in a simple database took over six months of development. I realized these complexities were only going to increase with the growing data siloes and the introduction of many more connected devices.”\n\nAfter recruiting Purdue classmate John Younes as a co-founder, who in turn brought on longtime friend Sacha Sawaya, Shah launched Litmus in 2014.\n\n“I identified the need for a platform to seamlessly collect data from many different types of industrial systems and devices to make it available to third-party applications efficiently and with intelligence in between,” Shah continued. “The biggest challenge enterprise companies face is access to the data they need to fuel machine learning and AI models. This is something Litmus specializes in.”\n\nTo this end, Litmus can collect data to feed AI and machine learning models and then run those models at the “edge” (e.g., a warehouse or manufacturing plant). For example, one customer, Taiwan-based Chimei, uses Litmus to run multiple AI models on the same edge device, store data at the edge, run analytics, visualize data and send data to existing enterprise storage systems and apps.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nShah claims that tens of thousands of devices are connected to the Litmus platform today, generating millions of data points across hundreds of customers and over 500 plants and sites.\n\n“What’s interesting about our investors is they are not VC firms — these are technology companies who believe in our tech and have invested as a result,” he said, noting that Mitsubishi is among Litmus’s previous backers.\n\nAssuming that’s true, Litmus might well be set up for success despite the competition and tough macroeconomic climate. Last year certainly set the stage, when VCs poured more than $1.4 billion into the industrial IoT space, according to Crunchbase — up from $1.7 billion in 2020.\n\nShah says the majority of the Series B tranche will go toward expanding 75-employee Litmus’s go-to-market efforts and “scaling to support enterprise customers globally.”"}