{"url": "https://techcrunch.com/2024/07/01/japans-smarthr-raises-140m-series-e-as-strong-demand-for-hr-tech-boosts-its-arr-to-100m/", "title": "Japan’s SmartHR raises $140M Series E as strong demand for HR tech boosts its ARR to $100M", "authors": ["Kate Park", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-07-01T00:00:00", "text": "SmartHR, a cloud-based human resources and labor management software startup, said on Monday that it has raised $140 million in a funding round led by KKR and Teachers’ Ventures Growth, an investment arm of Ontario Teachers’ Pension Plan, with participation from existing investors.\n\nThe Series E round, which comes three years after the company raised a $142.5 million (15.6 billion JPY) Series D at a valuation of $1.6 billion, is the latest indicator that investors are still keen to back tech that helps companies more efficiently manage their biggest cost base: staff.\n\nThe company declined to comment on its current valuation.\n\nCo-founded in 2015 by Kensuke Naito and Shoji Miyata, SmartHR has been seeing strong demand for its SaaS platform, which helps enterprises manage and streamline human resources and operations, in the past couple of years. Its annual recurring revenue (ARR) reached $100 million as of February 2024, a company spokesperson told TechCrunch, which signifies a decent uptick from the $80 million in total revenue it reported in FY 2023.\n\nThat growth is in line with the robust demand for HR tech that we’ve been seeing in other parts of the world. U.S.-based Rippling, which SmartHR says is its closest comparable company in terms of products and strategy, saw its ARR double to $350 million in 2023, per The Information. Gusto, which offers payroll management software and services, told TechCrunch its revenue had crossed $500 million by April 2023; and Deel, which manages payroll for companies across international lines, this March said that it had clocked ARR of more than $500 million.\n\nThere’s also a mountain of venture capital in this market, estimated to be worth a whopping $81.84 billion by 2032, per Fortune Business Insights. Rippling, one of the biggest startups in the space, has raised about $1.4 billion, per a spokesperson at Rippling, and said it was valued at $13.5 billion following a $200 million funding round in April. Gusto has raised nearly $750 million, Crunchbase data says, and it is worth around $9.6 billion, per PitchBook. And Deel, worth $12 billion, has raised a total of $679 million, according to Crunchbase.\n\nAnd you have investors throwing cash at smaller startups attacking nearly every facet of traditional HR: Remofirst, which helps its customers hire globally without setting up local offices, recently raised $25 million; Palm takes a mobile-first approach to improving the HR tech experience in MENA, and last year got $5 million; Compa in January landed $10 million to build its platform that provides recruiters aggregated compensation data so they can be more competitive when hiring; and Legion last month raised $50 million to automate hourly staff management for companies.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSmartHR’s peers in Japan include back-office software players such as Works Human Intelligence, freee and Moneyforward. The company sets itself apart by “obtaining the latest and most accurate employee data through labor management, which positions it as a system of record in HR,” its spokesperson said, adding that leveraging this employee data allows it to deploy new products rapidly.\n\nThe startup said the new capital will go toward developing new solutions and hiring, as well as organic and inorganic (read: M&A) growth strategies. It currently has about 1,000 employees.\n\nIts previous backers include Light Street Capital, Sequoia Capital Global Equities and Whale Rock.\n\nUpdates with Rippling’s total amount of funding"}