{"url": "https://techcrunch.com/2024/03/13/withings-cycle-tracking/", "title": "With cycle tracking, Withings considers taking half of the population seriously", "authors": ["Haje Jan Kamps", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-03-13T00:00:00", "text": "Whenever I talk to people working in the quantified self — fitness and health trackers — there’s a murmuring about how little attention is given to literally half the population. For people who menstruate, cycle tracking is a crucial health indicator, but all too often it’s a metric that somehow seems to slip between the cracks.\n\nWithings started previewing its cycle tracking feature in some markets in September 2023 when the ScanWatch 2 launched. The company just rolled out the feature globally, on-watch for the ScanWatch 2 and ScanWatch Light smart hybrid watches, and for all Withings users in the app. The company is lagging significantly behind its arch-rival Apple, which launched a comparable feature four years earlier.\n\nAt its core, the cycle tracking feature enables users to log their menstrual cycle stages, including symptoms, flow and period dates, as well as record moods and emotions and have a view of where they are in their cycle. Once the app gets to know your typical cycle, it predicts future period dates, helping users create personal routines that align with their monthly needs and optimize sleep, activity and nutrition.\n\nWhat took you so long?\n\nTechCrunch spoke with Etienne Trégaro, product manager in charge of, among other things, the company’s watches.\n\n“The menstrual cycle tracking feature was one of the top feature requests of our community. That’s why it’s important for us to provide this feature to the new ScanWatch,” said Trégaro in an interview with TechCrunch.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nI am not surprised that this was one of the most requested features. What surprised me is why it has taken Withings so long to launch the feature — and why it’s a fully manual feature. The implementation of the feature relies on people entering data manually, rather than, say, using biometric data such as heartrate, temperature or something else to track cycles more automatically. (Incidentally, it is possible to use temperature tracking as a proxy for cycle tracking, but you have to be very accurate with the measurement).\n\n“We have been very focused on health in general, with new biomarkers and innovative ways to track health. Choosing which feature will be developed next is hard. So [cycle tracking] came a little bit — maybe you’d say late — but we do want to be able to monitor activity, heart and other metrics first. We measure things that competitors are not doing, such as temperature 24/7. Nobody’s doing that on the market yet. Except us,” says Trégaro. “So now we felt that our team was ready to release this feature. I’ve learned a lot, also, doing the development of this feature. As a man, of course, to be honest, and by working with female colleagues and professionals to understand the importance of launching such a tool was really key.”\n\nI was mildly surprised that the company couldn’t find a product manager who has had the experience of tracking their cycles in the past, but I was curious what Trégaro learned along the way.\n\n“One of the biggest realizations was that around 25% of women in the world are actually having irregular cycles. So that’s a lot. In addition, something I learned is that from a doctor’s point of view, [cycle tracking is] one of the most important metrics to follow regarding overall health — as important as blood pressure for women, for example,” Trégaro explains.\n\nBuilding the functionality\n\nWithings has been at the forefront of health technology for a while; building high-quality, attractive equipment you’d like to have in your home or on your wrist, ranging from smart scales to advanced wristwatches. Each product release has been met with anticipation and excitement, as they consistently deliver on form and function. Persistent rumors of Apple wanting to buy Withings refuse to die down, but nobody on either side is willing to confirm nor deny them.\n\nTrégaro explains that menstrual cycle tracking represents a significant leap forward in personalized health monitoring. For too long, the tech world’s approach to health has been somewhat generic, focusing on step counting, heart rate monitoring and sleep tracking. Important as these metrics are, they offer an incomplete picture of an individual’s health. By integrating menstrual cycle tracking, Withings acknowledges the complex and nuanced nature of health — and adds more features to help track, measure and predict.\n\nMaybe it’s late (ironic, really, in the world of cycle tracking), but the introduction shows Withings’ ongoing commitment to listening to its community and understanding the diverse needs of its users. To its credit, in a market that’s crowded with gadgets vying for attention, Withings has managed to carve out a niche for itself by focusing on meaningful innovation.\n\nThe market Withings is going after with its cycle tracking feature is absolutely mind-bogglingly large. The app stores are heaving with tracking apps, and some analysts predict that the money spent on cycle tracking alone is at $750 million already, and will double by 2032.\n\nAddressing this need required Withings to embark on an extensive development process, which involved both the adaption of existing hardware and the creation of new algorithms. Trégaro and his team spent months researching and developing, working closely with health professionals to ensure accuracy and reliability.\n\nTrégaro explains that Withings goal was not just to add another feature — the team wanted to integrate menstrual cycle tracking seamlessly into our users’ health monitoring routines, providing them with valuable insights that could inform their daily lives.\n\nIn the U.S. in particular, period tracking is in the spotlight for not-great-reasons related to abortion-related legislation.\n\nIt is reassuring, then, that Withings highlighted its commitment to privacy and security. With sensitive health data at stake, Withings says it implemented robust measures to protect users’ information — although the company has also opened the door to syncing your data with platforms like Apple Health.\n\nIt’s worth highlighting the differences between Withings and Apple’s approaches. Whereas the Apple Watch is the do-everything-mini-iPhone-on-your wrist, Withing’s watches are taking a different tack.\n\n“We have our strengths [over Apple Watch]. We have a market-leading battery life of up to 30 days on our watches, compared to one or two days on the Apple Watch,” Trégaro grins. “And we have a beautiful design — almost like a real wrist watch. That allows us to have this battery life because we have a smaller screen. We focus on continuous health measurement.”"}