{"url": "https://techcrunch.com/2023/07/26/gaming-startup-mirrorscape-tabletop-gaming-ar/", "title": "Mirrorscape’s new AR tabletop platform could enhance your D&D campaign", "authors": ["Lauren Forristal", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-07-26T00:00:00", "text": "Yet another virtual tabletop (VTT) tool has joined the fray, giving Dungeons & Dragons, Pathfinder and tabletop role-playing gamers alike a new augmented reality experience.\n\nMirrorscape, a mixed reality and gaming development company, announced the open beta launch of its app, letting users experience their favorite tabletop role-playing games (TTRPGs) in AR.\n\nThe new VTT app launches at a time when many players are shifting away from the typical pen-and-paper play and transitioning to digital gaming — whether by creating character sheets on D&D Beyond, hopping on Discord/Zoom to play with long-distance friends or using services like Roll20.\n\nMirrorscape aims to shake up traditional tabletop as well as VTT gaming with its technology, allowing users to enhance their game session with AR, build 3D maps, roll digital dice, chat with fellow party members and more, all on one platform.\n\nThe app is available to download for free on the App Store and Google Play Store. A PC version is launching in the coming months.\n\nSimilar to other companies in the same space (Ardent Roleplay, Spatial and Tilt Five), Mirrorscape’s most significant feature is its building capabilities. The customizable platform provides game masters (GMs) with a toolset for creating an animated world of their dark and twisted dreams, from dimly lit dungeons to small villages overrun by orcs.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAt launch, Mirrorscape provides access to around 50 already built maps, which can be purchased in the store section within the build tab. Individual digital items, such as miniature figures and terrain, range from 99 cents to $4.99.\n\nThe app includes a free starter kit, including approximately a dozen or so free maps, a few basic structures like cavern walls, cobblestone floors and doorways, along with five free minis, including a dwarf, a barbarian and a huntress. Hero Forge users can link their digital mini for free.\n\nIn addition to Hero Forge, the company partners with major game publishers and model manufacturers Paizo (Pathfinder and Starfinder), Reaper, Fat Dragon, Dwarven Forge and many others.\n\nMirrorscape offers two types of playing modes. Players can either view the map in AR mode — where they point and look through their phone cameras to explore the landscape — or 3D mode, which takes place in virtual rooms such as “Forge’s Tavern,” featuring a cozy fireplace and mugs of mead, and “The Hall of Heroes,” a candlelit room that pays tribute to fallen adventurers.\n\nThere are only two virtual rooms available at launch, but the company plans to launch more in the near future, Eric McIntire, the company’s brand manager, told TechCrunch.\n\nBoth versions come with POV mode, where party members can click on an eye icon to look at the world from their characters’ perspective.\n\nAfter testing the app, we found that 3D mode was the most difficult to navigate, especially when zooming in and out or trying to look at the map from a different angle. It’s recommended that users turn off “Center Pivot” in the top-right menu to avoid a frustrating experience.\n\nThe AR mode is the most ideal for more interactive experiences. For instance, if a dungeon master wants to create an engaging atmosphere to pair with augmented reality, they can tell their players to go outside and turn on POV mode so it feels like they’re walking through an actual cavern. (Similar to Pokémon GO, where players can look through their cameras and discover a Roselia in their very own garden.)\n\n“Imagine all the players actually meet up in person and go outside,” McIntire said, painting one possible scenario. “[The GM] can watch from inside as they walk around his dungeon, and he narrates in their headsets, ‘You start to smell burning sulfur, death and decay.’ And they walk around the corner and see zombies that he’s got moving towards them.”\n\nAnother interesting tool that GMs may appreciate is the ability to conceal certain spaces on the map. For instance, if they want to hide a room where a monster is waiting for its moment to strike, the GM can tap on an area and watch it disappear. Co-founder and COO Donald Bland mentioned to us that, eventually, users would be able to scan a physical, handwritten map with their camera, which would then upload as a 3D version on Mirrorscape.\n\nOther features include a journal option to keep track of dice rolls and a messaging feature. The company is working on bringing effects to the app, such as lightning bolts for when a sorcerer casts a spell.\n\nHowever, Mirrorscape lacks one important element. The app currently doesn’t offer a character sheet feature for D&D players to refer back to their ability scores, proficiencies, equipment and so forth. Many players use their phones or desktops to look at their sheets, so to have to constantly switch tabs would probably take them out of the immersive experience that Mirrorscape is designed for.\n\nMcIntire mentioned that a character sheet option is a “work in progress.”\n\nFor now, iOS device users can mirror share their screen to a compatible smart TV or Mac and use a separate device to view the character sheet. Android devices can also mirror their screen to the TV. Players using an iPad can opt for the multitasking feature, but this option might be distracting as the separate tab would partially block the screen.\n\nMirrorscape isn’t solely designed for private game sessions; it’s a tool for Twitch streamers as well. Soon, content creators will be able to share a QR code with viewers for them to scan, download the app and be immersed in the same digital world as their favorite streamers.\n\n“When [viewers] look at their living room tables, the pieces are moving digitally on their living room table as the players are moving them physically. So, you could actually experience that 3D physical build as though it’s happening in front of you,” McIntire explained.\n\nMcIntire loosely calls this “presentation mode,” which can have thousands of people join a single session, in turn helping creators boost their engagement and following.\n\nFor reference, the Mirrorscape team played a test session on Twitch, which can be viewed on YouTube.\n\nThe company was co-founded in 2020 by Grant Anderson (CEO) and Donald Bland (COO), veteran D&D players who met while working at Sony. The duo has an extensive background in technology and entertainment, particularly virtual reality and 3D production.\n\n“Augmented reality was just starting to emerge and was perfect for tabletop gaming,” Anderson told us, who first came up with the idea for Mirrorscape. “I wanted to create something that really gives you that feeling of playing with your friends, and AR was the technology that could do that,” he added.\n\nAlso, “True Blood” actor and hardcore D&D nerd Joe Manganiello is Mirrorscape’s creative director.\n\n“I am both excited and invigorated to be a part of the Mirrorscape team,” Manganiello said in a statement. “Through their technology, I have seen the future of gaming and entertainment, and I am incredibly passionate about getting it into the hands of the public. It is going to blow minds and change everything!”\n\nMirrorscape appeared on Kickstarter in 2022 and raised nearly $500,000. The company also had a $2 million seed round led by TenOneTen Ventures and Ethos Fund.\n\nIt has since grown to about 7,000 beta users, the company said.\n\nThe company is in the process of developing Mirrorscape for compatibility with AR glasses and headsets, so gamers can play around with hand and eye tracking, further enhancing high-tech TTRPG sessions. For example, Mirrorscape leverages Qualcomm Technologies’ Snapdragon Spaces program, which enables smart glass wearers to automatically detect tabletop surfaces and manipulate game pieces. The company also notes that its platform is running on Lenovo’s AR glasses prototype.\n\nThe company hopes to make the platform available on VR headsets in the near future.\n\nAlthough virtual tabletop games will never truly replace traditional TTRPGs, there’s potential for them to become a trend as AR and VR technology continue to evolve. On top of that, GMs curious about the high-tech side of TTRPG play might love not having to hand-draw maps and painstakingly paint their own minis.\n\nUpdated 7/26/23 at 11:05 a.m. ET with the correction that Wizards of the Coast is not a Mirrorscape partner."}