{"url": "https://techcrunch.com/2024/02/29/popular-video-doorbells-eken-tuck-hijacked-researchers/", "title": "Popular video doorbells can be easily hijacked, researchers find", "authors": ["Lorenzo Franceschi-Bicchierai", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-02-29T00:00:00", "text": "Several internet-connected doorbell cameras have a security flaw that allows hackers to take over the camera by just holding down a button, among other issues, according to research by Consumer Reports.\n\nOn Thursday, the nonprofit Consumer Reports published research that detailed four security and privacy flaws in cameras made by EKEN, a company based in Shenzhen, China, which makes cameras branded as EKEN, but also, apparently, Tuck and other brands.\n\nThese relatively cheap doorbell cameras were available on online marketplaces like Walmart and Temu, which removed them from sale after Consumer Reports reached out to the companies to flag the problems. These doorbell cameras are, however, still available elsewhere.\n\nAccording to Consumer Reports, the most impactful issue is that if someone is in close proximity to an EKEN doorbell camera, they can take “full control” of it by simply downloading its official app — called Aiwit — and putting the camera in pairing mode by simply holding down the doorbell’s button for eight seconds. Aiwit’s app has more than a million downloads on Google Play, suggesting it is widely used.\n\nAt that point, the malicious user can create their own account on the app, and scan the QR code generated by the app by putting it in front of the doorbell’s camera. This process lets the malicious user add the doorbell to their own account, allowing the malicious user to “gain control over a device that was originally associated with the homeowner’s user account,” according to Consumer Reports.\n\nOne mitigating factor is that, once this process is over, the owner of the camera gets an email alerting them that their “Aiwit device has changed ownership,” per the tests Consumer Reports conducted.\n\nThe other issues highlighted by the nonprofit organization are that the doorbells broadcast the owners’ IP addresses over the internet, they broadcast still images captured by the cameras, which can be intercepted and seen by anyone without needing a password, and they broadcast the unencrypted name of the local Wi-Fi network that the doorbell connects to over the internet.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nConsumer Reports says EKEN did not respond to their emails reporting these issues. EKEN also did not respond to a request for comment from TechCrunch.\n\nDespite these flaws and Consumer Reports warning online marketplaces about them, the doorbells remain available for sale on Amazon, Sears and Shein.\n\nSpokespeople for Amazon, Sears and Shein did not respond to TechCrunch’s request for comment.\n\nTemu, which used to sell the doorbells, said that after the company received alerts from Consumer Reports on February 5, it “took immediate action, suspending the sale of the identified doorbell camera models from the brands Tuck and Eken. We began a thorough review of these products to ensure their compliance with FCC regulations and other relevant standards.”\n\n“Following the additional information received on February 28th regarding security vulnerabilities associated with products using the Aiwit app and manufactured by Eken Group Ltd, we took swift action and removed all related products from our platform,” Temu spokesperson Tori Schubert said in an email.\n\nWalmart’s spokesperson John Forrest told TechCrunch in an email that the retail giant removed the EKEN and Tuck doorbells from sale. But Consumer Reports claimed there are similar doorbells, likely whitelabels of EKEN doorbells, still available on Walmart.\n\nAfter TechCrunch shared with Walmart five listings flagged by Consumer Reports, Forrest said the company took down three of the five, while two had already been removed.\n\nThis research shows that — once again — consumers have no way to know whether internet-connected smart devices online have the appropriate privacy and security measures in place. And, that online marketplaces cannot be trusted to vet what they sell, until someone from the outside, like Consumer Reports in this case, points out that the products are not safe."}