{"url": "https://techcrunch.com/2023/10/31/connectly-taps-automation-to-nudge-shoppers-to-complete-purchases/", "title": "Connectly taps automation to nudge shoppers to complete purchases", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-10-31T00:00:00", "text": "Most consumers interact with e-commerce brands through social media, text and email. Brands reach out with promotions and discounts. But the engagement and read rates tend to be low; according to Gartner, brands risk losing 38% of customers due to poor marketing personalization efforts.\n\nStefanos Loukakos, the former head of Meta’s business-focused Messenger division, thought the solution might lie in algorithms to drive marketing at the right time — and to the right person.\n\nTo test this theory, Loukakos founded Connectly, which hosts a platform for businesses to create messaging campaigns and automate conversations with customers across messaging apps. Connectly today announced that it raised $7.85 million in a Series A round led by Volpe Capital with participation from RX Ventures and DST Global managing partner Saurabh Gupta, bringing the startup’s total raised to $17.25 million.\n\nLoukakos launched Connectly in 2020 alongside Yandong Liu, previously a lead engineer on Uber’s machine learning team, whom he met through a mutual friend in the founder community.\n\nUsing Connectly, brands can create campaigns and chatbots to automate text message conversations with customers. Loukakos pitches it as a way for brands to capture customers that’d otherwise potentially fall through the cracks.\n\n“Connectly can tailor suggestions to ensure customers discover products they’ll love, as well as help companies gain a deeper understanding of their customers,” Loukakos said. “While traditional automation players focus on one-way messages, Connectly specializes in conversations with current and potential buyers — enabling outbound and inbound solutions.”\n\nFor example, if a customer abandons a cart on a brand’s website, Connectly can detect this and then send them a message asking why they didn’t make a purchase, Loukakos says. If the customer is “high value,” Connectly can offer to extend them a discount or lower-cost shipping.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nOn the back end, Connectly’s AI attempts to figure out which products customers are most interested in and build audience segments, which it displays to brands in a unified dashboard.\n\n“Connectly provides a real-time pane of glass that connects the dots between messages and sales,” Loukakos said. “Connectly’s AI uses natural language processing to understand what customers are saying and give them accurate recommendations on how to improve … [it also] uses machine learning to interpret and prioritize inbound messages, tagging in the appropriate agents and tasks so they know what actions to take.”\n\nThe stakes are high to get it right. According to one recent survey of around 1,200 SMS users, nearly half reported being “annoyed” by text message marketing, with 28% saying that they’d abandoned at least one brand out of irritation.\n\nConnectly appears to have had some success, though, with a customer base hovering around 200 brands and annual recurring revenue just eclipsing $3.5 million.\n\nDespite competition from incumbents like Twilio and startups such as MessageBird and Attentive, the company is well-positioned for growth, Loukakos asserts, with plans to grow headcount from 35 employees to close to 40 by year-end 2023.\n\nUpdated on 3/7 at 5:42 p.m. Eastern: DST Global didn’t invest in Connectly as originally written — only DST Global managing partner Saurabh Gupta. We’ve made the correction and regret the error."}