{"url": "https://techcrunch.com/2024/06/04/stacklet-sees-demand-grow-as-companies-take-cloud-cost-control-more-seriously/", "title": "Stacklet sees demand grow as companies take cloud cost control more seriously", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-06-04T00:00:00", "text": "When Stacklet’s founders, Travis Stanfield and Kapil Thangavelu, came out of Capital One in 2020 to launch their startup, most companies weren’t all that concerned with constraining cloud costs. But in the ensuing years, as they experienced economic headwinds, first from the pandemic, and then rising interest rates, it became an imperative.\n\nAs such, Stacklet’s cloud cost control and governance platform has seen a rise in popularity. In fact, CEO Stanfield says that while he can’t get into specific numbers, revenue tripled year over year in 2023. Investors apparently liked what they saw, and made a $14.5 million investment to capitalize on the continued growth.\n\nTechCrunch’s Frederic Lardinois described the company’s core commercial product in a 2021 article, showing that cost control is just one part of the offering:\n\n“Stacklet helps enterprises manage their data governance stance across different clouds, accounts, policies and regions, with a focus on security, cost optimization and regulatory compliance. The service offers its users a set of pre-defined policy packs that encode best practices for access to cloud resources, though users can obviously also specify their own rules. In addition, Stacklet offers a number of analytics functions around policy health and resource auditing, as well as a real-time inventory and change management logs for a company’s cloud assets.”\n\nThe company also has a true open source piece called Cloud Custodian. The two founders helped develop the software when they were working at Capital One, before leaving to launch Stacklet. The project was open sourced in 2016, and became part of the Cloud Native Computing Foundation in 2019.\n\nSome open source projects have switched to more restrictive licenses in recent years, but Thangavelu says that won’t happen with this one, because it is part of the CNCF forever. As for protecting the commercial product from being cannibalized by the free version, he says there is too much separation between the two for the open source to threaten the company’s core commercial offering.\n\n“The open source project is a stateless rules engine. It’s just a CLI (command line interface). With our commercial product, we bring a platform to help people accelerate out of the box with context, and give them value and additional capabilities that don’t exist within the open source piece,” he said.\n\nStanfield says they have found that the cost control piece is particularly important to customers, something that wasn’t always the case. In the early days of the company, most folks didn’t have any notion of FinOps, the name given for controlling cloud spending inside organizations. Yet it has become even more important in recent years with the growing popularity of AI, which tends to be resource intensive.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Certainly as folks continue to evolve their own products and services and push deeper into cloud, they need to have the expenditures well controlled, and what we essentially focus on in the FinOps domain is the continuous usage optimization — everything that the developers might be using in cloud, and keeping that aligned to their efficiency best practices,” Stanfield said.\n\nHe says that as they continue to grow they need to find the right balance between growth and efficiency, and they intend to err on the side of caution when it comes to spending, even with the new influx of money, while investing only when it makes sense to help them accelerate.\n\nIt’s worth noting that this investment is less than the previous round in 2021 when the company raised $18 million, but Stanfield says it’s a different time and they feel good about the number.\n\n“We feel fortunate. Certainly, given the economic climate that we have been in recent years, we got a lot of really fantastic investors around the table,” he told TechCrunch.\n\nToday’s round was led by SineWave VC with participation from Strait Capital, Uncorrelated Ventures, Capital One Ventures, Foundation Capital and Relentless Ventures. Stacklet has now raised $36.5 million, according to the company."}