{"url": "https://techcrunch.com/2025/05/08/aurora-co-founder-sterling-anderson-is-leaving-the-self-driving-truck-startup/", "title": "Aurora co-founder Sterling Anderson is leaving the self-driving truck startup", "authors": ["Kirsten Korosec", "Transportation Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-05-08T00:00:00", "text": "Sterling Anderson, a veteran of the nascent autonomous vehicle sector and co-founder of Aurora, is resigning just a week after the company launched its commercial self-driving truck service in Texas.\n\nAnderson held the chief product officer position at Aurora. The resignation was posted in a regulatory filing along with the company’s first-quarter earnings report. His resignation will go into effect June 1. He will leave the board August 31.\n\nThe company said in the filing that his resignation from the board “did not result from any disagreement with the Company concerning any matter relating to its operations, policies, or practices. The Company and the entire Board are deeply grateful for Mr. Anderson’s service and his immense contributions to the Company over the years in his role as founder, Chief Product Officer and a member of the Board.”\n\nAnderson is headed to an external opportunity in a senior leadership role at an iconic global company, according to information shared during the company’s earnings call.\n\nAnderson could not be reached for comment. He did make comments, however, during the company’s first-quarter earnings call.\n\n“Leaving Aurora is one of the most difficult decisions I’ve ever made, especially given the exciting stage Aurora is at,” he said during Thursday’s call. “This is precisely what gave me the confidence that now is the right time. Aurora has reached a critical inflection point; product Strategy is firmly established. The technology is on the road, the team is in place to scale it, and the momentum we’ve created in the industry is palpable.”\n\nAnderson was director of Tesla’s Autopilot program when he left to co-found Aurora in 2017 alongside CEO Chris Urmson, the former head of the Google self-driving project, and Drew Bagnell, who was leading Uber’s autonomy and perception team. The trio, considered pioneers of the autonomous vehicle industry, gave Aurora immediate buzz, helping it attract high-profile investors like Sequoia Capital, Amazon, and T. Rowe Price Associates, as well as a slew of partnerships.\n\n\n\nAurora gained more cachet in December 2020 when it reached an agreement with Uber to buy the ride-hailing firm’s self-driving unit in a complex deal that valued the combined company at $10 billion. Under the terms of that acquisition, Aurora did not pay cash for Uber ATG, a company that was valued at $7.25 billion following a $1 billion investment in 2019 from Toyota, DENSO, and SoftBank’s Vision Fund. Instead, Uber handed over its equity in ATG and invested $400 million into Aurora. Uber received a 26% stake in the combined company, according to a filing with the U.S. Securities and Exchange Commission.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWithin four years the company went from buzzy startup to publicly traded company via a merger with special purpose acquisition company Reinvent Technology Partners Y. The SPAC was launched by LinkedIn co-founder and investor Reid Hoffman, Zynga founder Mark Pincus, and managing partner Michael Thompson.\n\nAurora, a deep tech company still in development and years from steady revenue, has faced headwinds since it went public in 2021. The company focused its efforts on self-driving trucks, putting other projects like robotaxis to the side.\n\nLate last month, Aurora announced it successfully launched a self-driving truck service in Texas, just squeaking in under its own deadline."}