{"url": "https://techcrunch.com/2025/02/13/tofu-is-building-a-omni-channel-marketing-platform-for-enterprises/", "title": "Tofu is building an omni-channel marketing platform for enterprises", "authors": ["Rebecca Szkutak", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-02-13T00:00:00", "text": "When EJ Cho started his first company in 2018, he was exposed to what it takes to market a product. He was surprised to find a market filled with different single-use tools.\n\n“It was a very frustrating experience,” Cho told TechCrunch. “I had to learn and juggle all these different tools. It felt like a very inefficient way of getting your word out to users. I’ve always been fascinated about how to make marketing a bit more efficient and effective.”\n\nCho (pictured above on the left) sat on this idea for a few years while working on engineering teams at companies such as Meta, Affirm, and Fast. After the advancements in generative AI in 2022, he realized he might be able to solve the marketing problems he had years earlier using AI.\n\n\n\nThe result was Tofu, an AI-driven B2B marketing platform that’s designed to bring all of a company’s potential marketing campaigns into one space. The platform integrates with a marketing team’s existing workflow, and tools like HubSpot and Salesforce, and uses AI to automatically modify marketing copy for different marketing channels and can personalize marketing content for different customer types.\n\nCho, Tofu co-founder and CEO, said that while he ran into his frustrations with marketing tools while building a consumer-facing company, he decided to focus on B2B marketing because it is significantly more text heavy than B2C marketing, which made it a more natural choice for a generative AI approach.\n\nTofu’s team consulted more than 40 different CMOs before writing any code, Cho said, to figure out what their biggest pain points were. The two areas that came up most consistently were that CMOs wanted to be able to personalize content across different market segments and to repurpose content for different channels. Cho said that’s where Tofu focused first.\n\nTofu combines multiple marketing tools into one using AI. Image Credits:Tofu (screenshot)\n\n“If you really think about it, there’s not that much delta between what you want to write for maybe an email versus what’s for a landing page copy,” Cho said. “Obviously there’s these small nuances, but it’s nothing that cannot be embedded under one tool.”\n\nSan Francisco-based Tofu launched in late 2023 and has seen strong demand. The company boasts 12x revenue growth, although it’s worth noting that it’s only been in operation for a little over a year. Customers include DeepScribe, Check Point, and Wunderkind, among others.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe company is announcing a $12 million Series A round led by SignalFire with participation from HubSpot Ventures, Tau Ventures, and Correlation Ventures, among a number of existing VC investors and angel investors.\n\nUsing AI in marketing is not necessarily a new concept — nor a post-ChatGPT concept, either. Jasper, which helps enterprise companies with AI-driven marketing, has been around for a decade and is valued at more than $1.5 billion. Cordial, another cross-channel marketing platform, has raised more than $70 million in venture funding.\n\nCho acknowledged that the space is crowded but added that he thinks Tofu is in a good position because it touches so many different teams within a marketing department, compared to a single-use tool. That makes it stickier than some of Tofu’s other competitors, he said. The fact that Tofu isn’t just a ChatGPT wrapper and offers an integrated end-to-end solution makes them stand out, he added.\n\nNow that Tofu has closed its Series A round, the company is going expand the product’s capabilities as it works toward building a source of truth for marketing teams.\n\n“It is a noisy space,” Cho said. “The way we position ourselves is to basically say we replace and can support the multiple use cases you’re purchasing individual tools for with one platform. So that unified platform is a very appealing value proposition for customers, especially enterprise customers.”"}