{"url": "https://techcrunch.com/2022/09/20/zartico-secures-20m-to-help-tourism-offices-promote-local-destinations/", "title": "Zartico secures $20M to help tourism offices promote local destinations", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-09-20T00:00:00", "text": "Despite representing 10% of the world’s GDP, the tourism industry has been one of the last to embrace big data and analytics. Darren Dunn and Jay Kinghorn experienced this firsthand — Dunn as a sales executive at various travel companies including FarePortal.com and Jay as an associate managing director at Utah’s office of tourism.\n\n“Destinations around the world [are] relying on outdated quarterly and yearly reports to make critical decisions on marketing allocation, product mix, and coordination with stakeholders such as hoteliers, attractions and local government officials,” CEO Sarah Lehman told TechCrunch in an email interview. “The tourism and hospitality industry was one of the hardest hit during the pandemic and the industry has not fully recovered. The industry has to provide attractive career paths to allow people to build their careers and have long-term stability.”\n\nTo attempt to inject some data and digitization into tourism operations, Dunn and Kinghorn co-founded Zartico, a platform that provides analytics and visualizations to destination management organizations, or DMOs — government-affiliated tourism boards that promote locations as travel destinations. In a sign business is performing at expectations, Zartico today announced that it raised $20 million in a Series A funding round led by Arthur Ventures with participation from Peterson Partners, the proceeds from which Lehman says will be put toward R&D and hiring.\n\nZartico’s platform ingests geolocation, spend and event data from partners — Lehman wouldn’t say which vendors — and overlays it on top of other data streams (e.g. from customer relationship management systems and jobs boards). Using it, customers can see where visitors to a location migrate and move at the street level and track the tourism effects on locally owned businesses.\n\nOn the analytics side, Zartico uses AI to predict activity, like the volume of visitors to a certain area, and to extract mentions of travel destinations from unstructured text (e.g. social media posts and web pages). These extractions can be used to help customers develop new travel products line and fine-tune their marketing campaigns, Lehman says.\n\n“DMOs don’t have first-party data, like customer email addresses or shipping addresses, nor do they have conversion data to explicitly connect marketing initiatives to sales and revenue growth,” Lehman said. “Advancements in our integrated data model tighten alignment between our core data sets [for DMOs,] making for faster, more accurate and easier self-service insights across spending, movement, marketing and web data sets.”\n\nZartico’s geolocation tracking might not sit well with all privacy advocates — or tourists for that matter. After all, it was just in August that the U.S. Federal Trade Commission alleged one data broker, Kochava, sold to clients the precise locations of U.S. consumers, including at therapists’ offices and homeless shelters. A seminal piece from The New York Times showed the various ways location data — typically from smartphones — can be used to track a person’s movements, especially when correlated with publicly available records.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhen asked about Zartico’s privacy policy, Lehman gave a detailed list of the protections that the company has in place to prevent abuse — beginning with data de-identification and anonymization. She claims that the company doesn’t conduct analytics on individuals or store personally identifiable data, doesn’t allow use of its data by law enforcement and will terminate a client if Zartico learns of “dishonest” or illegal practices on their part.\n\n“We don’t allow use of our data to target advertising to people below the legal age — for example, alcohol and casinos — or to create audiences for locations primarily visited by children such as preschools and playgrounds,” Lehman added. “We [also ] don’t allow use of our data for employment, credit, health care or insurance purposes, and we don’t allow use of our data to target vulnerable or sensitive communities — for example, by political, religious or sexual orientation — or to identify those within sensitive areas (e.g., conflict zones, protests, religious sites, clinics, etc.) or to places.”\n\nZartico launched in March 2020 — one week prior to most of the world shutting down due to the COVID-19 pandemic. Despite the inopportune timing and competition from rivals, including Arrivalist, Rove and Datafy (which specialize in data visualization and reporting) and Placer.ai (which tracks people movement), Lehman says that Zartico has grown to more than 188 customers in less than three years. All clients are government entities — think cities, counties and visitors bureaus — who’ve actively contributed to Zartico’s $10 million in annual revenue.\n\nLehman has grand plans for the future, including using machine learning to create behavioral models that prevent “over-tourism” in particular destinations. Zartico is also eyeing new markets, she says — chiefly sports venues, municipalities and airports — as it grows headcount over the next six months from 61 employees to more than 100.\n\n“The pandemic heightened the world’s understanding and appreciation of the impact of the visitor economy. This experience thrust the need for real-time decision making to the forefront,” Lehman said. “No longer satisfied with rearview mirrors, the destination industry is looking for, and deserves, forward-looking tools. Zartico is keenly positioned to lead the technical transformation due to the rapid pivot towards the use of high-frequency big data sets to provide situational awareness.”\n\nZartico has raised a total of $24.5 million in capital to date, inclusive of the Series A tranche closed today."}