{"url": "https://techcrunch.com/2024/04/30/twitchs-tiktok-like-discovery-feed-is-rolling-out-to-all-users/", "title": "Twitch’s TikTok-like discovery feed is rolling out to all users", "authors": ["Aisha Malik", "Consumer News Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-04-30T00:00:00", "text": "Twitch is officially rolling out its new TikTok-like discovery feed to all users this week, the company announced on Tuesday. The new feed, which is launching as a tab within the Twitch iOS and Android apps, allows viewers to scroll through bite-sized bits of content to discover new streamers. The official launch follows Twitch’s earlier tests of the feed that started in August 2023.\n\nWith this launch, Twitch now joins numerous other popular apps that have launched their own short-form video feeds following TikTok’s rise in popularity, including Instagram, YouTube, Snapchat, Uber Eats and LinkedIn to name a few.\n\nThe discovery feed is finally here: the quickest way to find content you love on Twitch. Preview dozens of live streams & clips without pre-roll ads to find something to watch in minutes. Update your Twitch mobile app to see the new Feed tab, rolling out to everyone this… pic.twitter.com/bI704lgYAB — Twitch (@Twitch) April 30, 2024\n\nThere are two tabs within the feed: a live feed and a clips feed. The “live” feed displays livestreams from both streamers users already follow and streamers that Twitch thinks they would like. The “clips” feed showcases top moments from streamers across Twitch, allowing viewers to discover content from streamers even when they’re not live.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhile people typically go to Twitch when they have enough time to watch a livestream, the new clips feed is designed for moments when users only have a few minutes to spare.\n\nTo better personalize what you see in the feed, you can click the thumbs-up or thumbs-down button on a livestream or a clip to signal what type of content you want to see more or less of.\n\nThe new feed’s arrival comes as Twitch streamers have long called on the company to introduce new features to help them reach new audiences. Since Twitch isn’t a fully algorithmic platform like TikTok, Twitch streamers haven’t had many ways to attract new viewers outside of promoting themselves on other platforms or teaming up with fellow streamers. With this new discovery feed, small and medium streamers have the potential to reach new audiences.\n\nTwitch says that all livestreams and clips are automatically eligible to appear in the feed if they meet the platform’s content guidelines. While streamers can’t directly upload content to the discovery feed, Twitch encourages them to create and feature clips of their content for a chance to be included in the feed."}