{"url": "https://techcrunch.com/2024/04/25/playruo-lets-you-try-game-demos-from-your-web-browser/", "title": "Playruo lets you try game demos from your web browser", "authors": ["Romain Dillet", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-04-25T00:00:00", "text": "It’s still unclear whether cloud gaming will ever become the next big thing. The appeal is clear: The game you’re playing runs in a data center near you, and the video output is directly streamed to your local device. When you interact with the game, everything is relayed back to the data center.\n\nWhen it works, it’s an amazing experience. It’s a flexible, easy way to play games across multiple devices without buying new hardware. That’s why many companies have launched services that let you play games remotely — there’s Nvidia’s GeForce Now service, Microsoft’s Xbox Cloud Gaming, Amazon Luna, and Google’s now-defunct Stadia cloud gaming service.\n\nBut the vast majority of people still play video games on their own, local devices. A French company called Shadow tried something different by bringing your entire computer to the cloud: It isn’t just cloud gaming; it’s cloud computing. You can access Windows in the cloud and install anything you want. But Shadow hasn’t become a mainstream service either.\n\nFergus Leleu, Jean-Baptiste Kempf and Yannis Weinbach — three former employees at Shadow — decided to leave the company and try something different with their new startup, Playruo. Instead of letting you play your games in the cloud, their new company lets you play game demos in the cloud.\n\nClick on a link to launch a game demo\n\nIn many ways, Playruo delivers on the original promise of Google’s Stadia: It lets you launch and play a video game from your web browser without having to install anything. Just like people share Google Docs links to share a document, game publishers can turn a game demo into a shareable link.\n\nBehind the scenes, Playruo’s streaming technology is based on Kyber, a bidirectional streaming technology created by Kempf, the CTO of Playruo. Kempf is also better known as the president of VideoLAN, the organization behind the popular open source video player VLC. He has also worked on various video encoders and decoders used by some of the largest video platforms, including Netflix and YouTube.\n\nPlayruo relies heavily on open source software components, such as FFmpeg to encode the audio and video streams, and libVLC to decode the stream on your local device. The company uses QUIC for the transport layer network protocol.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nI tried a couple of demos in Google Chrome on macOS, and the service worked as expected. You can start playing just a few seconds after clicking on the demo link, and on a solid fiber connection via Wi-Fi, it felt like I was playing a game locally.\n\nHow to make a viral game\n\nThere are thousands of games released on PC and game consoles every year. Unless you have a gigantic marketing budget, it’s hard to stand out.\n\nEven worse, game publishers are also competing with old games. Some of the most played games of 2023 have been around for more than a decade — think Minecraft, Dota 2, Grand Theft Auto V, or League of Legends. It’s arguably one of the reasons why there have been so many rounds of layoffs in the games industry recently.\n\nPlayruo’s pitch is that it can be used by game publishers as part of a launch campaign to maximize their chances of success. For instance, at the end of a video trailer, a publisher could embed a thumbnail on YouTube with a link to the demo so you can try out the game easily.\n\nPlayruo links can also be integrated in game launchers. Imagine a popular Twitch streamer sharing a link to a multiplayer game demo so that viewers can team up with their favorite Twitch content creator.\n\nUnlike traditional cloud gaming services, Playruo’s client here is the game’s publisher, and they pay the startup to offer a demo. Chances are that a demo that becomes viral will lead to increased game sales. Playruo is already working with Old Skull Games to promote Cryptical Path.\n\n“We know the cloud gaming business model pretty well from our past experience. The big pitfall is that the various platforms do everything they can to prevent you from using the service too much,” Playruo’s co-founder and head of product, Weinbach, told me.\n\n“It’s a bit ridiculous and counterintuitive. So we thought about a business model where it’s interesting for us that people stay for a long time,” he said. In other words, a viral demo could be considered as a success for a game publisher.\n\nPlayruo will have to make sure that it can quickly scale its fleet of servers (up and down) based on demand. The company relies on public cloud companies that offer virtual machines with GPUs, such as Amazon Web Services, Google Cloud, Microsoft Azure and Scaleway.\n\nThis will be a critical part of Playruo’s model. If the startup has too many servers running without anyone launching demos, it’ll lead to an expensive hosting bill at the end of the month. If the startup doesn’t have enough servers, many gamers will receive an error when they try to launch a demo.\n\nBut if it works well, Playruo can act as the top of the funnel for game purchases. After a 15-minute demo, players can get a link to add a game to their Steam wishlist, join a Discord server, or enter their email address to get more information. And they may not even realize that they played a game that wasn’t installed on their system."}