{"url": "https://techcrunch.com/2024/03/22/startups-weekly-what-goes-up/", "title": "Startups Weekly: What goes up must come down", "authors": ["Haje Jan Kamps", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-03-22T00:00:00", "text": "Welcome to Startups Weekly — your weekly recap of everything you can’t miss from the world of startups. Sign up here to get it in your inbox every Friday.\n\nHelloooo, startup nerds! I spent much of this week in San Jose hanging out in the world of AI startups and tech giants at GTC, and I have a ton of fun stories in the pipeline from there, so stay tuned for all of that. In the meantime … let’s look at the exciting goodness that has been the past week of TechCrunch startup coverage!\n\nMost interesting startup stories from the week\n\nLet’s talk about microbiomes… Image Credits: Krisztian Bocsi/Bloomberg via Getty Images Image Credits:Bloomberg / Getty Images\n\nIn a dramatic turn of events, Microsoft has effectively absorbed Inflection, a once-promising AI startup that raised a staggering $1.3 billion just nine months ago. The acquisition sees Inflection’s co-founders, Mustafa Suleyman and Karén Simonyan, along with a significant portion of their team, transitioning to Microsoft to spearhead the newly formed Microsoft AI division. This move leaves Inflection, under the guidance of Reid Hoffman and new CEO Sean White, in a precarious position as it attempts to salvage what remains of its co-founders’ ambitious project. Microsoft’s role in this saga raises eyebrows, as it positions itself as both a savior and an opportunist, capitalizing on the struggles of its investments to consolidate its dominance in the AI space.\n\nMeanwhile, over in the land of biotech, the sector’s latest fascination, the microbiome, has been hailed as a frontier for personalized health solutions, promising to tackle everything from digestive issues to skin conditions. However, a recent report in Science casts a shadow over the burgeoning industry, suggesting that many microbiome companies may be operating with more enthusiasm than scientific rigor. These startups, riding the wave of affordable genome sequencing and venture capital, offer services that profile the unique microbial communities in our bodies to identify health problems and solutions. Yet, the report raises concerns about the lack of meaningful regulation and scientific consensus in this complex field, likening some practices to modern-day snake oil salesmanship. Despite the criticism, companies like Parallel Health, Tiny Health, and Daye defend their approaches, emphasizing their commitment to achieving scientific legitimacy.\n\nInvestors are hungry for AI: Astera Labs’ IPO pops 72% on the first day, showing that investor demand for tech with an AI twist is high.\n\nAstera Labs’ IPO pops 72% on the first day, showing that investor demand for tech with an AI twist is high. Apple adds AI to its shopping basket: Apple, the tech behemoth known for its sleek devices and tight-lipped announcements, has quietly added another gem to its crown by acquiring DarwinAI, a Canadian startup that’s all about making manufacturing smarter with its vision-based AI technology.\n\nApple, the tech behemoth known for its sleek devices and tight-lipped announcements, has quietly added another gem to its crown by acquiring DarwinAI, a Canadian startup that’s all about making manufacturing smarter with its vision-based AI technology. Tradin’ up: TipTop is expanding its ecosystem. Its new platform offers a seamless experience for purchasing new, open-box, and refurbished devices with cash and through trade-ins, according to the startup’s founder, Bastian Lehmann, who previously founded Postmates.\n\nMost interesting fundraises this week\n\nSneaking in some healthcare through the side door. Image Credits: Getty Images Image Credits:Getty Images\n\nTelegram, the messaging app giant with a user base north of 900 million, just flexed its financial muscles by securing a whopping $330 million through bond sales, as announced by its founder and CEO, Pavel Durov. The bond bonanza was a hit, attracting more cash than they had room for, with Durov boasting about snagging “global funds of the highest caliber” under terms that made this the sweetest deal in Telegram’s history. While Durov played coy on who exactly threw their money into the ring, he was clear that these investors are betting big on Telegram’s growth trajectory. The company is aiming for profitability next year, and last raised $220 million worth of funding through bonds about a year ago.\n\nWould you like a side of healthcare with that?: Insurance Tech has had some false starts, but a new hero emerges: “embedded insurance.” This genius idea of sneaking insurance into your shopping cart like an extra pair of socks you didn’t know you needed has given the sector a much-needed face-lift. Not to be outdone, “embedded health” has strutted onto the scene, with The CareVoice leading the charge from Shanghai, bagging $10 million in Series B funding amid a venture capital famine in the sector.\n\nInsurance Tech has had some false starts, but a new hero emerges: “embedded insurance.” This genius idea of sneaking insurance into your shopping cart like an extra pair of socks you didn’t know you needed has given the sector a much-needed face-lift. Not to be outdone, “embedded health” has strutted onto the scene, with The CareVoice leading the charge from Shanghai, bagging $10 million in Series B funding amid a venture capital famine in the sector. I see a red door and I want it painted green: In the grand corporate quest to paint everything green, from their logos to their carbon footprints, the big guns have been flaunting their net-zero emissions targets like the latest fashion trend. But what about the little guys? Enter Greenly, the Parisian knight in shining armor, armed with carbon accounting software that promises to make sense of the carbon chaos without needing an army of analysts.\n\nIn the grand corporate quest to paint everything green, from their logos to their carbon footprints, the big guns have been flaunting their net-zero emissions targets like the latest fashion trend. But what about the little guys? Enter Greenly, the Parisian knight in shining armor, armed with carbon accounting software that promises to make sense of the carbon chaos without needing an army of analysts. The PC is dead — long live the browser: The Browser Company, creators of the Arc browser, is riding high on a fresh $50 million investment wave, led by Pace Capital, valuing the startup at a cool $550 million. With a total of $128 million in funding under its belt, this outfit is on a mission to redefine your digital life, starting with the browser.\n\nTrend of the week: The higher they soar, the harder they fall\n\nFisker had a great run but has now paused production. Image Credits: Fisker Image Credits:Fisker\n\nIt’s been a week of highs and lows. Where some startups are meeting their demise, others are rising from the ashes, while others again are filling the void left by their falling brethren. All very dramatic.\n\nOne example of this drama is between Google and the EU. The search giant finds itself in hot water once again with France’s Autorité de la Concurrence, which has slapped the tech giant with a €250 million fine (around $270 million) for misusing news publishers’ content to train its AI model, Bard/Gemini, without proper notification. This latest fine is part of a longstanding feud over copyright protections, with Google previously attempting to sidestep EU digital copyright reforms by limiting access to its news services in France. The Autorité‘s investigation revealed that Google not only failed to inform publishers about the use of their content for AI training but also lacked a mechanism for publishers to opt out without affecting their visibility on Google’s other services until late September 2023. Meanwhile, Midjourney thinks it has a plan to beat the copyright cops.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nFrom the ashes they rise: As Mint bids adieu to the budgeting app world, Copilot is celebrating, heralding the end of Mint as a win for its own finance app. With over 100,000 subscribers, Copilot is on a mission to prove that personal finance management can be less about nagging notifications on “big purchases” (looking at you, Mint) and more about actually understanding where your money is going.\n\nAs Mint bids adieu to the budgeting app world, Copilot is celebrating, heralding the end of Mint as a win for its own finance app. With over 100,000 subscribers, Copilot is on a mission to prove that personal finance management can be less about nagging notifications on “big purchases” (looking at you, Mint) and more about actually understanding where your money is going. <screeeeeeeeech>: Fisker once zoomed into the public eye with its electric Ocean SUV but is now hitting the brakes hard, announcing a six-week production pause as it desperately searches the couch cushions for a cash infusion. With the clock ticking and the cash burning, Fisker’s story is starting to read more like a cautionary tale than a success story.\n\nFisker once zoomed into the public eye with its electric Ocean SUV but is now hitting the brakes hard, announcing a six-week production pause as it desperately searches the couch cushions for a cash infusion. With the clock ticking and the cash burning, Fisker’s story is starting to read more like a cautionary tale than a success story. Maybe if we change our name they won’t remember what we did: Lordstown Motors, now rebranded as Nu Ride, has risen from the ashes of bankruptcy with a vendetta against tech giant Foxconn, accusing it of playing the villain in the downfall of an American dream.\n\nOther unmissable TechCrunch stories …\n\nEvery week, there’s always a few stories I want to share with you that somehow don’t fit into the categories above. It’d be a shame if you missed ’em, so here’s a random grab bag of goodies for ya:\n\nSubscribe to Startups Weekly and the other TechCrunch newsletters. If you have hardware startup news or tips, get in touch with Haje!"}