{"url": "https://techcrunch.com/2022/03/09/online-safety-bill-scam-ads/", "title": "UK expands Online Safety Bill to cover scam ads", "authors": ["Natasha Lomas", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-03-09T00:00:00", "text": "The UK government has again announced an extension to the scope of the draft Online Safety Bill — this time bringing scam ads into scope following pressure from campaigners.\n\nIn parallel, it has also launched a consultation on strengthening existing regulation of the online ad industry, laying out a range of options to beef up rules for advertisers more generally.\n\nScam ads in scope\n\nBack in May, when the draft Online Safety Bill was published, the government said it would impose a duty of care on digital service providers to moderate user-generated content in a way that prevents people — and especially children — from being exposed to illegal and/or harmful stuff online.\n\nSince then parliamentary committees have been pouring over the proposal. And while there has been broad backing from MPs and peers for regulating online platforms there have also been calls from parliamentarians for changes to ensure the legislation does not misfire — including by failing to hit its intended targets. (Not least because these targets are myriad: From terrorists and distributors of CSAM, to bullies, racists and trolls, to name a few.)\n\nOutside parliament, campaigners on a range of online safety issues have also been very vocal in pressing for the bill to be beefed up to deal with their particular ‘beefs’.\n\nSo despite earlier drafts already facing criticizism of being a ‘kitchen sink’ bill on account of the sprawling scope — and a warning from a former secretary of state, no less, that “everyone is going to try and hang their own particular hobby horse” on the bill — in recent weeks there have been a flotilla of announcements from the Department of Digital, Culture, Media and Sport (DCMS), to bolt on even more provisions in the name of further strengthening the proposal.\n\nSee, for example, the government bringing pornography websites in scope so the bill can require “robust” age checks to prevent kids accessing adult content online; or it expanding the list of criminal content and offences that will be added to the face of the bill to force more proactive takedowns from platforms; or the recent announcement that the largest platforms will be required to provide users with a verification option and the ability to only receive replies and messages from verified accounts — with the goal of giving people tools to beat trolls.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nScam ads is another issue the government has been under sustained pressure for the ‘Online Safety’ legislation to tackle, with consumer protection campaigners warning that a law which purely targets user-generated scams could simply end up driving scammers to professional channels by encouraging bad actors to pay platforms to carry their malicious messages as ads.\n\nTwo parliamentary committees which scrutinized the draft bill, and published reports in recent months, also pressed for certain types of harmful paid advertising to be brought into scope.\n\nThe government has again responded to campaigners’ concerns by agreeing to further expand the bill’s scope. (Pity Ofcom, the regulator that has been tasked with overseeing the lion’s share of compliance with so many ‘Online Safety’ provisions.)\n\n“A new legal duty will be added to the Online Safety Bill requiring the largest and most popular social media platforms and search engines to prevent paid-for fraudulent adverts appearing on their services,” DCMS said in a press release put out yesterday evening (UK time), presumably to catch late news bulletins and the early editions of next day newspapers.\n\nThe government’s appetite to regulate Internet content appears proportionate to how populist a cause it believes it has identified — with so many public grievances conglomerating into one piece of legislation. And “scam ads” are a particularly good example of that: Who doesn’t hate ‘scam ads’? (Well, apart from ad platforms which are happy to monetize any messaging anyone wants to pay them to send… )\n\n“The change will improve protections for internet users from the potentially devastating impact of fake ads, including where criminals impersonate celebrities or companies to steal people’s personal data, peddle dodgy financial investments or break into bank accounts,” DCMS’ release goes on.\n\nThe government said the new measures will apply to the largest social media platforms and search engines.\n\nThese tech giants will be required to “put in place proportionate systems and processes to prevent (or minimise in the case of search engines) the publication and/or hosting of fraudulent advertising on their service and remove it when they are made aware of it”, as it puts it.\n\n“It will mean companies have to clamp down on ads with unlicensed financial promotions, fraudsters impersonating legitimate businesses and ads for fake companies. It includes ‘boosted’ social media posts by users which they pay to have promoted more widely.”\n\nOnce again, the detail of what exactly major platforms will be required to do to tackle scam ads isn’t clear because it’s pending guidance which Ofcom will set out in forthcoming codes of practice.\n\nBut DCMS suggested provisions could include “making firms scan for scam adverts before they are uploaded to their systems; measures such as checking the identity of those who wish to publish advertisements; and ensuring financial promotions are only made by firms authorised by the Financial Conduct Authority (FCA)”.\n\nThe FCA has already been applying pressure to Google over scams ads in the financial sphere — and last summer the tech giant announced a policy change, agreeing from September to only run ads for financial products and services when the advertiser has been verified by the financial watchdog, after the FCA threatened it with legal action.\n\nEvidently, the government believes those quasi-voluntary tweaks by Google don’t go far enough.\n\nIn a statement on the latest bit of beefing up, culture secretary Nadine Dorries said: “We want to protect people from online scams and have heard the calls to strengthen our new internet safety laws. These changes to the upcoming Online Safety bill will help stop fraudsters conning people out of their hard-earned cash using fake online adverts.\n\n“As technology revolutionises more and more of our lives the law must keep up. Today we are also announcing a review of the wider rules around online advertising to make sure industry practices are accountable, transparent and ethical – so people can trust what they see advertised and know fact from fiction.”\n\nAnti-scam ad campaigners were quick to welcome the latest expansion of the Online Safety Bill — while also warning that attention to detail (to close off loopholes) and enforcement will be essential to ensure the measures don’t flop.\n\nCommenting in a statement, Martin Lewis, the founder of the MoneySavingExpert.com website — who has previously resorted to suing Facebook for defamation for running scam ads bearing his likeness — said: “I am thankful the government has listened to me and the huge numbers of other campaigners — across banks, insurers, consumer groups, charities, police and regulators — who’ve been desperate to ensure scam adverts are covered by the Online Safety Bill. We are amidst an epidemic of scam adverts. Scams don’t just destroy people’s finances — they hit their self-esteem, mental health and even leave some considering taking their own lives.\n\n“The government now accepting the principle that scam adverts need to be included, and that firms who are paid to publish adverts need to be responsible for them, is a crucial first step. Until now, only user-generated scams were covered — which risked pushing more scam ads, incentivising criminals to shift strategy. Yet it is a complex area. Now we and others need to analyse all elements of this new part of the Bill, and work with Government and Parliament to close down the hiding places or gaps scammers can exploit.”\n\nThe consumer rights group Which? also welcomed scam ads being brought into scope of the bill — but also warned that the legislation “must ensure the regulator has the support and resources it needs to hold companies to account and take strong enforcement action where necessary”.\n\nTougher online ad rules?\n\nThere could be more coming from the government vis-a-vis online ads as DCMS has also announced the launch of a consultation on proposals to tighten the rules for the online advertising industry — potentially signalling a move away from the current self-regulatory approach which is overseen by the Advertising Standards Authority.\n\n“Rapid technological developments have transformed the scale and complexity of online advertising leading to an increase in consumer harm,” DCMS warns, suggesting tighter rules are needed to “bring more of the major players involved under regulation and create a more transparent, accountable and safer ad market”.\n\nDiscussing the consultation, the government points again to the problem of online ads that seeks to defraud people through investment scams and promotions for fraudulent products and services (“including fake ticketing”), and which it notes often involve fake celebrity endorsements — reiterating that such scams have proliferated online.\n\n“People are also being targeted through legitimate-looking adverts that contain hidden malware. When clicked on they allow hackers to commit malicious cyber security attacks such as ‘cryptojacking’ — the unauthorised use of people’s devices to mine for cryptocurrency,” DCMS also warns.\n\n“Elsewhere there is evidence of online adverts selling items prohibited in UK law, such as prescription medicines and counterfeit fashion, misleading adverts misrepresenting the product or service they offer, and influencers failing to reveal sponsorship arrangements with companies in their posts.”\n\nIn light of so much dubious activity being laundered through digital ad channels, the government believes it’s time to change how online advertising is regulated — although it’s not yet sure exactly how best to do this to tackle the proliferation of scammy and fraudulent ad content.\n\nIn a ministerial forward to the new Online Advertising Programme (OAP) Consultation — which runs for 12 weeks from today — Julia Lopez, the minister for Media, Data and Digital Infrastructure, writes:\n\nThe Online Advertising Programme will review the regulatory framework of paid-for online advertising to tackle the evident lack of transparency and accountability across the whole supply chain. It will consider how we can build on the existing self-regulatory framework, by strengthening the mechanisms currently in place and those being developed, to equip our regulators to meet the challenges of the online sphere, whilst maintaining this government’s pro-innovation and proportionate approach to digital regulation. We want to ensure that regulators have good sight of what is happening across the vast, complex, often opaque and automated supply chain, where highly personalised adverts are being delivered at speed and scale.\n\nThe UK’s competition watchdog, the CMA, conducted a deep-dive market study of the online ad sector back in 2019 which already flagged a range of harms and finally concluded that a new regulatory approach — and a dedicated oversight body — is needed to address what it summarized as “wide ranging and self reinforcing” concerns attached to the market power of Google and Facebook.\n\nThat CMA market study has been feeding an in-train ‘pro-competition’ reform of the UK’s digital competition regime — which is set to bring in bespoke ex ante rules for the largest and most powerful Internet platforms. (Which is also still pending legislation to empower the new, dedicated Digital Markets Unit.)\n\nBut the government is now signalling that it thinks market specific rule changes are also needed to clean up widespread, murky activity in the online ad industry — and which would supplement targeted competition interventions likely to be applied to the adtech duopoly once the country’s new antitrust regime is in force.\n\n“The [OAP] programme will look at the current regulations and regulators including whether they are properly empowered and funded,” DCMS writes. “It will consider the whole supply chain and whether those within it should do more to combat harmful advertising, including ad-funded platforms such as Meta, Snap, Twitter and Tik Tok and intermediaries such as Google, TheTradeDesk and AppNexus.”\n\nOptions on the table include strengthening the current self-regulation approach or creating a new statutory regulator with tough enforcement powers, per DCMS.\n\nIt says some specific options being considered are:\n\nRule-making powers such as setting mandatory codes of conduct and enforcing them with fines and the ability to block and ban advertisers which repeatedly break the rules\n\nIncreased scrutiny across the supply chain related to high-risk advertising such as the promotion of products related to alcohol or weight loss. Companies could be required to demonstrate they are taking care to protect users — for example avoiding targeting vulnerable groups\n\nIncreased scrutiny of advertisers which repeatedly breach codes of conduct and more checks on firms and individuals placing adverts and buying ad space. This could include requiring third-party intermediaries or platforms to make advertisers self declare an interest in placing high-risk advertising such as age restricted ads\n\nInformation gathering and investigatory powers such as the power to audit and request transparency reports from companies and request data from them\n\n“Harmful or misleading adverts, such as those promoting negative body images, and adverts for illegal activities such as weapons sales, could be subject to tougher rules and sanctions,” DCMS suggests, adding: “Influencers failing to declare they are being paid to promote products on social media could also be subject to stronger penalties.”\n\nWhile it’s not clear exactly what is coming down the pipe for the online ad industry in general under tighter UK rules, or exactly when a beefier regime will be in force, far tougher oversight of paid messaging now looks to be a given — not least because the government has already confirmed targeted measures against scam ads in the Online Safety Bill.\n\nWhile the FCA also recently announced an incoming crackdown on crypto marketing this summer — after a boom in risky ads.\n\nOn the wider ad industry rule changes, the government said it will respond to the OAP consultation and outline reform proposals later this year.\n\nThe UK arm of the online ad industry body, the IAB, was quick to raise “concerns” about the parallel move of ministers slotting scam ads into the Online Safety Bill while simultaneously proposing to update the regulatory regime wrapping online advertising more generally.\n\nIn a statement calling for “an evidence-led process” to build on what the IAB UK’s CEO, Jon Mew, claimed are “strong industry standards and initiatives already in place”, he warned that the government’s “duplicate… focus on scam ads across both programmes creates unnecessary regulatory fragmentation and risks constraining proper policy development”.\n\nMew added:"}