{"url": "https://techcrunch.com/2025/05/09/rippling-raises-450m-at-a-16-8b-valuation-reveals-yc-is-a-customer/", "title": "Rippling raises $450M at a $16.8B valuation, reveals YC is a customer", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Kirsten Korosec", "Tim De Chant", "Kyle Wiggers", "Cindy Zackney", "Amanda Silberling", "Theresa Loconsolo", "Anthony Ha", "Maxwell Zeff"], "publication_date": "2025-05-09T00:00:00", "text": "HR tech startup Rippling has raised a $450 million Series G round at a $16.8 billion valuation, the company confirmed to TechCrunch. It is also conducting a $200 million tender offer to give current and former employees some liquidity.\n\nThe equity raise marks a big jump in valuation from a year ago. In April 2024, Rippling was valued at $13.4 billion when it raised a $200 million Series F round led by Coatue and a $590 million tender offer, with $200 million available for employees. (The other $390 million was available for seed and other investors.)\n\nThe latest financing, which Bloomberg reported was in the works last month, includes participation from a group of new and existing investors. New backers include Sands Capital, GIC, Goldman Sachs Growth, and Baillie Gifford. Existing investors such as Elad Gil, Y Combinator, and others also participated.\n\nRippling is one of Y Combinator’s many breakout success stories. It graduated from the winter 2017 cohort and YC apparently became a client of Rippling’s earlier this year.\n\nIn a new case study, YC also touted Rippling’s offering as the HR “tool of choice” for “all of the accelerator’s founders. (Rippling even now has a special “Founder Mode” offer of discounted services for YC-funded companies.)\n\nInterestingly, Rippling CEO and co-founder Parker Conrad earlier this week shared more information about his company’s new Startup Stack, which appears to be a push to work with earlier-stage companies. In a LinkedIn post, the company said it already works with over 15,000 startups, including Cursor (Anysphere), Clay, and Sierra. The company appears to aggressively market the new stack, offering startups “six months of Rippling free.”\n\nThe increase in marketing and capital raise come amidst a lawsuit Rippling has filed against rival Deel for allegedly hiring an employee to spy on its internal trade secrets. Deel is also a Y Combinator grad (winter 2019) and filed a countersuit against Rippling in April, denying those allegations and making a few of its own.\n\nWith this latest capital injection, Rippling has now raised $1.85 billion. It has over 20,000 customers and more than 4,000 employees. Other investors include Kleiner Perkins, Greenoaks Capital, and Founders Fund. The company recently reached $570 million in annualized revenue, according to sources who spoke to The Information.\n\nFounded in 2016, Rippling has evolved its offering over time and now has two dozen products, including payroll and benefits, SSO and identity management, bill pay, and corporate cards. The new capital will help it accelerate its expansion into new markets, “enhance” existing products, and support the development of new products."}