{"url": "https://techcrunch.com/2023/02/08/dbt-acquires-transform/", "title": "Dbt Labs acquires Transform, adding semantic tools to its data analytics platform", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-02-08T00:00:00", "text": "Almost exactly a year ago, dbt Labs shined a spotlight on the opportunities in the world of developer tools for data analytics when the startup closed a Series D of $222 million at a $4.2 billion valuation. Yes, that was $2 billion lower than what it had been originally targeting, but CEO and founder Tristan Handy tells us, “It was our choice,” a cut he made anticipating a tough year ahead, and the pressures of growth, even at a fast-growing startup like dbt, to justify a $6.2 billion figure.\n\nOne year on, the company is using some of that money, and possibly a bit of the leverage afforded by the compressed market, to expand in a different way: it is acquiring Transform, a fellow analytics engineering firm.\n\nTransform’s specialty is semantic tools to build data science insights from data troves that can be used for business intelligence, and this tech will now be folded into dbt’s Semantic Layer product, which already let engineers use simple phrases like revenue, customer count and churn rate to define the metrics they were looking to answer through the data: now that product will work more robustly and will thus become a bigger focus in the product.\n\nThe valuation of the deal is not being disclosed. Transform according to PitchBook had raised $29 million from investors like Index Ventures and Redpoint ($24.5 million in equity and some debt) in mid-2021. No funding rounds since then, but CEO and co-founder Nick Handel said that wasn’t a factor in selling up. Rather, it was a conversation he had with Handy even before the Series A in 2021, where the pair realized that what they were building in the data science space was complementary and that they thought in similar ways.\n\n“We were well capitalized and had customers,” Handel said in an interview. “But in the event we decided that this made more sense.” Handel, his two co-founders James Mayfield and Paul Yang, and most of the rest of their team of 30 will join dbt.\n\nThere are indeed some parallels between the two startups beyond the fact that the two CEOs have very similar surnames.\n\nDbt, which works across raw data repositories housed in Snowflake, Databricks (both of which invest in it), BigQuery and several other platforms, was actually a by-product, something that Handy and his team had built to help them be more productive in their consultancy work. It took off as a business in its own right after it was initially open sourced but started to get traction with enterprises who wanted and needed more support and a paid product.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSomewhat similarly, Handel, Mayfield and Yang came upon the concept for Transform when they were working together at Airbnb; they could see the potential of querying data better to help make product decisions or measuring the effectiveness of a particular customer-facing tool, or for future feature planning, but also understood how hard it was for the data scientists who could use that information pull and use the data to get those answers. They built a semantic tool, Minerva, at Airbnb specifically aimed at the kinds of questions Airbnb data scientists might have, and then left to build Transform for the rest of the world to use.\n\nDbt is the more generalist of the two companies, covering a much wider set of use cases that include business intelligence but others too, and it has been on a strong growth tear for a while and is a much bigger entity. It has some 19,000 companies overall, 65,000 open source community members and more than 3,000 businesses on the paid tier of the product, called dbt Cloud.\n\nHandy said that revenues have grown three-fold in the last year and headcount has doubled to 400 from 200.\n\n“Despite the challenging macroeconomic headwinds, we are happy with how things are going,” he said.\n\nHe added that there are no plans for the company to raise another round soon after swallowing that $222 million Series D last year, especially in the current climate, and that it’s focused mainly on adding on more users and paying customers and hiring, rather than snapping up more companies either to pick up talent or technology.\n\n“It was not a fundraise focused on acquisitions spree,” he said of the round. “We see the space as massive and many years of technology still to be built. We raised to think far into future.”\n\nAlthough there are a lot of startups out there getting to the end of their runways but unable to raise more money, and therefore looking for exits, another trend will keep some of them from becoming acquisition targets quite so quickly. The huge swathe of layoffs in the industry has meant significantly more people to hire as individuals, which is still less expensive than making an acquisition.\n\n“If you’d asked me six months ago about acquisitions, I’d have said we wanted to be be pretty acquisitive, as a way of bringing on multiple different small teams, to bring talent into the company. It was less about products and more about great engineers,” Handy said. “But the market shifted. Now it’s less about talent acquisitions and more about us. We are finding a lot of success in being able to hire without going the acquisition route, and so acquisitions are now more targeted and strategic."}