{"url": "https://techcrunch.com/2017/02/25/if-trump-wants-an-easy-policy-win-he-should-focus-on-funding-smart-cities/", "title": "If Trump wants an easy policy win, he should focus on funding smart cities", "authors": ["Michael Provenzano", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2017-02-25T00:00:00", "text": "Two decades after social scientists coined the term “smart cities,” the dream of tech-enabled communities has yet to come to fruition. But Donald Trump’s presidency could prove a turning point for the smart-city movement.\n\nSmart-city initiatives that do exist are mostly pilot programs funded by grants, not long-term projects with sustainable financials. Funding shortfalls and a lack of cohesive planning are to blame. That is to say, a recent University of Pennsylvania survey found that almost none of the largest metropolitan planning organizations have clear transportation modernization plans.\n\nAt the same time, the need for innovation as it pertains to infrastructure and urban living has never been more dire. Nearly two-thirds of U.S. citizens now live in urban areas. As America’s cities continue to grow, they face mind-boggling challenges: worsening traffic, increasing pollution, expensive housing, aging infrastructure and strained services. These challenges can only be solved by harnessing the power of big data, machine learning and other technology.\n\nRecent funding efforts, while commendable, are proverbial drops in the bucket. In September, the White House expanded its Smart Cities initiative, committing $80 million to help urban centers improve their climate, transportation, public safety and city services through advanced technology. But American cities will spend about $52.4 billion, or 655 times the White House funding, on technology this year alone, according to the Center for Digital Government. Worldwide, cities could spend as much as $41 trillion on smart tech over the next two decades.\n\nPresident Trump’s promise to spend $1 trillion on infrastructure over the next 10 years offers a possible path forward. His plan, which targets everything from airports to ports, should also include urban technology. Building smart-city infrastructure will not only create American jobs and top-line growth, but will also save both local and federal government money over time, thanks to more efficient use of energy and resources.\n\nTrump and other leaders can take note of successes around the globe. Take Singapore’s Smart Traffic system, Helsinki’s involvement in an ecosystem of open innovations called bIoTope or Barcelona’s dedication to smart cities, which began in 2012, and relied heavily on IoT to improve a number of different urban systems, including public transportation, street lighting and waste management.\n\nWithin two years, Barcelona’s deputy mayor claimed the city was saving $58 million annually on smart water technology, with $50 million more in revenue from smart parking and more than 47,000 new jobs thanks to its efforts.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPartnerships also can be vital to driving growth. Take, for instance, South Korea, where nearly every part of public life in Seoul is enabled by technology, from high-tech street lamps that reduce energy use to roads that recharge buses thanks to underground electrical cables. And the city of Songdo, just 22 miles away from the capital, is in the midst of being built from scratch as a futuristic business hub.\n\nAs part of the strategy, South Korea looked to a trusted ally in electronics behemoth LG, headquartered in Seoul. Trump can follow suit with American companies like GE and Google, which have demonstrated a willingness to invest in smart cities, or other software giants like SAP, which announced plans to invest $2.2 billion in IoT by 2020, where expanding partnerships and cooperation with companies like Dell and Intel are integral to its growth plans.\n\nBut there’s another resource that has already helped Trump build his multi-billion dollar brand: the media.\n\nIn The Silent Intelligence: The Internet of Things, co-author Daniel Obodovski points out the difference between ROI and monetization, and explains how cities can generate revenue from connectivity and the data resulting from it. Similar to startups that often raise a small seed round or bridge loan to support initial growth, a cash infusion through an easy revenue stream like ad revenue can foot the bill to build smart-city infrastructure. Then, once that foundation is in place, long-term sustainable revenue can be realized in the form of lower energy costs, reduced waste and greater efficiencies.\n\nAs a recent example, let’s examine the reason why Sidewalk Labs’ new venture Intersection won the LinkNYC contract in New York City, which provided the capital to create a free public Wi-Fi network of 10,000 kiosks. Compared to other infrastructure providers, Intersection, a hybrid municipal media and technology company, offered an opportunity for the city to modernize its existing infrastructure of public payphones with Wi-Fi enabled kiosks, which provided a monetization solution to offset the otherwise costly endeavor (estimated to be around $200 million). Now, through sales of digital media inventory, Intersection plans to generate about $500 million in ad revenue over the next 12 years, with taxpayers not contributing a dime.\n\nConcurrently, three other major vendors, including Outfront (formerly CBS Outdoor), Clear Channel Outdoor and JCDecaux, are now rolling out digital screens across U.S. urban cities, where distribution has increased significantly due to the plummeting price of LED screens and changing local legislation. A recent example can be found in the D.C. area, where digital billboards are viewed by city officials as appropriate in entertainment districts, like Nationals Park, and can add value to neighborhood identity.\n\nThere are early signs that Trump may be open to the type of business-driven, solution-focused thinking that will drive smart cities forward. At a time when the president faces major challenges and criticism for a campaign perceived by many members of the media as run largely on divisiveness, working alongside tech industry leaders could prove to be a powerful asset in pursuit of this massive initiative as they expand their own infrastructure improvements to pave the way for clean energy, solar energy and self-driving cars.\n\nCan focusing on U.S. smart cities and embracing relationships between manufacturing giants, media companies and tech disruptors help Trump create a lasting model for the future that could earn him an easy bipartisan win? The digital writing may already be on the wall — one that has immense potential to drive the economy forward, while creating a path for social and civic good that multiple players in the ecosystem can rally behind."}