{"url": "https://techcrunch.com/2022/08/15/report-apple-tested-ads-in-apple-maps-as-it-weighs-broader-ads-push/", "title": "Report: Apple explored ads in Apple Maps as it weighs broader ads push", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-08-15T00:00:00", "text": "A new report from Bloomberg indicates Apple may be expanding its advertising business beyond the App Store and other first-party apps like News and Stocks. This plan could see Apple introducing ads into other pre-installed, first-party apps like Apple Maps, where ads have already been explored internally, the report claimed. And later, Apple may roll out ads to other Apple apps, like Books and Podcasts.\n\nThe additions could help increase the annual revenue for Apple’s ads business, currently $4 billion, to reach the double digits, the report noted, making Apple a more sizable player in the digital ads industry.\n\nToday, Apple serves a variety of ads across its App Store, including display ads on the Store’s Search tab in addition to the Search Ads that appear at the top of the search results when users type in specific keywords to locate apps. Recently, Apple was said to be expanding its selection of App Store advertising slots to also include ads on the main Today tab and at the bottom of third-party apps’ listing in the “You Might Also Like” section of app recommendations.\n\nElsewhere, Apple runs display ads within its first-party News and Stocks apps and it broadcast ads within its Apple TV+ live streams of MLB games and pre-game shows. (It shares a cut of its News ad revenue with publishers, we should note.)\n\nAccording to Mark Gurman’s Bloomberg Newsletter, Apple has already internally tested Search Ads within Maps. These work similarly to the App Store Search Ads, he says, as they would allow an advertiser to bid on keywords in order to have their business returned when a user searched for a particular term.\n\nMeanwhile, the report suggests publishers could pay to have their work appear higher in search results in Apple’s Books and Podcasts apps or these apps could include display ads. It did not indicate if either of these apps had seen ad tests, however.\n\nApple TV+ could also prove to be another sizable ad platform, the report also speculated, arriving at a time when major streamers like Disney+ and Netflix have introduced more affordable ad-supported plans. Or Apple could introduce some sort of free streaming hub supported by ads. This could compete with other free movie and TV streaming offerings like those provided by The Roku Channel, Tubi or Amazon’s Freevee, perhaps.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nFurther, Bloomberg noted that Apple’s ad group’s VP Todd Teresi now reports directly to services chief Eddy Cue — an indication of the company’s ads business’ increased importance.\n\nThe news follows a recent report by Digiday that discovered, based on job listings, Apple appeared to be developing its own demand-side platform. It wasn’t clear whether this DSP would be devoted to serving ads on the App Store or other Apple-owned apps, or if it had broader ambitions. Apple didn’t offer a comment on the report at the time.\n\nApple’s ability to carve out more of a slice of the ads market for itself comes after the company made changes to its iOS platform that damaged third-party app makers’ ability to target their users with personalized ads. Apple’s ATT platform (App Tracking Transparency) lets users opt out of being tracked — something Apple characterizes as only a user privacy feature. But the feature is also of great benefit to Apple, as it’s able to leverage the data it collects across its own first-party apps to offer personalized ads. In time, advertisers could shift some of their budgets to Apple’s personalized ads — particularly if their ad dollars spent on third-party apps proved to deliver less powerful results due to ATT’s impact.\n\nIf Apple were to grow its advertising footprint, it could also increase pressure on the company to be more transparent about the revenues generated by the individual entities within Apple’s Services business, which includes the App Store and its advertising arm. Today, Apple’s Services drive nearly a third of the company’s gross profit, a Bloomberg op-ed noted, stressing that investors should have a right to know how well these businesses are performing.\n\nUpdate, 8/22/22: In a subsequent newsletter, Bloomberg stated Apple Maps would roll out ads in 2023."}