{"url": "https://techcrunch.com/2022/09/28/coalesce-lands-fresh-capital-to-transform-data-at-enterprise-scale/", "title": "Coalesce lands fresh capital to transform data at ‘enterprise scale’", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-09-28T00:00:00", "text": "Coalesce is a startup that offers data transformation tools geared mainly toward enterprise customers. Today the company closed a $26 million Series A funding round led by Emergence Capital with participation from 11.2 Capital and GreatPoint Ventures, bringing the company’s total raised to $31.92 million. Co-founder and CEO Armon Petrossian tells TechCrunch that the cash will be put toward building out Coalesce’s product and ecosystem.\n\nPetrossian met Coalesce’s other co-founder, Satish Jayanthi, at WhereScape, where the two were responsible for solving data warehouse problems for large organizations. (In computing, a “data warehouse” refers to systems used for reporting and data analysis — analysis usually germane to business intelligence.) Their clients often encountered challenges in transforming data, Petrossian says, as well as documenting these transformations in a way that made intuitive sense.\n\nTo Petrossian’s point, a survey commissioned by data integration platform Matillion found that as much as 57% of the time involved in analytics projects is spent tackling data transformation hurdles. Moreover, 75% percent of data teams feel that outdated migration and maintenance processes are costing them productivity and capital.\n\n“Companies have been struggling with data transformation and optimization since the early days of data warehousing, and with the enormous growth of the cloud, that challenge has only increased,” he told TechCrunch via email. “We are on a mission to radically improve the analytics landscape by making enterprise-scale data transformations as efficient and flexible as possible.”\n\nCoalesce offers tools designed to simplify modeling, cleansing and governance of data primarily in the Snowflake cloud, powered by what Petrossian describes as a “column-aware” architecture that leverages metadata to manage data transformations with an understanding of how the data is related or connected. Users can take advantage of data transformation automation templates that can be edited, packaged and shared, either with code or a visual design tool.\n\nOften, companies approach Coalesce with specific problems, Petrossian said, like needing to transform data from different databases, apps and systems to follow a certain spec or standard. Other customers seek to speed up business intelligence queries by removing the need to search across multiple data sources and formats.\n\n“Our product solves the largest bottleneck in analytics today by combining the speed of an intuitive graphical user interface with the flexibility of code, plus a healthy dose of automation, to enable rapid data transformations,” Petrossian continued. “With Coalesce, the data can be organized in an easy to access and read fashion while using automation to streamline the process and limit the amount of time needed by highly skilled engineers to code manually.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPetrossian sees Coalesce competing with “extract, transform, and load” data integration vendors, including Informatica and Talend. The aforementioned Matillion also occupies that space, as does Incorta and Etleap.\n\nFortunately for Coalesce, the ETL market is massive, with one estimate putting it at $10.75 billion as of early 2021. While demurring when asked about revenue, Petrossian claimed that Coalesce’s business is quite strong, with “multiple” Fortune 500 customers paying for the startup’s services.\n\n“Our company was born during the pandemic and has given us an opportunity to serve enterprise Fortune 500 companies that are resilient to the potential looming recession,” Petrossian added. “The Coalesce platform is easing the burden of companies struggling to find talented data engineers or architects by providing them with a tool that empowers their existing teams to be much more efficient without compromising flexibility at scale.”\n\nCoalesce currently has 40 salaried employees, spread across locations in four different countries. Petrossian wouldn’t commit to hiring a certain number this year but said the plan is to invest generally in Coalesce’s marketing, sales and engineering operations."}