{"url": "https://techcrunch.com/2022/05/17/candle-media-the-new-media-co-backed-by-former-disney-execs-acquires-gen-z-focused-attn/", "title": "Candle Media, the new media company co-backed by former Disney execs, acquires Gen Z-focused ATTN: for $100M", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-05-17T00:00:00", "text": "Candle Media, the new media company headed by former Disney execs, Kevin Mayer and Tom Staggs, has made another acquisition — this time with an eye on social storytelling and reaching a Gen Z to millennial audience. The company announced today it will become the new owner of ATTN:, a media company that uses entertainment to discuss topical issues that help explain the world to a younger audience — particularly those who consume content on social media.\n\nOf note, ATTN: also launched its own TikTok studio last year to provide production services for brands that wanted to reach the TikTok user base. Clients on that effort have included big name brands like Google, Madewell, MTV and even TikTok itself, which partnered with ATTN: to manage its own “TikTok for Good” channel. That deal was recently renewed for a second year.\n\nCandle explained its interest in ATTN: had to do with the company’s ability to effectively engage a social audience.\n\n“ATTN: has a deep, digital-native understanding for how to cut through the noise and reach today’s audiences through engaging content on social media. We are excited for them to join Candle and provide the benefits of their talented team’s expertise across our brands and franchises,” read a statement by Candle co-CEOs, Mayer and Staggs.\n\nLaunched in 2014, ATTN: has created original series for Facebook, Instagram, TikTok, YouTube and Twitch, in addition to networks ABC, NBC, CBS, MTV, Freeform and Discovery as well as for streaming services like Hulu and Apple TV. Its brand studio and agency have relationships with companies like Amazon, Ford, Google, Intel, Mattel, P&G, Target and T-Mobile.\n\nThe acquisition offers ATTN: scale, capital and expertise to accelerate its growth, Candle Media said in a press release. ATTN: co-founders Matthew Segal and Jarrett Moreno, along with the existing senior management team, will continue to oversee day-to-day operations, original content, production and studio work, the announcement said.\n\nVariety reports the deal for ATTN: is around $100 million in both cash and stock but could be worth up to $150 million with additional earn-out provisions. Candle confirmed this figure to TechCrunch as well.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBlackstone-backed, L.A.-based Candle Media was founded with an eye on aggregating brands to build an independent media operation — a rarity at a time when most media companies are now running their own streaming services.\n\nIn an interview with Deadline, Mayer explained that Candle’s lack of a streamer was an important part of its strategy, as it believes demand for content itself is going to grow “extremely robustly” in the months ahead.\n\nAfter coming onto the scene last year, the company has been making several high-profile acquisitions, including that of kids content company and “CoComelon” owner Moonbug for $3 billion; “Fauda” maker Faraway Road Productions for somewhere south of $50 million; and Reese Witherspoon’s Hello Sunshine for around $900 million.\n\nThis year, it also took a more than 10% stake in Will Smith and Jada Pinkett Smith’s media company, Westbrook, and was said to be in talks to acquire NFT company Notables.\n\nCandle has also been hiring, having recently added former UTA and Disney execs as its chief development officer and CFO.\n\nThe company says it expects the deal for ATTN: to close in about 30 days.\n\nUpdated, 5/17/22, 5:06 PM ET with confirmation of deal price."}