{"url": "https://techcrunch.com/2025/03/11/baas-startup-synctera-raises-15m-signs-bolt-as-a-customer/", "title": "BaaS startup Synctera raises $15M, signs Bolt as a customer", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Rebecca Bellan", "Kyle Wiggers", "Julie Bort", "Maxwell Zeff", "Sarah Perez", "Marina Temkin", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-11T00:00:00", "text": "The banking-as-a-service space took a hit last year when Synapse collapsed. But that hasn’t stopped BaaS startup Synctera from raising another $15 million in funding, it tells TechCrunch exclusively.\n\nSynctera works to provide companies “of all shapes and sizes with everything they need to launch and operate fintech and embedded banking products,” including: accounts, cards, and payment products, said CEO and co-founder Peter Hazlehurst.\n\nFin Capital and Diagram co-led the Series A extension round, which brings Synctera’s total equity raised since its 2020 inception to $94 million. Other existing investors include Lightspeed Venture Partners, NAventures, Banco Popular, Mana Ventures, Evolution, True Equity, and 1st and Main.\n\nHazlehurst declined to reveal the company’s valuation. As for business fundamentals, he said he expected the latest capital infusion to get Synctera “to breakeven” by early 2026.\n\nThe company saw an 80% increase in revenue and a 230% increase in gross profit year-over-year for its fiscal year ending January 31, according to Hazlehurst. Its 31 customers include one-click checkout company Bolt, Webull, Fruitful, Unified Signal, and Firstcard, among others. Synctera has 416,000 end users on its platform, which Hazlehurst said is up over 3x compared to a year ago.\n\nHe said the company’s biggest differentiator lies in compliance.\n\n“While all of our competitors similarly provide the API layer needed to launch fintech and embedded banking products, Synctera’s key differentiation lies in the tools and infrastructure we offer to customers and banks to manage compliance and ongoing operations,” he told TechCrunch.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPresently, Synctera has about 90 employees, around the same as it has had in the last year. Hazlehurst said he’s proud of the fact the company has been “able to nearly 2x the business without requiring incremental staffing.”\n\nThe company makes money in a variety of ways, including charging monthly platform fees, usage-based fees for ledgers and accounts, transactions, fraud monitoring and KYC/KYB (know your customer and know your business). It also gets a revenue share on interchange and interest on deposits.\n\nAs for the impact of the Synapse collapse, Hazlehurst says the debacle hurt in some ways and helped in others.\n\n“We experienced a number of fintechs coming to us looking for a solution and migration path to a new banking relationship,” he told TechCrunch.\n\n“I have always built with consumers and banks in mind first and foremost. What we witnessed with Synapse and Evolve clearly didn’t follow that approach, which was, and is, horrible to see the massive impact on real people and their money,” he added.\n\nFrom an industry perspective, the whole situation had “a pretty material impact” on new fintechs being able to be funded and new banks coming into the ecosystem, in Hazlehurst’s view.\n\n“It has slowed down and caused a lot more caution in the market as a whole. We certainly see more in-depth due diligence processes with new partners, banks, and customers, which I think is ultimately a good thing for consumers and the industry at large,” he said.\n\nRecently Synctera also inked a strategic partnership with Hawk, a company that uses artificial intelligence to fight financial crimes such as money laundering.\n\nLooking ahead, the new funding will in part go toward expanding its sales team of three as well as toward product development, according to Hazlehurst. The startup also sees a big opportunity to expand in Latin America, where it has seen a lot of demand and has a couple of large customers."}