{"url": "https://techcrunch.com/2025/02/25/quantum-machines-raises-170m-says-its-working-with-more-than-half-of-all-quantum-computing-companies/", "title": "Quantum Machines raises $170M, says it’s working with more than half of all quantum computing companies", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-02-25T00:00:00", "text": "Quantum computing remains a holy grail in the world of technology. But thanks to some important breakthroughs in the last several months, investors are betting on promising startups in the space to make the concept of super-efficient, particle- and electron-based computing a reality.\n\nNow, Quantum Machines, an Israeli startup that provides quantum control solutions to others in the field, has raised $170 million.\n\nLed by PSG Equity with participation from Intel Capital, Red Dot Capital Partners, and existing investors, this all-equity Series C round is one of the biggest funding rounds raised by a quantum computing company to date.\n\nOne reason for the size of the round is because of the startup’s business funnel. Quantum Machines’ technology is now used by more than half of all the companies in the world that are working on quantum computers and quantum computing, according to its CEO, Dr. Itamar Sivan, who co-founded the company with CTO Dr. Yonatan Cohen and chief engineer Dr. Nissim Ofek.\n\n“We serve every category of company in the field,” he said in an interview, “large corporates, startups building quantum computers, national labs globally, and universities.”\n\nQuantum Machines’ hardware may be best known for its traction with customers and partners like Nvidia who want to reduce errors in their own quantum computing research. This is a critical role in the wider ecosystem as researchers get closer to building functional, super-fast quantum computers that do not fall over with high fail rates.\n\nSivan declined to name any of those specific customers — although the list of tech companies backing the startup might be a good hint. However, he noted that its hundreds of clients also include companies that are not owners or developers of quantum computers themselves, but banks and others that are running research on third-party machines, in the cloud, and use Quantum Machines to keep that work on track.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSivan would not disclose the valuation of his startup, but he confirmed it was raised with a “significant uplift” compared to previous rounds. For some more context, when we and others first heard about the round earlier this year, the value was pegged at $100 million.\n\nPrior to this round, the company had raised around $93 million, per Crunchbase data. Valor Equity Partners, Alumni Ventures, Battery Ventures, Samsung NEXT, and Qualcomm Ventures are among its backers.\n\nQuantum computing had a burst of cold wind in January, when Nvidia CEO Jensen Huang made a public prediction that the technology was still “decades away” from being useful (despite his company’s work with Quantum Machines, Google, and others). It was a statement that sent quantum stocks and overall outlook tumbling.\n\nYet, we’ve since seen several positive developments that might pave the way for a different timeline. Sundar Pichai, the CEO of Google — which unveiled a quantum chip it called Willow in December — earlier this month said a realistic time frame for “useful” quantum computers was five to 10 years from now.\n\nMicrosoft followed that up just last week by unveiling its own quantum processor that’s built using what it described as “a new state of matter” called the Majorana particle. The company said it holds promise in building processors that contain 1 million qubits — a thousand times bigger than the typically 1,000 qubit processors being used today.\n\nSome have raised questions about Microsoft’s claims due to a lack of evidence, but it’s still an important development that underscores the work that is being done.\n\nMeanwhile, a number of startups have been raising large rounds. These include Alice & Bob in France raising $104 million and Google-backed QuEra raising $230 million in a debt round.\n\nThere remain question marks over the best approaches in the space. For example, some are building along a few different theoretical trajectories around how to construct processors and the best approaches for addressing errors. But as Sivan points out, this is what makes Quantum Machines effective: Bypassing those questions, it positions itself as agnostic to all those approaches, and as a mediator for reducing noise, both figuratively and literally.\n\nThis is one reason the startup has attracted the investment that is has, said Rotem Shacham, a director at PSG.\n\n“In the last few years the pace of tech breakthroughs in quantum computing have increased significantly,” she said in an interview. “We’re getting closer to end user values. We don’t like to invest decades away. But with Quantum Machines the market is already there.”"}