{"url": "https://techcrunch.com/2024/10/14/european-cyber-insurance-startup-stoik-secures-27-million/", "title": "European cyber insurance startup Stoïk secures $27M", "authors": ["Romain Dillet", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-10-14T00:00:00", "text": "Cyber risk has become an increasingly important issue for small companies around the world. While many companies try to avoid and mitigate cyber risks, they rarely discuss transferring those risks to a third party.\n\nThat’s why Stoïk is stepping in with a cybersecurity insurance product specifically designed for small- and medium-sized businesses. The French startup recently raised a €25 million Series B round (around $27 million at current exchange rates).\n\nIn many ways, Stoïk follows in the footsteps of companies like Coalition and At-Bay. However, instead of selling its insurance products to U.S.-based companies, Stoïk focuses exclusively on European companies.\n\nOnce insured by Stoïk, businesses are covered against cybersecurity-related claims. For instance, if a company needs to halt production or temporarily close due to a cyber incident, Stoïk can compensate for loss of revenue (gross operating margin) during that period.\n\nStoïk currently covers companies with annual turnover of €750 million or less and offers coverage limits of €7.5 million. At present, the company operates in France, Germany, and Austria.\n\nThe startup chose this particular vertical because cyber insurance is more complex than other types of insurance products. Stoïk has also built a small in-house crisis management team to respond to incidents and assist with data recovery and crisis communication.\n\n“Since the beginning of the week, we’ve had a dozen attacks on our portfolio, including a major one,” co-founder and CEO Jules Veyrat told TechCrunch last week. “We have people mobilized in the Lyon region for a ransomware attack that brought an industrial company to a standstill.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhen customers sign up, they receive an overview of their cyber risk exposure. The startup monitors DNS records and scans online databases for password leaks associated with the customer’s domain name. Stoïk can also perform internal scans to recommend changes to cloud and active directory configurations.\n\n“Our thesis is that we’re going to insure companies. On top of that, we’re going to help them better protect themselves against cyberattacks. That way, they’re happy, they get more for the same price, and we’re happy, because we have policyholders who are well protected, and therefore have fewer claims than others,” Veyrat said.\n\nStoïk still has some similarities with the broader insurance industry — it has to ensure it doesn’t accept too many bad apples in its portfolio of clients, as it could significantly impact the company’s loss ratio.\n\n“The insurers’ job is to select the risk. So, who do I accept and under what conditions? How well do they understand cyber?” Veyrat said. “In other words, am I willing to take on a €50 million industrial company that has no offline backup strategy? This is just an example, but these are the questions we ask ourselves every day.”\n\nStoïk acts as a managing general agent (MGA), meaning that it works with insurance and reinsurance companies so that they cover the risks. Stoïk gets to create its own rates, products, and policies — but it outsources the risk to bigger insurance companies.\n\nOne such partner is Tokio Marine HCC International, which is the only new investor in the Series B funding round. Existing investors also invested in the round. Alven is leading the Series B with Andreessen Horowitz, Munich Re Ventures, Opera Tech Ventures, and Anthemis also participating.\n\nStoïk doesn’t sell its insurance products to its customers directly. Instead, it works with third-party insurance brokers that already have a relationship with SMBs. So far, Stoïk has attracted 1,000 insurance brokers.\n\nBy the end of 2024, Stoïk should have 5,000 policyholders. It currently represents €25 million in premiums and plans to ramp up customer signups in the future. The startup expects to expand into a new country every year starting with a new European market in late 2024 or early 2025."}