{"url": "https://techcrunch.com/2022/04/27/mavrck-raises-135m-buys-linkin-bio-maker-later-in-creator-and-influencer-marketing-consolidation/", "title": "Mavrck raises $135M, buys Later", "authors": ["Ingrid Lunden", "Europe Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-04-27T00:00:00", "text": "Some believe that online marketing and advertising, as we largely think of them today, are dying a slow death and is getting replaced by something else: the rise of the influencer/creator. Today, one of the companies hoping to make a killing on that shift is announcing some funding and an M&A move to cement its place in that new economy.\n\nMavrck, which operates a platform for brands and media companies to source and engage with influencers for marketing campaigns, has raised another $135 million, and with some of that it’s scooping up Later, a startup that first made its name with a social media scheduling tool for Instagram (its original name was Latergramme), but has since diversified into other social platforms like Pinterest, TikTok and LinkedIn, a Linkin.bio service, and analytics for the creator to track engagement and other metrics.\n\nThe Linkin.bio service alone is an interesting asset to pick up: Linktree, a big competitor in that space, just last month raised $110 million at a $1.3 billion valuation. (The financial terms of the Later acquisition are not being disclosed.)\n\nCanadian startup Later hadn’t raised much money (less than $2 million, per Crunchbase) but it was already an influence in the influencer world: it’s been around since 2014, and the Linkin.bio service (launched in 2016) has seen 2 billion+ pageviews, with nearly 7 million creators and small business using Later’s wider product suite for social content scheduling and analytics. Mavrck for its part says that it works with some 5,000 marketers across 500 consumer brands to connect with some 3 million creators, paying out over $200 million to date.\n\nMavrck and Later will operate independently for now but there will also be more integration: for a start, the Linkin.bio click/engagement analytics will now appear in the Mavrck dashboard.\n\nThis latest equity investment is coming from a single investor, Summit Partners, which also was the sole investor when Mavrck raised $120 million only four months ago, in December last year. That and Linktree’s valuation both speak to how heated the so-called creator economy is right now, although Mavrck isn’t adding more fuel to that fire by disclosing its own valuation today.\n\nLike it or not (and despite the viral buzz that sometimes feels inescapable, many do not) the creator economy is a fascinating force in the world of marketing, social media and, to be honest, the consumer internet overall. Social media platforms, both those that are mainstream but also a lot focusing on particular interests or demographics, collectively have billions of users now (over 4.2 billion), and some argue they are the engine of the consumer internet today.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBut what drives those social platforms? Sometimes it’s engaging with friends, but increasingly it’s getting a look into lives of people who you don’t really know at all, who create content that’s entertaining or thought-provoking, or annoying but engaging anyway. They become the glue for how people use services like Instagram. Your friends might not post all the time, or be that interesting, but you can always count on following some key and reliable creators to keep the timeline humming, and when you don’t have that worked out already, Instagram (or another platform) is ready and willing to suggest content and people to follow.\n\nThat in turn becomes prime real estate for marketing and advertising — not least at a time when more standard advertising and marketing formats are under the gun over how data is tracked across the internet. People have gotten less happy about all that tracking, and regulators have followed; opting out of it all is possible in many (not all) places but that then means the format is less valuable for the ad buyers and publishers. Strategic placement of products or services with influencers, however, circumvents all that.\n\nIt is for this reason that Mavrck and companies like it believe that while some adtech and martech plays will look to incorporate more tools on their platforms, to help media buyers engage with that enconomy as part of their bigger spend, it’s likely to be a big enough opportunity financially — and operationally and culturally — to remain a salient enterprise.\n\n“The creator economy is growing fast enough that it will be a standalone solution,” CEO and co-founder Lyle Stevens said in an interview. He noted that the overall space has grown more than 40% in the last year and that while there are some 50 million creators out in the world today, they project around 1 billion people will identify as creators by 2030. “The majority of the middle class will be creators and they will be the focal point,” he added. “For brands, [connecting with them] won’t be a nice to have but a necessity to stay relevant.” Brand spend on average has gone up by 114% since 2020, he noted, another proof point of the growth.\n\nThat will also inevitably spill out beyond social, too, which may well also find itself over time potentially also falling out of vogue. (Hard to believe but you never know.) Stevens sees currents in VR, for example, “will change the landscape dramatically.” We’ve also seen multiple startups targeting creators with the ability to build gaming experiences as another area where creators may extend their own brands and influence.\n\n“We’ve built a phenomenal platform designed to help small businesses and entrepreneurs to manage their digital marketing, commerce, and customer relationships all in one place. Our notable scale is a result of the commitment we’ve placed on our role within that ecosystem,” said Roger Patterson, co-founder and CEO of Later, in a statement. “Later’s leading technology paired with Mavrck’s enterprise social proof platform will expand on that value even further. Together we’ll nurture a symbiotic relationship between creators and brands, helping both to drive meaningful results to grow their businesses.”\n\n“Together, we believe Later and Mavrck can empower both sides of this ecosystem – content creators and the brands that seek to harness their influence – with solutions and at a scale not yet seen in the creator economy,” added Michael Medici, MD at Summit Partners. “We look forward to working with Lyle, Roger and the entire team in their mission to solve a significant industry pain point for creators and marketers – and ultimately drive better business outcomes for both.”"}