{"url": "https://techcrunch.com/2024/01/18/four-startup-fundamentals-to-help-avoid-epic-product-fails/", "title": "4 startup fundamentals to help avoid epic product fails", "authors": ["Prashant Mahajan", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-01-18T00:00:00", "text": "Anyone mad enough to launch a new product already knows the stats surrounding product failure. According to Harvard Business School professor Clayton Christensen, over 30,000 new products are introduced yearly, and 95% fail.\n\nHowever, even the 5% don’t always hit their mark, with many not doing precisely what customers need and others failing to meet their target KPIs. We call it the product death cycle, a repetitive cycle that emerges when, despite listening intently to customers and diligently building the features they ask for, products still struggle to gain traction.\n\nIt’s an all-too-familiar scenario familiar to many product experts, and the irony is that most product experts are doing exactly what they’ve been taught: listening to their customers.\n\nOn the bright side, the vicious product death cycle doesn’t need to repeat itself. There are ways companies can better understand their customers’ pain points to develop the right products that solve the right problems at the right time. It’s about understanding the core fundamentals.\n\nMake sure you’re solving the right problem\n\nRegarding product design and development, solving the right problem might seem obvious. We’ve all heard of a solution for a problem — look at the Segway transporter device. However, the reality is that successful products and services succeed because they solve a specific problem that is well demonstrated. The challenge is really and truly understanding customer pain points.\n\nI found this in my startup’s early days: We were engaged by a division of a large multinational company. As a young, motivated startup, it was a dream customer, and we dove in headfirst to build an excellent product for them. But after we’d developed the solution, they wanted something else because they felt their priorities had changed.\n\nI think it’s something many startups can empathize with — you get a contact at a great company, and they tell you their problems. You build a product or solution to solve that problem, but it doesn’t work out as planned.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhat often transpires is that the company realizes too late that its product needs to be solving the right problem or that the product doesn’t quite hit the mark. It may have, for example, a 20% adoption rate when the company was aiming for 80%. Or, the company may misunderstand where they are going wrong internally.\n\nUnderstand the variables involved in executing everything well\n\nExecuting everything well is about more than just the product and overall experience. Execution isn’t one big thing, but lots of small things all coming together. The current economy, people, the market, and the industry situation are out of your control. However, product development, marketing, sales, and customer support are not. All elements must fit together and all are equally important.\n\nToo often, when something doesn’t work out, you hear of product blaming marketing, or sales blaming the product, or someone will blame what’s happening in the world. But it’s never just one thing — everything works together to create a great overall experience.\n\nStay in for the long haul\n\nThis ties in with the final fundamental aspect needed to avoid failure: great timing. This is the hardest to get right. There have been so many products that solved the right problem and were almost perfectly executed but lacked the right timing.\n\nGoogle Glass is an excellent example of this, and I often wonder whether companies that are successful now, such as Uber and Airbnb, would have achieved the same success if they had launched earlier. And then there’s Netflix, which was operating for years before becoming a household name, all thanks to the technology infrastructure needed to deliver high-quality streaming becoming available.\n\nStop guessing and use the AI available to you\n\nThe good news is that AI and data-driven initiatives can help companies move on from guesswork to avoid product failures. While AI’s predictive abilities may help in the long run, the more tactical, hands-on, data-driven analytics side of things will help in the initial transition.\n\nAI functionality, such as sentiment analysis, can help companies better understand what their customers’ real needs are. Natural language processing is also available to help product managers understand customers’ feelings. Machine learning can help to process market trends and customer needs.\n\nAI will also help product teams better measure what success looks like. In the best-case scenario, they can improve on a successful product foundation. In the worst case, it means they pinpoint micro failures faster and pivot more agilely before too much time and resources are wasted. Either way, AI can help to make more informed product decisions. The tools are there for companies to learn how to leverage and apply them meaningfully to understand what their customers want and need."}