{"url": "https://techcrunch.com/2021/04/27/materials-zone-raises-6m-for-its-materials-discovery-platform/", "title": "Materials Zone raises $6M for its materials discovery platform", "authors": ["Frederic Lardinois", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-04-27T00:00:00", "text": "Materials Zone, a Tel Aviv-based startup that uses AI to speed up materials research, today announced that it has raised a $6 million seed funding round led by Insight Partners, with participation from crowdfunding platform OurCrowd.\n\nThe company’s platform consists of a number of different tools, but at the core is a database that takes in data from scientific instruments, manufacturing facilities, lab equipment, external databases, published articles, Excel sheets and more, and then parses it and standardizes it. Simply having this database, the company argues, is a boon for researchers, who can then also visualize it as needed.\n\n“In order to develop new technologies and physical products, companies must first understand the materials that comprise those products, as well as those materials’ properties,” said Materials Zone founder and CEO Dr. Assaf Anderson. “Understanding the science of materials has therefore become a driving force behind innovation. However, the data behind materials R&D and production has traditionally been poorly managed, unstructured, and underutilized, often leading to redundant experiments, limited capacity to build on past experience, and an inability to effectively collaborate, which inevitably wastes countless dollars and man-hours.”\n\nBefore founding Materials Zone, Anderson spent time at the Bar Ilan University’s Institute for Nanotechnology and Advanced Materials, where he was the head of the Combinatorial Materials lab.\n\n“As a materials scientist, I have experienced R&D challenges firsthand, thereby gaining an understanding of how R&D can be improved,” Anderson said. “We developed our platform with our years of experience in mind, leveraging innovative AI/ML technologies to create a unique solution for these problems.”\n\nHe noted that in order to, for example, develop a new photovoltaic transparent window, it would take thousands of experiments to find the right core materials and their parameters. The promise of Materials Zone is that it can make this process faster and cheaper by aggregating and standardizing all of this data and then offer data and workflow management tools to work with it. Meanwhile, the company’s analytical and machine learning tools can help researchers interpret this data."}