{"url": "https://techcrunch.com/2022/12/12/beamery-the-all-in-one-talent-management-platform-becomes-a-unicorn/", "title": "Beamery, the all-in-one talent management platform, becomes a unicorn", "authors": ["Kyle Wiggers", "Ai Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-12-12T00:00:00", "text": "HR organizations are faced with a widening skills gap, economic headwinds and changing expectations around work. It’s no surprise, then, that burnout and exhaustion are widespread in HR, with one survey finding that 42% of teams are struggling under the weight of too many projects and responsibilities.\n\nChange starts with personnel and management, some might argue. Others leaning more technoutopianist might proffer HR tech as a solution. While there’s a fair amount of dissatisfaction with HR tech vendors (at least according to some data), to be fair to the tech-positive crowd, many companies see real value in HR tech. According to a recent Sapient report, over half of businesses with more than 500 employees plan to increase HR tech spending by an average of 21% into the coming year.\n\nOne beneficiary of that increased spending is London-based Beamery, a startup developing a talent lifecycle management platform. Beamery today announced that it raised $50 million in a Series D round that values the company at $1 billion, bringing the company’s total raised to date to $228 million.\n\nTeachers’ Ventures Growth (TVG), a part of the Ontario Teachers’ Pension Plan, led the round. “I believe Beamery is well-placed to win because it provides a solution that you can rely on through different economic cycles,” TVG’s Avid Larizadeh Duggan said in an emailed statement. “Beamery is helping the world’s largest employers with this talent agility, and allowing them to unlock the potential of their workforce.”\n\nCertainly, Beamery gained impressive traction this year, growing the size of its customer base to “hundreds” of enterprises and over 25,000 users. Revenue from Fortune 500 clients rose by over 250% compared to June 2021, when Beamery closed its Series C round, according to the company, while net retention grew to 135%.\n\n“Beamery’s … talent lifecycle management platform gives organizations, such as General Motors, VMWare and Johnson & Johnson, the intelligence they need to make the right decisions about their workforce and supports them through each stage of the talent lifecycle – from recruiting to talent mobility and development to upskilling,” Beamery CEO Abakar Saidov told TechCrunch in an email interview. “The new funding will support continued investment in our platform and tech capabilities and help to build out global sales footprint.”\n\nBeamery was founded in 2013 by Saidov and his brother, Sultan Saidov, along with Mike Paterson. The Saidov brothers say their vision for Beamery had it origins in their experiences as children of immigrants, when they became aware of the structural challenges associated with work. Paterson was previously an analyst at Morgan Stanley, while the Saidov brothers worked at Goldman Sachs — Abakar as a commodities trader and Sultan as a mergers and acquisitions analyst.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nFounded as Seed Jobs, Beamery uses AI to identify potential job candidate matches for open roles. Like many candidate-vacancy matching platforms, Abakar Saidov says that Beamery ranks skills based on the industry a company’s hiring for and a candidate’s relevant work experiences.\n\n“Beamery uses [AI] in our talent lifecycle management platform to give companies the intelligence they need to plan for business needs and gaps, understand the skills and capabilities they have and attract, retain, upskill and redeploy their workforce successfully,” Abakar Saidov said. “[O]ur models are not meant to replace humans; instead, they give relevant information to human decision makers to make better decisions.”\n\nGiven the increased scrutiny over candidate-recommending AI systems, Abakar Saidov was quick to note that Beamery shows how various factors, including skills, seniority, proficiency and industry, influence its recommendations and to what degree. Beamery is among the vendors that could be subjected to a New York City regulation — the Automated Employment Decision Tools law, set to go into effect in January — that would ban employers from using AI hiring tools unless a bias audit can show they won’t discriminate.\n\nAbakar Saidov says that Beamery recently completed a third-party audit for bias in its AI capabilities, which involved “rigorous testing” of the platform’s machine learning models. (Abakar Saidov didn’t proactively share a copy of the report with TechCrunch; we’ve requested one.) The company also partnered with Parity AI, a startup led by AI ethicist and activist Liz O’Sullivan, to audit the platform on an ongoing basis.\n\n“Within the Beamery … platform itself (i.e. in the application layer), a key differentiator for us is helping customers ensure their own compliance with the myriad of global personal data and privacy standards,” Abakar Saidov said. “We achieve this primarily through the preference center, which lets candidates control their consent, whether and how companies can contact them and control how AI is used against their profile.”\n\nBeamery doesn’t exist in a vacuum, of course. Competitors in the HR tech software space include 15Five, which raised $52 million in July for its talent management solution. There’s also Gloat, a well-capitalized startup building AI-powered internal jobs marketplaces. Eightfold is among the most formidable, with an over-$2-billion valuation and backing from SoftBank’s Vision Fund 2, General Catalyst and Lightspeed.\n\nBroadly speaking, VCs have shown a willingness to put money behind HR tech startups even as other segments underperform. According to an analysis from WorkTech, the first half of this year saw the second-largest global work tech investment, surging to $9.4 billion, with $4.6 billion invested in Q2 alone.\n\nDespite layoffs in the tech industry, job growth has remained resilient despite the economic headwinds, driving demand for HR tech — and spawning new vendors as a result.\n\nTo stay ahead, since its Series C, Beamery has doubled down on analytics capabilities, Abakar Saidov says — introducing a dashboard designed to enable companies to better understand their workforce by aggregating skills data across disparate HR systems and tools. The platform also recently rolled out a portal for candidates that provides recommendations for jobs as well as skills they might need to develop to further their careers in their chosen industry. And, as an outgrowth of its acquisition of internal HR sourcing platform Flux, Beamery launched Beamery Grow, which Abakar Saidov describes as a “talent marketplace solution” to help employees gain new skills and connections from within their organizations.\n\n“We are prioritizing enhancements that will let customers quickly and easily leverage their talent data for things like agile workforce planning, as well as ensuring they have real-time intelligence and insights around their current and future workforce allocation, the skills that exist in their organization relative to their business outcomes and their achievement of diversity, equity and inclusion targets,” Abakar Saidov said. “The capabilities that a company will need over the next ten years are in many cases very different from today, and therefore HR tech solutions need to be able to help businesses build, buy or borrow the skills they need to build a future fit workforce.”\n\nBeamery currently has 417 employees. When asked about hiring plans, Abakar Saidov said they’re “in development.”"}