{"url": "https://techcrunch.com/2025/04/14/marshmallow-the-uk-insurance-startup-for-migrants-raises-90m-at-a-2b-valuation/", "title": "Marshmallow, the UK insurance startup for migrants, raises $90M at a $2B+ valuation", "authors": ["Ingrid Lunden", "Europe Editor", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-14T00:00:00", "text": "U.K. startup Marshmallow has blown up over the years by using innovations in data science to build car insurance policies for immigrants and other consumers who have been overlooked or priced out of traditional insurance. Now, with a million drivers insured and a profitable annual revenue run rate of $500 million, Marshmallow has raised a fresh $90 million to expand.\n\nMarshmallow plans to use the funding to move into financial services, as well as more insurance products that it hopes will appeal to a population of people that — despite the chilling effects of Brexit — is growing.\n\n“We think of migration as a huge opportunity,” CEO Oliver Kent-Braham said in an interview. He noted that in the U.K., there are more people coming out of the workforce than there are going in, with 1.2 million migrants recorded coming to the U.K. in 2024 alone. “We need migration to put more people into work, and we want to help people move and integrate into the U.K.”\n\nIn Marshmallow’s view, that integration comes with being able to drive your own insured vehicle and soon, the startup hopes, buying home insurance and taking out loans.\n\nMarshmallow plans to launch its first lending product later this year, Kent-Braham said, en route to building a “one-stop shop” for everything financial and insurance that a new arrival to the U.K. might need to adjust to life.\n\nThis round is roughly split 50-50 between equity and debt, according to Kent-Braham, and it is coming at a valuation of just over $2 billion. To put that into context, Marshmallow last raised funding at $1.25 billion in 2021.\n\nThe startup has seen considerable growth on the business front in that time. In 2021, Marshmallow had insured just 100,000 people. Now, in cities like London, the one-million insured number is bolstered with a pink outdoor ad campaign that is hard to miss.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPortage Capital is leading the round, with participation from BlackRock and Columbia Lake Partners. Previous backers of the company have included Passion Capital, Investec, and Scor. Marshmallow has raised around $220 million to date.\n\nNotably, the new round has been in the works since at least January, and Kent-Braham noted that one part of the equity was convertible debt raised in 2023.\n\nMarshmallow’s funding is coming at a complex moment for insurance startups in Europe.\n\nOn one side, there is the grim story of WeFox.\n\nBacked by SoftBank, Omers, Salesforce, and dozens of others, WeFox’s valuation rose to as much $4.5 billion by 2023. Just two years later, after years of losses and complications in its distributed/broker-based business model, WeFox has fallen on hard times. The company has been selling off parts of its business and picking up lifeline financing to stay afloat.\n\nYet there are also some brighter signs of insurtech startups building more sustainable businesses. And those that can demonstrate a strong technology story are getting attention from investors.\n\nJust last week, Ominimo — a new startup out of Poland — picked up a major strategic investor that invested $10 million at a valuation of over $200 million. It was Ominimo’s first time raising outside money after becoming profitable while bootstrapped. Like Marshmallow, the startup started off with car insurance and is rethinking actuarial formulas and using AI to make new inroads into risk prediction.\n\nImage Credits:Marshmallow\n\nWhile data science and AI are quickly becoming table stakes for insurance startups, there are other details about Marshmallow that set it apart from the pack — and even some of its bigger competitors (like the price-busting mega-retailer Tesco).\n\nThe ideas of inclusivity and diversity that underpin how Marshmallow is approaching its target customer base run deep at the startup.\n\nKent-Braham co-founded London-based Marshmallow with his identical twin, Alexander, and David Goaté. The twins really do look a lot alike. “You could actually be talking to Alexander right now!”, Oliver joked when we spoke for this story. More seriously, though, the startup is an underrepresented rarity in another way, too.\n\nIt is one of what appears to be only two “unicorn” startups in the U.K. from a Black founder, the other being WorldRemit. The statistics are not hugely encouraging outside the U.K. either; one 2024 study found that across the U.K. and the U.S., only 3% of startups with valuations of over $1 billion have Black founders.\n\nAt a time when diversity, equity, and inclusion programs are being dismantled in the U.S., it’s notable that Marshmallow’s investors see particular strength precisely because of its diverse leadership.\n\n“This is a very strong founding team,” Devon Kirk, GP and co-head of Portage Capital Solutions, said in an interview. “We think that financial services benefits from different perspectives and leaders coming up with innovative solutions to address those needs.”"}