{"url": "https://techcrunch.com/2024/01/24/soon-youll-be-able-to-play-dungeons-dragons-in-vr-if-you-want/", "title": "Soon you’ll be able to play Dungeons & Dragons in VR . . . if you want", "authors": ["Amanda Silberling", "Senior Writer", "Kyle Wiggers", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-01-24T00:00:00", "text": "Wizards of the Coast and Resolution Games have announced their collaboration to bring Dungeons & Dragons to virtual reality.\n\nThe decades-old tabletop role-playing game has become increasingly popular over the last several years, in large part due to third-party content creators like Critical Role and Dimension 20, in which ensemble casts play D&D to create a compelling story for an audience. The franchise also made a splash this year with a Hollywood film and the hugely successful Baldur’s Gate 3, a video game that licenses Dungeons & Dragons IP.\n\nResolution is known for its game Demeo, which re-creates the tabletop gaming experience digitally, whether that’s on a VR headset, like the Meta Quest or the Apple Vision Pro, or just on an iPad.\n\nThe details of the deal aren’t apparent — is Wizards just licensing the IP, or working with Resolution? — but it continues Wizards’ trend of bringing Dungeons & Dragons away from the table and into digital media. It’s also not clear whether this is a platform for players to connect with their friends to play D&D through VR, or if they’re telling a whole new story, like the “Honor Among Thieves” film. But in trailers for Demeo, it seems that players are quite literally using VR hand-tracking to play cards and paint virtual miniatures, so perhaps the collaboration will be more like a virtual tabletop than a single-player story game.\n\nIt’s common for people to use platforms like Foundry and Roll20 to play D&D with non-local friends, and Baldur’s Gate was a hit, but . . . are we really trying to eldritch blast our enemies in VR? D&D sessions usually extend for two to three hours (or longer, if you’re extra dedicated), and even when you’re having a great time with your pals, your attention can waver a little bit. Does anyone really want to wear a headset for a whole D&D session?\n\nThe news comes shortly after mass layoffs hit Hasbro, Wizards’ parent company. In the division of the company that runs Wizards and digital gaming, revenue is up 40% year over year to $423.6 million, netting a $203.4 million operating profit; overall, however, Hasbro’s revenue is down 10%. Even though Wizards has been thriving, its department at Hasbro was not spared from layoffs."}