{"url": "https://techcrunch.com/2024/10/29/gmi-cloud-secures-82m-in-series-a-for-its-gpu-cloud-infrastructure/", "title": "GMI Cloud secures $82M in Series A for its GPU cloud infrastructure", "authors": ["Kate Park", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-10-29T00:00:00", "text": "The AI boom has spurred massive demand for graphics processing units (GPUs). As many enterprises seek to integrate AI technology into their systems, providers of GPU infrastructure are helping businesses get access to the chips they need.\n\nIn the latest development, GMI Cloud, a San Jose-based startup that provides GPU cloud infrastructure, has raised an $82 million Series A led by Headline Asia with participation from strategic investors such as Banpu, a Thailand energy firm, and Wistron, a Taiwan-based electronics company. Banpu will offer power to GMI Cloud, while Wistron will co-develop products with the startup. The company’s strategic partnerships boost its capacity to satisfy the increasing worldwide need for GPU resources, founder and CEO of GMI Cloud Alex Yeh told TechCrunch. The investment round, bringing its total raised capital to $93 million, consists of $15 million in equity and $67 million in debt financing.\n\nThe outfit, launched in 2022, started as a data center that focused on providing Bitcoin computing node services. Yeh said in an exclusive interview with TechCrunch that he noticed growing demand for GPU computing power from investors and clients, and shifted the company’s focus to AI cloud infrastructure in response.\n\nThe 2-year-old startup already serves dozens of clients, including those in the healthcare, research, and telecom industries, Yeh said. The corporation plans to utilize the newly acquired funds to establish a new data center in Colorado. This facility will be essential for expanding its capacity in North America and complementing its existing data centers in Taiwan, Thailand, and Malaysia. It also aims to increase its workforce to 60 to 70 staff by the end of the year. The startup has 35 staff in Asia and 18 in the U.S.\n\nA recent McKinsey report predicted that artificial intelligence could contribute around $13 trillion to the economy by 2030, with the industrial sector expected to account for about $1 trillion of that total. The market size of global AI is expected to reach $1.8 trillion by 2030, per a report by Grand View Research.\n\nGMI Cloud isn’t the only GPU cloud provider. It competes with CoreWeave, Nebius, Google Cloud’s Vertex AI and Big Tech firms. Yeh told TechCrunch that GMI Cloud distinguishes itself from competitors by providing distinctive features such as customized private cloud services and built-in support for Nvidia NIM, which simplifies integration with Nvidia hardware and software. He also noted that the company has a group of top-tier AI engineers and high-performance computing (HPC) experts with experience at Google X, Alibaba Cloud, and Supermicro.\n\n“[Our] team has over 20 years of AI and HPC experience,” Yeh said, boasting 33 AI patents and extensive experience building large-scale distributed systems. “GMI also offers professional AI consulting services, guiding enterprises on model training, fine-tuning, and scaling, which competitors rarely offer.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nGMI provides a cost-effective solution that delivers optimized performance and resource management compared to competitors, supporting businesses through end-to-end solutions from GPU hardware to AI applications, Yeh highlighted.\n\n“[On top of that], we hold a significant supply chain advantage by sourcing directly from manufacturers, which allows us to maintain cost efficiency and a highly secure supply chain,” Yeh continued. “Uniquely, GMI is also the only Nvidia-certified cloud service provider in Taiwan under the NCP/NPN program, further solidifying its competitive edge in offering premium cloud services.”"}