{"url": "https://techcrunch.com/2020/06/18/despite-pandemic-setbacks-the-clean-energy-future-is-underway/", "title": "Despite pandemic setbacks, the clean energy future is underway", "authors": ["Roger Duncan", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block", "Margin-Top Flex Font-Size Var"], "publication_date": "2020-06-18T00:00:00", "text": "The economic lockdown resulting from the coronavirus pandemic has had an immediate negative impact on renewable energy projects and electric vehicles sales, but the sustainable trends are still in place and may even be strengthened over the longer term.\n\nFor the first time in four decades, global installation of solar, wind and other renewable energy will be less than the previous year, according to the International Energy Agency, which is projecting a 13% reduction in installations in 2020 compared to 2019. Woods Mackenzie projects an 18% reduction for global solar installations in 2020. Morgan Stanley is projecting declines in U.S. solar PV installations from 48% in second quarter to 17% in the fourth quarter of 2020.\n\nThis is due to a combination of construction delays, supply chain disruptions and a capital crunch.\n\nInstallation of rooftop solar has been hit particularly hard. Access to homes and businesses was generally halted in March 2020 for several months. Installers have indicated that as much as half the workforce had to be furloughed. The supply chain was also disrupted as PV manufacturing in China was temporarily suspended. Installations and the supply chain will resume, and most contracts are still in place, but the robust projected growth in rooftop PV for 2020 will not be met, and it may take more than a year to catch up. Also, some businesses that planned installations may have higher priorities for cash and investment now as they reopen. Many of the small businesses planning solar installations may not return at all.\n\nOn the other hand, utility scale electricity generation from renewable energy continues to grow and take market share. In the first part of this year, renewable energy has produced more electricity than coal for the first time since the late 19th century, when hydropower started the power industry. Wind and solar are the cheapest alternatives for new electric generation in the U.S. The pandemic and collapse in oil prices will not change that. The closure of coal plants has been accelerating this year, and wind and solar will continue to be competitive with gas.\n\nFurthermore, most solar and wind farms were already financed and construction underway in rural areas not affected by the lockdown. About 30 GW of new solar capacity have already been contracted, and as long as interest rates remain low, financing should not be a problem. In fact, many solar and wind projects in the U.S and China are rushing to completion this year to qualify for government incentives.\n\nBut supply chains for utility scale renewables were still disrupted. Solar panel manufacturing in China was halted during the first quarter and has now reopened, but facing reduced orders. At one point, 18 wind turbine manufacturing facilities in Spain and Italy were stopped while social distancing and sanitation measures were put in place. Mining operations in Africa and other countries were also temporarily halted and now face reduced demand.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe replacement of oil and gas electricity generation with renewables in developing countries is not going to seem as attractive as a few years ago. Emerging economies need to expand electricity as cheaply as possible, which means coal, gas and even diesel plants. New fossil fuel plants in developing nations could lock in carbon emissions for years.\n\nElectric vehicle sales globally have also been severely impacted. The transition to electric vehicles takes place as people purchase new vehicles. The price of oil has collapsed, used-car prices are dropping and unemployment has soared to levels not seen since the Great Depression. Cheap gas, cheap cars and high unemployment will dramatically lower the expectations for multipassenger EV sales in 2020. Wood Mackenzie has projected a 43% global decline in EV sales in 2020 from 2019. Furthermore, many new electric models from the automakers are not expected until 2021.\n\nHowever, the long-term transition to EVs will continue and may even accelerate. It still costs less to drive a mile on electricity compared to gasoline, and when the upfront cost of electric vehicles becomes competitive with internal combustion vehicles in a few years, the market should quickly move to EVs. Now that the battery range is adequate for the average driver, the last barrier seems to be the availability of fast charging stations between cities.\n\nBefore the collapse in oil demand this year, the oil majors were expecting peak oil demand to occur sometime during the 2040s. Now peak oil demand is expected earlier, perhaps in the mid-2020s. Some even think that 2019 might turn out to be the highest level of oil consumption historically. At any rate, it seems that it will be at least a few years until the 2019 levels are reached again, if ever.\n\nHowever, the recent collapse in oil prices means the oil and gas industry will be able to supply fuel at very competitive prices for decades. This will at least make it more difficult for electric vehicles to take market share in the short term, and very difficult for alternative liquid fuels to be competitive. For biofuels and synthetic fuels, it seems to be a repeat of earlier decades when cheap oil crushed those industries. Replacing gas and diesel-powered cars is certainly going to be unattractive in the impoverished economies of developing nations.\n\nBut there are also bright spots for clean transportation alternatives emerging. Electric bicycles, for example, are a hot item. As people look for alternatives to mass transit and want something to move outdoors in the fresh air, electric-assisted bikes are a great solution and are no longer looked down upon as a vehicle for older (or lazy) cyclists.\n\nTelecommuting struggled for years to take hold, but the pandemic seems to have finally changed that. The recent national lockdown has spurred many large businesses to set up their employees to work from home. They have found that it works fairly well, and many will not return to packed downtown offices.\n\nSeveral experts have cited the potential for cleaner energy alternatives because the public is seeing cleaner air and the environmental benefits of a 30% reduction in daily oil consumption. Some consumer surveys have indicated a greater interest in electric vehicles.\n\nThere is certainly the hope that we will take the opportunity to revive the economy with cleaner technologies than before the lockdown. However, the reality is that workers and businesses need to start up again with the infrastructure they have, and investment in cleaner technology requires capital. Since many business operations are struggling to find cash and loans to just remain open, new clean technology may be delayed.\n\nYet the major infrastructure changes for a sustainable future are well underway. Solar and wind are rapidly replacing fossil fuels for electricity. Automakers and governments are committed to electrification of the transportation sector. The pandemic may be a near-term obstacle, but the transition to a sustainable economy is just delayed and may even be accelerated in the coming years."}