{"url": "https://techcrunch.com/2023/10/27/sample-series-a-pitch-deck-aether/", "title": "Pitch Deck Teardown: Aether’s $49M Series A deck", "authors": ["Haje Jan Kamps", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-10-27T00:00:00", "text": "Aether’s pitch deck is a real head-scratcher. The company says that it raised almost $50 million to “extract lithium from previously inaccessible reserves.” That makes sense: Lithium is a valuable, hard-to-get resource that is being used by the bucketload in batteries and other electronics. But the pitch deck relegates this use case (which is the smallest opportunity in the deck) almost to footnote status.\n\nIt makes for some really interesting reading and storytelling, so let’s dive in and see if we can spot what happened and how.\n\nWe’re looking for more unique pitch decks to tear down, so if you want to submit your own, here’s how you can do that.\n\nSlides in this deck\n\nCover slide Mission statement slide Vision slide Solution slide 1 Solution slide 2 Product slide Value proposition slide Potential use cases slide Technology challenges slide Competitive advantage slide Traction slide Results slide Go-to-market strategy slide Technology advantage slide Scaling slide Target markets slide Product lines overview slide Product line 1 slide Product line 2 slide Product line 3 slide Summary slide Ask and use of funds slide Thank you slide\n\nThree things to love\n\nI’ll be honest here: I don’t really understand what the company does. Perhaps I’m just not deep tech enough to fully appreciate how biotech works. On the other hand, I’m firmly of the opinion that if you can’t explain your business to a five-year-old, there’s something wrong with your storytelling.\n\nStill, Aether did get a few things right.\n\nA bold setup\n\nStraight out of the gate on slide 2, the company plants the seed for a huge vision:\n\n[Slide 2] Setting up a bold vision for the future. Image Credits: Aether Bio\n\nIf there’s anything you could put on a slide to catch my attention, this would be pretty high on the list. Yes, I do want to imagine that future. There’s a risk here, of course: Is the company going to be able to fulfill the promise it makes?\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nHella competitive advantages\n\nI caveat this by saying that I don’t really know what the existing technologies are, and if I were looking at this deal more closely, I’d have to talk to a bunch of industry experts to see how these types of datasets are currently generated. On face value, however, this slide is impressive:\n\n[Slide 7] If true, I wouldn’t want to be Aether’s competitors. Image Credits: Aether Bio\n\nAny company that can genuinely show it is 20x faster and 1/10th of the price per sample, and 1/50th of the initial investment of existing technology is flashing a huge, neon “disrupting the industry” sign alongside its pitch. Again, I’d want to verify the claims, but this will absolutely capture my attention.\n\nAddressing the challenges head-on\n\nThe little I do know about companies in this space is that there are tremendous challenges involved with bringing synthetic bioproducts to market. It’s refreshing to see Aether address some of those challenges head-on.\n\n[Slide 13] “Yeah, we know this is hard, but here’s how we are mitigating the issues.” Image Credits: Aether Bio\n\nFrom this slide, you can learn how to tackle some of the reasons VCs may have been burned in the past in this space, and explain how you are different.\n\nThis is similar to how companies building in the medtech microfluidics space put “Here is how we are different from Theranos” in an appendix slide. It’s tongue-in-cheek, but you know the question is going to come up, so you may as well be prepared for it. Elegantly done!\n\nIn the rest of this teardown, we’ll look at three things Aether could have improved or done differently, along with its full pitch deck!\n\nThree things that could be improved\n\nThe biggest improvement, I think, could be done on the storytelling front.\n\nExplain it like I’m 5\n\nThere’s an entire subreddit dedicated to explaining complex topics as if the person asking the question were a 5-year-old, and I think this deck could benefit from taking a similar approach. I don’t mean you have to speak down to your investors, but you also don’t have to technobabble your way through your pitch.\n\nThis pitch deck is exceedingly vague and I think it could have been brought to life with examples. A good framework for that would be “Unlike [current solution], which [problem with current solution], we do [solution] so that [target customer] can [value proposition].”\n\nSuch an approach forces you to think about the whole problem space in a way that is understandable to investors.\n\n[Slide 18] This slide (and the three that follow it) are pretty deep tech, and hard to understand and get excited about. Image Credits: Aether\n\nAether could have rephrased this whole argument thus: “Toxic water is increasingly a problem because polyfluoroalkyl substances (PFAS) cannot economically be filtered out of our drinking water using existing means. So, we have developed a protein that can get rid of the PFAS in water at 1,000th of the cost. We suspect this method will become mandatory in all drinking supplies within the next 10 years, representing a $45 billion opportunity.”\n\nRemember that you’re not just trying to convince the investors in the meeting. Your investors also have to get the rest of the partnership on board with the investment at hand. It’s just a good idea to give them the tools to show their friends, co-investors and the rest of the partnership exactly why they are so excited about your company.\n\nThat’s the worst “use of funds” I’ve seen in years\n\n[Slide 22] Give us money and I guess I’ll do some stuff. Image Credits: Aether\n\nWe’re going to build out a product line, prototype our tech and hire more executives. Really? You could copy and paste those three “use of funds” statements into any one of the previous 70 Pitch Deck Teardowns and get away scot-free. That’s some next-level vagueness.\n\nAether raised almost $50 million, so they clearly got by with this slide. But as a startup, you can do better. Spell out what milestones you’re planning to hit, where and how you are planning to invest the capital, and what the company will look like in 18 months. An operating plan wouldn’t have been amiss.\n\nSome images and illustrations, maybe?\n\nThe deck is extremely vague in a lot of ways that sets off alarm bells.\n\nThe cover slide has the only photo in the entire deck. And when I went to check if the team slide had any pictures, I realized there was no team slide, so forgive me — screw the illustrations, I found a far more serious mistake:\n\nWhere’s your team?!\n\nIf you’re going to build a company that is doing something right at the bleeding edge of technology, you’re going to need an extraordinary team. You need strong leadership (to set the direction), good science folks (to tell the leadership if this is even possible), excellent salespeople (to sell the brand-new thing) and technical and operations teams (to make things work in the first place, and then to make it work at scale).\n\nThe overall snake-oily vagueness, combined with the lack of a team slide sets off some pretty spicy-colored flags for me. For a deep tech company to work, you need a hell of a team. A lot of the conversation will be around how you’ve got the best team to execute against the mission, and what your pipeline is for hiring the best of the best going forward.\n\nThis deck explains none of those things, which likely means one of three things:\n\nThe founders are bad and don’t have a good plan for hiring. The founders are so good that they don’t even really need this pitch deck to raise money. The founders don’t understand why this is an important part of the narrative, which, honestly, would also be a pretty big red flag.\n\nTeam slides. They are mandatory. No discussion.\n\nThe full pitch deck\n\nIf you want your own pitch deck teardown featured on TC+, here’s more information. Also, check out all our Pitch Deck Teardowns and other pitching advice, all collected in one handy place for you!"}