{"url": "https://techcrunch.com/2021/11/30/aws-introduces-iot-twinmaker-a-new-service-to-easily-create-digital-twins/", "title": "AWS introduces IoT TwinMaker, a new service to easily create digital twins", "authors": ["Aisha Malik", "Consumer News Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-11-30T00:00:00", "text": "At AWS’s re:Invent conference this morning, the company announced AWS IoT TwinMaker, a new service that makes it easy to create and use digital twins of real-world systems.\n\nFor context, digital twins are virtual representations of things like buildings, factories, production lines and equipment that are regularly updated with real-world data to mimic the behavior of the systems they represent.\n\nThe company outlines that with this new service, users can create digital twins by connecting data from sources like video feeds and applications without having to move the data into a single repository.\n\n“You can use built-in data connectors for the following AWS services: AWS IoT SiteWise for equipment and time-series sensor data; Amazon Kinesis Video Streams for video data; and Amazon Simple Storage Service (S3) for storage of visual resources (for example, CAD files) and data from business applications. AWS IoT TwinMaker also provides a framework for you to create your own data connectors to use with other data sources (such as Snowflake and Siemens MindSphere),” AWS explained in a blog post about the new service.\n\nThe company notes that once the digital twin graph is created, users will likely want to visualize the data in the context of the physical environment. To address this, AWS IoT TwinMaker creates a digital twin graph that combines the relationships between virtual representations of users’ physical systems and connected data sources. This allows users to accurately model their real-world environment. Users can also import existing 3D models to arrange 3D scenes of physical space, such as a factory. From there, you can also add interactive video and sensor data overlays along with insights from connected machine learning services.\n\nAWS notes that the service comes with a plugin for Amazon Managed Grafana, which is a managed service for the open dashboard and visualization platform from Grafana Labs.\n\nAWS IoT TwinMaker is available today in preview in Northern Virginia, Oregon, Ireland and Singapore, with availability in additional AWS Regions to come."}