{"url": "https://techcrunch.com/2023/09/08/x-formerly-twitter-caught-running-unlabeled-ads-in-users-following-feeds/", "title": "X, formerly Twitter, caught running unlabeled ads in users’ Following feeds", "authors": ["Sarah Perez", "Consumer News Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-09-08T00:00:00", "text": "X, the company formerly known as Twitter, has been caught running unlabeled ads in users’ Following feeds, TechCrunch has learned and was able to confirm firsthand. While scrolling the Following feed on a Mac using the Chrome web browser, we encountered a handful of unlabeled ads amid other posts from people we follow, as well as other ads that did properly display the “Ad” label at the top right of the post.\n\nBecause many of X’s ads are still labeled, this makes the unlabeled ones even harder to spot.\n\nIt’s unclear if the issue is a glitch with X’s advertising platform or a deliberate change intended to deceive consumers into believing some ads are regular posts from accounts they follow.\n\nIn our tests, we came across a good handful of unlabeled ads from accounts we didn’t follow. In fact, the only indication they were an ad was by clicking on the three-dot menu at the top-right of the post. When you click this menu on an ad, you’re presented with various engagement options like “Not interested in this ad” or “Why this ad?” as well as tools to follow the account, mute it, block it and more.\n\nIn some cases, the unlabeled ads were from various NFL teams — according to examples sent in by a tipster — but TechCrunch also found a variety of other posts that were not displaying the ad label when we attempted to reproduce the problem ourselves. (This took a lot of scrolling and clicking!)\n\nThe issue with the ads follows an update X made to its ad labeling format in July, which saw it switching from a more prominent “Promoted” label at the bottom of its ads which had also included an arrow icon right above the post’s interaction buttons like reply and retweet.\n\nNow, the word “Ad” appears on the top-right of a post, next to the poster’s name and @username — a placement that some critics said made the ads less noticeable.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nHowever, those posts were still technically labeled as ads, so X was not breaking any rules around deceptive advertising practices.\n\nThat may no longer be the case, given that many ads are now flowing through users’ timelines without ad labels attached.\n\n“The FTC should open up an investigation into X’s use of stealth ads, especially reviewing whether it is engaged in deceptive business tactics,” said Jeffrey Chester, executive director at the Center for Digital Democracy, a digital rights, consumer protection and privacy organization headquartered in Washington, D.C., when reached for comment on the matter. “It should require X to disgorge any data it or its ad partners have gathered from its users, in addition to imposing fines and other sanctions,” he continued.\n\n“Doesn’t Elon Musk know that X can never really be effectively ad-supported given the environment he has unleashed on what was Twitter? The attempt to disguise ads as content smacks of financial desperation — not the best way to convey a ‘brand safe’ site for advertisers!” Chester added.\n\nIt appears the unlabeled ads may be an ongoing issue, as we came across a few posts that referenced the problem before today.\n\n“A user’s control of their social media experience must include clear labeling of ads they did not seek, as distinct from content they did seek,” noted Adam Schwartz, the Senior Staff Attorney at digital privacy nonprofit EFF. “If a platform is failing to label ads, it should correct this problem.”\n\nWho was looking for screenshots of ads in the timeline not being labeled as ads in an open and shut FTC violation? pic.twitter.com/6C6zDKoV2Y — You Gotta Give (@you_gotta_give) September 7, 2023\n\nJust got an ad pushed to my feed that *was not labeled as an ad* pic.twitter.com/RwJMYvxGVj — Big Tobacco St. William (@CorrectWord) September 7, 2023\n\nWe've reached the point where Blue Check posts that are not labeled as ads *for accounts I do not follow* are showing up in my \"Following\" tab. pic.twitter.com/hepj5mx3LV — Warren J. Wells, AICP 🚴🏙️🦀 (@WarrenJWells) September 6, 2023\n\nSo now we're getting ads in the Twitter timeline that aren't even labeled as \"Ad.\" I am not following the Jaguars. pic.twitter.com/Iso9YXCfpM — el jefe (@ThatElJefe) September 1, 2023\n\nIn addition to potentially attracting the attention of the FTC or another regulatory investigation beyond the U.S., the flub with ad labeling is also a prominent stain on the resume of X’s newly hired CEO Linda Yaccarino, who joined the company in June from NBCUniversal where she had been chairman of its advertising and partnerships group. Her hiring was meant to signal to advertisers that a responsible adult who understood the business had been put in charge of the revenue-generating side of the Elon Musk-owned company.\n\nSince Yaccarino’s hire, X has tried to lure back advertisers with a $250 ad credit and promises that advertisers could choose their own “sensitivity” settings when it came to brand safety. More recently, though, Elon Musk began blaming the Anti-Defamation League’s (ADL) accusations of antisemitism for X’s declining U.S. advertising revenues and threatened a lawsuit against the organization.\n\nX no longer has a communications department that responds to press inquiries.\n\nNevertheless, we reached out to X for comment and received an automated email response that read: “Busy now, please check back later.” Previously, the company would respond to inquiries using the poop emoji."}