{"url": "https://techcrunch.com/2023/12/05/git-allspice-enterprise-6m/", "title": "Git platform AllSpice now curries favor with enterprises", "authors": ["Christine Hall", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-12-05T00:00:00", "text": "We last wrote about AllSpice, a git platform for hardware developers, in 2022, when it was just starting out with $3.2 million in new funding. At that time, co-founders Valentina Ratner and Kyle Dumont wanted to build a developer operations ecosystem for hardware development.\n\nThough they initially targeted small businesses, in the past year they found more enterprise-level developers having the same issues collaborating around projects. Add to that companies adapting to new market conditions that included downsizing and layoffs, meaning doing more with fewer people.\n\nThat’s when AllSpice shifted its strategy to help enterprise companies bring engineers together via tools to connect and communicate so they can make the changes and updates they needed to deliver value for their customers, Dumont said in an interview.\n\nThe company created some new tools and features to cater to this new customer base, including more collaboration around a component library and library management. Actions is one of the newest tools for continuous integration and continuous deployment. It also added new CAD file support formats so that while pushing out a new design version, users can run automation and generate new reports for manufacturers and stakeholders.\n\nIn addition, in response to the chip shortage during the global pandemic, AllSpice developed a data aggregation feature that goes through all of the components needed and checks for availability across supply chains.\n\nBoth AllSpice’s user base and revenue grew 10x over the past year, with most of that growth coming from individual accounts, Ratner told TechCrunch. For example, one engineer at a large company would start using AllSpice, then within four to six months, the company would see hundreds of that engineer’s co-workers interacting with the platform.\n\n“That’s what we want to do, to make it easy for them to get started,” Ratner said. “In terms of the engagement, we have over 100 interactions per week, per user on the tool. Top cohorts of users spend about 37 hours a month on the platform. That’s exactly right where we want to be — a home base for people to build their workflows around.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAllSpice closed on $6 million in an additional funding round in late summer. Existing investors from the seed round again participated, including Root Ventures, Flybridge Capital Partners, Bowery Capital, Benchstrength and a group of angel investors.\n\nRatner and Dumont intend on deploying the new capital into product development, acquiring new customers and team growth in the areas of go-to-market and engineering. The Actions feature was rolled out to a few of AllSpice’s existing customers and will be more broadly available early in 2024.\n\n“For every engineer, we have about two to three collaborators on the platform from other teams that are coming to use the tool and collaborate with them, participate in reviews, provide feedback and pull data,” Ratner said. “We will build more functionality to help the other stakeholders so hardware is very interconnected. Actions is the first step in that direction for us.”"}