{"url": "https://techcrunch.com/2023/11/30/drug-discovery-pepper-bio/", "title": "Drug discovery startup Pepper Bio hopes to challenge Eroom’s law with new funding", "authors": ["Anna Heim", "Freelance Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-11-30T00:00:00", "text": "Whether you are a tech optimist or not, you have to acknowledge that progress rarely follows a straight line. While the world keeps getting better at churning semiconductors, we are still struggling to find new drugs to treat resistant diseases, and the process isn’t getting cheaper.\n\nSome hope that AI can help, and it likely will — when it comes to biotech, it is much more than a buzzword. But Boston-based drug discovery startup Pepper Bio fell in love with another term: Transomics. Calling itself “the world’s first transomics company,” it hopes that this approach will bring solutions for those suffering from untreated diseases such as certain forms of cancer.\n\n“Today, drug development still takes on average 10-15 years of R&D with a cost of production (around $2.5 billion) that has increased dramatically over the last decade despite improvements in technology: this is the concept of Eroom’s law (Moore’s law spelled backwards),” deep tech VC Florian Denis wrote in a recent Medium post.\n\nWhile AI could help uncover new drugs, “the AI analysis is really only as good as the data that you put into it,” Pepper Bio CEO Jon Hu told me. And transomics are part of that data.\n\nTransomics may be an emerging term, but the COVID-19 pandemic made us more familiar with some of the layers it encompasses. “There’s currently four different -omics types that we’re working with: DNA, RNA, proteomic data and phosphoproteomic data,” Pepper Bio chief scientist officer Samantha Dale Strasser said.\n\nYou may have identified the first two as genomics and transcriptomics; as for the last one, phosphoproteomics, she summed it up as “proteins with molecular switches that are added that turn them on and off.”\n\nMore than each layer in itself, though, what matters to Pepper Bio is to get the full picture. This is also why it prefers to talk about transomics than about multi-omics, which it sees as too disconnected; and why it compares itself to Google Maps. Just like real-time navigation data is richer and therefore much more useful than static maps, Pepper Bio is “bringing the same types of advances to drug discovery — a routing context of activity,” Dale Strasser said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPharma applications\n\nThe drug discovery road is particularly tricky to navigate; a study shared by Pepper Bio refers to “an overall failure rate in drug development of over 96%, including a 90% failure rate during clinical development.”\n\nIf transomics can improve odds of success before the costly clinical trial phase starts, pharmaceutical giants will likely be interested — and Pepper Bio is already on their radar.\n\nThe biotech startup’s $6.5 million seed round is led by NFX, a VC firm that was already involved in its pre-seed round in 2021 and was also an early backer of Mammoth Biosciences. But it’s perhaps equally noteworthy to see that Merck is also participating in the round, alongside Silverton Partners, Mana Ventures, Tensility Ventures and VSC Ventures.\n\nThe pharmaceutical firm’s involvement is taking place through Merck Digital Sciences Studio, an initiative aimed at helping healthcare startups bring their innovations to market. This might be just the buffer that Pepper Bio needs to still be able to work with other partners without concerns on their part.\n\nMerck’s accelerator, Hu explained, “is basically a forum in which we can have a lot of in-depth discussions with Merck scientists to understand basically what their key problems are; and in return, they have some ability to look at high-level financials, but there’s no details. They don’t get project-level access, they don’t see the data, they don’t even see the topics of particular projects that we have with other [drug] developers.”\n\nWorking with partners is half of what Pepper Bio does; the other half is its own pipeline, focused on oncology. The seed round is meant to help the company make progress on both sides, up to the point where it will be able to secure more funding, Hu said.\n\n“On the internal pipeline side, we are looking for particular assets that we can repurpose. We’ve already identified a number of them; we’re in the process of negotiating either an outright acquisition or […] an option to acquire, so we’ll need to have one of those [to raise a new round]. Most of our partnerships currently are much more limited in nature: they tend to be pilot projects. Before we can raise our next round, we’ll need to have at least one of these convert into a long-term partnership with broader economics.”\n\nBesides its pharma industry partners, which it can also support in finding drugs for inflammatory and neurodegenerative diseases, Pepper Bio is collaborating with Stanford’s Felsher Lab to identify and validate therapeutic targets for lymphatic and liver cancers. But the common thread here is not the organs these cancers affect; it is their transomics signature.\n\nWith poorly targeted drugs, “not only do they [patients] have to suffer through the cancer, but they have to suffer through all the side effects of that drug with none of the benefits.” Better targeted drugs can have higher efficacy with lower toxicity, and this is where Pepper Bio hopes that its approach can make the difference. “I think transomics is the final piece of the puzzle that genomics started about 20 years ago,” Hu said.\n\nWhile there likely won’t be a silver bullet to cure cancer, let alone all untreated diseases, it’s encouraging to see more startups trying novel approaches — and more capital flowing in their direction."}