{"url": "https://techcrunch.com/2019/12/09/aws-is-sick-of-waiting-for-your-company-to-move-to-the-cloud/", "title": "AWS is sick of waiting for your company to move to the cloud", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2019-12-09T00:00:00", "text": "AWS held its annual re:Invent customer conference last week in Las Vegas. Being Vegas, there was pageantry aplenty, of course, but this year’s model felt a bit different than in years past, lacking the onslaught of major announcements we are used to getting at this event.\n\nPerhaps the pace of innovation could finally be slowing, but the company still had a few messages for attendees. For starters, AWS CEO Andy Jassy made it clear he’s tired of the slow pace of change inside the enterprise. In Jassy’s view, the time for incremental change is over, and it’s time to start moving to the cloud faster.\n\nAWS also placed a couple of big bets this year in Vegas to help make that happen. The first involves AI and machine learning. The second, moving computing to the edge, closer to the business than the traditional cloud allows.\n\nThe question is what is driving these strategies? AWS had a clear head start in the cloud, and owns a third of the market, more than double its closest rival, Microsoft. The good news is that the market is still growing and will continue to do so for the foreseeable future. The bad news for AWS is that it can probably see Google and Microsoft beginning to resonate with more customers, and it’s looking for new ways to get a piece of the untapped part of the market to choose AWS.\n\nMove faster, dammit\n\nThe worldwide infrastructure business surpassed $100 billion this year, yet we have only just scratched the surface of this market. Surely, digital-first companies, those born in the cloud, understand all of the advantages of working there, but large enterprises are still moving surprisingly slowly.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nJassy indicated more than once last week that he’s had enough of that. He wants to see companies transform more quickly, and in his view it’s not a technical problem, it’s a lack of leadership. If you want to get to the cloud faster, you need executive buy-in pushing it.\n\nJassy outlined four steps in his keynote to help companies move faster and get more workloads in the cloud. He believes in doing so, it will not only continue to enrich his own company, it will also help customers avoid disruptive forces in their markets.\n\nFor starters, he says that it’s imperative to get the senior team aligned behind a change. “Inertia is a powerful thing,” Jassy told the audience at his keynote on Tuesday. He’s right of course. There are forces inside every company designed with good reason to protect the organization from massive systemic changes, but these forces — whether legal, compliance, security or HR — can hold back a company when meaningful change is needed.\n\nHe said that a fuller shift to the cloud requires ambitious planning. “It’s easy to go a long time dipping your toe in the water if you don’t have an aggressive goal,” he emphasized. To move faster, you also need staff that can help you get there — and that requires training.\n\nFinally, you need a thoughtful, methodical migration plan. Most companies start with the stuff that’s easy to move to the cloud, then begin to migrate workloads that require some adjustments. They continue along this path all the way to things you might not choose to move at all.\n\nJassy knows that the faster companies get on board and move to the cloud, the better off his company is going to be, assuming it can capture the lion’s share of those workloads. The trouble is that after you move that first easy batch, getting to the cloud becomes increasingly challenging, and that’s one of the big reasons why companies have moved slower than Jassy would like.\n\nThe power of machine learning to drive adoption\n\nOne way to motivate folks to move faster is help them understand the power of machine learning. AWS made a slew of announcements around machine learning designed to give customers a more comprehensive Amazon solution. This included SageMaker Studio, a machine learning development environment along with notebook, debugging and monitoring tools. Finally, the company announced AutoPilot, a tool that gives more insight into automatically-generated machine learning models, another way to go faster.\n\nThe company also announced a new connected keyboard called DeepComposer, designed to teach developers about machine learning in a fun way. It joins DeepLens and DeepRacer, two tools released at previous re:Invents. All of this is designed for developers to help them get comfortable with machine learning.\n\nIt wasn’t a coincidence the company also announced a significant partnership with the NFL to use machine learning to help make players safer. It’s an excellent use case. The NFL has tons of data on its players, and it has decades of film. If it can use that data as fuel for machine learning-driven solutions to help prevent injuries, it could end up being a catalyst for meaningful change driven by machine learning in the cloud.\n\nMachine learning provides another reason to move to the cloud. This shows that the cloud isn’t just about agility and speed, it’s also about innovation and transformation. If you can take advantage of machine learning to transform your business, it’s another reason to move to the cloud.\n\nMoving to the edge\n\nFinally, AWS recognizes that computing in cloud can only get you so far. In spite of the leaps it has made architecturally, there is still a latency issue that will be unacceptable for some workloads. That’s why it was a big deal that the company announced a couple of edge computing solutions including the general availability of Outposts, its private cloud in a box along with a new concept called Local Zones last week.\n\nThe company announced Outposts last year as a way to bring the cloud on prem. It is supposed to behave exactly the same way as traditional cloud resources, but AWS installs, manages and maintains a physical box in your data center. It’s the ultimate in edge computing, bringing the compute power right into your building.\n\nFor those who don’t want to go that far, AWS also introduced Local Zones, starting with one in LA, where the cloud infrastructure resources are close by instead of in your building. The idea is the same — to reduce the physical distance between you and your compute resources and reduce latency.\n\nAll of this is designed to put the cloud in reach of more customers, to help them move to the cloud faster. Sure, it’s self-serving, but 11 years after I first heard the term cloud computing, maybe it really is time to give companies a harder push."}