{"url": "https://techcrunch.com/2018/10/23/synthego-raises-110-million-to-make-gene-editing-technologies-more-accessible/", "title": "Synthego raises $110 million to make gene editing technologies more accessible", "authors": ["Jonathan Shieber", "Kyle Wiggers", "Julie Bort", "Maxwell Zeff", "Sarah Perez", "Marina Temkin", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size"], "publication_date": "2018-10-23T00:00:00", "text": "Paul Dabrowski, the chief executive officer of Synthego, which provides genetically engineered cells to scientists and researchers, worries about a future where access to the genetic technologies that will reshape the world are only available to the few who can afford them.\n\nTo hear him tell it, that’s why Dabrowski began working on Synthego in the first place — to democratize access to the new technologies that will give scientists, researchers, and consumers new ways to rewrite the code that has defined human existence.\n\n“People talk about access to the tools, but the question is access to the therapies,” Dabrowski said. “We’re talking about the basis of what does it mean to be human not right now, but in the next 100 years.”\n\nNow, the company has a fresh $110 million in cash from new investors at Founders Fund and the company’s previous backers — 8VC and Menlo Ventures — to try and drive costs down.\n\n“This new funding allows us to expand our reach and build out of our full stack platform capabilities at a perfect time,” said Dabrowski, co-founder and CEO, Synthego, in a statement. “Biological medicines are on the cusp of a revolution with the coming curative cell and gene therapies, and we are proud to support this industry.”\n\nWhile Dabrowski said the financing will be used for further research and development — and bringing new services to market — in the near term the funding will be used to expand two main areas of interest for the company. One is the creation of CRISPR kits that can create different genetic lines based on the requests from researchers and scientists, and the other is creating materials that are “clinical-grade”, which means that they can be used in clinical trials on animal (and potentially human) subjects.\n\n“In general the demand for these products is quite high. Building capacity and building out the informatics models for the predictability on the CRISPR research side.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIn all, the Redwood City, Calif.-based company has raised $166 million in funding to develop its technology that makes research and development using the gene editing tool known as CRISPR more economical and faster for researchers. Synthego claims that by offering researchers one-click access to engineered cells with guaranteed edits in their desired target, the company can slash the time it takes to conduct experiments by months, enabling predictable and rapid outcomes in cell and gene therapy research and development.\n\nAs we’d written previously, Synthego launched its first CRISPR offerings to the market earlier this year.\n\nThere are two basic functions that people use CRISPR for, said Dabrowski. The first is to remove a gene or function and the second is adding a function to genetic material.\n\nBoth of those processes involve three (very complicated) steps. First scientists have to identify the gene that they want to target and then understand what genetic material within that gene they want to target for removal. Then a research team would need to identify and procure the reagents and components they need to edit a gene. Finally, the team would need to figure out whether the edit was made successfully and watch for results when the edited genetic material is cultivated.\n\nSynthego’s first set of products were designed to simplify the process for identifying and designing genetic material for experimentation. This next set of tools are supposed to help scientists by providing them with the material they want to observe or experiment with.\n\n“Our vision is a future where cell and gene therapies are ultimately as accessible as vaccines, so that everyone can benefit from next-generation cures,” said Dabrowski in a statement. “Synthego will continue to innovate to help researchers redefine the boundaries of transformative medicines.”"}