{"url": "https://techcrunch.com/2010/11/25/cleantech-open-winners-puralytics/", "title": "Puralytics CEO On Cleaning Water With Light, Winning The Cleantech Open", "authors": ["Lora Kolodny", "Emerging Tech Editor", "Video Host", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2010-11-25T00:00:00", "text": "The Cleantech Open— a prestigious annual competition for U.S. tech startups that protect, restore, and reduce the negative impact of humans on the environment— announced its 2010 winners this week. Puralytics, a clean water startup from Beaverton, Oregon, took first prize.\n\nThe Puralytics team invented and sells a nanotechnology-based, photochemical water purification system that, in comparison to other available systems, can purify water more quickly, remove more impurities from it, and requires less electricity to do so. With 15 percent of the world’s total estimated 6.5 billion population lacking freshwater enough to live a healthy life today, companies with promising water technology are in demand, and could help abate a global water and humanitarian crisis.\n\nThe executive director of the Cleantech Open Rex Northen said, “Puralytics stood out because they have developed something that will have a tremendous environmental and social impact. Their technology lets you use LED light or sunlight as a mechanism to clean water, and it lacks the toxic output many others have. The team was also very strong.”\n\nPuralytics’ chief executive and founder, Mark Owen, is a serial entrepreneur and inventor whose thirty-some successful patents (according to his own calculations) have generated over one billion dollars in revenue for companies he has worked for and founded.\n\nOwen spoke with TechCrunch about winning the Cleantech Open 2010 National Business Competition, and how his latest innovation cleans water with light. An edited transcript of the conversation follows below.\n\nTC: What environmental problem does your company solve?\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMO: Purifying water has been a dirty process using filters, membranes, cleaning chemicals and mercurcy lamps. The systems in use today waste most of the water they’re trying to purify, and require a lot of electricity. With reverse osmosis systems, for example, about 80% of the water that could be purified goes out into the sewer.\n\nWe have a different way to purify drinking water or water for light-industrial and commercial use. Our system processes all the water, using half as much electricity, and doesn’t require you to produce anything toxic. It also removes things from the water that others cannot, like pesticides and pharmaceuticals.\n\nThe EPA just released a list of 169 endocrine disrupting compounds (EDCs) that they will track from now on in domestic drinking water. These are things that even in small quantities can cause health problems for some people [and animals] including caffeine. Our system removes them from the water.\n\nTC: How does Puralytics’ technology work?\n\nMO: If I was explaining Puralytics to a classroom full of kids, I’d say, “There are little things in your water that may not be good for you. We use a special light to make those go away.”\n\nWe use LEDs to illuminate a nanotechnology coating we’ve developed, that’s on a mesh where the water flows through a main system. This technology is not filtering at all. What it is doing instead, is creating a chemical reaction that causes molecules to break apart and break down in the water.\n\nThe right wavelengths of light and this nanotechnology coating cause five photochemical processes that work to pull contaminants out of the water onto the surface of the mesh, then dump the energy of what’s been absorbed into the molecules to break them apart.\n\nMost organic molecules are lots of carbons, hydrogens, and oxygen and a few other things. Essentially we break a long molecule apart, all the way down, and reform it as CO2 and water and minerals. We actively destroy contaminants in the water, but leave the minerals that are good for you in it. Other treatments take out minerals that are good for you. But ours does not.\n\n\n\nTC: Can you see the process?\n\nMO: It isn’t really visible. You see a kind of purplish light. If you could, you might see something that looks like water turning into steam and dissipating in the air. Something is changing form in there.\n\nTC: Where did you get the idea for this?\n\nMO: My previous company was Phoseon Technology. I’m still a director. We actually make light emitting diode (LED) drying equipment that can dry inks, coatings and adhesives very quickly using little energy. If you have any Ikea furniture, they spray on the coatings to make it look good, and make it durable, and Phoseon lamps dry it in about three seconds.\n\nI got to thinking about what else I could do with LEDs. The original idea was to replace mercury lamps that are used to kill germs in hospitals and in water with an LED array. It didn’t turn out to be efficient. There are other good solutions to killing germs, I learned. But there weren’t efficient solutions to take out chemicals and heavy metals and other things of concern from water.\n\nAnother thing that inspired me was a building I saw in Japan, within Tokyo’s Expo City. It had been sprayed with a coating that kept it from getting dirty. Sun activates the coating to break up dirt and chemicals on the surface, so it mostly stays clean. I asked myself if instead of making the building clean, you could make the water clean.\n\nI brought together a team— experts in chemistry, optics and physics— and we started figuring out which wavelengths of light were optimum, what kind of nanotechnology we could use, what kind of coating was optimum, and all the other things that could commence this idea around 2007.\n\n\n\nTC: Do you have customers already? Who are they?\n\nMO: We began shipping to customers in 2009. The majority have been industrial process customers. They need water that’s ultra pure for use in the lab, or in processes they use to make their products. Tap water isn’t clean enough. We are useful to pharmaceuticals, biotech and semiconductor manufacturers, and coffee franchises alike. We have several Fortune 500 clients.\n\n\n\nTC: What’s next for Puralytics?\n\nMO: I told you about our primary product, the Puralytics Shield, which uses LEDs to purify water for light industrial and commercial use. We have another one called the Solar Bag. It uses the same technology but without the LEDs. So, you have a nanotech coated mesh inside of a bag. You fill the bag with water, stick it in the sun, and the nanotech purifies the water over the course of several hours instead of a few minutes. This is going to be important for getting clean drinking water to people without access in the developing world.\n\nOne of our partners, Hydration Technologies humanitarian water division, is helping us sell the Solar Bag to nonprofits that can distribute it. We also work with different aid organizations around the world— including one in Kenya, and another one in Bangladesh— to supply our technology in developing world applications. We’ll be figuring out how to do more of this.\n\nWe’ve been funded by four government grants, a seed round, and now some prize money. We’ll be using that develop a next generation product and expand our market presence. But we’ll also be looking to raise growth capital, soon.\n\n[Editor’s note: The national competition prize included $150,000 worth of business services, and $100,000 in the form of a seed investment from a consortium of investors: Wilson Sonsini Investment Company, Stiefel Family Foundation, and the Cleantech Open.]\n\nImages courtesy Douglas Schwartz Photography\n\nMore information about the 2010 Cleantech Open National Business Competition winners is available via the competition’s winners site and competition’s Youtube Channel."}