{"url": "https://techcrunch.com/2022/07/12/scale-computing-secures-55m-to-help-companies-manage-edge-infrastructure/", "title": "Scale Computing nabs $55M to help companies manage edge infrastructure", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-07-12T00:00:00", "text": "Edge computing is seeing an explosion of interest as enterprises process more data at the edge of their networks. According to a 2021 survey (albeit from an edge computing services vendor), 77% of companies said that they expect to see more spending for edge projects in 2022. But while some organizations stand to benefit from edge computing, which refers to the practice of storing and analyzing data near the end-user, not all have a handle of what it requires. Managing a fleet of edge devices across locations can be a burden on IT teams that lack the necessary infrastructure.\n\nJeff Ready asserts that his company, Scale Computing, can help enterprises that aren’t sure where to start with edge computing via storage architecture and disaster recovery technologies. Ready — who, among other ventures, runs a beer brewing company in Indianapolis — co-launched Scale Computing in 2007 with Jason Collier and Scott Loughmiller.\n\nBoth Loughmiller and Collier worked at Tumbleweed Communications developing a messaging and file transfer platform for enterprise and government customers. Prior to Scale, Ready, Loughmiller and Collier co-founded Corvigo, which offered a spam-filtering tool for email.\n\nEarly on, Scale focused on selling servers loaded with custom storage software targeting small- and medium-sized businesses. But the company later pivoted to “hyperconverged” infrastructure and edge computing products, which virtualizes customers’ infrastructure by combining servers, storage, a virtual machine monitor called a hypervisor and backup and data recovery into a single system.\n\n“Scale Computing engineered an IT infrastructure platform that … eliminates the need for traditional IT silos of virtualization software, disaster recovery software, servers, and shared storage, replacing these with a fully integrated, highly available platform for running applications,” Ready said in an email interview with TechCrunch. “The self-healing platform automatically identifies, mitigates, and corrects problems in the infrastructure in real time, enabling applications to achieve maximum uptime even when local IT resources and staff are scarce.”\n\nThose are lofty promises. But — lending Scale credibility — the company today raised $55 million in new funding led by Morgan Stanley Expansion Capital, bringing Scale’s total raised to $202 million.\n\n“The technological advantage of Scale Computing’s edge computing platform solves endemic customer problems through enhanced resiliency, manageability and efficacy of their IT infrastructures,” Pete D. Chung, managing director and head of Morgan Stanley Expansion Capital, told TechCrunch in a statement. “It was clear from our diligence that Scale Computing’s customers benefit from material cost savings as well as increased confidence in their IT infrastructure.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nScale’s platform allows companies to run apps close to where their users are, at the edge, centralizing management of remote sites such as branch offices in a single dashboard. The company’s device management tool gives users the ability to see a fleet of devices from a console and optionally check their health, flagging problems automatically and logging them so that IT teams can arrive at a diagnosis.\n\n“Businesses across the spectrum of industries are eager to simplify their IT infrastructure, improve business resiliency, and drive down operational costs. The pandemic has also illustrated the importance of having edge computing capabilities outside a large centralized data center,” Ready said. “Scale’s software eliminates the need for traditional IT silos of virtualization software, disaster recovery software, servers, and shared storage, replacing these with a fully-integrated, highly-available platform for running applications.”\n\nReady’s language might be hyperbolic, but there’s certainly been growth in the demand for edge computing management software. According to Grand View Research, the global edge computing market — which was estimated to be worth $7.43 billion in 2021 — could climb to $155.90 billion in 2030.\n\nReady wouldn’t disclose revenue, and — perhaps hedging in light of the economic downswing — demurred when asked whether Scale had plans to expand its 160-person workforce by the end of the year. But he claimed that the company currently has over 6,000 customers across North America, Europe and the Middle East, and the Asia-Pacific region.\n\nAt one point in time, those customers reportedly included grocery store franchise Jerry’s Enterprises and casino company Genting Group.\n\n“Despite the uncertainty wrought by the pandemic — or perhaps because of it — Scale Computing has seen unprecedented demand for its edge computing, virtualization, and hyperconverged solutions,” Ready added in a follow-up email. “We’ll will use the new funds to expand our leadership position in edge computing, including investments in people, R&D, and restructuring of debt.”"}