{"url": "https://techcrunch.com/podcast/why-it-made-sense-for-an-online-community-college-to-raise-venture-capital/", "title": "Why it made sense for an online community college to raise venture capital", "authors": ["Rebecca Szkutak", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "Maggie Stamets", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": null, "text": "When Tade Oyerinde first set out to fundraise for his startup, Campus, a fully accredited online community college, it was incredibly difficult. VCs have backed for-profit education companies in the past, including Coursera and Udacity, but backing a more traditional two-year college is different. Plus, he was looking for funds a few years ago when higher ed was starting to face a reckoning from decreasing enrollment and increasing tuition prices.\n\nOyerinde said on a recent episode of TechCrunch’s Found podcast that despite the difficulty he thought it still made sense to turn to venture capitalists for funding for a few reasons. Campus runs off of CampusWire, online learning software that Oyerinde built prior to launching Campus, making it software-enabled and relatively lean. He added that while Campus may not look like the average software or edtech startup, he thought the fact that he was disrupting a legacy industry would align perfectly with VCs.\n\n“It was like a high risk, high reward, massive problem,” Oyerinde said. “If you can solve it, [there’s a] massive opportunity to make this country stronger and better. If you capture a small sliver of the market, you can build a massive company. So it just made a lot of sense to go to venture.”\n\nBut that didn’t mean it was easy. Oyerinde said his initial mistake was trying to find and pitch as many investors as he could to convince them to invest in him. Once he shifted his approach and sought out investors that had interest or experience with the community college space, fundraising started to get a little easier.\n\nSome of the startup’s first investors were OpenAI founder Sam Altman and Discord founder Jason Citron. They understood the need for innovation in the community college space because both of them had spent time at community colleges.\n\nWhile he was building CampusWire, Oyerinde got connected with Citron through Charles Hudson of Precursor Ventures. Citron participated in Campus’s seed round and later connected Oyerinde with Altman. Oyerinde said he’s glad he caught Altman before ChatGPT and joked it’s probably a little more challenging to get a meeting with him now.\n\nOyerinde said another reason he thinks it resonated with them is that while technology continues to evolve, community college largely looks the same, meaning students may not learn what they need to know to keep up. Because of Campus’ ties to startups and Silicon Valley, it’s closer to cutting-edge tech and can adjust its curriculum to meets trends faster than a regular community college might be able to.\n\n“Do you really think that these traditional community colleges are going to adapt quickly enough to be responsive to the changing landscape? Probably not,” Oyerinde said. “So there needs to be this highly adaptive, highly thoughtful, tech-enabled, tech-focused experience that’s more efficient, accessible and successful [at] actually helping kids complete. And so, they were really excited.”\n\nCampus has raised more than $55 million in venture funding. This includes a $29 million Series A round led by Altman and Citron in May 2023 and a more recent $23 million Series A extension round led by Founders Fund in April. Oyerinde joked that yes, even anti-college Peter Thiel could still see the potential here.\n\nThe startup’s recent funding rounds are particularly notable because of the current state of the edtech sector which has definitely fallen out of favor with VCs since its pandemic boom. More than $38 billion was invested in edtech startups globally in 2020 and 2021, according to Crunchbase data. But that momentum didn’t last. Through June 11 of this year, edtech startups had raised a little over a billion, meaning the sector will likely see its lowest funding total in years in 2024. Existing edtech players don’t appear to be doing well either. Companies like Byju’s, once valued at $22 billion, recently raised a round that cut its valuation down to between $20 million and $25 million.\n\nBut Oyerinde isn’t deterred. While fundraising was tough at first, it’s gotten easier and the startup gets inbound interest now. Oyerinde credits that change in tune to the fact that he thinks Campus is doing something truly innovative in a legacy, and largely untouched, category, the type of disruption that is generally music to VCs’ ears.\n\n“We want this to fundamentally change the way people learn in America, and eventually the world,” Oyerinde said. “Silicon Valley is still the place you go if you want funding for moonshots, and that’s exactly what Campus was.”"}