{"url": "https://techcrunch.com/2023/11/01/yahoo-spin-out-vespa-lands-31m-investment-from-blossom/", "title": "Yahoo spin-out Vespa lands $31M investment from Blossom", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-11-01T00:00:00", "text": "Vespa.ai, the big data serving engine that just a few weeks ago spun out from Yahoo (full disclosure: TechCrunch’s parent company) into an independent venture, has raised a new round of funds.\n\nBlossom Capital led a $31 million investment in Vespa — money that Vespa CEO Jon Bratseth says will be put toward growing Vespa as a standalone business, strengthening the company’s engineering functions and “delivering more features faster to all Vespa’s users.”\n\n“In particular, we’ll speed up the development of features that’ll make it easier for developers to create apps that combine AI models with proprietary data sets,” Bratseth told TechCrunch in an email interview. “Vespa has been around for over 20 years, and we’re set up to be around for a lot longer.”\n\nYahoo created Vespa back in 2005 after acquiring paid search service provider Overture, and, through it, a Norwegian search engine called AlltheWeb.com. Working with the e-commerce division within Yahoo, the AlltheWeb team retooled its search tech into a more general-purpose tool that Yahoo developers could use internally to compute over large-scale data sets in real time.\n\nOver the next decade or so, Yahoo expanded Vespa along several axes, enabling the tool to handle input beyond text strings, personalize content based on users’ click-through histories and take direction from machine learning algorithms. Then, in 2017, Yahoo open sourced Vespa, hoping to rally developer support behind the software — and foster something of an ecosystem both internally and externally.\n\nEvidently, it paid off.\n\nThousands of brands, including Spotify, OkCupid and Wix, now use either the open source release of Vespa or Vespa’s cloud-hosted, fully managed product, Vespa Cloud. Vespa still drives searches and related-article recommendations on many Yahoo-owned sites — performing ad targeting on Yahoo-branded web properties such as Yahoo Sports, Yahoo Finance, Yahoo News and Yahoo’s advertising network.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Well-known use cases of Vespa include search (for both humans and AI), online personalization recommendation and ad serving,” Bratseth said. “Essentially, Vespa applies AI to store, sift through and apply data to meet any number of needs, and it’s currently being used for everything from helping a global financial services company instantly search through billions of documents … to serving one billion users processing 800,000 queries per second across 150 applications to deliver content and offering targeted ads for Yahoo.”\n\nWhile there are a number of open source alternatives to Vespa available, including Solr and Elasticsearch, Bratseth makes the case that Vespa goes several steps beyond what’s on the market. For example, he says, Vespa offers a mode, “vector streaming search,” that can “dramatically” cut the cost of an app retrieving personal data such as emails and documents.\n\n“Vespa [provides] end-to-end services that allow clients to use any combination of text and structured data to provide quality results with sophisticated scoring and relevance at scale,” Bratseth said. “Vespa solves the problem many AI applications, including large language models [along the lines of ChatGPT], are starting to face as they increase the amount of customers and data needed to function while also allowing Fortune 500 and enterprise customers to leverage AI to streamline their operations and improve their bottom line.”\n\nFree of Yahoo (except for Yahoo’s stake in Vespa and seat on Vespa’s board of directors), Bratseth says that Vespa, whose team now stands at 29 people, has the capability to expand its cloud services.\n\n“Those who already use Vespa now have the opportunity to move to Vespa Cloud,” he said. “Vespa is a startup with a huge growth potential from our large base of open source enterprise usage, which would benefit greatly from moving to our managed version of the platform.”"}