{"url": "https://techcrunch.com/2024/02/29/eq-tickets-combines-cheaper-sports-and-event-tickets-with-a-social-network/", "title": "EQ Tickets combines cheaper sports and event tickets with a social network", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-02-29T00:00:00", "text": "A startup that aims to combine the ticket-buying experience online with a social network, EQ Tickets, is today emerging out of stealth to help make discovering shows and other live events a more social activity. What’s more, the company promises to offer ticket prices that undercut some of its competitors operating similar secondary ticket marketplaces. In addition, EQ Tickets intends to scale its new primary ticket marketplace to help generate revenue, taking on the likes of Eventbrite and others in the process.\n\nFounded by brothers Aaron and Ryan Caradonna and hip-hop artist Matt Raposo (Rapta), Aaron explains the idea for EQ Tickets began out of his personal interest in sports entertainment. He recalls a childhood where he and his brother were always at the field hours early, trying to get players’ autographs. While he later went the law school route, instead of being a sports agent, as planned, he worked extensively with venues during his legal career. Meanwhile, his brother Ryan ended up working at a ticketing company after an earlier stint at JP Morgan. Those shared interests combined with Ryan’s understanding of the market — and the margins necessary to be successful — led to the founding of EQ Tickets.\n\nThe brothers also teamed up with a friend they knew through the music industry, Raposo, who understood the business from the performers’ side, bringing a different perspective.\n\nInitially, EQ Tickets focused on developing a secondary ticket marketplace, similar to something like StubHub, Vivid Seats or SeatGeek.\n\n“We went about by cutting the same inventory deals as all the other big competitors, and we just put a very fair transparent markup on our tickets,” Aaron explains. The selling point is that tickets on EQ can be up to 20-30% less than on competitors’ sites.\n\n“So that got us a lot of attention,” Aaron continues. “But that wasn’t enough, because it still was very transactional — we wanted to add a social layer to it. So we gave people the ability to bookmark events, as well as follow people,” he says.\n\nThe social networking features help fans of the same teams, events or musical artists find each other and form connections. For instance, if you were in town and wanted to go to the local hockey game, you could use EQ Tickets to find another fan who also didn’t want to go alone. Plus, with the bookmarking feature, users can signal their interest in upcoming events to others who could then reach out to connect.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe final tie-in is EQ Tickets’ primary ticketing marketplace, which helps turn the site into a one-stop shop for big events. That is, instead of just buying tickets to the big game, you could also buy a ticket to a fan tailgating event or an afterparty.\n\nThe startup first launched its ticketing marketplace in August, initially without any additional fees. It has since transitioned to a small markup and is now rolling out the primary ticketing platform, as well.\n\nDespite operating in stealth until now, EQ Tickets has already generated six figures in gross ticket sales and its early adopters are also using the follow and bookmarking functions to participate in the social experience. Aaron himself used the platform to go to shows, including the U2 show at the Las Vegas Sphere. While he didn’t use EQ Tickets to connect with strangers — rather with friends in other cities — the plan is to eventually offer a friend suggestion algorithm that can help users form connections. Today, you can manually search for users or invite them to the platform, however.\n\n“There’s diehards around sports and entertainment. So I think people are going to find a lot of new friends. They’re probably in chat rooms and separated right now and don’t even know that the other exists,” Aaron points out.\n\nThe primary ticketing platform hadn’t yet been announced as EQ Tickets was working directly with select clients to test the service. In one night last week, the company generated $30,000 in ticket sales for just one of those events — a promising early haul that prompted the founders to take the service public. Now, EQ Tickets will be host to ticket sales for some of the side events around SXSW, concert tours and movie premieres. Clients can choose between two rev share models, either 6.6% plus $1.79 per ticket or 10% plus $0.99 per ticket — both of which are the going rates at other competitors.\n\nThe company promises its clients can access their own customer data about ticket sales, as well as other information — like fans’ phone numbers, if they agree to share that, or answers to questions about what an attendee would like to see at the event.\n\nThe company touts it has a 30% repeat buyer rate, which speaks to its traction with early adopters.\n\nEQ Tickets is currently available via the web and mobile web but plans to launch a native mobile app later this year.\n\nThe small 10-person team (including consultants) is based out of LA, but has developers and engineers in Denver and Boston. Aaron resides in Huntsville, Alabama.\n\nThe startup is backed by $2 million in seed funding from Sage Venture Partners, led by early Apple investor Fred Warren. The round closed last June."}