{"url": "https://techcrunch.com/2025/05/01/aurora-launches-commercial-self-driving-truck-service-in-texas/", "title": "Aurora launches commercial self-driving truck service in Texas", "authors": ["Rebecca Bellan", "Senior Reporter", "Zack Whittaker", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-05-01T00:00:00", "text": "Autonomous vehicle technology startup Aurora Innovation says it has successfully launched a self-driving truck service in Texas, making it the first company to deploy driverless, heavy-duty trucks for commercial use on public roads in the U.S.\n\nThe launch comes just as Aurora hits its deadline; in October, the company delayed its planned 2024 debut to April 2025. The debut also comes five months after rival Kodiak Robotics delivered its first autonomous trucks to a commercial customer for driverless operations in off-road environments.\n\nAurora says it began running freight this week between Dallas and Houston with its launch customers Hirschbach Motor Lines and Uber Freight, and that it has completed 1,200 miles in a single self-driving truck without a driver so far. The company plans to build up to “tens of self-driving trucks” and expand to El Paso and Phoenix by the end of 2025.\n\nAurora will also continue to haul “more than 100 loads of commercial freight” for customers every week with a fleet of more than 30 supervised autonomous trucks, according to a company spokesperson.\n\nAurora’s plan is to start its driverless trucking operations by owning, maintaining, and insuring its own trucks for customers. The company is working with its strategic partners Volvo Trucks and Paccar to develop self-driving trucks for high-volume manufacturing. Aurora expects its customers to buy those trucks directly from manufacturers starting in 2027 or earlier.\n\nTechCrunch has reached out to learn whether the system has needed to implement a pullover maneuver or required remote human assistance, though CEO Chris Urmson said in a statement that the Aurora Driver “performed perfectly” during his inaugural trip.\n\nAurora’s commercial launch comes at a challenging time. Self-driving truck companies have long pitched the necessity of their technology due to labor shortages in long-haul trucking and an expected growth in freight shipping. Trump’s tariffs have changed that outlook, at least in the short term. According to an April report from commercial vehicle industry analysis firm ACT Research, freight is expected to decrease in the U.S. this year as volumes and consumer spending decline.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIn response to how a freight pullback is expected to affect Aurora’s business, an Aurora spokesperson pointed out that trucking faces other challenges, including skyrocketing operating costs and underutilized assets.\n\nAurora will be reporting its first-quarter results next week, which is when it will also share how it expects the current trade war to affect its future business. TechCrunch has reached out to learn more about how tariffs affect Aurora’s business.\n\nFor now, Aurora will likely focus on continuing to prove its safety case without a driver, and work with state and federal legislators to adopt favorable policies to help it expand.\n\nAt the start of 2025, Aurora brought a suit against federal safety regulators after a court denied its request to be exempt from a safety requirement that involves placing warning triangles on the road when a truck needs to pull over on the highway — something that is difficult to do when there’s no driver in the vehicle.\n\nIn order to remain in compliance with that rule and still deploy a fully driverless service, it would make sense for Aurora to have a human-driven car trail its trucks whenever they’re in operation.\n\nRachel Chibidakis, an Aurora spokesperson, said the company did not require lead vehicles, chase vehicles, or police escorts for its driverless operations.\n\n“In addition to our driverless trucks, we have supervised autonomous trucks that are delivering goods for customers everyday between Dallas and Houston,” Chibidakis said. “In the rare case a driverless truck encounters an issue and needs to pull over to the side of the road, a vehicle with vehicle operators won’t be far away.”\n\nThis article has been updated with more information and comments from an Aurora spokesperson."}