{"url": "https://techcrunch.com/2021/03/26/woven-capital-kicks-off-portfolio-with-investment-in-autonomous-delivery-company-nuro/", "title": "Woven Capital kicks off portfolio with investment in autonomous delivery company Nuro", "authors": ["Rebecca Bellan", "Senior Reporter", "Zack Whittaker", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-03-26T00:00:00", "text": "Woven Capital, the investment arm of Toyota’s innovation-focused subsidiary Woven Planet, has announced an investment into Silicon Valley-based autonomous delivery vehicle company Nuro. This kicks off the new $800 million strategic fund, which will invest in growth-stage technology companies that could one day develop into partners or acquisitions to further a mission of building the future of safe mobility, according to George Kellerman, Woven Capital’s head of investments and acquisitions.\n\nWoven Capital’s contribution was part of Nuro’s $500 million Series C funding round, which was announced last November. Chipotle also invested in the round, which also included funds managed by T. Rowe Price Associates, Inc., with participation from new investors Fidelity Management & Research Company, LLC and Baillie Gifford. The specific amounts invested by each stakeholder were not disclosed.\n\nToyota announced the $800 million investment pool in September 2020, and Woven Capital was officially formed in January 2021, with the aim of investing in technologies including autonomous mobility, machine learning, artificial intelligence, automation, connectivity and data and analytics.\n\n“Nuro was a good jumping off point, because a lot of the work that we’re doing is really focused on developing autonomous passenger vehicles, so this is a way for us to learn and advance through a partner that is laser-focused on local goods delivery,” Kellerman told TechCrunch. “There’s a lot of opportunity to learn from them, and potentially over time, to collaborate and help them expand globally.”\n\nNuro’s fleet of cargo-only self-driving vehicles has already been approved by California’s Department of Motor Vehicles to test on public roads, delivering goods from partners like Krogers, Domino’s, Walmart and CVS. The coronavirus pandemic accelerated the need for goods delivery, giving Nuro an opportunity to become a leader in this space. Woven Capital saw an opportunity to help accelerate and strengthen that leadership position, while also setting up a strategic knowledge sharing arrangement between the two.\n\n“[Woven Capital] has assembled a great team with ambitious goals for the future, and we share a common objective of transforming the way people live and move to make life better,” said Nuro co-founder and president Dave Ferguson in a statement. “We’ll use this new capital, and the support of one of the largest automotive companies in the world, to continue growing our team and building a great autonomous delivery product.”\n\nAutomation will be a big part of Woven Capital’s portfolio, which exists to support all of parent Woven Planet’s activities, including Woven City, a testing ground for new technologies set in an interconnected smart city prototype. In February, Toyota broke ground at the Higashi-Fuji site in Susono City, Japan, at the base of Mount Fuji.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“When we think about Woven City, we think about autonomous mobility and automation more broadly,” said Kellerman. “To facilitate that, you’re going to need artificial intelligence, machine learning, data and analytics, connectivity. So we’re going to be building a portfolio that has investments in all those areas.”\n\nA growing trend in the mobility industry is to view mobility not just as the movement of people and goods, but as the movement of information and data. Woven Planet recognizes this and is taking a software-first approach, particularly when it comes to automobiles. This means that instead of the historical auto industry approach of designing the hardware first, and then fitting in the software to operate that vehicle, you start with the software and build hardware around it.\n\nBuilding off a software-first architecture provides a lot flexibility for future innovation. If the hardware changes, you don’t have to rewrite the code, you could just add in another application. Kellerman said all the software Woven Planet is developing as a company should be usable in as many applications as possible.\n\nHaving really strong, integrated software is also the logical next step for connected mobility, and it opens up doors for rethinking what a vehicle has the potential to transport. A Nuro vehicle isn’t just a vehicle for whatever groceries it’s delivering, but it’s also a vehicle for all the information it picks up along the way and transmits back to the cloud, such as traffic flows and weather patterns. The value, therefore, is less in the A to B utility, and more in the interchange of information.\n\nSome of the information collected by Nuro that could be immediately useful to Woven City is that related to street safety. Nuro’s vehicles don’t carry passengers, so the design features focus more on the safety of people outside of the vehicle, the aggregate data of which could be useful in human-centered city planning.\n\nIn the end, Woven Capital’s long-term view is always a potential funnel to future mergers and acquisitions, said Kellerman.\n\n“Toyota is not historically a very acquisitive company, but within Woven Planet we’re building a corporate development team with an eye to how we can accelerate the vision and mission of Woven Planet through strategic acquisitions, as well,” said Kellerman."}