{"url": "https://techcrunch.com/2025/04/24/wait-how-did-a-decentralized-service-like-bluesky-go-down/", "title": "Wait, how did a decentralized service like Bluesky go down?", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-24T00:00:00", "text": "It turns out that decentralized social networks can go down, too.\n\nOn Thursday evening, the decentralized social network Bluesky experienced a significant outage, leaving users unable to load the app on both the web and mobile devices for roughly an hour. According to a message on Bluesky’s status page, the company was aware of the outage, which it attributed to “Major PDS Networking Problems.” (PDS means personal data servers.)\n\nThe first status message was posted at 6:55 p.m. ET, and a second one indicating that a fix was being applied was shared soon after, at 7:38 p.m. ET.\n\nThe question many may be asking now is, how did this decentralized social network go down? Isn’t it … decentralized? Isn’t one of the perks of decentralization that there’s not a single point of failure?\n\nDespite the platform’s decentralized nature, the majority of Bluesky users today interact with the service via Bluesky’s official app, powered by the AT Protocol. While in theory, anyone can run the various parts of the infrastructure that make up the protocol, including PDS, relays, and other components, it’s still early days for the social network, so few have done so.\n\nThose who did, however, were not impacted by the outage.\n\nIn time, the idea is that many communities will be built on Bluesky, some with their own infrastructure, moderation services, and even client applications. (One example is the work that the Blacksky team is doing to create safer, more welcoming online spaces that take advantage of these decentralized tools.)\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nEventually, the hope is that Bluesky will be one of many entities that run the infrastructure needed to support the growing number of applications built on the AT Protocol.\n\nIn the near term, however, an outage impacting Bluesky’s infrastructure will be felt more broadly.\n\nThe outage stirred up some of the rivalry between Bluesky and another decentralized social network, Mastodon, which runs on a different social networking protocol called ActivityPub. Mastodon users were quick to point to the outage in order to make jokes or jabs that focused on Bluesky’s approach to decentralization.\n\nOne Mastodon user, Luke Johnson, wrote, “See how the mighty Bluesky crumbles while the Raspberry Pi running Mastodon under my bed just keeps chugging along” — a reference to how Mastodon can run off even tiny machines users themselves configure.\n\nOr, as another Mastodon user joked, “nice decentralisation ya got there.”\n\nIn any event, Bluesky’s outage was resolved shortly after it began and the service is back up and running.\n\nOn Friday, Bluesky CTO Paul Frazee confirmed in a post that Bluesky’s personal data servers (PDS) were the victim of DDoS attacks — typically, malicious attempts by bad actors to disrupt normal traffic to a server. Other PDSs were not targeted. The attack’s source has not been identified, but Frazee says the current theory is that it was an accident by a third party.\n\nThis post was updated after publication to include the confirmation of the DDoS attack."}