{"url": "https://techcrunch.com/2022/06/22/african-healthtech-startups-in-the-supply-chain-segment-show-rapid-growth-spurring-a-7m-investment-initiative/", "title": "African health tech startups in the supply chain segment show rapid growth, spurring a $7M investment initiative", "authors": ["Tage Kene-Okafor", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-06-22T00:00:00", "text": "While Africa’s health systems are still reeling from the effects of the COVID pandemic, the adoption of digital health services has been revved up in some countries. Telemedicine, the standout offering, witnessed massive adoption during the pandemic, and in the last five years, no other service has been launched more by health tech startups.\n\nHowever, a particular segment has achieved scale faster within the past year. These startups digitize the supply chain and distribution to providers. And according to a new report from Salient Advisory, a global healthcare consulting firm, this is the segment where the most impressive growth has occurred for Africa’s healthcare in the last 12 months.\n\nCompanies in this segment work with community pharmacies and lower-end providers such as drug shops to help stock products. Some include mPharma, Lifestores, Shelf Life and Maisha Meds.\n\n“The fastest traction we’re seeing are those helping the providers — those who interface with the customer, like pharmacies, clinics and hospitals — to digitize distribution to the consumer. That’s where the greatest traction has happened,” said Remi Adeseun, director, Africa at Salient Advisory, to TechCrunch in an interview.\n\nSalient surveyed over 80 companies across Ghana, Kenya, Nigeria and Uganda — 25% more than the number it tracked in its last report in 2021.\n\nThe models of these B2B companies mirror their retail e-commerce counterparts such as Wasoko and TradeDepot, as they use tech-enabled solutions to digitize medicine distribution to underserved pharmacies, drug shops, clinics and hospitals.\n\nAs such, their growth has been rapid, Salient says. Lifestores, for instance, increased its outlets from 85 to 600 in Nigeria; Maisha Meds grew from 400 to 900 outlets across Kenya and Nigeria; Shelf Life has over 1,630 outlets in Kenya and Nigeria, up from 400 the year before.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe report says 36% of all-time funding reported by the health supply chain startups it profiled was raised in the last 12 months. However, the segment is yet to record the type of investments that have poured into B2B retail e-commerce in the previous two years.\n\nFor instance, medium-to-large scale players like MarketForce and Wasoko have raised between $40 million-$130 million in single rounds (some including debt). And save from mPharma, which has a network of Mutti pharmacies and recently raised $35 million to build out its telehealth and e-commerce offerings, funding has been few and far between for B2B distribution health tech startups.\n\n“Companies like Wasoko and other companies in B2B e-commerce involved in FMCG are raising larger sums. But the point we’re making within the context of health tech and within the smaller context of our research is that these B2B companies are growing the fastest. Over the last four months, they also raised the larger sums of money,” says Yomi Kazeem, senior consultant for West Africa at Salient Advisory. “And of course, funding in health tech is generally low. So we wouldn’t expect them to be raising large sums just yet. But there’s every possibility that as they grow, that might change.”\n\nOne way Adeseun reckons that might happen is if B2B e-commerce platforms in retail take an interest in pharmaceutical and health-based products. But he contends that since most of these startups haven’t scratched the surface of a vast FMCG space, it’ll take a long while before they invest in B2B medicine distribution.\n\nAdeseun also cited two events that could push more funding into this segment. “We think one of the things that will also drive investor interest is when the scale matches the kind of appetite they have. Many startups operate in [one] or two countries, so expanding geographic footprints will be an enabler to draw in better funding.” The second is clearer and forward-thinking regulations.\n\nBut Salient notes in its report that regulatory frameworks governing this space, especially e-pharmacy activities, have evolved since last year. Online pharmacy regulations have been launched in Nigeria and Ghana and are in development in Kenya and Uganda. The report says all regulations currently require online pharmacies to have a licensed physical location under the control of a licensed pharmacist.\n\n“Uniquely, Ghana is going beyond enacting online pharmacy regulations to embark on broader digital transformation of pharmaceutical care, through a government-run, centralized e-pharmacy platform to house all online pharmacy transactions across the country,” its authors wrote.\n\n“This could transform the availability of product data and confer end-to-end visibility for product movement in the online pharmacy space. Once fully established, the platform’s scope could be expanded to include health products currently being distributed through offline models and serve as a model for similar initiatives beyond Ghana.”\n\nThe research found that while many startups, retail pharmacies and e-commerce players such as Jumia and Copia remain active in digitizing distribution, customers ordering over-the-counter products from their online channels appeared small.\n\nOn competition between these platforms, Adeseun said a few of these chain pharmacy incumbents, such as MedPlus and HealthPlus, are taking on a digital strategy by adding telemedicine capabilities, thus responding to the innovation that startups introduced. However, a direct path to multinational telemedicine scale through these chains is not clear, the report contended.\n\nRegarding how they influence their market, 94% of companies surveyed claimed to have an impact on medicine supply. 60% said theirs was on quality, while 43% of innovators claimed an effect in lowering pharmaceutical and drug prices.\n\nLast year, two talking points from Salient’s report were the need for increased capital from Africa-based investors and more money to flow into women-led startups. There’s been an improvement on the former: 58% of innovators that raised funding in the last 12 months cited Africa-led investors as a source of financing. But nothing has changed for the latter category as women-led startups are not still receiving the funding they need. According to the report, female-led startups with Black CEOs accounted for 2% of the total funding raised by health tech startups featured in this report. In 2021, they received just $1.6 million.\n\nSpurred by the findings, a consortium of global and continental organizations, with funding from the Bill and Melinda Gates Foundation, is set to launch a $7 million pan-African health tech initiative. Adeseun said the initiative, dubbed “Investing in Innovation (I3),” will focus on women’s access to funding: supporting and funding 60 early and growth-stage African health supply chain startups over two years — and providing access to skills development.\n\n“Women founders are disadvantaged,” the director said. “And that’s one of the things the investment in innovation will try to address: to take that gender and disadvantaged African founder lens and prioritize them when selecting the potential beneficiaries who will participate in the program.”\n\nThe pan-African initiative will have four hubs in east, north, south and west Africa. It will give these startups access to market opportunities and showcase them to impact investors and venture capitalists. The expectation for the initiative is that after the two years elapses, additional funding will come from development partners who have already indicated interest but want proof of success before committing, Adeseun said."}