{"url": "https://techcrunch.com/2024/01/16/sierra-space-joins-defense-primes-in-landing-massive-military-satellite-contract/", "title": "Sierra Space joins defense primes in landing massive military satellite contract", "authors": ["Aria Alamalhodaei", "Reporter", "Space", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-01-16T00:00:00", "text": "Sierra Space is joining Rocket Lab as a current or formerly VC-backed space company to land a major satellite deal with the military.\n\nThe Space Development Agency (SDA) selected Sierra, along with Lockheed Martin and L3Harris, to build 54 satellites in deals collectively worth $2.5 billion. The news, announced today, follows news from last week that Rocket Lab landed a similar contract for up to $515 million.\n\nThe award, as well as Rocket Lab’s, shows that more and more companies are looking to take a slice of a market that until now had been the exclusive domain of defense primes: military satellites. Most recently, Sierra closed a $290 million Series B round that skyrocketed its valuation to $5.3 billion.\n\nThe 54 satellites will form part of the SDA’s Proliferated Warfighter Space Architecture, a massive missile detection and tracking constellation in low Earth orbit that’s being built and launched in “tranches.” The trio of contracts announced today is for 18 satellites each in the Tranche 2 Tracking Layer: L3Harris’s award is worth $919 million; Lockheed Martin, $890 million; and Sierra Space, $740 million.\n\n“We’re pleased to welcome Sierra Space, a new entrant as a prime vendor on Team SDA, as we continue working with L3Harris and Lockheed Martin on Tranche 2,” SDA director Derek Tournear said in a statement. “The marketplace is responding to the demand signals for our spiral development model. The agile response across the space industry is critically important as we deliver to the warfighter this no-fail mission capability of missile warning, missile tracking, and missile defence.”\n\nThe 54 satellites will consist of 48 dedicated to missile detection and tracking and 6 to missile defense. All will be equipped with infrared sensors, though the sensors on the six birds dedicated to missile defense will be capable of generating what the SDA calls “fire control-quality tracks,” which are sensitive enough to guide an interceptor to bring down an aggressor’s missile.\n\nWhile Lockheed and L3Harris have an established track record winning satellite manufacturing contracts with the SDA, this is the first award of this kind for Sierra Space. The latter company is best known for its Dream Chaser spaceplane and Orbital Reef private space station project, rather than satellite manufacturing at scale.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe satellites are expected to launch no later than April 2027."}