{"url": "https://techcrunch.com/2022/10/06/post-pandemic-telemedicine-startups-are-evolving-this-just-one-raised-6m-for-its-hybrid-approach/", "title": "Post-pandemic, Telemedicine startups are evolving — this one just raised $6M for its hybrid approach", "authors": ["Mike Butcher", "Editor At Large", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-10-06T00:00:00", "text": "So-called “personalized medicine” is all the rage these days. Healthcare is being gradually affected by data-driven insights gleaned through what the healthcare sector calls “precision medicine.” The COVID-19 pandemic has added urgency to this sector. The 15-minute appointment that ends in prescription medicine is also being affected by the advance of remote telemedicine, and this whole arena is now being populated by startups.\n\nAlthough there is plenty of investment in telemedicine, there remains a space for using telemedicine in treating chronic diseases using a hybrid of in-home care and telemedicine. Other players in this space include CarbonHealth and Dispatch.\n\nThis is why it’s of interest that telemedicine-based Index Health has now raised a $6 million seed round. The Miami-based startup says it offers “data-driven and personalized approach” to a medical treatment called “root cause” or “functional Medicine,” using lab tests, specialized staff and personalization.\n\nThe $6 million round was co-led by LAUNCHub Ventures and Inovo Venture Partners and will be used to hire specialized medical professionals, engineering talent and expand across the U.S., employers, insurance companies and go direct to consumers.\n\nIndex Health’s main focus is on cardiovascular disease, diabetes, hormones and auto-immune conditions, where its members regularly speak to their physician and nutritionist. The startup says it collects over 1,000+ data points per single lab test and each session with a physician is an hour during the months-long course of treatment.\n\nThere are also specialized telemedicine providers such as Cerebral (mental health), Hinge (joints) and Virta (diabetes).\n\nThat said a string of healthcare unicorns have announced layoffs over the past few months, including Ro, Cerebral, Forward and Calibrate.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMany companies in the space offer prescription services and OTC drugs. Index Health is hoping its data-driven, personalized approach, combined with telemedicine will be the more winning formula in “root-cause medicine.”\n\nIn a statement, CEO Luka Ivicevic — who previously co-founded a German challenger bank — said:\n\nWith Root Cause Medicine, we collect 1,000+ data-points using advanced lab tests, to make the most precise overview of why a disease is occurring in an individual’s body. Based on this data, we make a treatment that’s personalized for them and their condition.\n\nThe company is available in Florida, Virginia and New Hampshire."}