{"url": "https://techcrunch.com/2023/10/02/greener-for-business/", "title": "Greener for Business launches to help Australian SMBs move to net zero", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-10-02T00:00:00", "text": "Greener, the Australian cleantech startup that creates custom action plans to help its customers become more environmentally sustainable, is launching Greener for Business today. Aimed at Australian SMBs, Greener for Business is intended to help them move more quickly toward net zero. It has the lofty goal of helping every SMB in Australia halve emissions by 2030 and, so far, has reached almost one million SMBs for its launch. Greener also announced a strategic partnership with Origin, the Australian energy retailer.\n\nFor SMBs that want to create more environmentally sustainable businesses, time and resources are often an issue. Greener cites statistics that show SMBs make up more than 98% of Australian businesses, contributing about $506 billion to the economy. But 43% of SMBs run at a loss, with almost half failing within the first four years.\n\nWith the pressure that SMBs cope with in mind, Greener for Business is available to them for free. It monetizes through a supplier-funded model by working with companies that give exclusive offers to Greener’s members, while reducing emissions and saving money. Greener’s action plans help SMBs in any sector make changes to their operations across emissions areas like energy, waste, electrification, packaging and logistics, and can help them save money. In addition to Greener’s action plans, Greener for Business also helps users find government rebates.\n\nGreener co-founder Tom Ferrier told TechCrunch that “when it comes to climate change, things can be notoriously complex and we know the more complicated things get, the less likely people are to take action.” That’s why Greener for Business creates step-by-step plans that are easy to follow and can have positive impacts on a SMB’s bottom line.\n\nTo create its action plans, Greener works with climate and behavioral experts, including the Harvard’s Behavioral Insights Group. The actions in Greener for Business are also aligned with the UN Race to Zero. Ferrier added that Greener has worked with carbon experts, like Pangolin Associates, one of the top carbon measurement and consultancy firms in Australia. Greener uses Pangolin’s carbon footprint benchmarking dataset to estimate emissions savings for businesses based on their size, industry and actions.\n\n“There’s a common misconception that the greener option is the more expensive option, requiring expensive sustainability consultants, and so getting greener isn’t always top of mind for SMBs,” Ferrier said. But that’s a myth Greener has set out to debunk, by doing things like forming a coalition of large Australian brands, including Origin and Sendle, who give Greener users offers that can help them reduce their emissions.\n\nGreener’s partnership with Origin means Greener for Business’ users get offers for products like solar energy and GreenPower, a government-accredited renewable energy program that matches energy use by sending the same amount of renewable energy back to the grid. Stitch Bar in Sydney, a Greener for Business user, was able to save more than $2,000 annually by switching to GreenPower, and Ferrier said it also took the equivalent of 34 cars off the road in emissions.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nGreener for Business’ action plans might include advice like switching to LED lighting, which could save the average SMB more than $2,300. For businesses that own their own property, installing rooftop solar might be an option and save them $7,000 a year in less than five years.\n\nFerrier adds that some actions might seem more obvious than others, but “what some businesses may not realize is that there are real savings to be made even in areas they may not think about, like their rubbish collection. We show them how separating waste streams to reduce the amount of waste sent to landfill, considering their bin suppliers, can have significant benefits to their bottom line as well as the planet. For example, simple changes to waste management can actually help an average 40-seat restaurant save over $1,000 a year.”\n\nGreener’s partners include several local city councils, including Ku-ring-gai, North Sydney, Willoughby, Yarra and Moonee Valley. “When it comes to councils and commercial property groups, many have set net zero targets but inherit the emissions of businesses in their locations,” Ferrier said. “This means that to achieve their targets, they are reliant on these businesses to reduce emissions and need an easy and compelling way to do so.” In working with Willoughby council, Greener has identified an approach that could help them achieve 118% of their net zero target four years early.\n\nOther partners include the Australian Retailers Association (ARA). Mr Yum and Shopline. Ferrier says they are helping them greater more financially sustainably and greener businesses by helping their members and customers save money and emissions.\n\nGreener is backed by NAB Ventures and RealVC."}