{"url": "https://techcrunch.com/2024/01/29/startup-studio-hexa-hires-former-doctolib-exec-to-launch-its-health-vertical/", "title": "Startup studio Hexa hires former Doctolib exec to launch its health vertical", "authors": ["Romain Dillet", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-01-29T00:00:00", "text": "Hexa, the Paris-based startup studio that recently raised $22 million, is launching a new vertical focused on improving the healthcare system. Julien Méraud, a senior team member of the French unicorn startup Doctolib, is joining the startup studio.\n\nAs a reminder, Hexa started its life as eFounders and originally focused specifically on B2B software-as-a-service startups. The studio comes up with startup ideas, finds startup founders to pair them with these ideas and helps them get started with its own core team and some initial funding.\n\nAfter a while, startups “graduate” from the startup studio and continue their life as independent companies — with Hexa maintaining a stake in its portfolio companies. Some of Hexa’s past companies include Front, Aircall and Spendesk.\n\nAs Hexa starts to branch out to other verticals, the startup studio is also rethinking its strategy. For the health vertical, Hexa is not only hiring Julien Méraud, but it’s also going to work with a full-time medical doctor to help when it comes to assessing future projects.\n\nFor each health tech startup, Hexa will look for two co-founders — a doctor who already knows their speciality and has hands-on experience and an operational founder who knows how to scale companies.\n\nHexa Health will have a vertical approach with each company focusing on one pathology specifically. The first two startups that will come out of the studio will focus on weight loss and skin cancer detection.\n\n“The idea is to have a CEO and a CTO — just like in most startups. And that’s quite common across all Hexa companies. But something that’s a bit new with this particular vertical is that we believe innovation in healthcare should be driven by doctors. In other words, if you ask me to design the perfect care to detect skin cancer, I’m not capable of doing it. That’s why we want to work with doctors on every innovation,” Méraud told me.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nHe also insists on the fact that Hexa doesn’t want to disrupt the healthcare industry as a whole. With this new vertical, the startup studio wants to find inefficiencies and improve the care pathways, as there’s a growing imbalance between an aging population in Europe and the available medical time.\n\n“Tech shouldn’t just enable faster care. It should also enable better care. And we’re really going to focus on measuring the medical quality of care and everything we create,” Méraud said."}