{"url": "https://techcrunch.com/2020/10/20/flex-logix-chip-availability/", "title": "Lux-backed Flex Logix announces availability of its fast and cheap X1 AI chip for the edge", "authors": ["Danny Crichton", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2020-10-20T00:00:00", "text": "In the computing world, there are probably more types of chips available than your local supermarket snack aisle. Diverse computing environments (data centers and the cloud, edge, mobile devices, IoT, and more), different price points, and varying capabilities and performance requirements are scrambling the chip industry, resetting who has the lead right now and who might take the lead in new and emerging niches.\n\nWhile there has been a spate of new chip startups like Cerebras, SiFive, and Nuvia funded by venture capitalists in the past two years, Flex Logix got its footing a bit earlier. The company, founded in 2014 by former Rambus founder Geoff Tate and Cheng Wang, has collectively raised $27 million from investors Lux Capital and Eclipse Ventures, along with Tate himself.\n\nFlex Logix wants to bring AI processing workflows to the compute edge, which means it wants to offer technology that adds artificial intelligence to products like medical imaging equipment and robotics. At the edge, processing power obviously matters, but so does size and price. More efficient chips are easier to include in products, where pricing may put constraints on the cost of individual components.\n\nIn the first few years of the company, it focused on developing and licensing IP around FPGAs, or reprogrammable chips that can be changed after manufacturing through software. These flexible chips are critical in applications like AI or 5G, where standards and models change rapidly. It’s a market that is dominated by Xilinx and Altera, which was acquired by Intel for $16.7 billion back in 2015.\n\nFlex Logix saw an opportunity to be “the ARM of FPGAs” by helping other companies develop their own chips. It built customer traction for its designs with organizations like Sandia National Laboratory, the Department of Defense and Boeing. More recently, it has been developing its own line of chips called InferX X1, creating a hybrid business model not unlike the model that Nvidia will have after its acquisition of ARM clears through regulatory hurdles.\n\nWith that background out of the way, Flex Logix unveiled the availability of its X1 chip, which is currently slated to be offered at four speeds ranging from 533Mhz to 933Mhz. CEO Tate stressed on our call that the company’s key differential is price: those chips will be priced between $99-$199 depending on chip speed for smaller orders, and $34-$69 per chip for large-scale orders.\n\nThe reason those chips are cheaper is that they are significantly smaller than competing chips from Nvidia in its Jetson chip lineup according to Tate, up to 1/7 the size. Smaller chips generally have lower costs, since each wafer in a chip fab can hold more chips, amortizing the cost of manufacturing over more chips. According to the company, its chips outperform Nvidia’s Xavier module, although independent benchmarks aren’t available.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Every customer we talk to wants more processing power per dollar, more processing power per unit of power … and with our die-size advantage we can give them more for their money,” Tate explained.\n\nCustomer samples for these new chips are expected to arrive in the first quarter next year, with scale manufacturing in the second quarter.\n\nThe company’s plan is to continue both sides of its business and continue to grow and mature its technology. “Our embedded FPGA businesses is now, as a standalone, profitable. The amount of money we’re bringing in exceeds the engineering and business. And now we’re developing this new business for inference which ultimately should be a bigger business because the market is growing very fast in the inference space,” Tate explained.\n\nThe company’s board consists of Peter Hébert and Shahin Farshchi of Lux, Pierre Lamond at Eclipse, and Kushagra Vaid, a distinguished engineer at Microsoft Azure. The company is based in Mountain View, California."}