{"url": "https://techcrunch.com/2025/05/05/meet-the-companies-racing-to-build-quantum-chips/", "title": "Meet the companies racing to build quantum chips", "authors": ["Anna Heim", "Freelance Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-05-05T00:00:00", "text": "Quantum computing has long been announced as “just around the corner,” but several companies are now determined to make this a commercial reality, with the promise of solving complex problems beyond classical computers’ reach.\n\nThe problems in question are wide-ranging, from medicine and cybersecurity to materials science and chemistry. But first, there are very practical problems to be solved, such as developing chips that can reliably host large numbers of qubits — short for quantum bits, the fundamental unit of information in quantum computing.\n\nAs usual in a high-stakes tech race with an uncertain time horizon, tech giants such as Google and Microsoft are at the forefront. Yet startups are also set to play an important role, especially tackling bottlenecks like connectivity and error correction that are critical for scaling quantum systems.\n\nBut some startups and smaller tech companies are taking on the chip challenge head-on and deserve mention alongside the more attention-grabbing efforts from industry giants. While Big Tech projects typically boast the highest qubit counts, rethinking designs from first principles and using different approaches could yield equally promising results.\n\nHere are some of the companies behind the main quantum chip projects that are worth tracking.\n\nAkhetonics\n\nAkhetonics is a German photonics startup working on an all-optical, general-purpose chip — a contrarian bet in a field where most focus on narrower applications. This bold version and its first-principles approach helped the company raise a €6 million seed funding round led by Matterwave Ventures in November 2024.\n\nAlice & Bob\n\nAlice & Bob is a French startup that raised a $104 million Series B round of funding in January 2025 to continue working toward building a “fault tolerant” quantum computer.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nUnlike companies focusing only on chips, Alice & Bob is developing a full quantum computing system. To do so, it relies on cat qubits, a type of superconducting qubit designed to reduce errors and simplify error correction.\n\nAmazon\n\nAmazon officially joined the quantum chip race in early 2025 when AWS introduced Ocelot, developed in partnership with the California Institute of Technology. While this is the company’s first quantum chip, AWS had previously launched Braket, a quantum computing service, in partnership with D-Wave, IonQ, Rigetti, and others.\n\nAtom Computing\n\nAtom Computing is a U.S. company building quantum computers with arrays of optically trapped neutral atoms.\n\nAt the Microsoft Ignite 2024 conference, Microsoft and Atom Computing announced plans to launch a commercial quantum computer in 2025.\n\nD-Wave\n\nD-Wave is a quantum computing company whose latest flagship system, the Advantage2 prototype, relies on a process called quantum annealing, which uses quantum physics to find the most stable, lowest-energy arrangements of elements to figure out the best mix for a given problem.\n\nFounded in 1999 as a spinoff from the University of British Columbia in Canada, D-Wave is now a public company listed on the NYSE.\n\nEeroQ\n\nIllinois-based EeroQ is a startup betting on helium for its quantum chip design. Having raised a $7.25 million seed funding round in 2022 and received regional public support, the company made a $1.1 million commitment in September 2024 toward expanding its HQ in Chicago’s Humboldt Park.\n\nFujitsu and RIKEN\n\nIn April 2025, Fujitsu and Japanese research institution RIKEN announced having developed a 256-qubit superconducting quantum computer at the RIKEN RQC-FUJITSU Collaboration Center, up from a 64-qubit iteration in 2023.\n\nGoogle\n\nIn December 2024, Google announced Willow, its latest quantum computing chip.\n\nGoogle didn’t stop at saying Willow was better than its predecessor, Sycamore, or at describing it as “a major breakthrough in quantum error correction.” In a statement that made headlines, Google Quantum AI founder Hartmut Neven wrote that Willow’s performance lent “credence to the notion that quantum computation occurs in many parallel universes.”\n\nIBM\n\nIBM’s quantum efforts include Condor, its milestone superconducting chip for scaling up to 1,121 qubits, and Heron, a 156-qubit processor focused on improved performance and lower error rates.\n\nInfleqtion\n\nFounded in 2007, Infleqtion (formerly ColdQuanta) is a US-based company developing quantum computers based on neutral atom technology.\n\nIntel\n\nIntel is developing quantum computers based on silicon spin qubits. In June 2023, it unveiled Tunnel Falls, a 12-qubit research chip, and said a next-generation quantum chip based on Tunnel Falls was expected to be released in 2024, but this hasn’t happened.\n\nIonQ\n\nIonQ is a publicly listed U.S. company developing trapped-ion quantum computers, including the IonQ Forte. After going public via a SPAC in late 2021, it acquired Canadian networking specialist Entangled Networks.\n\nIQM\n\nIQM is a Finnish startup building superconducting quantum computers and is a spinout of the Aalto University and VTT Technical Research Centre of Finland. It received funding in its early days from the Business Finland government agency, followed by additional support from the EIC Accelerator program.\n\nIn 2022, IQM raised €128 million in Series A2 funding led by World Fund, adding to the €39 million led by MIG Fonds it had raised in 2020 as part of what was then its Series A. This second tranche included part of a previously announced €35 million venture loan from the European Investment Bank, as well as participation from the EIC Fund and others.\n\nMicrosoft\n\nIn February 2025, Microsoft introduced Majorana, a quantum chip using a topological core architecture. Microsoft previously declared that it expected to build a quantum supercomputer within 10 years.\n\nOxford Ionics\n\nAs its name suggests, Oxford Ionics is a British startup that spun out of Oxford University and focuses on trapped-ion quantum computing.\n\nIt raised a £30 million Series A (approximately $36 million) in early 2023, followed by an additional £2 million (approximately €2.32 million) from the UK’s National Security Strategic Investment Fund (NSSIF) that same year. More recently, it was selected for DARPA’s Quantum Benchmarking Initiative (QBI) alongside Quantinuum.\n\nPasqal\n\nPasqal is a French startup taking a full-stack approach to quantum computing and betting on neutral atoms. The company emerged out of the Institut d’Optique in 2019, and its co-founders include 2022 Nobel Prize laureate for physics and professor Alain Aspect.\n\nIn February 2023, Pascal raised a €100 million Series B funding round led by Singapore’s Temasek, with participation from existing investors Quantonation, the Defense Innovation Fund, Daphni, and Eni Next, as well as new investors European Innovation Council (EIC) Fund, Wa’ed Ventures, and Bpifrance (through its Large Venture Fund).\n\nPsiQuantum\n\nPsiQuantum is a quantum computing startup using photonics technology and aiming to build “a 1 million-quantum-bit machine.” In February 2025, it announced Omega, a quantum photonic chipset manufactured at GlobalFoundries in New York.\n\nIn 2021, PsiQuantum landed a $450 million Series D investment led by BlackRock, which is now said to be leading a potential $750 million round into the company at a $6 billion pre-money valuation. Founded by Australian academics, it is also backed by the Australian and Queensland governments.\n\nQilimanjaro\n\nQilimanjaro is a Spanish startup focusing on analog quantum app-specific integrated circuits (QASICs) and taking a full-stack approach, including hardware, software, and applications.\n\nBased in Barcelona, it won the Four Years From Now startup competition at Mobile World Congress in 2024, going on to receive €1.5 million in funding from Catalonia later that year.\n\nQuandela\n\nQuandela is a French startup founded in 2017 to develop photonic quantum computers.\n\nIn November 2023, Quandela raised a €50 million Series B and received support from the French government through the France 2030 Plan.\n\nQuantinuum\n\nQuantinuum is a quantum computing company formed in 2021 by the merger of Cambridge Quantum and Honeywell Quantum Solutions. Its flagship product is the H-Series of trapped-ion quantum computers. In April 2024, together with Microsoft, it announced a breakthrough in error correction.\n\nQuantWare\n\nQuantWare is a Dutch startup that came up with a proprietary 3D chip architecture, VIO, which focuses on scaling bottlenecks in quantum processing units (QPUs). It started accepting preorders for Contralto-A, its first QPU for quantum error correction, in February 2025.\n\nFounded in 2020, it is a spinout of TU Delft and its affiliated research institute, QuTech. In March 2025, and following a €6 million seed round in 2023, it announced having raised a €20 million Series A (approximately $19.27 million) — including €5 million in equity out of the €7.5 million it previously secured from the European Innovation Council (the remainder is a grant).\n\nQuEra\n\nBoston-based QuEra is betting on neutral atoms as the “best approach to achieve large-scale, fault-tolerant quantum computers.” Its products include Aquila, a 256-qubit analog neutral-atom quantum computer launched in 2022 and accessible via Amazon Braket.\n\nQuEra is notably backed by Google, which led the $230 debt round that the quantum startup raised in February 2025 — with a convertible note also backed by SoftBank, Valor, and existing investors.\n\nRigetti Computing\n\nFounded in 2013 by Chad Rigetti, Rigetti Computing is a quantum company focusing on superconducting technology. Its range of products include Ankaa-3 and the uppcoming 336-qubit Lyra system.\n\nJust like rivals D-Wave and IonQ, Rigetti Computing is a listed company; it raised just under $200 million in VC capital before going public via a SPAC in 2021.\n\nIn February 2025, it signed a strategic partnership with Taiwan-based Quanta Computer, which is set to invest $35 million and purchase shares of Rigetti, while both companies invest more than $100 million each over the next five years to accelerate the development and commercialization of superconducting quantum computing.\n\nSEEQC\n\nU.S. quantum startup SEEQC — an acronym for “scalable, energy efficient quantum computing” — is a spinout of chip company Hypres, which was itself established by former employees of IBM’s superconducting electronics division.\n\nIn 2023, SEEQC announced a partnership with Nvidia to build an “all-digital, ultra-low-latency chip-to-chip link between quantum computers and GPUs.”\n\nIn January 2025, SEEQC raised a $30 million round of funding co-led by Booz Allen Ventures and Japanese-European VC firm NordicNinja.\n\nOther backers include Merck’s corporate venture capital arm, M Ventures. SEEQC is leading the U.K.-supported QuPharma project to explore how quantum computing can accelerate drug discovery, in partnership with BASF and Merck.\n\nSpinQ\n\nSpinQ is a Chinese startup founded in 2018 that develops quantum computers. It claims that some of them are portable and making use of nuclear magnetic resonance (NMR).\n\nXanadu\n\nXanadu is a Canadian startup aiming to build quantum computers through a photonic approach. In January 2025, it introduced Aurora, a 12-qubit system, including 35 photonic chips.\n\nFounded in 2016, Xanadu raised some $275 million to date, including a $100 million Series C in November 2022 at a $1 billion valuation.\n\nThis story was originally published on April 28, 2025 and will be regularly updated."}