{"url": "https://techcrunch.com/2020/10/01/macrometa-an-edge-computing-service-for-app-developers-lands-7m-seed-round-led-by-dnx/", "title": "Macrometa, an edge computing service for app developers, lands $7 million seed round led by DNX", "authors": ["Catherine Shu", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2020-10-01T00:00:00", "text": "As people continue to work and study from home because of the COVID-19 pandemic, interest in edge computing has increased. Macrometa, a Palo Alto-based startup that provides edge computing infrastructure for app developers, announced today it has closed a $7 million seed round.\n\nThe funding was led by DNX Ventures, an investment fund that focuses on early-stage B2B startups. Other participants included returning investors Benhamou Global Ventures, Partech Partners, Fusion Fund, Sway Ventures, Velar Capital and Shasta Ventures.\n\nWhile cloud computing relies on servers and data centers owned by providers like Amazon, IBM, Microsoft and Google, edge computing is geographically distributed, with computing done closer to data sources, allowing for faster performance.\n\nFounded in 2018 by chief executive Chetan Venkatesh and chief architect Durga Gokina, Macrometa’s globally distributed data service, called Global Data Network, combines a distributed NoSQL database and a low-latency stream data processing engine. It allows developers to run their cloud apps and APIs across 175 edge regions around the world. To reduce delays, app requests are sent to the region closest to the user. Macrometa claims that requests can be processed in less than 50 milliseconds globally, making it 50 to 100 times faster than cloud platforms like DyanmoDB, MongoDB or Firebase. One of the ways that Macrometa differentiates from competitors is that it enables developers to work with data stored across a global network of cloud providers, like Google Cloud and Amazon Web Services (for example), instead of a single provider.\n\nAs more telecoms roll out 5G networks, demand for globally distributed, serverless data computing services like Macrometa are expected to increase, especially to support enterprise software. Other edge computing-related startups that have recently raised funding include Latent AI, SiMa.ai and Pensando.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nA spokesperson for Macrometa said the seed round was oversubscribed because the pandemic has increased investor interest in cloud and edge companies like Snowflake, which recently held its initial public offering.\n\nMacrometa also announced today that it has added to its board of directors DNX managing partner Q Motiwala, former Auth0 and xnor.ai chief executive Jon Gelsey and Armorblox chief technology officer Rob Fry.\n\nIn a statement about the funding, Motiwala said, “As we look at the next five to ten years of cloud evolution, it’s clear to us that enterprise developers need a platform like Macrometa to go beyond the constraints, scaling limitations and high-cost economics that current cloud architecture impose. What Macrometa is doing for edge computing, is what Amazon Web Services did for the cloud a decade ago.”"}