{"url": "https://techcrunch.com/2024/04/09/reshape-wants-to-accelerate-biotech-rd-by-bringing-computer-vision-to-lab-experiments/", "title": "Reshape wants to help ‘decode nature’ by automating the ‘visual’ part of lab experiments", "authors": ["Paul Sawers", "Senior Reporter", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block"], "publication_date": "2024-04-09T00:00:00", "text": "A Danish startup wants to help R&D teams automate lab experiments that require visual inspections, raising $20 million in a Series A round of funding to scale its technology in the U.S.\n\nReshape, which was founded out of Copenhagen in 2018, has developed a robotic imaging system replete with software and AI models to help scientists track visual changes — such as color or cell-growth rates — from petri dishes and similar plate formats. Its machines sport built-in incubation that can be set to specific temperatures, with the corresponding data logged to ensure the experiments can be easily repeated.\n\nThe benefit is that these experiments can be run 24/7 without direct supervision, freeing up technicians for other critical tasks.\n\n“Decoding nature”\n\nThe concept of “decoding nature” sits at the heart of what Reshape is setting out to achieve, building on a broader trend that has seen the lines blur between the natural and manufactured worlds. These opportunities have not been lost on Silicon Valley, evidenced by the countless money poured into technologies seeking to “engineer” biology.\n\n“Biology as a whole is transitioning from a science to an engineering discipline, and I think one of the biggest things that we want to do is make some of the very ‘intangible’ — how does an object grow, how does it behave? — easier to describe,” Reshape CEO Carl-Emil Grøn told TechCrunch. “Ideally, we want to figure out how we make that translation layer between what happens in the real world, and what happens in your DNA.”\n\nThe genesis for Reshape came when Grøn, who has an engineering background, started dating someone who worked in the biotech industry, giving him insight into the amount of manual effort involved in lab experiments.\n\n“I just assumed that biotech was massively automated, but every eighth hour, of every day, for five months straight, she had to go in to the lab and take a photo of a petri dish,” Grøn said. “When you are from the tech world, it just seemed crazy.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAfter speaking to a bunch of biotech companies in the Copenhagen locale, Grøn realized that his initial experience wasn’t some weird anomaly: The way that labs carry out DNA-sequencing, measure chemical compositions and all the rest was still happening in more or less the same way as it had been done for more than a century.\n\nSo Grøn enlisted two co-founders, Daniel Storgaard and Magnus Madsen, and set about building a full-stack platform, replete with high-resolution cameras and lighting, to capture visual data points and time lapses and record how different components in a given experiment react to the conditions they are subjected to.\n\nUnder the hood\n\nReshape develops its own AI models, trained on in-house data at its own lab, and these can work from the get-go for some of the more common experiment types, such as those involving fungal or bacterial hosts, or seeds and insects. But the company can also help its customers train models for specific use cases, such as tracking how particular microbes behave under certain conditions.\n\n“The Reshape data science team, using our custom-built MLOps architecture, handles this end-to-end, starting from understanding the desired output and quantification, annotating the required datasets at scale, developing and benchmarking models, and then deploying them in our product for our customers,” Grøn said.\n\nAn agriculture company, for example, can use Reshape to test for seed germination rates, or the severity of a specific disease. Or a food company can perform ingredient characterization to test for quality, freshness or how the ingredients ripen over time — anything that typically requires a visual assessment.\n\nSome Reshape customers are using the platform technology to transition from chemical to bio-pesticides — basically, figuring out which new compounds work the best and recording how they were made. And speed is ultimately the main appeal for customers.\n\n“They’ll do like four to 10 times as many experiments as they could before, which just means that they get products to market much, much faster,” Grøn said.\n\nReshape makes the results available to view in a cloud-based interface, but the platform also supports data exports in formats such as LIMS or CSV, allowing users to take their data to other biotech software such as Benchling or even just Excel.\n\nIn terms of accuracy, Grøn says that it compares the underlying models to the performance of a human on that same experiment, covering metrics such as false negatives. This helps avoid scenarios where an experiment might otherwise have been cut short because the scientist thought the experiment was ineffective.\n\n“We help with about an 80% reduction in false negatives,” Grøn said. “We also help our customers reduce how much time they need to get a result. And instead of having to rely on remembering how you did an experiment a few years back, we keep perfect track of it. So every time you run an experiment on the platform, we track it; repeatability is extremely important.”\n\nIn terms of business model, Reshape sells the full platform as a subscription, which includes the hardware, machine learning and underlying software. The pricing is charged on a “value-based” pricing model, which can vary for each customer.\n\nFor now, Reshape ships just one size of machine, meaning if a customer has lots of experiments, then they must obtain lots of machines. So to scale this to giant industrial-grade experiments, Reshape might need bigger machines; Grøn remained somewhat coy on this matter, but he suggested that they might “branch out” to bigger devices in the future.\n\nGrowth\n\nA graduate of Y Combinator’s (YC) Winter 2021 batch, Reshape has amassed a fairly impressive roster of clients, including Swiss agricultural tech giant Syngenta and the University of Oxford. With another $20 million in the bank, which follows an $8.1 million seed round last year, Reshape says it plans to use its fresh cash injection to scale its business in the U.S., where it says around two-thirds of its revenue already emanates, albeit mostly from its European customers’ U.S. facilities.\n\n“We have proven that our technology works — now it’s about scaling it and helping as many labs as possible to accelerate the biological transition,” Grøn said.\n\nOthers are also bringing automation to science labs, including London’s Automata, which raised $40 million last year to target the broader lab workflow. And some companies offer something similar to what Reshape is trying to do, such as Singer Instruments’ PhenoBooth and Interscience’s ScanStation.\n\nBut by providing a full-stack platform complete with end-to-end data management that’s good to go off the bat, Grøn reckons this is what sets Reshape apart.\n\n“This is an expensive problem that a lot of companies have been trying to solve for a long time,” Grøn said. “We provide the incubation, image capture, and analysis in a closed-loop system. Our pre-trained models are ready to go right out of the box and don’t require time-consuming training.”\n\nReshape’s Series A round was led by European VC firm Astanor Ventures, with participation from YC, R7, ACME, 21stBio and Unity co-founder Nicholas Francis."}