{"url": "https://techcrunch.com/2023/01/19/trunk-extends-its-developer-toolkit-with-ci-analytics/", "title": "Trunk extends its developer toolkit with CI analytics", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-01-19T00:00:00", "text": "Trunk, a startup that aims to build a toolkit that helps developers build and ship their code faster, today announced the launch of its latest product: CI Analytics. The new service helps developers understand how their CI Workflows (currently with a focus on GitHub Actions) perform in the real world — and if there are any trends they should be aware of.\n\nFounded in 2021 by a group of former Uber engineers, Trunk already offers Trunk Check, a tool for checking code quality, and Trunk Merge, a service that orchestrates merging pull requests. With CI Analytics, it’s now expanding this feature set with another tool that tries to help developers work more efficiently.\n\n“I’d run these surveys and the number one issue coming back from folks is ‘the hardest part of my job is landing code and merging code into main.’ That’s insane. We’re trying to build future-forward tech to make cars drive themselves and the hardest thing for the engineers is to put their code into the codebase,” Trunk co-founder and co-CEO Eli Schleifer told me of his time at Uber. “Every company has to invest a tremendous amount of money into this stuff and you really don’t want to hire 30 engineers — that’s how many were at Uber — to build this solution, because it’s not germane to your problem space. It’s just the core tax you pay.”\n\nSchleifer described the new analytics service as an “engineering intelligence solution” that helps developers fix broken engineering workflows. He noted that while GitHub Actions has become very popular in a short amount of time, it’s also a bit of a black box. “There are a lot of engineering intelligence tools out there that will tell you that this engineer wrote this many lines of code or this many commits. We see engineering intelligence more as a tool to help the productivity of all the engineers,” Schleifer said. If Trunk can help these engineers find inefficiencies in their CI processes, then, he argues, it will make everybody in the engineering organization more efficient.\n\n“Without a proper engineering intelligence solution, DevOps and engineering teams are left operating in the dark and engineers are left to guess at what parts of their build and test workflows are slowing down engineering,” said Schleifer. “Trunk CI Analytics eliminates the guesswork with beautiful trend lines, anomaly alerting and the ability to perform deep historical analysis within a few clicks. Operating without this level of engineering intelligence can be the difference between shipping code on time and slowly grinding to a halt.”\n\nThe new service is now available to all Trunk users, with pricing starting at $7 per month and user (after a free two-week trial)."}