{"url": "https://techcrunch.com/2024/03/04/multiverse-computing/", "title": "Multiverse raises $27M for quantum software targeting LLM leviathans", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-03-04T00:00:00", "text": "We’re still years away from seeing physical quantum computers break into the market with any scale and reliability, but don’t give up on deep tech just yet. The market for high-level quantum computer science — which applies quantum principles to manage complex computations in areas like finance and artificial intelligence — appears to be quickening its pace.\n\nIn the latest development, a startup out of San Sebastian, Spain, called Multiverse Computing has raised €25 million (or $27 million) in an equity funding round led by Columbus Venture Partners. The funding values the startup at €100 million ($108 million), and it will be used in two main areas. The startup plans to continue building out its existing business working with startups in verticals like manufacturing and finance, and it wants to forge new efforts to work more closely with AI companies building and operating large language models.\n\nIn both cases, the pitch is the same, said CEO Enrique Lizaso Olmos: “optimization.”\n\nIn other words, as computing becomes more advanced, computations can be more costly and in some cases too complex to execute consistently. Multiverse’s pitch is that its software platform Singularity — designed to apply across a wide range of industries like finance, manufacturing, energy, cybersecurity and defense — can be used to run and optimize complicated modeling and predictive applications more efficiently.\n\nIn AI, the focus is more squarely on applying the platform to compress large language models, with a new product called CompactifAI honing in on the calculations that are constantly being made when building and querying LLMs, to cut out more noise and speed up the work (and thus reliability) when producing results.\n\nThe company claims that its services, accessed by clients via APIs, can compress LLMs “with quantum-inspired tensor networks” by more than 80% with the software, while still producing accurate results. If true, that could have large implications for how companies buy and use processors, addressing one of the big bottlenecks in the industry to date.\n\nLizaso Olmos cuts a polymath figure, starting out his career more than 30 years ago by first qualifying as a medical doctor, then taking a second degree in mathematics, and then a third in computer engineering with a PhD in biostatistics, which somewhat tied these things together. He then picked up an MBA, he said. Over the course of all that, he picked up like-minded thinkers and friends, and some of them — namely Roman Orus and Samuel Mugel — were interested in the concept of quantum software and were already making names for themselves through academic work around the subject.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Multiverse started in a WhatsApp group,” he jokes. The year was 2017, and for the thought experiment, a few of them thought it “would be fun” to write a scientific paper about what you could do with quantum in finance.\n\nThe paper ended up getting accepted for a conference taking place at the university in Toronto, so they went along to that. Arriving, Lizaso Olmos saw that the paper was getting shared around and discussed and suddenly it looked like people might use it as inspiration for enterprising ambitions. That was when Lizaso Olmos’s MBA-radar kicked in and he pulled his two friends together for a serious IRL chat.\n\nAnd that is how they, along with Alfonso Rubio, started Multiverse Computing.\n\nThat initial exploration of quantum and financial technology that was the subject of that paper became the company’s first commercial application, and where it picked up its first traction. Since then it has widened out into other sectors and counts Moody’s Analytics, Bosch, BASF, Iberdrola, Crédit Agricole and BBVA among its customers, and Lizaso Olmos says that together, industrial and energy clients, who like the greener aspects of more efficient computing, today actually account for more of the company’s business than finance.\n\nAlongside Columbus, previous backer Quantonation Ventures also participated alongside new backers like the European Innovation Council Fund, Redstone QAI Quantum Fund, and Indi Partners.\n\n“Multiverse’s exceptional team will soon apply their unparalleled capability to deliver quantum and quantum-inspired software solutions also within the life sciences and biotechnology markets, where Columbus Venture Partners will help to identify unmet market needs and high-profile industrial partners,” Javier García, a partner at Columbus Venture Partners, said in a statement.\n\nWhile the pitch to verticals seems to have connected with customers, what remains to be seen is how its ambition to go one level higher, to target deep tech and AI companies themselves, might play out for Multiverse. Others competing in the same space include the Alphabet spinout Sandbox AQ, Quantum Motion, and Classiq."}