{"url": "https://techcrunch.com/podcast/if-you-build-it-they-wont-come-bison-ventures-founders-on-scaling-frontier-tech/", "title": "‘If you build it, they won’t come’: Bison Ventures founders on scaling frontier tech", "authors": ["Theresa Loconsolo", "Audio Producer", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "Anthony Ha", "Maxwell Zeff"], "publication_date": null, "text": "“If you build it, they won’t come,” Bison Ventures co-founder Tom Biegala said Wednesday on the Equity podcast. The phrase is an internal mantra at Bison, the early-stage venture firm betting on “frontier tech” companies building in the material science, robotics, biotech, climate, and sustainability verticals; one that’s meant to dissuade founders from solving the problem they think exists.\n\nBison’s mantra, according to Biegala, “hammers home the point that if these entrepreneurs aren’t talking to customers and validating their hypothesis around the pain point, around the value proposition, around the product specs, that’s a major, major red flag for us.”\n\nSo how can founders scale frontier tech? Today on Equity, Rebecca Bellan asks Biegala and his co-founder Ben Hemani for specifics.\n\nListen to the full episode to hear Rebecca and Bison’s founding team discuss:\n\nWhy AI isn’t a “silver bullet” for biotech companies, although it is central to modern drug discovery.\n\nWhich robotics startups are catching investors’ eyes.\n\nHow — and how not — to find product-market fit when building frontier technology.\n\nWhen to seek out venture funding over grant funding.\n\nEquity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. Subscribe to us on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod."}