{"url": "https://techcrunch.com/2022/10/04/this-startup-wants-to-help-other-startups-figure-out-compensation/", "title": "How much to pay your engineer? This startup will tell you", "authors": ["Mary Ann Azevedo", "Sr. Reporter", "Theresa Loconsolo", "Anthony Ha", "Maxwell Zeff", "Kirsten Korosec", "Sarah Perez", "Sean O'Kane", "Tim De Chant", "Rebecca Bellan"], "publication_date": "2022-10-04T00:00:00", "text": "Figuring out what to pay employees is a universal problem. Startups, in particular, struggle with compensation as they are often competing with other startups for talent.\n\nFor Roger Lee, the issue came up repeatedly when he co-founded 401(k) provider Human Interest, which achieved unicorn status in August of 2021 and today has nearly 700 employees. (Lee is no longer involved in that company’s day-to-day operations, although he remains on its board.)\n\n“Figuring out employee compensation was one of our top sources of frustration,” Lee told TechCrunch. “We were using what felt like 1,000 spreadsheets to track and decide salaries, equity, raises, pay ranges and offers.”\n\n“It was impossible to get a holistic view of employee compensation to ensure that we were paying people fairly and competitively.”\n\nSo in October of 2021, he teamed up with his former Harvard roommate Teddy Sherrill to start Comprehensive in an effort to tackle the problem. The company is emerging from stealth today, announcing a $6 million seed round raised earlier this year led by Inspired Capital and including participation from Floodgate, SV Angel as well as founders and C-level executives of Rippling, Wealthfront, Pilot.com, Thumbtack, Public.com and others.\n\nComprehensive’s target customers are startups, a world Lee is familiar with, having started two of his own, as well as launching Layoffs.FYI — a layoff tracker — at the onset of the COVID-19 pandemic. Early customers include Mercury, LaunchDarkly, Clearbit, Titan and Clever.\n\nA number of startups have emerged in this space in recent years. In August, Complete announced a $4 million raise. As TC’s Anita Ramaswamy wrote at that time, “Series A startup OpenComp has a similar product geared toward high-growth companies looking to improve their recruitment and retention, while…YC-backed Compound seeks to help tech employees understand their own compensation.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nLee hopes to make Comprehensive stand out from its competitors by making its offering well, as comprehensive as possible. For example, it wants to help startups with all aspects of compensation matters within their organization — going beyond salaries to also advise on compensation reviews, employee communication and pay analytics.\n\n“Employee compensation is now more complex and higher-stakes than ever, given the recent trends of remote work and inflation and the focus on DE& I,” said Lee.\n\nHe argues that the issue goes beyond human resources with multiple teams involved in the process and data scattered across multiple systems. Lee is hoping with Comprehensive, companies will “have the visibility to see the compensation-related information in a single place.”\n\n“When comp data lives in siloed systems, a company can’t really make informed decisions on compensation,” Lee added. “We’re aiming to unify all that data.”\n\nComprehensive is not just about employee recruitment, he emphasizes. It’s also about employee retention. Lee estimates that employee compensation typically represents 70-80% of startups’ overall costs — representing its biggest expense “by far.”\n\n“Now more than ever, startups want to know that the money they’re spending is being used to reward and retain their high performers and not being wasted,” Lee said.\n\nComprehensive operates a SaaS model where it charges companies a subscription based on their size. The 10-person startup plans to use its capital toward growth and continued hiring.\n\nAlexa von Tobel, founder and managing partner of Inspired Capital, believes that as the HR tech stack “continues to shift to the cloud, compensation is a thorny and complex tech challenge that is ripe for innovation.”\n\n“Compensation has fundamentally evolved in the past year, and Comprehensive was born to meet this specific moment: more remote companies with disparate compensation expectations, salary inflation, increased needs for compensation disclosure and assessments for pay gaps, and more,” von Tobel wrote via email.\n\nMy weekly fintech newsletter, The Interchange, launched on May 1! Sign up here to get it in your inbox."}