{"url": "https://techcrunch.com/2022/10/13/analytics-operating-system-redbird-makes-data-science-accessible-to-non-technical-users/", "title": "Analytics operating system Redbird makes data more accessible to non-technical users", "authors": ["Catherine Shu", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-10-13T00:00:00", "text": "Data engineers have a big problem. Almost every team in their business needs access to analytics and other information that can be gleaned from their data warehouses, but only a few have technical backgrounds. Redbird was created to help everyone in an organization create and run analytics without using code, therefore reducing the amount of bottlenecks that data engineers need to deal with. The New York-based startup announced today that it has raised $7.6 million in an oversubscribed seed round led by B Capital, with participation from Y Combinator, Thomson Reuters Ventures, Alumni Ventures and Soma Capital, along with other funds and angel investors.\n\nRedbird, formerly known as Cube Analytics, serves as an analytics operating system by connecting all of an organization’s data sources into a no-code environment that non-technical users can use to perform analysis, reporting and other data science tasks. The new funding will be used to add more no-code capabilities. It also plans to build out its marketplace, where users and developers can exchange apps they create using Redbird.\n\nFounded by data analytics experts Erin Tavgac and Deren Tavgac, Redbird works with large enterprises in a wide array of verticals, including consumer packaged goods, manufacturing, retail, media and agencies. Erin formerly worked at McKinsey, helping companies set up and run data analytics capabilities, while Deren was chief product officer at Saks Fifth Avenue.\n\nErin told TechCrunch that the two left their jobs to solve enterprise data analytics problems like lack of automation and advanced analytics that require coding skills. That means data engineering teams can’t meet all demand from stakeholders, leaving companies unable to manage the fragmented tools within a complex data stack.\n\nRedbird addresses these issues by enabling people without a technical background to create custom apps that automate analytics, breaking through bottlenecks for data engineering teams while giving everyone access to data analytics.\n\nRedbird’s peers in the enterprise data analytics space include analytic tools like Tableau, Looker and Microsoft Power BI, which Tavgac said Redbird does not consider direct competitors because they don’t automate complex workflows end-to-end, instead delivering generic data visualizations from datasets that have already been transformed.\n\nA closer rival are advanced automation platforms like Alteryx, but it has a couple drawbacks compared to Redbird. For one thing, it has less capabilities in collection, data science and visualization, which means customers can’t use it as a comprehensive analytics workflow solution, Erin said. It is also hard for non-technical users to adopt, a problem that Redbird was created to solve.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMost of Redbird’s customers are large enterprises that make more than $1 billion in revenue. It is profitable, with seven-figure revenue and 9x revenue growth over the past year. Redbird monetizes through an enterprise SaaS model, with usage-based license fees.\n\nSome examples of how clients have used Redbird: a large media company created automation workflows that collect data from more than 10 sources, apply advanced analytics to them and generate thousands of custom reports to guide their ad sale activities. A global CPG brand is using Redbird to do digital brand health tracking across a wide variety of data sources, like social media, e-commerce review and Google search volume, and using advanced analytics to predict future sales trend.\n\nIn a statement, B Capital general partners Karen Page said, “We believe Redbird will become a mission-critical platform for enterprises to manage complex data workflows. This investment underscores our strategy of working with innovative companies that enable rapid technological transformation across traditional industries.”"}