{"url": "https://techcrunch.com/2024/09/12/novatus-nabs-40m-to-help-financial-institutions-quell-their-regtech-nightmares/", "title": "Novatus nabs $40M to help financial institutions quell their regtech nightmares", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-09-12T00:00:00", "text": "Banks, investment firms, and financial services providers are not known to be bastions of transparency. At least, not to the general public. And, as the last financial crisis laid bare, sometimes not even to the people who operate within them.\n\nAndrew Hedley understands this well. Assessing risk at companies like Vanguard and Prudential in London, his job boiled down to an important task: Understanding where data was going and being used where it was supposed to be — inherent for assessing risk and, critically, reducing it.\n\nThat was easier said than done. Financial institutions spin a lot of plates simultaneously, which makes for a data nightmare, so much so that outside troops frequently have to be called in to help figure out better systems.\n\nThe help came from, among others, another risk specialist called Matthew Ranson who was working at Deloitte. Together, Ranson and Hedley (pictured above, with Ranson on the left) could see that the problem was not endemic to a specific company but pervaded the entire industry. And it was getting worse. They spotted an opportunity to build a better platform that could help financial companies manage their data for risk and compliance.\n\nThe two banded together to start Novatus to create that platform. The startup today has some 30 major clients, including MUFG, NatWest Group, Revolut, Wellington, Allspring and Artemis, and it has now raised $40 million to expand its growth into new markets.\n\nSilversmith Capital Partners is leading the Series A round, with participation from existing investor, Maven. With this round, sources tell us that Novatus’ post-money valuation is in the region of $150 million (Novatus declined to disclose it).\n\nAt its core, Novatus is targeting one problem: complex data management under equally complex conditions.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe banking crisis of 2007 put the spotlight on the risks that had been built into the global banking system. Since then, we’ve seen a major shift in how data is handled across financial institutions: Data represents a forensic record of what companies and individuals are doing, so it’s important to retain it to understand why something goes wrong. On top of these factors, there is a much stronger push for data protection and making sure the data retained for such purposes is also handled responsibly.\n\nAll of this adds up to many different regulations — both from regulators and companies — that can be tricky for a company to balance.\n\n“If we think back to the financial crisis, one of the biggest issues was the lack of transparency,” said Hedley. “We had derivatives on derivatives, so we did not understand where there was risk in the financial system.”\n\nThat spurred a lot of action to fix this both from within and from outside.\n\n“Regulators demand that our clients provide them with accurate, complete, and timely reporting,” Hedley explained. “That, in itself, sounds like a simple task, but it’s incredibly complex when you overlay the volume of data on ever-changing regulations. What makes it so appealing and necessitates automation and technology is the fact that these requirements are getting more stringent globally.”\n\nNovatus’ flagship product, En:ACT, is a SaaS platform that helps companies manage their data to comply with reporting regimes. As with other SaaS plays of this kind, Novatus complements the automation with advisers who can help tailor how the platform works for specific use cases.\n\nNovatus is sticking with its anchor of humans who help apply its technology, but that is not the case everywhere. That in itself presents a bigger opportunity for the startup.\n\n“If you look at U.S. employment coming out of the financial crisis, there were millions and millions of jobs lost, both public and private,” said Ned Kingsley, a principal at Silversmith who led the investment. “The regulatory regimes have become more strict and more onerous, but there’s less people to deal with them. So we feel like the only way anyone can solve that problem is technology, because the heads just aren’t there anymore.”\n\nThe company has offices in London and Sydney, and the plan is to use some of the funding to invest in technology and some to expand in North America, the founders said."}