{"url": "https://techcrunch.com/2022/09/06/drover-ais-alex-nesic-on-using-tech-to-regulate-the-scooter-market/", "title": "Drover AI’s Alex Nesic on using tech to regulate the scooter market", "authors": ["Rebecca Bellan", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-09-06T00:00:00", "text": "As shared micromobility continues to take over cities, operators have found themselves implementing different forms of scooter “advanced rider assistance systems” or scooter ARAS, that can detect when a rider is doing the thing cities hate most — riding on the sidewalk.\n\nDrover AI, a startup that had the gumption to launch in May 2020, is one of the companies enabling this trend to take off. The startup builds computer vision IoT modules that have been mounted on scooters from the likes of Spin, Voi and Beam. The modules are built with cameras that use machine learning to detect things like sidewalks, bike lanes and pedestrians, which then send that data back to the scooter’s brain in order to send the riders alerts or, in some cases, actually slow them down.\n\nAlex Nesic, one of the founders of Drover AI and its chief business officer, didn’t always have a burning passion for AI or computer vision. In fact, Nesic spent the better part of the aughts as an actor, appearing in TV shows like “Sleeper Cell” and “CSI” (Miami and New York!). But Nesic enjoyed chemistry in high school and was good at converting tech speak into actionable marketing language, so he jumped at the opportunity to get involved in a high school friend’s venture that dealt with nanotechnology and surface modification chemistry.\n\nAfter rising up the ladder fairly quickly until he reached the role of VP, Nesic got pulled into the mobility sphere by a company called Immotor, which probably launched about five years too early to be successful. Immotor built a three-wheeled portable scooter with swappable batteries and was connected to an app via Bluetooth.\n\n“I would travel with it because the batteries were TSA-compliant, and I would put it in the overhead bin and it was my introduction to moving through cities with micromobility that I could carry with me everywhere,” said Nesic.\n\nThis was around the time that Bird started launching shared scooters, so the market wasn’t yet ready for a $1,500 consumer-facing scooter that was being lumped more into the hoverboard category than a useful transportation device.\n\nSo Nesic pivoted and founded Clevr Mobility, a shared e-scooter operator that also provided a turnkey solution for cities and other private operators. Nesic said that Clevr was one of the first companies to start the conversation around detecting and geofencing sidewalks, only it was relying on GPS to try to achieve submeter accuracy. It was the failure to actually do so that led Nesic to denounce the inadequacies of GPS and go on to found Drover AI, which meets the demand for precise location awareness using computer vision instead.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWe sat down with Nesic to discuss the possibilities of integrating computer vision tech into privately owned scooters, what it means when a larger company steals your idea and why tech pedigrees are overrated when it comes to running a startup.\n\nEditor’s note: The following interview, part of an ongoing series with founders who are building transportation companies, has been edited for length and clarity.\n\nTechCrunch: You closed a $5.4 million Series A in July, and at the time you told me the money would go toward your next-gen product but also toward exploring other integrations farther up the supply chain with vehicle manufacturers.\n\nAlex Nesic: The end game for me is also to try to help inform the regulatory environment because it’s not reasonable to expect there to be two different sets of rules for the shared operators and private scooter owners. Operators are constrained and have all these hoops to jump through, but then anybody can buy something on Amazon that doesn’t offer any similar safety features.\n\nI know it’s easy to dunk on the industry and say that these technologies are really bells and whistles when cities should be focusing on adequate infrastructure. I have been in places that have adequate infrastructure. Amsterdam is like the holy grail, right? And they’re still struggling with the wrong modality in the wrong place. They have an issue with mopeds using bike lanes and now they’re using cameras to enforce the bike lanes.\n\nSo again, this technology is not just frivolous, in my view. I think that once we get to a point where it can be embedded and applicable to all kinds of modalities, then you have a system where you can say, all right, if mopeds want to be in the bike lane, you’re going to be capped at 15 miles per hour. If you’re on the sidewalk, you get disabled.\n\nI’m struggling between words like “nanny state” or “paternalistic” for treating micromobility like this when cars, which are arguably much more dangerous, don’t have such controls.\n\nThe hegemony that we’ve seen in the automotive industry … it’s just really hard to put that cat back in the bag after 100 years of not having an automatic speed limit. It’s just way too big of a beast to tame and I think cities are sensing that micromobility and these new modalities, especially in the core dense urban areas, are an opportunity to get it right. And then if it’s proven out to be effective with the smaller modalities, then it gives them precedent to then deploy it on cars.\n\nThe Department for Transport in the U.K. is also looking at this, which is why shared fleets are legal, but private scooters weren’t for so long — because they’re looking at this in a holistic way. And so if you believe that that’s a likely outcome, we think that our technology will hopefully be a core element of a manufacturer’s ability to meet those regulations if they develop at the federal or even state level in the U.S.\n\nAre there any other industries where you’ve seen something like this happen?\n\nWe see micromobility as the drones of the built infrastructure — they go places where cars can’t, even though current infrastructure has been built largely for cars.\n\nDrones were initially the purview of commercial enterprise — surveying, agriculture, utility companies. They were expensive products and there were not very many of them. Then the prices dropped and companies came out with affordable consumer products. And you started seeing people flying them in really unsafe places, like, federally regulated airspace, and so that immediately became a concern.\n\nAs with micromobility, there are no signs around telling people not to fly their drones here, so it became a top-down regulatory environment where manufacturers decided to implement geofencing. Now if you try to fly your drone into FAA-regulated airspace, it won’t work. So it’s not impossible for the micromobility space to be regulated this way.\n\nI assume Drover is actively trying to push for regulation in the private scooter market?\n\nTo the extent that we have relationships with city officials and people in this space, we are definitely not shy about talking about the benefits of using this technology. I think, with additional capital, we can certainly bring more resources to bear and maybe team up with shared micromobility companies that would be aligned in that fight. Because it doesn’t benefit shared micromobility companies if Joe Schmo can buy a scooter online that goes 50 miles per hour and theirs is capped at 15. They’ll lose customers.\n\nTier recently bought Fantasmo to bring its camera positioning tech in-house, and Lime just announced its own computer vision tech. Are you worried about operators bringing the tech you make in-house?\n\nJust because Zoom existed didn’t mean that Microsoft and Google weren’t gonna get into the video conferencing space. There’s always room for competition and, ultimately, the fact that operators and even manufacturers are trying to replicate our approach is very validating. It proves that our idea is in fact valid.\n\nOn the other hand, it definitely creates competition and we have to be aware of it. I think our speed of execution gives us a little bit of a head start, having deployed internationally across multiple continents and dozens of cities so far with our training dataset and continuing to build on those tools.\n\nLime throwing their hat in the computer vision ring does kind of make it table stakes moving forward for others to compete, so it’s actually helping us fortify our position with existing customers. We just have to make sure that we stay competitive in terms of the technology and our value proposition, continuing to add value on the operational and unit economics front.\n\nDo you think your strategy going forward might be to pursue smaller operators that don’t have the resources to build this kind of tech in-house?\n\nPart of our strategy here is to integrate our technology farther up the supply chain, which would then see us integrate with smaller operators. We can work with the Okais and Segways and Actons of the world and build a scooter that already integrates our next-generation product. If operators want the Drover-equipped scooter, then they’ll just pay us the monthly SaaS fee for support.\n\nWe’re also in conversation with IoT manufacturers and third-party software partners like Joyride or Wunder Mobility to enable the ingestion of the rich dataset that we can provide off our units. Those are the best ways for us to target the mid- to lower-tier operators that service regional markets.\n\nIf you had a crystal ball, when do you think you’ll get to a point where computer vision technology is cheap enough that it can be scaled as widely as you’re talking?\n\nIf I’m optimistic, I’d want to say next year. I think that hopefully the supply chain and component and chip shortage and all these other things go away, and we will be able to significantly reduce cost. We’ll also be able to achieve scale by integrating with manufacturers that are building abroad.\n\nDrover cameras on vehicles are collecting a ton of data as they move through the world. How do you use that as an ancillary service to bring in additional revenue?\n\nThat’s definitely something that, with additional capital and more saturation in the market, we really want to flush out because you’re astutely pointing out that we have tens of thousands of vehicles that will be equipped with cameras collecting data from cities and moving through cities very differently than cars do. And so there’s a lot of opportunity there from an image standpoint, maybe filling in gaps for street mapping in areas where cars can’t go.\n\nRecency is also a big thing. In Google Street View, the average age of images is somewhere between 18 and 24 months. Maybe we can help fill gaps and provide more recent images to mapping services like that.\n\nWe’re looking at things like infrastructure surveying to help with urban and transportation planning. One of the projects I’m having my team work on now is bike lane violations, which have gained a lot of steam on the political side recently. Same thing with blocking bus lanes. We can use scooters instead of just static cameras and collect citywide data to help inform policy decisions.\n\nYou mentioned that with more funding you’d be able to scale your capabilities further. The funding environment is uncertain at the moment. Would you consider being acquired by an operator or manufacturer?\n\nI would certainly entertain offers but it’s hard to say yes or no without having a real offer. I think it’s a broader conversation. Obviously, now that we have investors on board, we’re not the only ones that have a say in the matter, so it would just have to be the right fit and give us additional potential to grow faster as part of a bigger organization. We’re just focused on building, and the results will come.\n\nYour founding team, you included, doesn’t really come from computer vision backgrounds or any unicorns in the autonomous space, which you’ve said didn’t exactly thrill investors. Any advice for founders in a similar boat, who are coming from a more generalist background?\n\nI think pedigree is almost weighted too much, whether it’s in a job interview or a VC trying to fund a company. They want to know what you’ve done in that same space because they somehow think that it’s going to ensure success. It’s a tough prejudice to break free from. I think you just have to show it with conviction and belief and really lean on the fact that generalists do bring a different perspective.\n\nAlso, being multicultural is a huge asset — a lot of companies that are successful are from immigrants because they come from the outside and are able to approach problems with a more open mind. Personally, I’m just open to hearing ideas. I’m never really wedded to anything. I’ve changed my mind often, and I think that’s a skill set that is not necessarily valued enough. It’s OK to change your mind, because it means that you’re absorbing new information.\n\nWhere do you think Drover will be a year from now?\n\nOur goal is to be much less involved in the hardware side of things, to continue building the software, our AI capabilities, adding layers and value there. We want to be integrated into not just scooters but e-bikes and e-mopeds on the shared side and hopefully even in some consumer products.\n\nI think in a year and beyond, I want to be diversified in terms of vehicles that we service and I want to move closer to what I would call a technology licensing model where people are building the hardware that’s necessary to run our AI and our suite of tools into the vehicles and we can just license our tech.\n\nCorrection: A previous version of this article listed Alex Nesic as Drover’s CEO. He is the company’s CBO."}