{"url": "https://techcrunch.com/2025/01/23/trump-orders-formation-of-working-group-to-evaluate-crypto-stockpile/", "title": "Trump orders formation of working group to evaluate crypto stockpile", "authors": ["Rebecca Bellan", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-01-23T00:00:00", "text": "President Donald Trump on Thursday ordered the formation of a working group to propose federal regulations for “digital assets” — including cryptocurrencies, digital tokens, and stablecoins — and evaluate a national crypto stockpile.\n\nEx-PayPal COO and founder of VC firm Craft Ventures David Sacks, Trump’s pick for crypto and AI “czar,” will lead the working group. The group will also include the Treasury secretary, the attorney general, the secretary of Commerce, and other top officials.\n\nTrump’s latest executive order — titled “Strengthening American Leadership in Digital Financial Technology” — comes two days after the Securities and Exchange Commission, currently led by crypto-friendly Republican Mark Uyeda, launched a crypto task force to “draw clear regulatory lines” for the market. Uyeda will also be a part of the presidential working group.\n\nFormer SEC Chair Gary Gensler had a reputation in the crypto community for pursuing stricter regulation of cryptocurrencies.\n\nTrump’s order also protects individuals’ rights to access, use, develop, and transact on public blockchain. This would formally protect blockchain activities as lawful.\n\nThe EO signed Thursday repeals Biden-era rules around cryptocurrencies and digital assets. Specifically, it repeals an executive order from former President Joe Biden signed in 2022 to address the risks and harness the potential benefits of digital assets and their underlying blockchain technology, while emphasizing the need to protect consumers and investors. Trump’s order also repeals a framework published by the Treasury Department in 2022 for international engagement in crypto and blockchain development.\n\nWhile Biden-era policies focused on risk mitigation and international collaboration, Trump’s order prioritizes economic liberty and U.S. sovereignty.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAnother big difference is that Biden’s executive order directed various federal agencies to explore the development of a U.S. Central Bank Digital Currency (CBDC). Trump’s order prohibits CBDCs, meaning the government can’t create a digital version of the dollar directly controlled by the central bank. At the same time, the order promotes privately issued U.S. dollar-backed stablecoins, with the goal of bolstering the dollar’s dominance in global trade and digital finance.\n\nIn other words, Trump is signaling his commitment to keeping cryptocurrencies under a decentralized financial system.\n\nIt’s worth noting that Trump launched a memecoin, $TRUMP, days before his inauguration. The memecoin stood at a $6.84 billion valuation as of Thursday afternoon. Critics have warned that Trump’s token erodes boundaries between the president’s political and business interests, and some have argued it has the makings of a classic pump-and-dump scheme.\n\nPrevious administrations have approached the crypto world with caution due to concerns that it can easily be used in association with illicit and illegal activities, like ransomware payments and money laundering. One of the most prescient examples of the dangers of crypto is the downfall of crypto trading platform FTX, which exposed massive fraud, misappropriation of customer funds, and a lack of regulatory oversight.\n\nMany in the crypto industry argue that FTX’s crash is exactly why clearer regulation designed for the industry is needed. And there are some companies, like Chainalysis, that have made strides in creating trust in crypto by providing compliance and investigation software and tracking virtual currencies."}