{"url": "https://techcrunch.com/2024/01/24/anomalos-machine-learning-approach-to-data-quality-is-growing-like-gangbusters/", "title": "Anomalo’s machine learning approach to data quality is growing like gangbusters", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-01-24T00:00:00", "text": "When Anomalo’s co-founders left Instacart in 2018, they thought they could put machine learning to work to solve data-quality problems inherent in large datasets. Five years later, the company’s idea is even more relevant as data quality takes center stage with large language models.\n\nToday, the startup announced a $33 million Series B, equaling their 2021 Series A and bringing the total raised to $72 million, according to the company.\n\nCo-founder and CEO Elliot Shmukler says that the thesis they started with has become validated over the years. “If you’re going to use data to do anything, whether it’s dashboarding, decision-making, or these days to power generative AI applications, then you need [a tool] that’s actually monitoring that data and making sure it’s correct, of high quality and ready to be used,” Shmukler told TechCrunch.\n\nAs companies store increasingly large amounts of data in cloud storage and data warehouses like Databricks and Snowflake, this need has only become more pronounced, he says. But in a time when everyone is looking to cut costs, they came up with a way to limit the data that Anomalo monitors to certain datasets, instead of monitoring everything, to help lower customer bills. “You can reserve our kind of full ML and AI [solution] for the tables and datasets that really need it,” he said.\n\nThe approach is working. Shmukler indicated that the company has grown 15x since that Series A when he told TechCrunch the revenue was around $1 million. That would make today’s revenue close to $15 million. What’s more, for the company’s recent fiscal third quarter, he reported that annual recurring revenue grew a whopping 177%, growth numbers we haven’t seen in some time from early-stage enterprise startups.\n\nShmukler says he still understands that while investors obviously welcome this kind of growth, they are still very much in efficiency mode, and as CEO he has to find ways to walk that line. “Investors still love high growth, they just don’t want you to light the cash on fire,” he said.\n\nTo help find the proper balance, the company has set a couple of goals to find that sweet spot between growth and efficiency. “Our growth goal was based on percentage growth in ARR, and our efficiency is actually based on burn multiple, which is emerging as one of these efficiency metrics that investors are paying attention to. And so we see that efficiency metric of burn multiple as a kind of counterbalance on our growth,” he said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAs the company’s revenue grows, they have been hiring and are currently up to 50 employees with plans to double that with the new money. The company told us in 2021, when it had less than 10 people, that it saw diversity as one of its core goals. Shmukler says it’s a work in progress, but of the seven executives they hired since the A round, four are women. He says a third of the engineering group are women, and they are working to close the gap in that number. He believes that having women in leadership roles will help attract others.\n\n“Having women leaders in place and women engineering managers in place really has been tremendous in terms of attracting women candidates for all of our roles. And so I think that’s going to serve us well as we double the company again,” he said.\n\nSignalFire led the $33 million Series B investment with participation from strategic investor Databricks Ventures. Previous investors Norwest Venture Partners, Two Sigma Ventures and Foundation Capital also participated in the round. It’s particularly interesting that the company has attracted the attention of one of the leading data analytics startups in Databricks, which had a $43 billion valuation as of last September, when it raised another $500 million."}