{"url": "https://techcrunch.com/2021/12/09/netflix-launches-a-website-dedicated-to-news-about-renewals-exclusive-interviews-and-more/", "title": "Netflix launches a website dedicated to news about renewals, exclusive interviews and more", "authors": ["Aisha Malik", "Consumer News Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-12-09T00:00:00", "text": "Netflix has launched a new website called “Tudum,” which will host consumer news about renewals, release dates and extra content featuring its TV shows and movies. The company is marketing the website as “a place to discover more about your Netflix favorites.” For a more curated experience, users can log into the website with their Netflix account. Netflix says the website is still currently in its early days, as it plans to continue to build it out and add new features in the future.\n\nTudum will feature extra content and information about Netflix’s TV shows and movies. For example, Netflix notes that users will be able to dig deeper into its content and use the website to find out things like where else they’ve seen the cast of “The Witcher” and whether “Maid” is based on a true story. The website includes exclusive interviews, cast breakdowns, information about content that’s popular on the platform, a trending news section, details about upcoming shows, an explore section and more.\n\nSay hello to Tudum — a backstage pass that lets you dig deeper into the Netflix films, series, and stars you love! It’s still early days but you can expect exclusive interviews, behind-the-scenes videos, bonus features, and more. Check it out https://t.co/sYnbZ6pTzF pic.twitter.com/WtCCAF3B9u — Netflix (@netflix) December 9, 2021\n\nTudum, which is named after the sound users hear when they press play on Netflix, is also the name of Netflix’s global virtual fan event that took place in September. The event included exclusive first looks and panels with stars from some of Netflix’s most popular titles. It featured conversations with the creators and stars of some of Netflix’s most popular shows, including “Stranger Things,” “Emily in Paris,” “The Witcher,” “The Crown,” “Cobra Kai” and “Bridgerton.”\n\nThe streaming giant’s chief marketing officer, Bozoma Saint John, announced the launch of the new website in a blog post, stating that Netflix is “excited to introduce Tudum for fans to dive deeper into the stories they love, fuel their obsessions and start new conversations. It’s still early days, and our launch today is just the beginning.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe new website is now accessible around the globe but is currently only available in English. It’s unknown if Netflix plans to launch the website in more languages."}