{"url": "https://techcrunch.com/2024/03/19/the-carevoice-raises-10m-series-b-bucking-funding-slowdown-in-health-tech/", "title": "The CareVoice raises $10M Series B, bucking the funding slowdown in health tech", "authors": ["Rita Liao", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-03-19T00:00:00", "text": "The field of insurance technology has had a rough time. About 7 years ago, early insurtech companies promised to disrupt the insurance industry with new tech, but today, most of those companies have either been acquired or are floundering in the public markets.\n\nFortunately, insurtech has found a new wave to ride in the past couple of years: “embedded insurance.” Insurance startups have found success in helping third-party companies “embed” insurance products into their customer journeys to improve sales and retention — instead of buyers actively seeking coverage, insurance might appear as an add-on at the time of customers’ flight purchases, for example. Investors seem to be excited about this model, too, though they have made it clear that good economics and healthy traction are crucial factors for startups in the space today.\n\nNow, an adjacent — and new — category has emerged and attracted investor attention: embedded health. While embedded insurance bundles insurance solutions with existing services, embedded health integrates health functionalities, like fitness and wellness, into a single platform run by service providers, especially insurers.\n\nThe former is a distribution play, while the latter emerges as a response to increasing demand for personalized health needs.\n\nThe CareVoice is one of the active players in this new sector. Started in Shanghai a decade ago, the embedded health company now has a footprint across 15 countries. It just raised $10 million from a Series B financing led by U.K.-based Apis Insurtech Fund I, which contributed to most of the round. The investment brings the company’s total capital raised to around $20 million.\n\nThat’s notable, given how much venture investment in startups has slowed down in the past year. In 2023, U.S.-based digital health startups raised a total of $10.7 billion across 492 deals, the lowest amount since 2019, according to Rock Health, a health tech–focused seed fund.\n\nThat funding slowdown also hit The CareVoice, though it weathered the storm by reaching healthy cash flow. By mid-2022, the company had already received funding commitments for its Series B. But right as the market turned around then, one of its investors became “valuation sensitive” and greatly reduced the startup’s revenue multiple, co-founder and CEO Sebastien Gaudin told TechCrunch.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We had to adjust the fundraising strategy,” he said. “We were on the right way to become profitable, so we rolled up our sleeves and managed to get to cash flow neutral from Q3 2022 up to now.”\n\nIn 2023, the company doubled its revenues, and this year, it’s headed toward revenues of $10 million, a mix of recurring licensing payments and one-off implementation fees, he said.\n\n\n\n“So eventually, we were in a good position to complete our Series B,” Gaudin added.\n\nEmbedded health solution providers like The CareVoice can find themselves competing with traditional IT and consulting service companies, such as Tata’s TCS. But Gaudin feels that health providers that opt to outsource their software needs will eventually realize the significant “cost and time” involved with “limited outcomes.”\n\n“It could be two years, three years before [customers] see anything. And [in terms of] cost, it’s like several million dollars. Then they’ll be stuck. The health system management remains out of the scope, meaning that in the end, those custom software companies are not going to manage different health technologies, partner with them, and bring them in,” he said.\n\nGaudin says The CareVoice can make the first version of a health tech solution live in as little as three months, with the design process taking two to four weeks and development requiring another two months. ⁠For one of its biggest clients MetLife, the startup enables the insurer’s 360Health app with functionalities like illness detection through face scanning and access to a network of nearby checkup centers, as well as prevention across physical, mental and cognitive wellness.\n\nOperating with a team of around 40 employees, The CareVoice plans to spend its fresh funding on expanding partnerships with insurers across Asia, Europe, the Middle East, Africa and the Americas, as well as investing in the next generation of CareVoiceOS, an operating system it has built for insurers.\n\nThe story was updated on March 20, 2024, to clarify that The CareVoice is an embedded health startup."}