{"url": "https://techcrunch.com/2024/01/23/vr-needs-to-build-for-its-best-use-cases-not-for-all-around-computing/", "title": "VR needs to build for its best use cases — not for all-around computing", "authors": ["Darrell Etherington", "Editor At Large", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block"], "publication_date": "2024-01-23T00:00:00", "text": "Apple’s Vision Pro launch resembles its Apple Watch debut in more ways than one, but to me the most telling similarity is in the marketing approach. Apple has striven to distance the Vision Pro from the existing crop of virtual reality (and even mixed reality) devices — many of which are objective failures — by exclusively focusing on the term “spatial computing”; however, the marketing seems focused on identifying a few key use cases it thinks will best drive consumer interest.\n\nThe company took the same approach with the Apple Watch, which like its face computer cousin, was more or less a solution in search of a problem when it originally debuted. Apple initially focused on a lot of features the Apple Watch has now actually done away with entirely, including its Digital Touch stuff that was meant to be a new paradigm for quickly communicating with friends and loved ones across distances. In general, it was presented as a relatively robust and full-featured platform nearly on par with the iPhone in terms of future potential.\n\nThe intervening years and generations of Apple Watch have seen it grow considerably in terms of pure technical capability and specifications, yet the marketing and focus around the product from Apple’s side has been more economical, spending outsized effort at the areas that seemed to resonate best with users — including health and wellness, and more recently, safety.\n\nTo some degree, all new product launches are predicated on a hypothesis that ends up being more or less true, but seldom exactly accurate. But the iPhone debuted with a much more focused, and much more accurate idea of what it would become for users than the Apple Watch did. The Vision Pro, I’d argue, is even more adrift from how and why people will come to appreciate it. Given the right positioning and product mix to support it, I think the Vision Pro could become a lasting part of Apple’s overall mix, but not if it continues to aim for being a full-fledged platform able to stand on more or less equal footing with the iPhone, the Mac, or even the iPad.\n\nMeta has done a much better job arriving at some kind of focus for how it’s selling VR to the masses. The company took a much softer, “mixed reality is cool” position to the recent launch of the Meta Quest 3, versus the “metaverse is the next big thing in computing” hardline take it attempted to force down our throats in the Quest 2 generation. Meta CEO Mark Zuckerberg seems to be moving his chips from the metaverse to AI as the next big thing he’s got extreme FOMO about, which has to have helped ease that positioning switch.\n\nMeta is leaning in to what Apple already learned with the Apple Watch: Some devices just aren’t good at certain things, but that doesn’t mean they can’t be amazing at another. Oddly, Apple has already also kind of learned this lesson — and one that might apply even in terms of the specifics of what it is and isn’t good at — with the iPad.\n\nThe iPad has become an excellent and well-favored couch content-consumption device. Apple still touts its creative prowess, but that’s mostly on the Pro models, and even then it’s likely a secondary or bonus use case for most buyers. The Vision Pro is already being lauded by early reviewers as an amazing virtual theater for watching movies and consuming other kinds of video content, while even tasks like basic text input are instead facing sometimes harsh critique.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe Meta Quest 3 is also excellent for just watching videos, but it also feels tailor-made for interactive workout use cases like that provided by Supernatural, which Meta wisely purchased. It’s terrible at text entry and productivity, on the other hand, and any gains in that direction tend to just reduce annoyance, rather than making it actually pleasant to use for those things.\n\nThe entirety of the push of VR to become a mainstream general-purpose computing platform has been more about an imagined future reliant on how the technology has worked in sci-fi, which ignores key details like how your nose feels when you wear something heavy across its bridge, or how horrible it is to type on a keyboard that floats some indeterminate distance in front of you and that offers zero tactile feedback.\n\nVR is very good at the things it’s very good at, and it’s wonderful in small doses for stationary, interactive or passive experiences that benefit from a sense of immersion. It’s terrible at a lot of other things — chief among them being the next big thing in the vein of personal computing or mobile."}