{"url": "https://techcrunch.com/2023/04/04/everstream-which-applies-big-data-to-supply-chain-management-raises-50m/", "title": "Everstream, which applies big data to supply chain management, raises $50M", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-04-04T00:00:00", "text": "Just short of a year after raising $24 million from backers, including DHL, Everstream Analytics, a company that provides predictive insights for physical supply chains, has secured a fresh round of funding.\n\nEverstream today announced that it raised $50 million in a Series B round led by Morgan Stanley’s 1GT Fund, with participation from StepStone Group and Columbia Capital. Julie Gerdeman, Everstream’s CEO, says that the fresh capital will be put toward product development, hiring and customer success efforts.\n\n“Solving supply chain challenges has never been more important, and have never received so much attention from shareholders,” Gerdeman told TechCrunch in an email interview. “Everstream has grown revenue 30x from the initial investment made by Columbia Capital three years ago and was successful in doubling the business in both 2021 and 2022.”\n\nEverstream’s growth isn’t happening in isolation. Startups selling supply chain tech continue to attract major investor attention — and dollars. Toward the end of March, IntegrityNext, which helps organizations audit their supply chain partners for compliance with environmental and sustainability governance (ESG) rules, landed $109 million from backers, including EQT Growth. That massive tranche came on the heels of supply chain security software vendor Overhaul landing $73 million and just less than a year after Tive, a supply chain visibility tools developer, snapped up $54 million in an all-equity investment.\n\nGiven the events of the past year and change, it’s not terribly surprising that the supply chain segment has been robust to the macroeconomic headwinds that’ve impacted other categories of startups. China implemented strict lockdown measures against COVID-19 outbreaks. The Ukrainian-Russian war continued unabated. Inflation accelerated. And parts of Europe faced uncommonly high temperatures and drought conditions.\n\nTaken together, it’s thrown the global supply chain for a loop and then some. According to a recent survey from Capgemini, companies see disruption in the supply chain as the top risk to their business growth, ahead of rising raw material prices and the energy crisis. Supply chain resilience is now a key priority in the enterprise, with 43% of organizations planning to increase investment there.\n\nStill, not all firms have been so lucky. Funding for supply chain startups in Q3 2022 fell to $3.3 billion, down 56% year over year and 37% compared to the second quarter, according to PitchBook.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nGerdeman claims that what helped Everstream stay ahead of the competition was its “big data” approach. The platform combines data based on supply chain interactions with AI and analytics to generate strategic risk scores, assessed at the material, supplier and facility location level.\n\nEverstream offers its own dashboards for data analysis, but also integrates with existing enterprise resource planning, transportation management and supplier relationship management systems.\n\nIn one step of the data analysis pipeline, Everstream collects trading data from sources, including news and media articles, and applies algorithms to identify who’s trading with whom. It’s among the tougher problems to solve in supply chain management, Gerdeman says, because of the way suppliers’ names are represented, misspelled, abbreviated and translated on customs forms from hundreds of different systems.\n\n“Everstream is equipped with a broad view of risk from the component level to materials, through the shelf to the consumer,” Gerdeman explained. “We combine AI predictions and intelligence-based modeling with expert human analysis and real-world, in-the-moment insights from a global network of partners, which allows us to provide visibility to deliver a complete view of all the variables impacting a company’s supply chain, from back-ups at the ports or labor unrest to weather disruptions up to 15 days in advance.”\n\nEverstream’s other advantages are its access to proprietary data sources, Gerdeman says, as well as its “deep expertise” in meteorology. Meteorology might seem far afield from supply chain woes. But Everstream employs a team that monitors weather-related risk, including climate change and — relatedly — access to water and heat, which Gerdeman notes can inform a company’s decisions about where to build manufacturing facilities.\n\nEverstream recently expanded its ESG tools to measure commodity risks and human rights violations, Gerdeman said, such as forced and child labor in the supply chain sub-tier. Some Everstream customers, she added, are using these to ensure exports are screened against the risk of forced labor from specific areas in China, like the Xinjiang Uyghur Autonomous Region.\n\n“The need for private and public sector collaboration to address supply chain challenges has never been more obvious or more pressing,” Gerdeman said. “Our customers are made up of some of the world’s largest brands. They require a solution that provides them with a standardized view of risk and disruption across their global supply chain during planning and execution, whether it’s challenges or disruptions in identifying demand drops in key markets, maintaining supply of raw materials or components, getting notice of insolvencies within their supplier network, assessing risk during transportation planning or understanding ETA deviations for in-transit shipments.”\n\nTo Gerdeman’s reference to large brands, Everstream, indeed, has some eye-popping clientele, ranging from tech giants like Google to beverage, scientific and health household companies such as Abbott, Medtronic, Boston Scientific, Bayer and AB InBev. In total, Everstream has more than 200 enterprise customers and anticipates “substantial” growth this year.\n\nTo support that growth (assuming it happens, of course), Everstream plans to grow its 200-person workforce by 10% to 15% this year, with a particular focus on the data science, sales, product management and customer success and development teams."}