{"url": "https://techcrunch.com/2023/09/11/scala-biodesign-makes-it-easy-to-re-engineer-proteins-one-molecule-at-a-time-or-50/", "title": "Scala Biodesign makes it easy to re-engineer proteins one molecule at a time – or 50", "authors": ["Devin Coldewey", "Writer", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-09-11T00:00:00", "text": "There’s a gold rush on in biotech as AI and other tools are used to find new drugs and treatments. With $5.5 million in new funding, Scala Biodesign is focusing these methods on a related problem: making existing or promising drugs more practical by tweaking them one (or more) molecule at at time.\n\nThe founders spun the company out of research done at the Weizmann Institute of Science in Tel Aviv around predicting the 3D structure and behavior of proteins. AlphaFold and RoseTTAfold blew the doors off the field in recent years, and by combining their capabilities with other data, Scala’s founders say they can accelerate one of the slowest aspects of engineering therapeutic molecules.\n\nThere are many potential drugs out there that perform some useful function, but are in other ways unsuitable for mass manufacturing or distribution — for instance, they break up at room temperature, or when exposed to a body’s natural chemical environment. A more robust version might involve swapping out one small piece of the molecule… but which piece, and what do you swap in?\n\n“Protein development process is very complex, and even in large companies it’s largely trial and error,” said CEO and co-founder Ravit Netzer. “Scientists engineer them by some flavor of random mutagenesis. But now that we know the structures of these proteins, it’s clear that randomly changing things is not really an option.”\n\nAs an example: A small protein that’s a chain of 100 amino acids, with 20 options for each of those 100 positions, has so many possibilities to test that you could do so until the sun burned out and still not exhaust them. And indeed, many such attempts to randomly hit on an improvement either take a long time to get results or simply fail and cost millions.\n\nIt’s a bit like changing one word of a paragraph to a random one from the dictionary and hoping it gets your point across better, when what you need is a thesaurus. (Trust a writer to come up with a tortured metaphor like this one.)\n\nScala has combined protein structure prediction with clinical data and observations of naturally occurring proteins to produce a system that can home in on changes that accomplish a given outcome. Improving stability, amplifying effect, easing manufacture, there are plenty of ways that almost-there proteins can graduate to useful and effective levels.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIt’s all computational — no wet lab — and they ultimately provide a small number of high confidence sequences, one of which they are sure will at least move things in the right direction.\n\nAs a real-world example, one lab was working on a naturally occurring protein that works as a malaria vaccine. The problem is that it is sensitive to temperature, and likely wouldn’t survive transport or storage.\n\n“They knew they had a problem with thermal stability. They gave one input and got three outputs, went with the best one, and it’s now in clinical trials,” said CTO and co-founder Adi Goldenzweig. “Ideally we would provide one option and be 100% confident, but we’re not there yet. But people often go through tens of thousands.”\n\nThey added that this is not simply switching one amino acid for another, but that in larger proteins they may be swapping in dozens at at time. “You won’t find anybody doing that, over 50 mutations in one shot,” Goldenzweig pointed out.\n\n“I think we have a very unique range and depth of validation — a track record of successful protein design in very diverse applications. Antibodies, enzymes you name it,” said Netzer. “We have shown time and again that you can actually design major improvements to proteins — we want to prove this can be done at scale, not just as a PhD project.” (Hence the company’s name.)\n\nCurrently the company is working with some unnamed pharmaceutical companies and labs, and remaining flexible as far as the licensing and business model goes. Providing and proving out the service is the priority, not establishing their own biological IP, though they don’t rule that out for the future.\n\n“As a seed company we can’t do everything, so we’re focusing on working with companies, showing them our tech. The way to work with them is to not complicate things,” Netzer explained.\n\nThe company’s $5.5 million seed funding round, led by TLV partners, is their first. Having emerged from stealth, they will be pursuing more partnerships and studies, with the hopes of making protein engineering as easy as checking your email."}