{"url": "https://techcrunch.com/2024/05/25/deal-dive-can-blockchain-make-weather-forecasts-better-weatherxm-thinks-so/", "title": "Can blockchain make weather forecasts better? WeatherXM thinks so", "authors": ["Rebecca Szkutak", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-05-25T00:00:00", "text": "Accurate weather forecasts are critical to industries like agriculture, and they’re also important to help prevent and mitigate harm from inclement weather events or natural disasters. But getting forecasts right is extremely difficult. That’s why the founders of WeatherXM have been looking to make weather forecasts more accurate for the past 12 years.\n\nIn 2012, Manolis Nikiforakis, Stratos Theodorou and Nicolas Tsiligaridis launched an app that allowed community members to provide grassroots weather updates. They then worked as consultants to enterprise customers, like the Athens airport, in weather-sensitive industries. Now they are building WeatherXM, a network of community-monitored weather stations that are collecting and sharing local weather data through systems built on the blockchain.\n\nNikiforakis, WeatherXM’s CEO, told TechCrunch that the startup has already deployed 5,000 of its own weather stations in over 80 countries. These stations collect local ground weather information and are monitored by volunteers who are compensated with WeatherXM’s own crypto token, $WXM. All of the data collected is accessible to anyone to use personally for free with paid offerings for enterprises that want to use it commercially.\n\n“We are strong advocates of open source,” Nikiforakis said. “We believe [WeatherXM’s mission] is not purposeful without collaboration with multiple different sides of people and expertise. We are making all this data openly available to anyone. You can see in real time what every weather station is reporting.”\n\nThe startup just raised a $7.7 million Series A round led by Faction, an early-stage blockchain-focused fund that is affiliated with Lightspeed, with participation from VCs, including Borderless Capital, Alumni Ventures and Red Beard Ventures, in addition to more VCs and other types of investors. The startup will use the capital to expand its team and set itself up to start monetizing its commercial users.\n\nTim Khoury, a partner at Faction, said he was drawn to invest in the company because it offered an attractive use case for a community-driven blockchain project that had both the supply of people willing to join the community and the demand for what the company was producing. The potential TAM for more accurate weather data didn’t hurt, either.\n\n“The falling of a lot of DePIN networks is the demand side,” Khoury said. “If there isn’t demand for what is actually being generated, or produced, in this case, you can’t sustain the network over time.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAs someone with a basement that has flooded on multiple occasions during storms that weren’t accurately predicted, this deal immediately piqued my interest. But the blockchain and crypto token aspect of WeatherXM’s strategy confused me initially.\n\nNikiforakis told me that the crypto incentive structure is the only way this local weather network could work. Paying each person who oversees a weather station would make the idea too costly and complicated to scale to the size the network needs to reach to be effective. He said via their first app, they discovered that people were willing to provide weather data for free, so WeatherXM’s structure is meant to incentivize users just a bit more.\n\n“[Using crypto] also helps coordinate that [weather stations] are deployed in the areas where we care about the most, developing nations and rural nations,” Nikiforakis said. “The crypto rewards work as a coordination tool. In many ways this is a community project; therefore that crypto is acting as a governance tool. People can vote using this token on decisions that influence how the project works.”\n\nWhile I’ll admit I’m not bullish when it comes to blockchain or crypto, utilizing that structure here does make a lot of sense. It’s also complementary to the startup’s focus on making the data open source, which requires blockchain technology to actually be effective.\n\nI was moderating a panel earlier this week that was focused on how communities can prepare for climate emergencies and disasters, and one thing that came up on multiple occasions was that data like this needed to be open source so that public and private entities could more easily work together to both plan for climate disasters and better respond to them.\n\nWeatherXM making all the data open source, especially from its stations in underserved or rural areas, could be advantageous to communities that are fighting the growing threat and damage of climate events without needing a large budget or resources.\n\nThe mission here is easy to get behind, but we’ll see whether bringing weather to the blockchain gets enough demand to really make a difference.\n\n“We need to create an ecosystem around our technology and ideas for the industry to move forward, for meteorology to improve in general,” Nikiforakis said. “We don’t like the old way where things are happening in silos and not giving access to anyone who has the credentials or payment. We are going against the stream. We are opening the data to everyone.”"}