{"url": "https://techcrunch.com/2024/09/10/french-embedded-insurance-startup-neat-secures-55-million/", "title": "French embedded insurance startup Neat secures $55 million", "authors": ["Romain Dillet", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-09-10T00:00:00", "text": "It’s not every day that you hear about a large funding round for a French startup in the current funding environment. But Neat, a Paris-based insurtech startup, has managed to raise €50 million (around $55 million at current exchange rates).\n\nThere is some fine print however. In addition to the traditional equity-for-cash financial transaction, a portion of this funding round is a debt facility. It’s around 60% in equity and 40% in debt, according to the company. So it’s more like a €30 million round with €20 million in debt on top of that.\n\nNeat helps other companies sell insurance products to their own customers. In insurance lingo, it focuses on affinity insurance contracts linked to another service or product.\n\nFor instance, if you’re buying a smartphone, you might want to buy an insurance product to make sure you’re covered in case of accidental drops. Other examples include travel insurance, concert ticket insurance or warranty extensions for household appliances.\n\nNeat focuses on embedded insurance products, which means that partner retailers find insurance customers for it. As a result, retailers also get a commission on each insurance product sold, but they don’t have to deal with the complexities of the insurance industry directly.\n\nAt the other end of the equation, Neat works with insurance and reinsurance companies so that they cover the risks directly. Neat acts as a managing general agent.\n\n“In our business, we usually say that we hold the company’s checkbook, in the sense that we create our own rates, products, and policies. At the same time, we outsource the risk to insurers or reinsurers that trust us,” Neat co-founder and CEO Maximilien Dauzet told TechCrunch.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhen it’s time to create a new insurance product, Neat doesn’t have to go through its insurance partners because it has its own compliance and actuarial teams. It creates insurance products with a small, transparent commission built in for the startup. At the same time, distributors get a commission and reinsurers can generate interests at the end of the insurance food chain by working with Neat.\n\n“Despite some organic growth, insurance companies were still facing a great level of discontent. And so, the real solution is to bring together the entire value chain in a single company, so that we can see things from the same angle and align the interests of our policyholders and our distributors,” Dauzet said.\n\nThe main benefit with this full-stack approach is that Neat can create a wide variety of insurance products because it isn’t a broker built on top of legacy systems. For instance, travel insurance shouldn’t cost the same for people who are 20 and those who are 60 years old. It should be priced differently if you’re going on a camping trip in the countryside versus traveling to another continent. Similarly, smartphone insurance pricing should vary depending on the device and whether it’s a refurbished model or a new one.\n\nImage Credits:Neat\n\nNeat is also diversifying its risk profile by going broad. “We’re pretty agnostic, covering 10 verticals. In fact, right from the start, Max and I made sure that we weren’t focusing on just one vertical,” Neat co-founder and COO Fabien Cazes said. “It allows us to mutualize the risk in terms of insurance, and we have a lot of synergies from a technical point of view.”\n\nNeat offers insurance products that come with credit and debit cards for Floa, travel insurance for Pierre et Vacances, but also hearing aids insurance for Afflelou and Krys. These partners can bundle insurance products with payment cards or sell insurance products as add-on purchases both online and in retail stores.\n\nAs a result, Neat currently works with 1,500 distribution partners. Combined, these partners have sold over 1 million insurance products. Hedosophia is leading the Series A round in the company with Alma Mundi Ventures, ETFS, Athletico Ventures and existing investors also participating."}