{"url": "https://techcrunch.com/2024/12/17/databricks-raises-10b-as-it-barrels-toward-an-ipo/", "title": "Databricks raises $10B as it barrels toward an IPO", "authors": ["Kyle Wiggers", "Rebecca Szkutak", "Sarah Perez", "Tim De Chant", ".Post-Authors-List__Authors --Font-Size Var", "Align-Items Center Display Flex Gap Var", ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var", "Border Solid Var --Wp--Custom--Color--White", "Border-Radius", "Height -O-Object-Fit Cover Object-Fit Cover Width .Post-Authors-List__Authors .Post-Authors-List__Author-List Display Flex Flex-Wrap Wrap Gap Var"], "publication_date": "2024-12-17T00:00:00", "text": "In Brief\n\nDatabricks, the data analytics platform, has raised $10 billion in a funding round that values the company at $62 billion (up from $43 billion). Backers include Thrive Capital, Andreessen Horowitz, DST Global, GIC, and Iconiq Growth.\n\nThe round is one of the largest venture rounds in history, and will drive future mergers and acquisitions, stock payouts to employees, and expansion abroad, according to a statement obtained by CNBC.\n\nDatabricks’ mammoth “Series J” comes ahead of the company’s hotly anticipated IPO. Founded in 2013 by seven doctorate candidates from UC Berkeley, Databricks sells AI, big data analytics, and cloud tooling to enable companies to build data- and AI-powered applications.\n\nDatabricks expects to generate positive free cash flow for the first time with a $3 billion revenue run rate in the quarter that ends on January 31, according to CNBC. The company’s revenue in the October quarter grew more than 60% year over year."}