{"url": "https://techcrunch.com/2025/03/18/bolts-former-ceo-is-launching-a-new-e-commerce-startup/", "title": "Bolt’s former CEO is launching a new e-commerce startup", "authors": ["Charles Rollet", "Senior Reporter", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-18T00:00:00", "text": "Maju Kuruvilla, who left the CEO role of controversial one-click checkout startup Bolt last year, is back. He’s launching his own startup, focused on a different problem for online shoppers: what he calls “check-in.”\n\nWhen you click on an ad for something like a T-shirt, the experience afterward can feel a little clunky. The website you land on might not even have the product you clicked on to begin with. That causes many shoppers to bounce back, hurting conversion rates, Kuruvilla told TechCrunch.\n\nKuruvilla wants to change that with AI. His new startup, Spangle AI, creates custom landing pages for shoppers based on what they searched for or clicked on. It sells to major retailers looking to better monetize their traffic and is powered by an AI model called ProductGPT that decodes customer interactions.\n\nBased in Seattle, Spangle AI raised a $6 million seed round last year, it told TechCrunch. Its investors include Seattle-based Madrona Ventures and Streamlined Ventures, which is in Silicon Valley.\n\nSpangle AI joins a host of other e-commerce startups who sell AI to customize online shopping experiences and improve conversions. Vancouver, B.C.,-based Unbounce, which sells no-code landing pages, raised almost $40 million in 2020 while Dubai-based Qeen.AI raised $10 million earlier this month for its smart shopping assistants.\n\nIt’s still early in Spangle AI’s journey, but the startup claims to be seeing promising signs from its product, which has boosted conversion rates by 51% in early testing. Armed with its product and these case studies, Spangle AI says it will now focus mostly on sales.\n\nKuruvilla was Bolt’s CEO for two years and previously worked for almost eight years at Amazon. He replaced Bolt’s outspoken co-founder Ryan Breslow in 2022 after Breslow’s fiery Twitter tirade against Y Combinator.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThat didn’t end the drama for Breslow, though, after he was sued by Bolt investors over a $30 million personal loan he took out of Bolt. Breslow has since returned as CEO, defended the loan as a vote of confidence in Bolt, and announced that Bolt’s legal troubles are over.\n\nKuruvilla, who jokingly announced on X that he had “one-click checked out” from Bolt when he left last year, is looking ahead. “I just love e-commerce and I love solving hard problems,” he told TechCrunch."}