{"url": "https://techcrunch.com/2022/08/02/shopify-makes-100m-strategic-investment-in-marketing-automation-startup-klaviyo/", "title": "Shopify makes $100M strategic investment in marketing automation startup Klaviyo", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-08-02T00:00:00", "text": "E-commerce marketing automation platform Klaviyo has received a $100 million strategic investment from Shopify, according to documents filed with the U.S. Securities and Exchange Commission. The disclosure coincided with the announcement that Klaviyo and Shopify will strengthen their existing partnership by making Klaviyo the recommended email product for Shopify’s premium merchant plan, Shopify Plus, while granting Klaviyo early access to in-development Shopify features.\n\n“We’ve been working closely with Shopify for years and this is a great next step,” Klaviyo CEO Andrew Bialecki told TechCrunch via email. “I’ve talked with their product team and CEO many times — they’re big believers in our mission of empowering creators and they have a lot of respect for the products we’ve built and our customer-first, product-led culture. Shopify’s been key to our growth and a great team to work with and we’re excited that this will help us go faster in helping more of their customers.”\n\nFounded in 2012, Boston-based Klaviyo — which TechCrunch has profiled extensively — integrates with existing platforms (e.g., Octane AI, Recharge) to automate the sending of emails and text messages to customers. Using Klaviyo, businesses can set up triggers for messages about abandoned carts, product recommendations and more, leveraging an array of templates and predictive analytics tools.\n\nThere’s no shortage of competition in the marketing automation tech space (see Sendlane, Sendinblue and Cordial to name a few). But Klaviyo has done incredibly well for itself, reaching over 100,000 paying customers including Unilever, Dermalogica, Solo Stove and Citizen Watches.\n\nTo date, Klaviyo, which has over 1,000 employees, has raised around $775 million. As of May 2021, the startup was valued at $9.5 billion by investors including Sands Capital, Counterpoint Global, Accel and Summit Partners.\n\nFor Shopify, Klaviyo is the latest in a string of investments and acquisitions aimed at broadening the e-commerce platform’s reach. In May, Shopify snapped up shipping logistics startup Deliverr for $2.1 billion — the largest purchase in Shopify’s history — to launch an “end-to-end” logistics platform for merchants. Just this week, Shopify invested in Single, a music and video app used by many businesses on Shopify, following an equity pledge in CMS developer Sanity.\n\nTo the extent that they have a focus, Shopify’s past year of investments have leaned in the direction of recommendations and martech. Last September, Shopify put money toward and entered into a partnership with Yotpo, which provides marketing tools and products for consumer sellers. The e-commerce giant more recently injected capital into Crossing Minds, a startup offering a platform that delivers “personalized experiences” ostensibly without using personal data.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThere’s certainly pressure on Shopify to better weather what’s likely to be an extended economic downturn. Last month, the company laid off 10% of its workforce — about 1,000 employees — in what CEO and founder Tobi Lütke described as a “necessary” move in response to users pulling back on online orders and returning to old shopping habits. The company posted a $1.2 billion net loss for Q2 2022 and warned shareholders during a call last week to expect inflation to impact earnings throughout the remainder of the year."}