{"url": "https://techcrunch.com/2024/04/23/matterport-costar-deal/", "title": "Y Combinator alum Matterport is being bought by real estate juggernaut CoStar at a 212% premium", "authors": ["Anna Heim", "Freelance Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-04-23T00:00:00", "text": "Digital twin platform Matterport has agreed to be acquired by one of its customers, CoStar, in a cash-and-stock deal of $5.50 per share that gives it an enterprise valuation of about $1.6 billion. Matterport’s tech helps companies create digital replicas of physical spaces.\n\nCoStar’s offer represents a premium of a whopping 212% over Matterport’s last closing share price before the deal was announced on April 22.\n\nThe deal looks like a fortunate turn of events for Matterport, whose shares had been trading below the $5 mark since August 2022 as the company struggled to meet investors’ expectations for subscriber growth amid a sluggish real estate market and a wider macroeconomic slowdown. Matterport’s stock was trading below $2 per share before the transaction was disclosed.\n\nThe company has been trying to improve its profitability over the past year, too, according to its 2023 financial statements. However, investors haven’t been happy with the company, whose shares have been struggling since it went public via a SPAC deal in 2021, which Bloomberg reported valued Matterport at around $2.9 billion.\n\nMatterport’s shares were trading at $4.76 before the bell on Tuesday — slightly below the $5.50 deal price, which indicates investors may be wary of the deal getting blocked by regulators, or they may be hedging their bets to account for a possible decline in CoStar’s stock, since the deal has a share-based component, too. CoStar’s shares, however, are up slightly since the announcement, indicating that its investors are happy with the potential benefits of the deal.\n\nMatterport quickly rose to prominence from its start in 2011, making 3D imaging cameras, spawning out of the Microsoft Kinect hacker scene and going on to join Y Combinator’s Winter 2012 batch. Its services gained significant traction in the real estate space despite competition from alternatives such as Cupix, Giraffe360 and Zillow 3D Home.\n\nDigital twin technology has applications in construction tech and insurtech, but demand from real estate players is particularly salient, as the pandemic accelerated the switch from in-person viewings to virtual tours, both for commercial and for residential properties.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nEarly-mover advantage aside, the company’s later decisions likely played an equally important role as the market evolved. It diversified into helping clients create virtual tours even with smartphones. And the addition of AI with its in-house solution, Cortex, added more differentiation to its offering, leveraging its data to generate 3D digital twins supporting additional labels such as property dimensions.\n\nMatterport’s leadership changed over the years. Its current CEO, former eBay Chief Product Officer RJ Pittman, took the reins in 2018 — but its fundraising trajectory was fairly smooth. Over its first decade, it raised successive rounds of funding for a total of $409 million, followed by its public debut in 2021.\n\n“CoStar Group and Matterport have nearly identical mission statements of digitizing the world’s real estate,” CoStar’s founder and CEO Andy Florance said in a statement.\n\nCoStar, which has a market cap of $34.84 billion, is a real estate heavyweight that operates marketplaces such as Apartments.com, Homes.com and LoopNet (for commercial real estate). This gives it direct insights into the value that Matterport can add for its end users.\n\nIn March 2024, CoStar wrote in a press release, “there were over 7.4 million views of Matterport 3D Tours on Apartments.com, with consumers spending 20% more time viewing an apartment listing when Matterports were available.” The company now plans to incorporate Matterport’s virtual tours (“Matterports”) on Homes.com.\n\nTaking to the stage at a real estate event shortly after the announcement, Florance reportedly said that allowing home buyers to view properties with their own furniture, for instance, will allow agents to provide more value and promote their brands.\n\nIt will be worth tracking what happens to Matterport’s activities beyond real estate, such as its partnership with Facebook to help researchers train robots in virtual environments.\n\nThe deal is subject to regulatory approvals, but this is more than an asterisk: In 2020, CoStar’s attempt to acquire RentPath was derailed by an FTC antitrust lawsuit, and RentPath was instead bought by Redfin in 2021."}