{"url": "https://techcrunch.com/2025/02/28/startup-co-founded-by-longevity-guru-peter-attia-emerges-from-stealth/", "title": "Startup co-founded by longevity guru Peter Attia emerges from stealth", "authors": ["Charles Rollet", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-02-28T00:00:00", "text": "Longevity is a hot trend in Silicon Valley these days, driven by rising interest — especially among the wealthy — in preventing disease through regular testing.\n\nA new player, Biograph, has just emerged from stealth, and it’s co-founded by one of the biggest names in longevity science: Dr. Peter Attia. Attia is a Canadian-American physician best known as the author of the bestseller “Outlive: The Science and Art of Longevity” and for his podcast.\n\nBiograph’s CEO and other co-founder is John Hering, a prominent Silicon Valley figure. A cybersecurity founder who infamously scanned celebrities’ cellphones at the 2005 Academy Awards, Hering has become best known as one Elon Musk’s biggest backers through his role as a partner at Vy Capital. There, Hering has poured billions into Musk’s startups and donated $500,000 to a pro-Trump super PAC before the election, per a WSJ profile.\n\nBiograph calls itself the world’s “most advanced” preventive health and diagnostics clinic. It currently has a location in Silicon Valley with plans to open in New York City this quarter, and eventually expand globally, according to an announcement on its website.\n\nThe startup says it will collect over 1,000 data points across 30+ evaluations to paint a holistic picture of someone’s health and optimize their lifespan. It doesn’t come cheap: Its Core membership costs $7,500 per year while the premium Black membership — which it says provides the “deepest insights” — runs $15,000.\n\nBiograph is backed by Vy Capital, Human Capital, Alpha Wave, and WndrCo, along with angel investors including Balaji Srinivasan, the startup told TechCrunch. Biograph declined to specify how much funding it has raised.\n\nIn a statement, Hering said he was inspired to co-found Biograph by the cancer diagnosis of his Vy Capital partner and friend Alexander Tamas. Tamas posted on X that a check-up in his late 30s resulted in an early thyroid cancer diagnosis that probably saved his life — and caused him to encourage Hering to get checked, too.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBiograph claims that over 15% of members have reported discovering “urgent or life-alerting health” insights through its services. The company has been quietly operating since 2020, according to the LinkedIn profile of its executive medical director, Michael Doney, a doctor with a background in longevity.\n\nWhile Biograph’s announcement doesn’t mention AI, the company is currently looking for a founding AI engineer to build an AI-powered assistant, according to its careers page.\n\nBiograph is part of a quiet boom in startups dedicated to living longer, with Andreessen Horowitz-backed Function Health seeking a $2 billion valuation this year and Sam Altman-backed Retro Biosciences in talks to raise a cool $1 billion last month."}