{"url": "https://techcrunch.com/2017/03/17/santa-fe-enlists-rubicon-global-to-curb-waste-and-ramp-up-recycling/", "title": "Santa Fe enlists Rubicon Global to curb waste and ramp up recycling", "authors": ["Lora Kolodny", "Emerging Tech Editor", "Video Host", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2017-03-17T00:00:00", "text": "Humans, especially Americans, are kind of slobs. We mess up the Earth by throwing out about 4.5 pounds of garbage per person on average every day. Two-thirds of that waste could be composted, but isn’t. And half of the rest of it could be recycled, according to research from the Duke Nicholas School of the Environment, corroborated by studies from the Global Footprint Network and others.\n\nNow, the city of Santa Fe wants to do something about it. Santa Fe has enlisted tech startup Rubicon Global to figure out what its residents toss in the trash, recycle or send to compost. Using data gathered by garbage collectors and trucks on their normal routes, Rubicon helps municipalities quantify their trash and pinpoint neighborhoods for improvement when they clearly need more education or different waste management services.\n\nFunded by Nima Capital and a number of high-profile angel investors, including actor and environmentalist Leonardo DiCaprio, Rubicon Global first generated buzz as the “Uber of garbage.” It promised to make garbage pick-ups available on demand, not just at pre-scheduled times.\n\nIn its early days, Rubicon generated revenue by helping businesses like restaurant chains or hospitals divert waste from landfills and instead send it to be recycled or used elsewhere. Doing that, businesses avoid “tipping fees” charged by landfills. They also get to ballyhoo their efforts in sustainability for positive PR.\n\nRubicon’s long-term goal in Santa Fe is to enable garbage hauling on demand, or just when and where it’s needed. But before making any changes to the way it hauls waste, the city wants to get a handle on its own hot mess. Head of public policy at Rubicon, Michael Allegretti, said the company’s app asks garbage collectors to submit notes about anything unusual on a given job.\n\nIf a collector can’t complete a weekly pick-up because there’s simply no garbage at an abandoned and boarded-up house, the city learns where flight and blight are happening. If they pick up a trash bin that’s full of recyclable bottles and cans, repeatedly, at the same address, the city can target that home for educational outreach on recycling.\n\n“Cities want to be smart. They want all the data they can get before they make decisions to spend time and money on programs with a constrained budget. We give them the tools to turn their existing assets into the brains of the smart city,” Allegretti said. Its expansion into Santa Fe marks the first time Rubicon Global has struck a municipal-level contract outside of its hometown of Atlanta, CEO Nate Morris said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAsked if Rubicon is installing new sensors, or robotic arms, into the fleets of trucks it works with, Morris said not yet. The cameras and mobile devices that are already on-board these vehicles do such a good job of gathering data with humans at the wheel that Rubicon hasn’t needed to automate further. However, he noted that Rubicon will always investigate emerging technologies that can help waste management workers do their jobs more efficiently and with less risk."}