{"url": "https://techcrunch.com/2023/06/01/xonai-looks-to-reduce-cloud-bills-by-optimizing-data-infrastructure/", "title": "Xonai looks to reduce cloud bills by optimizing data infrastructure", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-06-01T00:00:00", "text": "There are many companies out there looking at how to reduce your cloud bills by eliminating waste, or finding more cost-effective ways of doing the same job. Xonai, an early-stage startup, is taking a different approach to cloud cost reduction.\n\nIt’s looking at ways to make your data software run more efficiently, and thereby reduce the cost of your overall workload, starting with Apache Spark. It plans to support other packages over time. Today, the company announced a $3.5 million seed investment.\n\n“We are helping organizations that need to scale data- and AI-driven products to reduce cost, and accelerate time to value,” company co-founder and CTO Leandro Vaz told TechCrunch.\n\nThe company has chosen to focus on these data and AI products because by their nature, they require scaling of cloud resources in proportion to the business growth in order to maintain the quality of service. While Vaz couldn’t share customer names, or the number of companies using the product at this point, he talked in general terms about the types of organizations that could benefit from using Xonai, such as adtech, financial services, retail, gaming or just about any data-heavy business.\n\n“They need to scale because they keep growing the amount of data they have to process as the business grows. Essentially what happens when engineers implement these things is that they have to scale the infrastructure horizontally and this almost always means that they use more machines,” he said. And this essentially scales the cloud costs in proportion to the number of machines that they are using in the cloud.\n\nThis is where Xonai comes with a solution designed to bring down those data infrastructure costs. “We are doing something to really make these very demanding applications for AI and data run faster and use fewer resources,” he says.\n\nThe beauty of the approach is it’s fully automated, so you don’t have to monitor the level of resources. The software takes care of that for you automatically via hardware acceleration that makes these workloads run faster with fewer machines. “We are leveraging novel developments in compilers and building a layer that allows you to essentially write these steps into a common language. Then we can optimize all these steps together, and by doing that these applications run compute much faster,” he said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nHow much faster? He says anywhere from 2-5x.\n\nThe company currently has around a dozen employees with a few open roles coming soon. At this early stage, they have gender and geographic diversity and he says as he hires, he is going to continue to make an effort to bring people from different backgrounds into the company.\n\nThe seed investment was led by Kadmos Capital with participation from Adara Ventures, Deep Science Ventures, Nauta Capital, Notion Capital and various industry angels."}