{"url": "https://techcrunch.com/2021/04/07/spotify-stays-quiet-about-launch-of-its-voice-command-hey-spotify-on-mobile/", "title": "Spotify stays quiet about launch of its voice command ‘Hey Spotify’ on mobile", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-04-07T00:00:00", "text": "In 2019, Spotify began testing a hardware device for automobile owners it lovingly dubbed “Car Thing,” which allowed Spotify Premium users to play music and podcasts using voice commands that began with “Hey, Spotify.” Last year, Spotify began developing a similar voice integration into its mobile app. Now, access to the “Hey Spotify” voice feature is rolling out more broadly.\n\nSpotify initially chose not to officially announce the new addition, despite numerous reports indicating the voice option was showing up for many people in their Spotify app, leading to some user confusion about availability.\n\nOne early report by GSM Arena, for example, indicated Android users had been sent a push notification that alerted them to the feature. The notification advised users to “Just enable your mic and say ‘Hey Spotify, Play my Favorite Songs.” When tapped, the notification launched Spotify’s new voice interface where users are pushed to first give the app permission to use the microphone in order to be able to verbally request the music they want to hear.\n\nSeveral outlets soon reported the feature had launched to Android users, which is only partially true.\n\nAs it turns out, the feature is making its way to iOS devices, as well. When we launched the Spotify app here on an iPhone running iOS 14.5, for instance, we found the same feature had indeed gone live. You just tap on the microphone button by the search box to get to the voice experience. We asked around and found that other iPhone users on various versions of the iOS operating system also had the feature, including free users, Premium subscribers and Premium Family Plan subscribers.\n\nThe screen that appears suggests in big, bold text that you could be saying “Hey Spotify, play…” followed by a random artist’s name. It also presents a big green button at the bottom to turn on “Hey Spotify.”\n\nOnce enabled, you can ask for artists, albums, songs and playlists by name, as well as control playback with commands like stop, pause, skip this song, go back and others. Spotify confirms the command with a robotic-sounding male voice by default. (You can swap to a female voice in Settings, if you prefer.)\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThis screen also alerts users that when the app hears the “Hey Spotify” voice command, it sends the user’s voice data and other information to Spotify. There’s a link to Spotify policy regarding its use of voice data, which further explains that Spotify will collect recordings and transcripts of what you say along with information about the content it returned to you. The company says it may continue to use this data to improve the feature, develop new voice features and target users with relevant advertising. It may also share your information with service providers, like cloud storage providers.\n\nThe policy looks to be the same as the one that was used along with Spotify’s voice-enabled ads, launched last year. Spotify later clarified that the app will always indicate — with an in-app visual or audio tone — when it is receiving a user’s voice input. At other times, the app listens for “Hey Spotify” in short, few-second snippets that are deleted if you don’t say it, it says. The full voice controls policy is detailed here.\n\nGiven the “Hey Spotify” voice command’s origins with “Car Thing,” there’s been speculation that the mobile rollout is a signal that the company is poised to launch its own hardware to the wider public in the near future. There’s already some indication that may be true — MacRumors recently reported finding references and photos to Car Thing and its various mounts inside the Spotify app’s code. This follows Car Thing’s reveal in FCC filings back in January of this year, which had also stoked rumors that the device was soon to launch.\n\nSpotify was reached for comment on Wednesday morning, but was unable to provide any answers about the feature’s launch despite a full day’s wait. Instead, we were told that they “unfortunately do not have any additional news to share at this time.” That response further suggests some larger projects could be tied to this otherwise more minor feature’s launch. [Update, April 4: Spotify finally confirmed the launch of “Hey Spotify”, noting the feature has begun to roll out to iOS and Android users in the U.S. and will continue to roll out to more in the next few weeks.]\n\nThough today’s consumers are wary of tech companies’ data collection methods — and particularly their use of voice data after all three tech giants confessed to poor practices on this front — there’s still a use case for voice commands, particularly from an accessibility standpoint and, for drivers, from a safety standpoint.\n\nAnd although you can direct your voice assistant on your phone (or via CarPlay or Android Auto, if available) to play content from Spotify, some may find it useful to be able to speak to Spotify directly — especially since Apple doesn’t allow Spotify to be set as a default music service. You can only train Siri to launch Spotify as your preferred service.\n\nIf, however, you have second thoughts about using the “Hey Spotify” feature after enabling it, you can turn it off under “Voice Interactions” in the app’s settings."}