{"url": "https://techcrunch.com/2023/03/27/y-combinator-backed-neptyne-is-building-a-python-powered-spreadsheet-for-data-scientists/", "title": "Neptyne is building a Python-powered spreadsheet for data scientists", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-03-27T00:00:00", "text": "Douwe Osinga and Jack Amadeo were working together at Sidewalk Labs, Alphabet’s venture to build tech-forward cities, when they arrived at the conclusion that most spreadsheet software doesn’t scale up to today’s data challenges. Data science tools like Pandas and Jupyter Notebooks do, but they tend to be too inaccessible to the layperson — at least in Osinga and Amadeo’s experience.\n\n“Talk to any analyst or financial modeler and they’ll tell you that Excel just doesn’t cut it anymore,” Osinga said. “Everybody is aware of the need to move to more powerful solutions and Python is the obvious candidate. Yet collaborating with today’s tools is underwhelming.”\n\nOsinga and Amadeo’s solution was Neptyne, an app that uses an AI assistant to help users program spreadsheets without learning how to code. A member of the Y Combinator winter 2023 class, Neptyne this month closed a $2 million pre-seed round from Y Combinator and a group of high-profile angels, including Google AI lead Jeff Dean and Google Maps co-founder Lars Rasmussen.\n\nNeptyne joins a raft of startups on a mission to transform the traditional spreadsheet. There’s Airtable, of course, plus upstarts like Spreadsheet.com, Actiondesk and Pigment — the last of which raised $73 million last November for its data analytics and visualization service. Most recently, Equals, a San Francisco-based venture, raised $16 million for its spreadsheet platform that incorporates tools like live data integrations.\n\nNeptyne is different in that it packs a Python-based spreadsheet engine, Python being the programming language popularly used for data science. Osinga describes it thusly: It’s a spreadsheet where everything works the way you’d expect it to work in a spreadsheet, but that also offers access to the Python ecosystem — including libraries, frameworks and tools.\n\n“The large language models [like OpenAI’s GPT-4] that have recently produced mind-blowing results happen to be very good at writing Python code,” Osinga said. “Since Neptyne natively speaks Python, it means that the AI doesn’t just help you write formulas or visualize data — you can have a dialog with the AI about the spreadsheet application in front of you and have it modify it for you.”\n\nFor example, imagine you have a pivot table built using Pandas, an open source Python library for data analysis, that summarizes data both by product and region. With Neptyne, you can ask the AI assistant to modify the pivot table calculation to include or exclude products or change the grouping criteria, such as by product category instead of individual product. Neptyne updates the calculations in real time, allowing you to explore different options.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“A lot of important modeling and calculations today is hidden in complex spreadsheets or data processing systems and modifying requires experts to dig in deep,” Osinga said. “Neptyne’s powerful AI integrations eliminate the limitations of normal spreadsheets while dramatically reducing the complexity of using advanced data tools.”\n\nThem’s fighting words. But it’s early days for Neptyne — the company is pre-revenue and isn’t disclosing the size of its customer base. Osinga optimistically expects growth this year, so much so that he’s anticipating hiring six staffers to round out Neptyne’s current four-person workforce."}