{"url": "https://techcrunch.com/2018/05/18/tiny-house-trend-advances-into-the-nano-scale/", "title": "Tiny house trend advances into the nano scale", "authors": ["Devin Coldewey", "Writer", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2018-05-18T00:00:00", "text": "All around the world, hip young people are competing to see who can live in the tiniest, quirkiest, twee-est house. But this one has them all beat. Assembled by a combination of origami and nanometer-precise robot wielding an ion beam, this tiniest of houses measures about 20 micrometers across. For comparison, that’s almost as small as a studio in the Lower East Side of Manhattan.\n\nIt’s from the Femto-ST Institute in France, where the tiny house trend has clearly become an obsession. Really, though, the researchers aren’t just playing around. Assembly of complex structures at this scale is needed in many industries: building a special radiation or biological sensor in place on the tip of an optical fiber could let locations be probed or monitored that were inaccessible before.\n\nThe house is constructed to show the precision with which the tools the team has developed can operate. The robot that does the assembly, which they call μRobotex, isn’t itself at the nano scale, but operates with an accuracy of as little as 2 nanometers.\n\nThe operator of μRobotex first laid down a layer of silica on the tip of a cut optical fiber less than the width of a human hair. They then used an ion beam to cut out the shape of the walls and add the windows and doors. By cutting through some places but only scoring in others, physical forces are created that cause the walls to fold upwards and meet.\n\nOnce they’re in place, μRobotex switches tools and uses a gas injection system to attach those surfaces to each other. Once done, the system even “sputters” a tiled pattern on the roof.\n\nHaving built this house as a proof of concept, the team is now aiming to make even smaller structures on the tips of carbon nanotubes — ones that could comfortably pass through the house’s windows.\n\nThe researchers published their methods in the Journal of Vacuum Science and Technology."}