{"url": "https://techcrunch.com/2022/06/14/proving-that-contact-center-tech-remains-desirable-invoca-raises-83m/", "title": "Contact center tech remains desirable, Invoca raises $83M", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-06-14T00:00:00", "text": "Invoca, a platform that uses AI to analyze calls for marketing, sales and customer agent training purposes, today closed an $83 million funding round that values the company at $1.1 billion post-money. Invoca has raised $184 million to date, the bulk of which is being used to support product development focused on Invoca’s contact center offerings, international expansion and potential acquisitions, according to CEO Gregg Johnson.\n\nThere’s evidence to suggest that poor customer service experiences, like long hold times, can affect revenue. Unfortunately, the pandemic continues to put a strain on call centers in particular, which have had to contend not only with the “new normal” of remote work but a historic labor shortage. For example, in 2020, T-Mobile was forced to move 12,000 customer care employees out of 17 call centers to work-from-home platforms. Last July and August, the company’s annualized attrition rate — a measure of how many employees leave over a year — reached 65%, up from around 20% before the pandemic.\n\nInvoca doesn’t claim to solve all of these problems. But through services like agent coaching and “automated contact center quality assurance,” the company aims to boost conversion rates, customer satisfaction and service levels in a largely hands-off fashion.\n\n“Business-to-consumer (B2C) brands are laser-focused on driving revenue growth, delivering great customer experiences, and reducing churn. And at a time when they are experiencing more incoming calls and have fewer qualified reps to manage them, delivering a quality customer experience is vital,” Johnson told TechCrunch in an email interview. “The contact center has re-emerged as a strategic solution and this is increasing investment in technology to modernize the contact center.”\n\nInvoca was founded in 2008 by Colin Kelley, Jason Spievak and Robert Duva in Santa Barbara, California. The founding team worked together at CallWave, a communications firm that was ultimately acquired by Voice over IP company 8×8.\n\nAccording to Johnson, Kelley, Spievak and Duva foresaw the intersection of two broad trends: the shift of advertising and marketing into digital and internet-enabled telephony. Johnson joined in 2016 from Salesforce, where he was SVP of product management at Marketing Cloud, with a vision to expand the Invoca platform and take advantage of emerging technologies around AI, natural language processing and voice.\n\nAn IPO was in the works. But Johnson and the management team ultimately decided the timing wasn’t right.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Invoca solves a critical problem for businesses – the broken customer experience,” Johnson said. “Invoca’s technology enables revenue teams to better understand the end-to-end consumer buying experience and immediately act on the information consumers share via phone conversations. In our case, ‘revenue teams’ encompass marketers, sales and retention teams in the contact center, as well as digital commerce and customer experience teams.”\n\nInvoca aims to deliver “actionable” data from phone calls between sales or service agents and customers in real time. Entirely cloud-based, Invoca acts as a centralized platform that combines AI-powered speech analytics, automated call scoring, call routing and conversational interactive voice response (IVRs) capabilities.\n\nInvoca customers get metrics for call handling, call intent and conversational outcomes, as well as a searchable database of transcripts and call recordings.\n\n“Invoca’s flagship product is used by acquisition marketers at large consumer brands, such as AutoNation, Banner Health, DirecTV, ORKIN, Rogers Communications, Mayo Clinics, and University Hospitals,” Johnson said. “Over the past year, Invoca added AI-powered products for contact center teams to enhance customer experiences through improved quality management, agent coaching & performance, call routing, conversational IVRs (virtual agents), and handling of unanswered calls.”\n\nThe market for call center technologies has undergone something of a revitalization in recent years as startups and incumbents pursue what is — and will be — a lucrative opportunity. Grand View Research anticipates that global contact center software revenue will grow to $149.58 billion in 2030, up from $28.09 billion in 2022. Amazon, Google and Microsoft offer products that automate common contact center tasks and perform analytics on call data. So do newer entrants like Replicant, Tenyx, Observe.ai, Loris and Level AI. Earlier this year, Uniphore, which uses AI to suggest actions to service agents, raised $400 million in one of the largest transactions to date in the call center technology space.\n\nJohnson claims that what sets Invoca apart is its machine learning capabilities, specifically its classification systems. The platform can detect call outcomes such as purchases made, appointments set or applications submitted, he explained, and group conversations into topics based on speech similarities — identifying call topics (e.g. claim filing) and top-spoken words (e.g. “best price”) and optionally pushing and pulling the data to/from third-party marketing apps including Google Ads. For instance, an e-commerce customer might see data from Invoca like their estimated household income, their last-viewed webpages and the number of times they’d called before. Post-call, the retailer might be notified if the caller mentioned or purchased a product of theirs.\n\n“[We’re] seeing multi-location chains and large scale businesses begin to use or even double down on contact centers so that workers can focus on in-person guests,” Johnson said. “The contact center is representative of something much larger – a business fundamental. As a result, Invoca [has seen] a dramatic spike in customers calling businesses, handling over 337 million calls — the equivalent of 1.579 billion call minutes.”\n\nOne of Invoca’s less-advertised features is automatic call scoring, which allows customers to define criteria to “quantify agent performance and track script compliance” and “monitor how agents … are performing against core KPIs.” While scoring is par for the course where it concerns call center analytics software, the feature might not sit well with agents already under pressure from increasing call volumes. A 2021 ExpressVPN survey of 2,000 workers found that employees were unhappy with workplace monitoring software, on the whole, with 43% seeing it as a violation of trust.\n\nJohnson defended automatic call scoring as a way to improve agents’ performance through teachable moments — despite, too, the technical challenges inherent in speech recognition. When an agent doesn’t meet expectations, a manager can swoop in to review the conversation and provide feedback, he said, ostensibly saving time.\n\n“[Invoca] is driving huge efficiency gains in our customers’ quality assurance process, enabling them to be much more effective without added resources,” he continued. “It’s also helping our customers improve morale and elevate their agent coaching programs by improving access to data and facilitating increased collaboration between agents and their supervisors.”\n\nCustomers haven’t been dissuaded. Johnson said that Invoca has surpassed $100 million in revenue run rate, with annual recurring revenue reaching $97 million. The company was break-even on an EBITDA basis in the last fiscal year (ending January 2022) and plans to expand its 380-person workforce by 50 this year, targeting new customers beyond its core markets of the U.S. and Canada into Europe, Mexico and South America.\n\nSignaling its broader ambitions, in 2020, Invoca expanded with the launch of Invoca Exchange, a portal where businesses can find third-party integrations for applications like e-commerce and sales. And last year, Invoca made its first acquisition in DialogTech, a startup that builds tools for marketers to analyze inbound phone calls and other contacts.\n\n“As tech company valuations have retracted by 50% year-to-date, investors have a critical eye on verified business fundamentals and long-term market potential,” Johnson said. “They’re stepping back from investing in lofty vision-based companies and returning to companies that are strong, steady, and proven. Invoca’s round bucks the current trend in tech valuations and validates the strong long-term fundamentals propelling its business.”\n\nSilver Lake Waterman led Invoca’s latest funding round, with participation from Upfront Ventures, Accel and H.I.G. Capital."}