{"url": "https://techcrunch.com/2024/10/01/air-doctor-raised-20m-to-plug-a-gap-in-how-people-find-doctors-when-theyre-travelling/", "title": "Air Doctor raises $20M to plug a gap in how people find doctors when they’re traveling", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-10-01T00:00:00", "text": "Traveling abroad comes with its unique set of stresses, and for many, one of the biggest is what to do if you find yourself unwell. Can you find a doctor who speaks your language, will accept your insurance, and let you avoid the costs and stress of visiting an unfamiliar hospital emergency room?\n\nA startup called Air Doctor has built a platform to help people in this very predicament, and it has now raised $20 million in a Series B round after seeing strong traction.\n\nAir Doctor’s product is part directory, part algorithmically-driven location-based service provider, and part accounting tech. At its heart, it is a directory of vetted doctors in different countries along with profiles detailing what they cover and what languages they speak. This directory is provided to users to browse and use for either in-person or remote consultations.\n\nPatients do not have to pay the doctors or get their claims covered by insurance providers. Air Doctor matches up customers’ insurance policies with the services rendered, and manages the reimbursement payments to doctors from insurance companies.\n\nAir Doctor charges a service fee and commission as part of that process, but all the same, it claims that its efforts result in 50% savings on outpatient claims overall, 60% savings for medical assistance providers, and reduces handling and processing time by 75%.\n\nThe startup claims it has more than 80,000 customers, which has been boosted by contracts with 18 major health insurance providers, and it provides a directory of 20,000 doctors across 84 countries. It started off with a B2C focus, but now operates a B2B2C model with insurance companies in the middle, referring individuals to Air Doctor, along with others using the service directly.\n\nCEO and co-founder Jenny Cohen Derfler said the company’s revenue is growing by 2.5x annually. But when you combine that traction with the ballooning number of international travelers (790 million people traveled internationally in the first seven months of 2024, per UN estimates), “the potential is much larger,” Derfler said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIt should be noted, though, that there are other startups targeting travelers’ health needs: Feather is building an insurance platform for expats, for example.\n\nThe investors in Air Doctor’s new round underscore the opportunity the company is targeting: aMoon, an Israeli VC firm focused on health and life sciences, is leading the round, with other new backers including insurance giant Tokio Marine Holdings and Samsung Ventures (SVIC). Previous backers Lightspeed Venture Partners, Vintage Investment Partners, and two more industry bigwigs — Phoenix Insurance and Munich Re Ventures — are also participating.\n\nThe investors spelled out another aspect of the potential tech the company has been building: “Air Doctor is … leveraging advanced algorithms and app-based solutions to provide timely, quality medical care for travelers worldwide,” Todd Sone, general partner at aMoon, said in a statement.\n\nDerfler’s interest in building Air Doctor comes partly from her and her son’s (who is also her co-founder) background. Derfler described herself as a “nomad”: she originally hails from Uruguay, has traveled around South America, spent time in other countries, and currently lives in Israel.\n\nHer son, Yam Derfler, originally came up with the idea for the company when traveling.\n\nIn South America, he fell ill and realized he had no idea how to navigate the local health system to find a doctor. He went to a hospital instead, which proved to have its own dramatic turns.\n\nBack at home in Israel, when he and Jenny started to look deeper at the problem, it was clear that Yam and other consumers were not alone. Insurance companies also didn’t have a clear route to recommending doctors in countries outside their home territory.\n\nAnd so began the process of building Air Doctor. That endeavor was filled with challenges, Derfler recalled. The co-founders realized that to be very close to the problem and solution, they would have to travel to the first country they tackled, Greece, to find doctors to start building a network.\n\n“We started to go to visit doctors in Greece through recommendations,” she said. “We learned that when you call a doctor in Greece, the receptionist usually doesn’t know English. And when you go to the address, the letters are not Latin letters, so we couldn’t understand which floor a clinic was located on. We wanted to understand the need ourselves and what we needed to tell our users to do.”\n\nThe two also used other methods to build up its database, including contacting embassies for recommendations, and then leveraging word-of-mouth through existing doctors on the network. Before the COVID-19 pandemic, Air Doctor had amassed 10,000 doctors, and in the last two years, another 10,000 have joined, she said.\n\nAnd now that the startup is working more closely with insurance companies, it leans on them, too, to understand where people travel and what are the most common ailments to focus its network growth.\n\nThe company has now raised a total of around $50 million (including this Series A in 2020) and it is not disclosing its valuation."}