{"url": "https://techcrunch.com/2024/06/19/c12-the-french-quantum-computing-startup-founded-by-two-twin-brothers-raises-194-million/", "title": "C12, a French quantum computing startup founded by twin brothers, raises $19.4M", "authors": ["Romain Dillet", "Senior Reporter", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block"], "publication_date": "2024-06-19T00:00:00", "text": "C12 is announcing that it recently raised an €18 million funding round ($19.4 million at today’s exchange rate). Originally founded in 2020 as a spinoff from the Physics Laboratory of the École Normale Supérieure, the company has been working on a unique process to create quantum computers based on carbon nanotubes.\n\nWhile the concept of quantum computing isn’t new, it is still very much a work in progress. Many scientific teams have been approaching this topic from different angles. The goal is to create a quantum computer at scale that can execute calculations with a low amount of errors.\n\nBut wait, why do we need quantum computers in the first place? Computers as they exist today are entirely based on electronic transistors. And we’ve become really good at making transistors smaller so we can pack more of them in a single chip. As a result, computing power has progressed at an exponential pace over the past 60 years.\n\nAnd yet, the current computer architecture has its limits. Even if companies start building bigger data centers, some problems simply can’t be solved with traditional computers. It is also unclear whether Moore’s law will remain valid in the years to come.\n\nThis is where quantum computers could prove useful.\n\n“If we want to create a model — an exhaustive simulation of a chemical reaction — to know how new drugs are going to interact with our cells, that’s not possible with a conventional approach,” C12 co-founder and CEO Pierre Desjardins (pictured right) told TechCrunch.\n\n“There are a whole host of optimization problems to be solved, whether in transport, logistics or manufacturing. They are impossible to run on a conventional computer because there will be too many variables, too many possible scenarios,” he continued.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMatthieu Desjardins, his brother, has a PhD in quantum physics and acts as the CTO of the company. At some point in our conversation, Pierre even called his brother a “scientific genius.”\n\nAnd because it’s 2024, there’s even an AI angle that should convince you that quantum computing research is important. “Today, training a large language model also means consuming an enormous amount of energy,” Pierre said. “And quantum is also a computing method that uses much less energy.”\n\nHow to build a quantum computer\n\nC12 says the two key differences with the other teams working on quantum computers are that it uses a different material (carbon nanotubes) and it has a specific manufacturing process (a nano-assembly process that is now patented).\n\n“Today, I think we are the only ones in the world to control this very special process, which involves putting a carbon nanotube on top of a silicon chip. And what’s absolutely fascinating is the scale. The diameter of a carbon nanotube is 10,000 times smaller than a human hair,” Pierre said.\n\nImage Credits:C12\n\nResearch teams working for big companies like Google, IBM or Amazon are currently focusing on a different process. Most of them are using superconducting materials, such as aluminum, on top of a silicon substrate.\n\nAccording to C12, this method has led to early breakthroughs. However, using aluminum isn’t going to work at scale due to interferences as you start adding more qubits. While quantum isn’t mature yet, C12 believes it is working on next-generation quantum computing compared to these aluminum-based processes.\n\nThe company has set up its first production line in a basement near the Pantheon in Paris. In this facility, they manufacture carbon nanotubes, control those tubes and then integrate them with the silicon substrate.\n\n“It’s now up and running. Today, we produce about one chip a week, which we then test in our mini data center,” Pierre said. But don’t expect to see a quantum computer just yet. “We are still really just validating fundamental elements,” he added. The company is focusing on chips with one or two qubits for the moment.\n\nEmulating quantum\n\nAs research and development work progresses, the C12 team is also working on its business ecosystem. Like many quantum companies, C12 has created an emulator called Callisto. Emulators let developers write and run some quantum code on a classical computer.\n\nThey’re not going to get the results they would get with a quantum computer, but at least they will be ready to hit the ground running when quantum computers are available.\n\n“We are currently focusing on two verticals, the chemical industry and the energy industry. The chemical industry uses it to simulate chemical reactions and the energy industry uses it mainly for optimization problems,” Pierre said. In particular, the startup has a partnership with Air Liquide.\n\nImage Credits:C12\n\nAnd if we go back to the funding round, Varsity Capital, EIC Fund and Verve Ventures are investing in it; existing investors 360 Capital, Bpifrance’s Digital Venture fund and BNP Paribas Développement are also participating once again in this round.\n\nThere are 45 people from 18 different nationalities working for C12 today, including 22 PhDs. With the recently raised capital, C12 plans to sign more partnerships with industrial partners. But the company also has a research goal.\n\n“The other goal is to carry out, for the first time, a quantum operation between two qubits that are located at a long distance from each other,” Pierre said. By long distance, he means “tens of micrometers” from each other. It doesn’t seem like much, but it will be key when it comes to scaling quantum computing."}