{"url": "https://techcrunch.com/2023/09/20/american-climate-corps-climatetech-labor/", "title": "Will the American Climate Corps program be enough to meet the wave of jobs coming up in climate tech?", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-09-20T00:00:00", "text": "The White House is launching a training program that promises to prepare 20,000 people for a range of jobs across climate tech and ecosystem restoration.\n\nThe new American Climate Corps would teach skills related to heat pump and solar panel installation, building insulation, and forest and coastline restoration, giving participants a fast-track to jobs that are already in high demand.\n\nThe program echoes the Civilian Conservation Corps launched by President Franklin Roosevelt in the depths of the Great Depression. Back then, the program hired millions to plant trees, build bridges, and construct campgrounds. The new one borrows some of those goals and adds new ones, mostly focused on energy efficiency and electrification.\n\n“The American Climate Corps will mobilize a new, diverse generation of more than 20,000 Americans — putting them to work conserving and restoring our lands and waters, bolstering community resilience, deploying clean energy, implementing energy efficient technologies, and advancing environmental justice,” the White House said in a statement.\n\nStartups need electricians, too\n\nThe program comes at a time when startups have been lamenting a shortage of skilled labor. The day before the American Climate Corps was announced, three founders onstage at TechCrunch Disrupt said that the labor shortfall is one of the biggest challenges facing their businesses.\n\n“We saw this coming a while ago,” said Angelo Campus, co-founder and CEO of BoxPower. “There’s such a shortage of certified field electricians and union electricians that it was part of the decision for us to productize and prefabricate microgrids because it reduces the need for electricians in the field.”\n\nOne way companies have sought to improve predictability in their operations is by hiring electricians directly rather than relying on contractors, as is often the case in the construction industry. “We are vertically integrated; we have electricians on staff,” said Kathy Hannun, president of Dandelion, adding that her company is also pursuing productization to speed up installs of their geothermal heat pumps.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBlocPower also employs electricians on staff, but its needs are so great that it also runs its own job training program.\n\n“One of the things BlocPower is trying to do is train the green workforce,” said Jon Moeller, the company’s COO. “We’ve got a few different workforce training programs around the country. The biggest is in New York, where we’ve trained a few thousand people.”\n\nNew corps is a small down payment\n\nThe 20,000 positions created by the American Climate Corps will make for a decent start, but it’s a far cry from the 300,000 the Biden administration originally proposed in its Build Back Better plan. While parts of that plan were implemented in the subsequent Inflation Reduction Act, the $30 billion program was axed. The new corps draws on existing funding.\n\nThe 20,000-strong American Climate Corps is also a drop in the bucket when compared with the projected volume of jobs set to be created by public and private investments following the Inflation Reduction Act. A study from the University of Massachusetts Amherst predicts that nearly 1 million jobs will be created every year for the next decade as a result of $98 billion of investment.\n\nThat figure might be a gross underestimate given that the bill earmarked $369 billion for climate-related investments and incentives, and private investments could ultimately surpass $3 trillion, according to a Goldman Sachs report.\n\nIs the American Climate Corps enough to make a small dent in that? Not really. But it’s a start, and if it proves popular, it might inspire follow-up programs that could begin to deliver the training that Americans will need to fill the tidal wave of new jobs that’s appearing on the horizon."}