{"url": "https://techcrunch.com/2025/03/25/waymo-to-launch-robotaxi-service-in-washington-d-c-in-2026/", "title": "Waymo to launch robotaxi service in Washington, D.C., in 2026", "authors": ["Rebecca Bellan", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-03-25T00:00:00", "text": "Waymo said Tuesday it will begin offering robotaxi rides via the Waymo One app in Washington, D.C., in 2026.\n\nBefore it can launch commercially, the company will have to up its lobbying game in the capital, where autonomous vehicle permits still require a human behind the wheel.\n\nThe news from Waymo comes as the Alphabet-owned company aggressively expands its robotaxi coverage to cement its lead ahead of potential competitors like Amazon’s Zoox and Elon Musk’s Tesla. Musk said Tesla will launch a robotaxi service in Austin this summer and California at some point this year.\n\nWaymo already operates a commercial service in Phoenix, Los Angeles, the Bay Area, and more recently Austin, in partnership with ride-hail firm Uber. Waymo also intends to launch a robotaxi service via Uber in Atlanta this year and has already begun ferrying employees in fully autonomous vehicles in the city. Miami is next on Waymo’s public launch list for 2026, alongside Washington, D.C.\n\nTo raise even more enthusiasm and awareness, Waymo has said it plans to begin mapping in 10 cities this year, including Las Vegas, San Diego, and, as of Monday, Nashville.\n\nWaymo’s Washington, D.C., announcement comes two months after the company launched a small test fleet of its Jaguar I-Pace robotaxis in the city, where it’s been driving manually and testing autonomously with a safety driver behind the wheel.\n\nWaymo’s business model is contingent upon removing the human driver from the vehicle. The company said it will work with policymakers to update the district’s permitting rules to allow for fully autonomous vehicles to drive on public roads."}