{"url": "https://techcrunch.com/2022/09/08/london-based-regtech-steeleye-nabs-21m/", "title": "London-based regtech SteelEye nabs $21M", "authors": ["Paul Sawers", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-09-08T00:00:00", "text": "London-based regulatory technology (regtech) startup SteelEye has raised $21 million in a Series B round of funding.\n\nFounded in 2017, SteelEye works with banks, hedge funds, brokers, asset managers and more, to help them comply with strict regulatory procedures and requirements in their respective industries.\n\nSteelEye essentially brings compliance to the cloud via a SaaS platform, with the promise of streamlined regulatory reporting, improved insights and a reduced risk of non-compliance with rules set out by the likes of the Market Abuse Regulation (MAR) in Europe and the Securities and Exchange Commission (SEC), the Commodity Futures Trading Commission (CFTC) and Financial Industry Regulatory Authority (FINRA), among others in the U.S. and beyond.\n\nFor example, the SteelEye Data Platform focuses on archiving and record-keeping, and is built to be tamper-proof through its WORM (write once, read many) foundation that ensures information such as orders, trades and associated communications cannot be modified. This includes built-in search functionality to easily retrieve data upon request by a regulator or auditor, and full “trade reconstruction” capabilities that can recreate the conditions around a specific trade or transaction.\n\nUltimately, SteelEye is all about preserving a full and accurate paper trail of everything that has gone in a heavily-regulated financial sector, and goes some way toward countering insider trading and other market abuses.\n\n“Facing regulatory clampdowns, huge data volumes, and inflation impacts on budgets, financial firms need ways to reduce costs through efficiencies and automation,” SteelEye CEO Matt Smith said in a press release. “This is what we deliver through our distinctive, data-centric compliance platform.”\n\nRegtech rush\n\nThere has been a flurry of activity across the regtech space of late, with news recently emerging that publicly-traded regulatory compliance company Computer Services, Inc. (CSI) is set to be acquired by a duo of private equity firms for $1.6 billion.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nElsewhere, another London-based regtech called PassFort secured $16.2 million in funding last year to help financial companies automate their compliance processes, while California-based Hummingbird landed $30 million.\n\nSteelEye, for its part, had previously raised around $22 million in funding, and with its latest cash injection the company said that it’s looking to expedite its growth particularly in global markets such as North America.\n\nThe company’s Series B round was led by Ten Coves Capital, with participation from Fidelity International Strategic Ventures, Illuminate Financial and Beacon Equity Partners, among others."}