{"url": "https://techcrunch.com/2023/04/27/excess-renewable-power-energycloud-nonprofit/", "title": "Irish nonprofit sends excess renewable energy to people in need", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-04-27T00:00:00", "text": "Every day, strong gusts off the North Atlantic buffet hundreds of wind farms in Ireland, generating so much energy that owners often have no one to sell it to, forcing them to dump otherwise useful power.\n\n“12% to 14% of our potential generation goes into surplus. In Northern Ireland, it’s at 18%,” said Derek Roddy, co-founder and CEO of smart home company Climote. “If you’re a wind farmer, you are feeling the pain. This is a huge chunk of change that you’re walking away from, but the system struggles with what to do with it.”\n\nRoddy had been mulling this problem over for a while. Climote focuses on heating and hot water, so he thinks a lot about supply and demand signals in the electricity sector. It was on his mind when he attended an event where an Irish social enterprise called FoodCloud took home one of the top awards. FoodCloud, which was founded in 2012 by two university students, intercepts food that would otherwise go to waste and donates it to those in need.\n\n“I’m just listening in the audience to their whole story about sustainability, and I went, shit, surplus energy, surplus food — they’re the same,” Roddy told TechCrunch+.\n\nAt that moment, he realized that he had been approaching the surplus energy problem the wrong way. With his company, he had been focused on the technology part of the puzzle. While that’s still a key piece, it hadn’t made the dent he wanted. After all, Ireland was still wasting a significant amount of wind power.\n\n“I went, OK, maybe we’re looking at this wrong, Maybe we need to go and do our bit for the world and the globe in solving the surplus piece and by default we prove how the actual system could work.” The answer wouldn’t be another startup, but a nonprofit social enterprise styled after FoodCloud.\n\nFinding partners\n\nHaving spent the last two decades in the smart home business, Roddy had a front-row seat to the Celtic Tiger economy. The tech sector had helped pull the previously agricultural nation out of poverty and turned it into one of the wealthiest nations in Europe. But even in wealthy countries, some people tend to be left behind.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIreland is no exception. Last year, 5.3% of the country’s population was living in consistent poverty and another 13.1% was at risk of poverty. Given that the country has some of the highest electricity costs in the EU, energy can make up a significant portion of an impoverished household’s expenses.\n\nInspired by the FoodCloud story, Roddy wanted to help people who had trouble paying their utility bills. He and Cathal Lee, a managing partner at Instinctif Partners, approached the CEO of Wind Energy Ireland, a trade group that represents wind farmers. “By any chance, would your members be willing to give their surplus to people in fuel poverty?” Roddy asked him. In principle, the wind association’s members were supportive. “If it’s going to get dumped, and there’s no other solutions, they’d be willing to do it,” Roddy recalled of their response.\n\nOffer in hand, he then went to an executive at Cluid, one of the largest housing nonprofits in Ireland, which was more than happy to accept. “The following week, three of us met in a hotel in Dublin, and I said, ‘You’ve got wind, you’ve got 10,000 homes. Could we actually make this work?’” Roddy asked. Soon after, they went to the grid operator, EirGrid, which was also keen on pitching in. The nonprofit was starting to take shape, and soon it had a name: EnergyCloud.\n\nForging bonds\n\nNot too long after the initial meetings, the world went into lockdown as COVID-19 swept the globe. Rather than put things on hold, the group, now consisting of Roddy along with senior executives from WEI, Cluid, flipped open their laptops or hopped on the phone and met weekly. “The ask was fairly onerous: Could we do an hour every Friday?” Roddy recalled. “It took about 12 months for everyone to get to know each other.”\n\nThe team’s composition — the organizations’ core operational leaders — and its commitment to meeting regularly was key, he said. They also asked Iseult Ward, co-founder and CEO of FoodCloud, to join a few meetings to help guide them through the process. “That was the acorn, the seed, the first green shoots coming out of the ground,” Roddy said.\n\nTo ensure supply and demand were balanced and more evenly distributed, the first device EnergyCloud installed in Cluid-managed homes was a smart switch for water heaters. In many homes in Ireland, water heaters don’t maintain a fixed set point 24-7 like they do in the U.S. Rather, they’re manually controlled or timed to switch on when electricity is cheapest, which is usually at night. When EnergyCloud knows that there will be a wind curtailment, it sends a text message telling people not to switch on their water heaters. Then, in the morning, they get another, alerting them that they received a free tank of hot water overnight.\n\n“When you’ve got three kids to wash, and you don’t have any money, you’re going, ‘That is cool,’” Roddy said. For now, the grid operator doesn’t charge for transmission, though that may change in the future. Roddy has suggested that the grid might charge EnergyCloud a special rate and then donate the funds back to nonprofit.\n\nIn the process, EnergyCloud is helping to test a possible future for the grid. Renewable power like wind and solar doesn’t always line up with the ebbs and flows of demand. Batteries are one way to smooth the curves, but shifting demand is another. Smart devices that coordinate with the wider grid won’t work for every use, but for things like water heaters or EV chargers, they could help soak up excess power that would otherwise be curtailed. That’s been the dream of the smart grid proponents for well over a decade, though it’s one that hasn’t really taken off. Roddy thinks EnergyCloud could help prove the model; all the relevant players are on board, and Ireland’s grid is relatively small. “All we really need is to get equipment in the home, model what it would look like when there’s surplus, switch on the device, and prove that it works.”\n\nToday, EnergyCloud is providing free energy in Ireland, and it’s setting up operations in Northern Ireland. England and Wales are next, and Roddy is hoping to expand to the U.S. in the next 12 to 18 months. That’s an impressive timeline for an organization that still doesn’t have a bank account.\n\nThat’ll have to change soon, but the organization’s finances, or lack thereof, are revealing. Where most organizations and startups would begin by raising money, EnergyCloud has taken a completely different tack, approaching key executives first and asking them to join an organization that they’ll help shape. “They need to join the board or be part of the organization to make it work,” Roddy said.\n\n“Once they’re part of the organization and everyone’s sitting around a table, it’s like everything in human nature. Once that trust gets built up, anything’s possible.”"}