{"url": "https://techcrunch.com/2025/03/26/ais-coming-to-the-classroom-brisk-raises-15m-after-a-quick-start-in-school/", "title": "AI’s coming to the classroom: Brisk raises $15M after a quick start in school", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Cindy Zackney", "Amanda Silberling", "Theresa Loconsolo", "Anthony Ha", "Maxwell Zeff", "Kirsten Korosec", "Sarah Perez"], "publication_date": "2025-03-26T00:00:00", "text": "It’s virtually impossible today to determine when a student’s writing has been composed using ChatGPT or another generative AI tool, and it can be a nightmare to disprove incorrect accusations. An AI edtech startup called Brisk has built a tool that could at least help teachers identify some of the telltale signs, and it’s now announcing $15 million in new funding on the back of decent traction.\n\nAlongside a writing inspector, Brisk’s platform offers around 40 tools for teachers and students to use by way of a Chrome extension. The platform uses generative AI, computer vision, and other AI features that Brisk says can help not only speed up work, but also do the work better. These include writing lesson plans, tests, and presentations; adjusting work for different abilities; grading work; and more.\n\n“The existing edtech stack as we know it, which is around 140 different tools that the average teacher in the U.S. uses in a given school year, is not ready for AI,” Brisk’s CEO and founder, Arman Jaffer, said in an interview. “We’re trying to build the AI-native edtech stack.”\n\nThe funding will be used in part to build more tools, and in part to expand to more platforms. A Microsoft integration, aimed at the many schools that are Microsoft shops, is planned for autumn 2025.\n\nBusiness has so far been brisk for San Francisco-based Brisk. Since it raised a seed round of $5 million in September 2024, its user base has grown fivefold, and Jaffer said the company had “40x’d” its revenue in 2024 (it’s worth noting that the company was starting from zero). Brisk says more than 2,000 schools in 100 countries use its products today, and more than 90% of its business comes from inbound interest. One in five K-12 teachers in the U.S. have installed the Brisk extension as of February 2025, Jaffer added.\n\nBessemer Venture Partners is leading the Series A round, with previous backers Owl Ventures, South Park Commons, and Springbank Collective also participating (the $15 million is being disclosed for the first time today, with $6.9 million in the Series A).\n\nBrisk’s funding and growth come at a time when technology and education are becoming increasingly intertwined.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nEducators have spent years embracing an increasing array of technology to improve how they work as well as to offset other major changes in their tools (such as the decline of textbooks) and other areas, such as budget cuts. (The recent DoE changes in the U.S. have yet to play out, but it has raised concerns that they will spell yet more erosion of resources.)\n\nEnter tech, where adoption is easy, in a sense. There are literally hundreds of startups and much larger technology giants rolling out edtech apps. Some outfits cater directly to students and families, like the immense Khan Academy empire, while others direct themselves at schools and educators such as the suites developed by Google and Microsoft.\n\nAnd, just as enterprises have embraced consumerization in their IT departments — looking for apps that have the same usability as the most popular consumer apps — so have teachers looked for inroads to connect with students. Kahoot is a key example of how education has been “gamified,” the theory being this is one way of making learning more accessible.\n\nAI is yet another step in edtech’s natural evolution. AI companies are building learning tools to that end, and their basic pitch is much like Brisk’s: AI is coming whether you like it or not, and it will make everyone’s lives better.\n\nBut as with other segments of the world of work and play, not all AI moves are received with open arms. OpenAI’s teachers’ guide to ChatGPT — released in November 2024, arguably well after the horse had bolted — was met with criticism over the bigger issues that it failed to address around accuracy and data protection.\n\nJaffer founded Brisk after spending time in edtech in a different capacity. He spent more than five years at the Chan Zuckerberg Initiative, where he conceived of and led a team building Notebooks, a Google Docs alternative aimed at improving collaboration between students and teachers. Ultimately, Notebooks did not take off, not least because, well, Google Docs does the job, but also because AI really changes the game for collaboration. That ethos was carried into Jaffer’s next swing of the founder bat.\n\nIf using AI rings alarm bells, Brisk wants to muffle that with a measured approach: assistance, not replacement.\n\nThe company’s student writing inspector does not conclude “this was written by ChatGPT.” It starts with a video of a student’s work process on-screen, which it then watches in fast-motion, flagging when that student has copy/pasted information or is otherwise doing other things that are uncharacteristic of how they work. This is then sent on to the teacher who can assess whether it could be an indication of copying from somewhere else, or if the work was indeed created by GenAI.\n\nThe most popular tool in the stack, “Targeted Feedback,” uses generative AI to read student essays (on Google Docs) and create comments that are tailored to age, a grading rubric, or other standards if they’ve been uploaded or selected. Before anything is shared with students, teachers can review and edit the comments (in the best-case scenario, they are doing that rather than just shifting them along with no oversight).\n\nWhether the idea of AI taking on some of teachers’ work, and maybe even doing it better, is loved or feared in the world of education, it seems that the trend line is too clear to be ignored, said Kent Bennett, the Bessemer partner who led this investment.\n\n“We’re big believers at this AI moment in tracking sectors like education technology, which have a reputation for being tech phobic. This reputation often arises because the high-value workflow in these environments involves human language, and thus wasn’t as addressable with legacy software — with LLMs all of that can change,” he told TechCrunch in an email exchange.\n\n“[But] one of the biggest surprises as we looked into AI powered ed-tech was that educators were not just tolerating AI, they are aggressively seeking it out,” he said, adding that it is “obvious” that teachers cannot be cut out of the equation altogether.\n\nLooking forward, Brisk will be building more immersive tools beyond its extensions. Later this year, it will be switching on a new web platform so that “educators can work cohesively and natively within the Brisk environment.” It will include new resources and activities, Jaffer said.\n\nBrisk also wants to offer more “multimodal” integrations. These will include the ability for students to submit image-based work, in addition to text, for evaluations; and a “podcast” feature to generate audio versions to describe documents and more."}