{"url": "https://techcrunch.com/2025/03/11/geothermal-could-power-nearly-all-new-data-centers-through-2030/", "title": "Geothermal could power nearly all new data centers through 2030", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-03-11T00:00:00", "text": "There’s a power crunch looming as AI and cloud providers ramp up data center construction. But a new report suggests that a solution lies beneath their foundations.\n\nAdvanced geothermal power could supply nearly two-thirds of new data center demand by 2030, according to an analysis by the Rhodium Group. The additions would quadruple the amount of geothermal power capacity in the U.S. — from 4 gigawatts to about 16 gigawatts — while costing the same or less than what data center operators pay today.\n\nIn the western U.S., where geothermal resources are more plentiful, the technology could provide 100% of new data center demand. Phoenix, for example, could add 3.8 gigawatts of data center capacity without building a single new conventional power plant.\n\nGeothermal resources have enormous potential to provide consistent power. Historically, geothermal power plants have been limited to places where Earth’s heat seeps close to the surface. But advanced geothermal techniques could unlock 90 gigawatts of clean power in the U.S. alone, according to the U.S. Department of Energy.\n\nAdvanced or enhanced geothermal encompasses a wide range of approaches, but generally they drill deeper and wider than before. That allows them to access hotter rocks — which translates into more power — and pack more geothermal wells onto a single property. The sector has seen a surge of startups in recent years, driven in part by knowledge and technology borrowed from oil and gas companies.\n\nFervo Energy, for example, was founded by former oil and gas engineers to expand geothermal’s potential using horizontal drilling techniques perfected over the last few decades. The company raised over $200 million in 2024 on the heels of significant cost reductions in well drilling.\n\nAnother startup, Bedrock Energy, is drilling deep to minimize geothermal’s footprint, allowing space-constrained office buildings and data centers to extract more power from their limited footprints. The company’s specialized drilling rigs bore down more than 1,200 feet to tap consistent heat year-round.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nQuaise Energy’s technology sounds like something out of science fiction. The startup vaporizes rock using microwaves generated by gyrotrons. By skipping traditional drill bits, Quaise hopes to drill as deep as 12.4 miles (20 kilometers). At that depth, the rocks are nearly 1,000°F year-round, offering nearly limitless amounts of heat to drive generators or warm buildings.\n\nWhile most companies are using Earth’s ability to provide and store heat, another startup is using it to store energy another way. Sage Geosystems has been injecting water into wells under pressure. When power is needed, it can open the taps and run the water through a turbine, sort of like an upside-down hydroelectric dam.\n\nBecause geothermal power has very low running costs, its price is competitive with data centers’ energy costs today, the Rhodium report said. When data centers are sited similarly to how they are today, a process that typically takes into account proximity to fiber optics and major metro areas, geothermal power costs just over $75 per megawatt hour.\n\nBut when developers account for geothermal potential in their siting, the costs drop significantly, down to around $50 per megawatt hour.\n\nThe report assumes that new generating capacity would be “behind the meter,” which is what experts call power plants that are hooked up directly to a customer, bypassing the grid. Wait times for new power plants to connect to the grid can stretch on for years. As a result, behind the meter arrangements have become more appealing for data center operators who are scrambling to build new capacity."}