{"url": "https://techcrunch.com/2022/11/22/pitch-on-stage-at-tc-sessions-space-2022/", "title": "Pitch onstage at TC Sessions: Space 2022", "authors": ["Neesha Tambe", "Startup Battlefield Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-11-22T00:00:00", "text": "Founders — pitch onstage with TechCrunch. Next month we’re back with the star-studded TC Sessions: Space — an event dedicated to exploring all things innovation, investment and industry in the final frontier. We’re on the hunt for early-stage founders creating innovative companies in space or space-related industries.\n\nThe TC Sessions: Space stage will host fireside chats and panels from luminaries in the industry. Hear from experts from NASA, Space Force, Aerospace Corp., Blue Origin and more on December 6, in person in Los Angeles California.\n\nPitch your space tech startup\n\nSpace tech spans numerous verticals — satellite-data-based applications, rockets, fueling, data analytics, geospatial information systems, hardware, satellites, national security, commercial launch, climate, tracking software and more. Startups applying to pitch should have some connection to space — intergalactic or from the ground.\n\nFounders will have four minutes to pitch followed by a five-minute Q&A with our in-person panel of judges. Selected companies will be announced on TechCrunch. The pitches themselves will be streamed to TC Sessions: Space attendees and on TechCrunch.com. Apply here.\n\nWhat are the qualifications to participate in the Space Startup Pitch-Off? It’s simple:\n\nBe an early-stage startup.\n\nHave at least a minimally viable product.\n\nFocus on tech connected to various aspect of space: data visualization, rockets, fueling, data analytics, geospatial information systems, hardware, satellites, national security, commercial launch, climate, tracking software, space maintenance and more.\n\nIncorporated anywhere (pitch will take place in person).\n\nIn addition to the opportunity to pitch, you’ll get training with TC’s Startup Battlefield Editor and receive two complimentary passes to the entire TC Sessions: Space event. The winner of the event will get an invitation to showcase on the Disrupt San Francisco 2023 show floor. The deadline to apply is November 27. Applicants are reviewed and accepted on a rolling basis so apply ASAP!"}