{"url": "https://techcrunch.com/2021/08/27/as-5g-demand-grows-sitenna-helps-telcos-find-more-cell-tower-locations-faster/", "title": "As 5G demand grows, Sitenna helps telcos find more cell tower locations, faster", "authors": ["Danny Crichton", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-08-27T00:00:00", "text": "The buildout of 5G networks continues apace, with wide-scale deployments across much of the developed world. Yet, one of the largest challenges with closing the gaps in coverage maps are constraints on 5G transmissions. Because of the spectrum that 5G technology uses compared to 4G, telecom operators need to install many times more towers to deliver the advertised bandwidth with the same quality signal that users expect.\n\nInstalling cell towers is a daunting proposition though. An operator has to find exactly the right location in terms of line of sight to users, then make sure the location has power and internet access, and then negotiate a contract with the property owner to keep the tower there for a decade or more. Now repeat tens of thousands of times (and maybe even more).\n\nSitenna, which will debut next week as part of Y Combinator’s Summer 2021 Demo Day, wants to radically speed up the process of selecting tower sites and securing contracts, creating a marketplace for landlords, tower operators and telcos alike.\n\nTower siting and access to poles have in some cases emerged as national infrastructure priorities. In the United States, the challenges around installing new towers — and new towers quickly — became a top priority of the FCC during the Trump administration, which launched a 5G FAST Plan to try to ease regulations around tower installation.\n\nSitenna’s founders Daniel Campion and Brian Sexton saw an opportunity with such programs to help with the movement. Over the past year, they have built out what is essentially a marketplace that on one hand helps property owners figure out if they have an asset that’s worth investigating for telecom usage, and on the other, helps tower operators select and digitally sign deals for installation.\n\nThe company launched in the United Kingdom in June, and “it kind of resonated,” Campion said, noting that 65,000 real estate assets and roughly 15% of the towers in the U.K. are now on the platform. The company has kicked off two pilots with Vodafone and its tower provider Cornerstone. He said the company intends to enter the U.S. market in the first quarter of next year.\n\nWhile the company is starting with a marketplace, like many startups today, it is also augmenting that marketplace with B2B SaaS tools. In its case, that means tools for telcos to manage the process of onboarding a new tower location and then managing the asset. “Once they find the site, they ping pong emails back and forth,” Campion said. “So we have built some tools to help them on their workflows.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhile there is definitely a large wave of tower installations underway now with the transition to 5G wireless, that wave doesn’t mean that tower installation will suddenly dry up in a few years. Campion notes that there is a “continual refresh of 15-20% on the carrier side” due to everything from changing usage patterns and building redevelopment to just standard hardware replacement.\n\nAnd of course, there is always 6G, which while completely amorphous today, is a real thing that I get invites to conferences for. There’s always going to be a next generation of wireless, and Sitenna wants to become the center for managing that infrastructure."}