{"url": "https://techcrunch.com/2025/05/14/white-house-scraps-plan-to-block-data-brokers-from-selling-americans-sensitive-data/", "title": "White House scraps plan to block data brokers from selling Americans’ sensitive data", "authors": ["Zack Whittaker", "Security Editor", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-05-14T00:00:00", "text": "A senior Trump administration official has scrapped a plan that would have blocked data brokers from selling Americans’ personal and financial information, including Social Security numbers.\n\nThe Consumer Financial Protection Bureau (CFPB) said in December 2024 it planned to close a loophole under the Fair Credit Reporting Act, the federal law that protects Americans’ personal data collected by consumer reporting agencies, such as credit bureaus and renter-screening companies. The rule would have treated data brokers no differently than any other company covered under the federal law and would have required them to comply with the law’s privacy rules.\n\nThe rule was withdrawn early Tuesday, according to its listing in the Federal Register. The CFPB’s acting director, Russell Vought, who also serves as the director of the White House’s Office of Management and Budget, wrote that the rule is “not aligned with the Bureau’s current interpretation” of the Fair Credit Reporting Act.\n\nWired first reported the rule change on Wednesday.\n\nData brokers are part of a multibillion-dollar industry of companies that profit from collecting and selling access to vast amounts of Americans’ personal and financial information. This personal data is then sold to other companies, as well as law enforcement and intelligence agencies, often without the explicit permission of the individuals.\n\nCollecting huge banks of data also comes with inherent risks. Over the past year, at least two data brokers were hacked, spilling millions of Social Security numbers online and exfiltrating a huge trove of user location data that tracked millions of people’s whereabouts.\n\nIn 2024 alone, the Federal Trade Commission banned several data brokers from collecting and sharing data on individuals without their permission, following allegations of unlawfully tracking people.\n\nPrivacy advocates have long called for the government to use the Fair Credit Reporting Act to rein in data brokers.\n\nThe decision by CFPB to cancel the rule comes days after the Financial Technology Association, an industry lobby group representing non-bank fintech companies, wrote to Vought in his capacity as the White House’s budget director. The lobby group asked the administration to withdraw the CFPB’s rule, claiming it would be “harmful to financial institutions’ efforts to detect and prevent fraud.”\n\nCFPB did not return a request for comment.\n\nCorrected the description of the FTA."}