{"url": "https://techcrunch.com/2024/09/19/indias-physics-wallah-raises-210m-at-2-8b-valuation-even-as-edtech-funding-remains-scarce/", "title": "India’s Physics Wallah raises $210M at $2.8B valuation even as edtech funding remains scarce", "authors": ["Manish Singh", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-09-19T00:00:00", "text": "Physics Wallah, an Indian edtech startup, has secured $210 million in fresh financing amid a tough funding environment for edtech companies in the country following the collapse of Byju’s, once the biggest company in the space.\n\nPhysics Wallah said on Friday the Series B round was led by the hedge fund Hornbill Capital, a venture between China’s Orchid Asia and India’s Hornbill, with Lightspeed Ventures Partners “significantly” participating, alongside existing backers WestBridge and GSV. The round values Physics Wallah at $2.8 billion, a substantial increase from the previous $1.1 billion valuation it scored in June 2022.\n\nThe startup has raised over $310 million to date. The new funding, largest by an Indian edtech since 2022, included a secondary transaction of about $35 million that saw its founders and employees selling some of their shares.\n\nPhysics Wallah began its journey as a YouTube channel in 2016, where co-founder and teacher Alakh Pandey posted his lectures for free to help students who — like he had — lacked the financial means to enroll in premium coaching classes. By 2020, Physics Wallah had grown to become the largest Indian education community on YouTube, prompting Pandey to formalize his efforts into a company that now serves 46 million students in five vernacular languages.\n\n“He always felt that he couldn’t crack the IIT entrance exam because he didn’t have access to quality education,” said Prateek Maheshwari, co-founder of Physics Wallah, explaining the motivation behind the startup’s mission.\n\nIndia, the world’s most populous nation, boasts one of the largest education markets globally, with approximately 250 million students attending school and about 4 million giving entrance exams for engineering colleges and medical schools every year.\n\nPhysics Wallah caters to a broad spectrum of this market, serving students from third grade through those preparing for competitive engineering and medical entrance exams and government positions. It even offers live classes that typically draw tens of thousands of simultaneous attendees.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe startup, which also operates about 180 brick-and-mortar centers, employs teaching assistants and AI to address student queries, and has developed an app called AI Guru that helps students solve problems in their learning material. Physics Wallah has trained the AI on its own data, Maheshwari said.\n\nOne of Physics Wallah’s key strengths is the affordability of its courses, with prices starting as low as $50 for an entire year. More than 5.5 million students are paying subscribers, the startup said.\n\n“We are covering nearly all exams in India, and for all the special ones — JEE, NEET, GATE, UPSC, and CAT — we are No. 1 in terms of revenue and the size of the student base served,” Maheshwari said.\n\nThat traction is serving Physics Wallah well: It reported revenue of $96.2 million in the year ended March 2023, and the startup told TechCrunch revenue increased 2.5x between March last year and March 2024. It expects its fiscal year ending March 2025 to be its most profitable yet in EBITDA terms.\n\nDev Khare, a partner at Lightspeed and one of the earliest investors in Indian edtech startups, told TechCrunch that many trends have converged to help Physics Wallah grow. “When you bring the price point down, it just makes things way more accessible,” he said, pointing to budget-hotel chain Oyo, quick-commerce startup Zepto, and storytelling platform PocketFM as other examples of Lightspeed’s portfolio startups that run similar playbooks.\n\nMaheshwari said Physics Wallah will explore inorganic growth opportunities with the fresh funds, but added that the company largely raised the capital because the funding was available and the investors saw value in doing so. The company, which has acquired about 10 firms in the last three years, is thinking about an IPO, but he cautioned that it would not make any immediate moves soon.\n\nThe new funding arrives as India’s edtech sector faces significant headwinds. Online learning startups, which saw rapid growth during the COVID-19 pandemic when schools were closed, have seen a sharp decline in usage since.\n\nUnacademy, a major edtech company based in Bengaluru, has cut approximately 2,000 jobs since 2022. The company cut another 250 positions in July this year, citing the need to restructure for profitability.\n\nByju’s, formerly India’s most valuable startup at $22 billion, has suffered a dramatic downturn over the past two years. The company now faces the prospect of bankruptcy proceedings.\n\nMaheshwari said recent industry events haven’t affected the market opportunity. “From a student’s lens, things haven’t changed much post-COVID. The market is entirely hybrid and students are enjoying the best of both worlds to strengthen their preparation,” he said.\n\nPhysics Wallah is a “rare combination of vision, execution, and impact with a thriving 3C model – Content, Community, and Commerce,” said Manoj Thakur, founder of Hornbill Capital, in a statement. “We are excited to see PW’s use of AI not only to help improve students’ outcomes but also their emotional well-being.”\n\nNo investment bank was appointed for the deal."}