{"url": "https://techcrunch.com/2022/02/28/hearhere-raises-3-2m-to-scale-its-immersive-storytelling-road-trip-app/", "title": "HearHere raises $3.2M to scale its immersive storytelling road-trip app", "authors": ["Aisha Malik", "Consumer News Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-02-28T00:00:00", "text": "Santa Barbara-based HearHere, the company behind an audio entertainment and immersive storytelling road-trip app, has raised $3.2 million in seed funding led by RV and outdoor retailer Camping World. The app aims to foster deep connections and understandings of the places and histories of the land that users are traveling through when on a road trip. With users’ permission, HearHere pushes information to users as they’re driving, giving them informational tidbits in three- to five-minute segments about their surroundings, including points of interest they might not have known about.\n\nLaunched in August 2020, HearHere currently has more than 100,000 registered users and offers more than 8,880 stories across the United States. The GPS-powered app serves up stories based on users’ location and interests. HearHere CEO and co-founder Woody Sears told TechCrunch in an interview that the stories inform users about the history and natural landscape of the area that they’re in. About half of the stories featured in the app are based on history, while the rest focus on national wonders, sports, music and local insights.\n\n“There’s no shortage of stories that can be told about all these places in America,” Sears said. “There are millions of stories, so you have to be somewhat selective in the beginning. For some of those, we were inspired by things like historical markers, and then [took] them a layer deeper. We’re not just focused on major tourist destinations, like cities and national parks, but on all the things in between that connect people to cities.”\n\nOnce users enable location access, they can explore nearby stories based on their current location. When users aren’t on the road, they can access a map of the United States and choose stories based on their interests. The idea of the app is to surface the unknown or forgotten history of regions. Sears’s neighbor, actor Kevin Costner, liked the idea of the app so much that he joined its team as a co-founder, narrator and investor in 2020.\n\n“I serendipitously met Woody through our children and was immediately hooked on the vision and mission of HearHere,” said Costner in a statement. “HearHere prioritizes authenticity and truth in our stories. We cover America’s past, which as you know, in addition to the rich stories, unfortunately also involves a deep history of tragic events like the displacement of Indigenous people, the treatment and history of African American people, the experiences and influence of the Hispanic and Asian communities, and the many, many other groups of peoples who came to this country to pursue all of the opportunities, hopes and dreams that it offered. We tell these stories because they are crucial to understanding the full history of a location and our nation, and until those thousands upon thousands of stories are chronicled and told, our history isn’t complete.”\n\nIn terms of the new funding, Sears says the investment will be used to continue to grow the app’s content library and expand its functionality in different ways, such as introducing offline listening capabilities. The startup also plans to use the funding to grow its team. HearHere currently has 26 people on its content team, primarily consisting of contractors with a background in travel journalism. The team also includes researchers, writers, editors and narrators.\n\nThe company’s seed round included a strategic investment from AAA and participation from Pasadena Angels, SeraphGroup and others. The seed round follows HearHere’s $1.6 million investment announced last year, which also included investments from Camping World, AAA and more. Sears said Camping World’s involvement in HearHere’s pre-seed and seed funding round was a result of the companies’ “natural synergy,” as HearHere provides entertaining and educational content that RVers can enjoy during their journeys throughout the country. Last year, Camping World announced plans to integrate HearHere into its trip planning tool to provide consumers with real-time content as they travel.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe app is available on the Apple App Store, with an Android launch expected to come soon. Free accounts come with five stories, while paid accounts cost $36 per year and come with unlimited access. HearHere is currently available in the continental United States, with plans to launch in Alaska and Hawaii later this year."}