{"url": "https://techcrunch.com/2024/09/18/nurture-teaches-kids-important-life-skills-through-interactive-gameplay-and-entertainment/", "title": "Nurture teaches kids important life skills through interactive gameplay and entertainment", "authors": ["Lauren Forristal", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-09-18T00:00:00", "text": "Parents understand the challenge of keeping young kids engaged in online learning. Nurture is a new app designed for children aged 4 to 7 that features interactive content and games to capture their interest. The company’s mission is to equip children with critical life skills such as socializing, basic financial understanding, mindfulness, fitness, nutrition, and more through story-based adventures that kids can actively participate in.\n\nNurture announced Wednesday its $2.8 million pre-seed round, led by Golden Gate Ventures, with participation from Club Penguin co-founder Lance Priebe. The funding will go toward bringing on preschool content creators to help develop content for the platform.\n\nThe flagship title that Nurture first launched is called “Doki’s Delivery” and is focused on helping kids learn social-emotional skills. The series follows a group of characters who are on a mission to deliver an egg in a spaceship.\n\nImage Credits:Nurture\n\nThe app also has a dual-screen component that requires parents to download the Nurture TV app on Fire TV or Google TV so kids can interact between both screens. For “Doki’s Delivery,” kids can use their phone or tablet as a game controller while playing on the TV screen. They can tilt the mobile device from side to side to help the characters avoid obstacles.\n\nOther interactions include answering a call from the main character, designing the spaceship, and hatching the mysterious egg, which players can then take care of — similar to Tamagotchi, the popular toy.\n\n“I didn’t want to make it passive, mindless screen time. I want to make it an active, interactive learning experience,” co-founder and CEO Roger Egan told TechCrunch. “[Once kids] get the concepts, then we use the games and interactives to practice the skills and apply them.”\n\nThe company plans to release new original content focusing on “growth mindset and financial thinking,” as explained by Egan. Additionally, Nurture is in discussions with around 20 popular third-party creators to enhance its content library. Nurture’s creator platform enables creators to host content on their own digital “islands,” which users can access by swiping through the app menu.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nImage Credits:Nurture\n\nIn addition to the immersive learning content, parents will have the ability to track their kids’ performance in the games.\n\n“We have these things called reflection moments where we ask questions, and the child can answer. … With that answer, we can synthesize that information and understand how well do they understand the concept, and then feed that back into the product and report to parents about how they’re learning and showing progress,” Egan said.\n\nThere will also be offline activities to provide parents with ideas on how they can reinforce the concepts learned in the app and encourage children to apply their knowledge in everyday situations.\n\nNurture was founded in 2022, a couple years after Egan’s kids started remote learning during the pandemic. Having a front-row seat to his children’s education, he believed that traditional schooling doesn’t adequately prepare kids for the rapidly changing world, especially one powered by AI. In his opinion, children should also learn things like adaptability, critical thinking, digital literacy, mindfulness, and empathy to thrive in the future. However, he struggled to find suitable alternatives to complement his kids’ education.\n\nEgan previously founded the online grocer RedMart, which was acquired by Alibaba. He is joined by co-founders Danny Limanseta (chief product officer), who served as product design lead at RedMart; Sally Doherty (chief people officer), who previously worked at Microsoft; and Scott and Julie Stewart (chief creative officers), a husband and wife team who specialize in children’s animated content, such as “Lego Friends: The Next Chapter.”\n\nImage Credits:Nurture\n\nIn addition to Priebe being an investor, he’s also a game design advisor for Nurture. Priebe was responsible for creating Club Penguin, an incredibly popular multiplayer online game.\n\n“The next generation of kids are picking up games faster than watching a show,” Priebe told us. “I really like the idea of you’re not just going to sit there and watch linear TV anymore. … It’s really novel, how the [Nurture] characters stop and bring the kid into the adventure, and they’re like, ‘Now what would you do?’ or ‘How would you want us to do this?’”\n\nCurrently, Nurture is an invite-only beta available for users in the U.S., the U.K., and Canada. It plans to expand to other markets in 2025. The company will also launch a paid subscription once the app is open to the public.\n\nOther participants in the round include Reach Capital and Seedcamp. Other notable advisers include Manuel Bronstein, Roblox’s chief product officer; Scott Kraft, former lead writer and executive producer of “Paw Patrol”; and Joey Mazzarino, the puppeteer on “Sesame Street” known for his roles as Murray Monster, Stinky the Stinkweed, and other Muppets."}