{"url": "https://techcrunch.com/2025/03/05/ryan-breslow-is-back-as-ceo-of-fintech-bolt-after-years-of-controversy/", "title": "Ryan Breslow is back as CEO of fintech Bolt, after years of controversy", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "Amanda Silberling", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-05T00:00:00", "text": "Ryan Breslow is once again the CEO of Bolt, the fintech company told TechCrunch on Wednesday.\n\nBolt shared a communication that recently went out to investors in which Breslow wrote that “following a challenging few years,” he had been reinstated as Bolt’s CEO with “unanimous approval” of the board of the one-click checkout company.\n\nJustin Grooms, who has served as interim CEO since last March, will now serve as president of Bolt. Grooms, the company’s former director of sales, took over as CEO after Maju Kuruvilla was reportedly removed by Bolt’s board.\n\nBreslow, the outspoken founder of Bolt, stepped down as CEO in early 2022. Over the years, he has faced allegations that he misled investors and violated security laws by inflating metrics while fundraising the last time he ran the company. Breslow was also embroiled in a legal battle with investor Activant Capital over a $30 million loan he took out. Last September, Bolt shared that it had reached a settlement with Activant Capital. That settlement stipulated that Bolt would repurchase Activant’s shares of Bolt stock, after which Activant would no longer hold any interest in the company.\n\nIn the communication to investors, as seen by TechCrunch, Breslow thanked the company’s backers for their “support and encouragement” and expressed gratitude to employees.\n\nLast year, Bolt was reportedly trying to raise $200 million in equity and an unusual, additional $250 million in “marketing credits,” at a $14 billion valuation. As part of the funding round, Breslow would be re-instated as CEO. By September that deal had apparently stalled. Today, Bolt told TechCrunch that it could not comment on the fundraise.\n\nBolt’s annualized run rate was at $28 million in revenue and the company had $7 million in gross profit as of the end of March of 2024, journalist Eric Newcomer, who also saw copies of the leaked term sheet, reported last August. A valuation of $14 billion would be an enormous multiple over such numbers and higher than that $11 billion valuation achieved in January of 2022.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBolt, which provides software to retailers to speed up checkout, raised around $1 billion in total venture-backed funding and at one time was valued at $11 billion. Investors include funds and accounts managed by BlackRock, Schonfeld, Invus Opportunities, CreditEase, H.I.G. Growth, and Moore Strategic Ventures, among others."}