{"url": "https://techcrunch.com/2021/11/10/singapore-based-treedots-gets-11m-series-a-to-cut-food-waste-in-asia/", "title": "Singapore-based TreeDots gets $11M Series A to cut food waste in Asia", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-11-10T00:00:00", "text": "Every year, tons of food ends up in landfills because of cosmetic issues (they won’t look nice in stores) or inefficiencies in the supply chain. Singapore-based TreeDots, which says it is the first food surplus marketplace in Asia, wants to help. The company is focused on creating a vertically integrated supply chain with a B2B marketplace and a social commerce feature for group buying by consumers. It is also developing its own cold-chain logistics infrastructure to help food reach end users more quickly. TreeDots announced today that it has raised an $11 million Series A led by Amasia and East Ventures, with participation from investors including Active Fund, Seeds Capital, author Nir Eyal and actress Fiona Xie.\n\nThe funding, which brings TreeDots’ total raised to $15 million, will be used to grow its operations in Malaysia, where it expanded last year, enter other markets and continue optimizing its logistics and supply chain business, called TreeLogs. The startup says its gross merchandise volume (GMV) has grown more than 4x year-over-year.\n\nTreeDots was founded in 2017 as a surplus food marketplace for F&B businesses, before it expanded its business to include social commerce, too. About one-third of food produced in the world is never eaten. In Asia specifically, TreeDots’ team says this is usually because of inefficient supply chains or aesthetically “imperfect” foods. For example, a grocery chain might reject a chicken that is too big or has a broken bone. But F&B businesses like restaurants usually don’t care how their ingredients look, because they cook and plate food before it reaches the customer. TreeDots’ surplus food marketplace was originally created to sell food to F&B businesses at up to 90% cheaper than other suppliers.\n\nIn an email, TreeDots co-chief executive officer Tylor Jong explained that the company does not redistribute food from retailers. “Instead, we solve the food loss problem further upstream where you have food that is imperfect due to various cosmetic standards set by different groups of buyers (businesses, but ultimately driven by consumers) and food that is in surplus, as most countries want to ensure that all varieties are accessible and therefore keep more inventory than needed at every step of the supply chain.”\n\nFor suppliers, the benefits of selling food to TreeDots include earning incremental revenue and saving the money they would have spent to send surplus products to landfills. TreeDots also helps them digitize their operations through its app and onboard to TreeLogs. The logistics infrastructure was built using a combination of in-house and external services to fulfill demand from social commerce and business buyers, Jong said. It improves on traditional cold-chain logistics by “being tech-driven and striving for higher utilization, heavier delivery density and best practices,” he added.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIn a statement about its investment in TreeDots, East Ventures managing partner Roderick Purwana said, “Food loss is already a trillion dollar problem, but what got us excited was the fact that suppliers started to use the system for all of their revenue, not just food loss products. If one of their trucks could make a delivery to a zone, TreeDots could make five deliveries on that same trip working across suppliers. The increased network density allows for decreased logistics costs and lower emissions.”"}