{"url": "https://techcrunch.com/2024/08/13/arborxr-secures-12m-to-boost-management-platform-for-ar-and-vr-devices/", "title": "ArborXR secures $12M to boost its management platform for AR and VR devices", "authors": ["Lauren Forristal", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-08-13T00:00:00", "text": "ArborXR, a startup that helps companies remotely manage AR and VR devices, believed that enterprise customers would be the primary targets for AR and VR devices. Now, that bet is paying off. On Tuesday, the company announced it has secured $12 million in funding, a Series A that will be used to develop and scale its platform.\n\nMercury Fund and Cortado Ventures led the new round, which included participation from Impact Venture Capital and Lewis & Clark Ventures. To date, ArborXR has raised over $25 million.\n\nWhile the hype around XR (extended reality), which includes AR and VR, is premature among consumers, it’s being more widely used in the corporate world. Companies such as Adidas, Bank of America, Coca-Cola, Dell, Pfizer, Nike and Walmart all utilize VR training programs to teach employees in hybrid and remote office settings.\n\nHowever, businesses may find it difficult to manage the thousands of VR devices their employees use. This is where companies like ArborXR step in.\n\nArborXR provides a platform for companies to remotely manage AR and VR devices, install apps and content, and control user access within the headset. Managers can set up devices through ArborXR’s web app (available on Windows and Mac devices), then monitor training progress in real time, guide employees through virtual experiences, control user settings, limit access, trigger updates, see device health like battery and storage and more.\n\nThere’s also a directory to discover over 600 app developers and download apps tailored to enterprise needs.\n\nThe company also offers an education offering similar to its enterprise-focused product, which is utilized by over 420 educational institutions. For both offerings, users can manage unlimited devices.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nArborXR CEO and co-founder Brad Scoggin told TechCrunch, ”People need to know about the quiet adoption of XR happening in enterprise, healthcare and education right now. This isn’t about Meta, Apple, Qualcomm, or Google… although their significant commitment to XR is not unimportant. This is about a fundamental shift in the way that people learn, and VR is driving that change.”\n\nImage Credits:ArborXR\n\nSince its launch in 2020, ArborXR has believed enterprise customers would be the primary adopters of VR. That turned out to be true as now over 3,000 major companies utilize its device management services, such as Bank of America, Delta, Pfizer, Qualcomm, UPS and Walmart. According to the company, ArborXR’s customer base tripled in the last year. It hopes the new funding will help it meet the growing demand.\n\nThe three co-founders — Scoggin, Will Stackable (CMO) and Jordan Williams (CRO) — began their first startup in 2017, which was a VR arcade company called UpwardVR. They later launched a software platform, SpringboardVR, to help manage VR devices, which was acquired by Vertigo Games in 2021. Scoggin, Stackable and Williams leveraged the success and experience gained from SpringboardVR to launch ArborXR.\n\n“Our long-term vision? XR that transforms learning and work,” Stackable said. “Pilots mastering flight simulations at home, surgeons practicing complex procedures risk-free and students accessing world-class education, regardless of location. Imagine a kid in a rural area taking a virtual tour of the Louvre or a med student practicing a complicated surgery. Ultimately, we believe XR, at its best, is a tool that gives people their time back. To learn faster and work smarter, then unplug and enjoy real life. That’s the future we’re working towards — XR as a powerful tool, not a digital escape.”\n\nImage Credits:ArborXR\n\nThere are very few VR device management companies that currently exist, including ManageXR, and Omnissa’s (formerly VMware) Workspace One UEM. Apple also offers an enterprise device management capability for the Apple Vision Pro. ArborXR aims to offer affordable pricing compared to its rivals and a straightforward user interface.\n\nThe company offers three subscription options: “Starter” for $7 per device per month for small companies, “Essential” at $10 per device per month, and “Enterprise” for $13 per device per month for large businesses. It also has a 30-day free trial.\n\nArborXR supports a wide range of VR devices, including Apple Vision Pro, DPVR headsets, HTC Vive, Lenovo VRX, Meta Quest and Pico devices, as well as AR glasses like DigiLens, Magic Leap 2, Vuzix and RealWear."}