{"url": "https://techcrunch.com/2024/03/15/sample-series-a-pitch-deck-superscale/", "title": "Pitch Deck Teardown: SuperScale’s $5.4M Series A deck", "authors": ["Haje Jan Kamps", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-03-15T00:00:00", "text": "There are two industries that make a ton of money but they’re traditionally largely ignored by venture capital — movies and gaming. That comes as a bit of a surprise to many: Venture capitalists are known for their keen eye on high-growth opportunities, predominantly casting their lot with tech startups, healthcare innovations, and the next big thing in the digital sphere. But Deadline reports that movies made $33.9 billion last year, and global gaming revenue was $184 billion, according to Newzoo. Still, the proposition of investing in movies introduces venture capitalists to a landscape far removed from the calculable metrics of SaaS platforms or the relatively predictable risk of biotech.\n\nGaming and movies are extremely hit or miss, and that’s the kind of unpredictability that’s seldom embraced by traditional venture capital investment theses.\n\nI am always particularly curious about pitch decks in the gaming industry, so when SuperScale threw its hat in the ring, I was excited. The company is promising to make marketing for games easier, and given that great marketing is one of the crucial differences between an okay outcome and a smash-hit success, it tickled my curiosity nerve in a most delightful way.\n\nWe’re looking for more unique pitch decks to tear down, so if you want to submit your own, here’s how you can do that.\n\nSlides in this deck\n\nThe company submitted a 22-slide deck, but “details of customers and customer case studies where we didn’t get approval for distribution are redacted,” according to the company.\n\nCover slide Problem slide Solution slide Macro market size prediction slide Market size prediction slide Market size slide (2027) Target customer slide Platform interstitial slide How it works slide Market segmentation slide Business model slide Case studies slide Competitive landscape slide Business plan interstitial slide 5-year plan summary slide The Ask slide Use of Funds summary slide Summary slide Team slide Appendix interstitial slide Company history slide Closing/contact slide\n\nThree things to love about SuperScale’s pitch deck\n\nSuperScale has an incredibly slick-looking deck that gets right to the point. Twenty-two slides might seem like too many (the optimal length for a slide deck is around 16 slides these days), but there are some interstitial slides and an appendix in this one, and those don’t really count.\n\nLet’s take a look at some of the things that really work.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMaking your own market\n\n[Slide 5] This will certainly catch the eye of investors. Image Credits: SuperScale\n\nGaming is a huge market, and investors don’t need to be convinced of that. The question, then, is how to get a slice of that very tasty digital pie. SuperScale is taking some interesting leaps of faith here: The numbers are projections for 2027, rather than talking about the numbers today. But this slide comes early in the deck; if SuperScale can make a solid argument for how it will be part of the machine that grows gaming by 10%, that’s very interesting indeed.\n\nIt’s bold and brazen storytelling. Of course, the company is now setting itself up for having to share a plan and show the receipts, but it’s a good way to get investors interested right off the bat.\n\nA new lease on life\n\n[Slide 7] SuperScale promises to go after two markets. Image Credits: SuperScale\n\nAs a games optimization company, SuperScale has an interesting approach, and this simple slide holds a smart promise: What if we can massively increase the profitability of a game that’s already out there? SuperScale’s model aims, in part, to give those games a new lease on life at a stage of the games publishing cycle where every dollar that comes in is basically a bonus. The deck isn’t making a big deal out of this, but I can see that being a really powerful sales technique to games studios — and if it’s successful with legacy games (at essentially no risk), wouldn’t it be smart to integrate SuperScale on new games, too?\n\nIt’s extremely smart, and investors will be able to see that, too.\n\nThat’s how you do a summary\n\nDesign and almost-unreadable text aside, the content on this slide is great:\n\n[Slide 18] Hell yes. Image Credits: SuperScale\n\nI love a good summary slide. Give the investors all the thinking and talking points they need to get excited about an investment. It’s a great approach.\n\nThree things that SuperScale could have improved\n\nOverall, this is one of the better pitch decks I’ve seen, but there are a few things that made me go “hmm.”\n\nWait, how big is your team?\n\nWhen a company raises around $5 million, I typically expect a team of 10 to 15. This team slide came as a bit of a surprise:\n\n[Slide 19] That’s a big team. Image Credits: SuperScale\n\nPutting this slide at the end of the deck makes me wonder about the seriousness of this startup. If it has five business units and 70+ team members, it throws the rest of the deck out of whack. There’s an ask slide, but no solid use of funds. You can’t sustain a 70-person team without having significant revenue. The company is spending so much time talking about 2027 and its five-year plans, yet it totally glosses over how much money it’s making.\n\nThere’s some info about revenue, but only in the form of case studies:\n\n[Slide 12] Blink and you’ll miss it, but this slide includes some crucial business metrics. Image Credits: SuperScale\n\nDid you spot it? SuperScale made $6 million from EA, Zynga and Fingersoft. And an additional $1.5 million from NimbleBit.\n\nThat’s impressive, but it’s a terrible way of showing off this level of traction. A proper traction slide would display these numbers not as totals, but as revenue graphs that show how much and how fast revenue is growing over time.\n\nWhy is SuperScale raising money?\n\nIt’s confusing why the company is raising around $5 million when it’s making proper revenue numbers.\n\n[Slide 16] What? Image Credits: SuperScale\n\nThis slide makes almost no sense at all. On slide 12, the company noted it had $7.5 million worth of revenue from just its case study clients. How many clients are there? We don’t know. How much revenue is there in total? No idea. And what is it planning to do with the money? Well, there’s a slide for that:\n\n[Slide 17] Raising for a five-year runway? Image Credits: SuperScale\n\nThis slide is worthless. The company says it is building an M&A machine, suggesting it is planning to acquire the rights to legacy games and presumably grow them. That’s awesome and all, but there needs to be a specific plan for that.\n\nThere’s also the internal inconsistencies here: It says it needs $5 million to achieve targets, but then says it will have “follow on organic investment” through reinvesting profits.\n\nIn the M&A space, $5 million is almost no money at all, so now I’m very curious about who the acquisition targets would be, and how the company presumes these acquisitions will work toward its bottom line.\n\nTell a coherent story!\n\nSuperScale, on first read-through, seemed like such a fantastic investment opportunity, but as I started poking and prodding at the deck, it made less and less sense. The company seems to want to acquire other companies (or is it games?). It has 70 people on staff, but it’s only raising $5 million. It doesn’t share its past successes, nor how it is planning to find the future success it needs.\n\nI think a much better way of telling this story, overall, would be to have an end-to-end story, told consistently:\n\nWe bought game A for $B.\n\nWe invested $C into growth infrastructure for the game.\n\nWe invested $D into marketing for the game.\n\nRevenue for the game went from $E to $F, after only investing $C+D.\n\nAs you can see, we made profit of $X on this project, and we predict this playbook will work on games that have this particular profile.\n\nWe want to build a portfolio of 30 games, which is why we are raising 30*($B+$C+$C), after which this becomes a self-sustainable business with a repeatable playbook and business model.\n\nThat story would make sense to investors.\n\nThe full pitch deck\n\nIf you want your own pitch deck teardown featured on TechCrunch, here’s more information!"}