{"url": "https://techcrunch.com/2024/04/18/orbexs-new-funding-may-accelerate-its-prime-microlauncher-into-orbit/", "title": "Orbex’s new funding may accelerate its Prime microlauncher into orbit", "authors": ["Aria Alamalhodaei", "Reporter", "Space", "Kyle Wiggers", "Julie Bort", "Maxwell Zeff", "Sarah Perez", "Marina Temkin", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-04-18T00:00:00", "text": "U.K.-based small launch developer Orbex got another boost from the Scottish National Investment Bank and other investors as it gears up for its first orbital launch, though that mission still does not have a set date.\n\nFounded in 2015, Orbex is one of a handful of firms racing to develop the next generation of European launch vehicles. These companies are looking to fill the massive gap left by the retirement of the Ariane 5 and major delays to the Ariane 6 and Vega C rockets; the absence of these vehicles means there is essentially zero native launch capacity coming out of Europe.\n\nBut the absence also means opportunity for Orbex. The company is developing a “microlauncher”: a two-stage vehicle called Prime that stands just 19 meters tall, designed to carry payloads up to 180 kilograms. The closest comparison is Rocket Lab’s Electron, which is a meter shorter but can carry up to 300 kilograms.\n\nTo Orbex, this small stature is a benefit, not a drawback, and Orbex CEO Phillip Chambers told TechCrunch via email that the company is seeing “positive market conditions” for its product.\n\n“We are seeing an exponential growth of satellites being launched into LEO and demand for launch is far exceeding supply — at the present time it’s not possible to launch a single kilogram from Europe and there is pent-up demand for sovereign launch capabilities,” he said. “We will offer freedom of action to European customers to be in control of their own launches and launch European Payloads from European soil.”\n\nPrime will be launched from a new spaceport in Sutherland, in northern Scotland, which is being constructed with the help of funding from the U.K.’s national space agency. The aim is eventually to incorporate a patented recovery technology the company calls Reflight. This is an interstage structure that sits between the rocket stages; after the booster detaches, four “petals” will fold out and, along with a parachute, will create enough drag to enable a soft ocean splashdown.\n\nA larger vehicle could eventually be in the plans as well, though Chambers was clear that Prime was the company’s first priority. However, he said that many of that rocket’s core technologies could scale to support larger payloads.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“The laws of physics dictate that if you want to compete on cost per kg you need to do this with larger vehicles, therefore, I think that it makes sense for Orbex to consider this.”\n\nThe company is kicking off its Series D with £16.7 million ($20.7 million) in fresh funding, with additional contributions from Octopus Ventures, BGF, Heartcore, EIFO and others. The new capital comes after Orbex closed a £40.4 million ($50 million) Series C in October 2022. While a spokesperson confirmed the new funding will “help Orbex ramp up the development of Prime … to ensure full readiness and scalability for its launch period,” a firm launch window has yet to be announced."}