{"url": "https://techcrunch.com/2024/04/05/robovision-computer-vision-belgium/", "title": "Belgian computer vision startup Robovision eyes US expansion to address labor shortages", "authors": ["Anna Heim", "Freelance Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-04-05T00:00:00", "text": "Faced with labor shortages, sectors such as manufacturing and agriculture are increasingly adopting AI in their automation.\n\nComputer vision startups are looking to jump on that opportunity with a range of point solutions for both industries. From data collection to crop monitoring and harvesting, robots with eyes are entering the fields.\n\nOne big challenge that remains, however, is implementation: If such solutions are not easy to use, they won’t be used.\n\nBelgian startup Robovision believes it has found a way around that. The company wants to industrialize deep learning tools and make them more accessible to businesses that are not tech companies at their core. It has built a “no-code” computer vision AI platform that doesn’t require software developers or data scientists to be involved at every step of the process. Robovision doesn’t make robots, but as its name suggests, the company also targets robotics companies that want to develop new machines that support AI-enabled automation.\n\nIn practice, this means Robovision customers can use its platform to upload data, label it, test their model and deploy it in production. The company says its model can be useful for a variety of use cases such as recognizing fruit at supermarket scale, identifying faults in newly made electrical components and even cutting rose stems.\n\nOut of its base in Belgium, Robovision already serves customers in 45 countries, CEO Thomas Van den Driessche told TechCrunch in an interview. Now, thanks to a recent sizable funding round, it’s expanding to the U.S., banking on interest from industrial and agribusiness customers in that gigantic market.\n\nThe Series A round of $42 million is being co-led by Belgian agtech investor Astanor Ventures and Target Global. The latter is a Berlin-based investor and its participation in this fundraise marks a departure from some of the other coverage it’s had of late: controversy over its ties to Russian money. Red River West, a French VC that focuses on funding European startups looking to break into North America, also participated in the round.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWith a post-money valuation of $180 million, this new round brings the total amount of equity funding raised by Robovision to $65 million, including two converted notes. This still leaves the founders together with the staff owning more than 50% of Robovision, its chief growth officer, Florian Hendrickx, told TechCrunch via email.\n\nWhat is the point?\n\nOne challenge that Robovision faces in its expansion is that working with different sectors complicates messaging and its go-to-market strategy. On the plus side, learnings and experiments in one application can be applied to another. Robovision, for example, was able to apply some of the 3D deep learning it had developed for disease detection in tulips to disease detection in human lungs during the COVID crisis.\n\n“It’s a double-edged sword,” founder Jonathan Berte told TechCrunch. “It has been the DNA of Robovision of striking the delicate balance between diversity and focus.”\n\nThat DNA comes from Robovision’s history: It was founded in 2012 as a consultancy studio, and it was several years before it pivoted into the B2B platform approach that also made it more attractive to VCs.\n\nThe initial traction Robovision gained was in agtech, which represents 50% of its activities, Van den Driessche said. Agtech is also where its Series A’s co-lead investor, Astanor, comes from: That company focuses on what it describes as “impact agrifood.”\n\nAgtech is a sizable opportunity because of labor shortages, and also due to Robovision’s track record — it helps its partner ISO Group plant a billion tulips annually. But other verticals are growing faster for Robovision, Van den Driessche said.\n\nAccording to Van den Driessche, Robovision is seeing strong traction in life sciences and tech. For instance, Hitachi uses its platform to produce semiconductor wafers. “I don’t think agriculture is going to be the largest sector at scale,” said Bao-Y Van Cong, a partner at Target Global. “I think it’s going to be industrial manufacturing.”\n\nApple’s recent decision to acquire DarwinAI, an AI startup specializing in overseeing the manufacturing of components, shows rising interest in this space. For Robovision founder Jonathan Berte, it is also a sign that a toolbox that can support a wide variety of different industrialized applications makes more sense. “Apple would never [have bought that] company if it were only a point solution.”\n\nFrom Ghent to the world\n\nThe convertible notes that Robovision raised in 2022 and 2023 following its pivot mostly came from Dutch and Belgian investors, but it had to look further afield to raise the capital it needed. The amount of capital that Robovision raised in the round would have been harder to secure from Benelux, or may have required more dilution.\n\nRobovision’s Belgian roots are paying off in other ways. “The whole early team was very smart people from Ghent university,” Berte said. Van den Driessche became Robovision’s CEO in 2022, and Berte moved his focus to fundraising, partnerships and global expansion.\n\nRobovision’s tech evolution has extended to rethinking the architecture of its computer vision tools in response to customer demand. Because low latency and delivery speed are requirements in certain environments, it launched Robovision Edge.\n\nIn today’s market, doing more with less has become key to competing globally. “I think the only way to do that is to innovate and to become more productive,” Van Cong said."}