{"url": "https://techcrunch.com/2024/03/06/remofirst-hr-tech-series-a/", "title": "Remofirst raises $25M to take on Deel and Rippling in the global HR tech space", "authors": ["Mary Ann Azevedo", "Sr. Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-03-06T00:00:00", "text": "In the world of HR tech startups, there are the Davids and the Goliaths. Deel and Rippling are the Goliaths, both having raised millions of dollars in venture capital. But Remofirst, which just secured $25 million in Series A funding, is proving to be a very worthy David.\n\nRemofirst, an HR tech startup, touts that it hires its clients’ employees and contractors in more than 180 countries on their behalf without those companies having to set up local entities. This can save those companies both time and money while also helping them be more compliant, according to CEO and co-founder Nurasyl Serik.\n\nBy serving as an employer of record, Remofirst operates that entity to hire workers on behalf of businesses and handles “everything to do with hiring a person in a company,” Serik said. That includes managing payroll, taxes, employment, and compliance; providing work equipment; and helping businesses come up with competitive compensation plans and offering health, dental and vision insurance.\n\nRemofirst says that its annual recurring revenue (ARR) has grown 10x since it raised its $14.1 million seed round in September 2022, although it declined to reveal hard revenue figures.\n\nThat revenue growth helped attract three term sheets in four weeks, according to Serik, allowing it to secure $25 million in Series A funding. European VC firm Octopus Ventures led the latest raise, which also included participation from existing backers QED, Mouro Capital and Counterpart Ventures.\n\nThe company declined to reveal valuation, noting only that it was a “strong up round.”\n\nAlthough it has raised far less capital than competitors Deel (which has raised more than $600 million and was last valued at $12 billion) and Rippling (which raised $500 million in 2023 alone), Remofirst is undeterred and believes it is differentiated in a few ways, one of which is that it is far more affordable, Serik claims.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nEarly on, the company spoke with potential customers and kept hearing that cost was a barrier — that there were “good solutions out there but they were cost prohibitive.”\n\nRemofirst says its fees start at $199 per month for an employee and $25/month for a contractor, which it claims is hundreds of dollars cheaper than competitors Deel and Rippling.\n\nDeel’s website, for example, shows that fees start at $599 per month for employees and $49 per month for contractors.\n\nJust how it is able to offer lower fees is Remofirst’s “secret sauce,” Serik said. “How we do it differently is all on the back end,” he said. “We also eliminate the need to spend months and tens of thousands of dollars setting up local entities to hire employees located in other countries.” Also, Remofirst COO and co-founder Volodymyr Fedoriv told TechCrunch that Remofirst aims to “ensure” compliance by partnering with in-country legal “experts,” whereas most competitors opt to set up entities themselves.\n\nWhile Remofirst predominantly aims to serve small- and medium-sized businesses, it can work with clients of all sizes, it claims. Today, it has thousands of customers, including Zocdoc, World Health Organization and Mastercard.\n\n“We see SMBs as an underserved segment of the market,” Serik told TechCrunch.\n\nOctopus Ventures principal Nick Sando told TechCrunch via email that his firm believes that “Remofirst offers an exceptional level of service, at a significantly more affordable price. This means they can serve a broader range of companies than similar offerings.”\n\nThe company plans to use its new capital in part to “significantly expand” its presence in international markets, such as the United Kingdom.\n\nOn March 4, Deel announced that it is acquiring PaySpace, an African-based payroll and HR software and services company, in a deal that marks its largest acquisition to date. It also announced that it has crossed $500 million in ARR. Also on Tuesday, UAE-based RemotePass announced it had raised $5.5 million in Series A funding led by Istanbul-based 212 VC."}