{"url": "https://techcrunch.com/2023/02/03/sunfi-wants-to-become-the-fastest-way-for-nigerians-to-find-finance-install-and-manage-solar/", "title": "SunFi aims to be the fastest way for Nigerians to find, finance and manage solar", "authors": ["Tage Kene-Okafor", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-02-03T00:00:00", "text": "SunFi, the Nigerian clean tech startup that connects people and businesses who want solar energy access to payment plans that match their needs, has raised $2.325 million in seed funding.\n\nThe self-described energy financial tech platform received backing from lead investors Nairobi-based Factor[e] and SCM Capital Asset Management and participating investors such as Voltron Capital, Norrsken Impact Accelerator, Ventures Platform and Sovereign Capital.\n\nOn a call with TechCrunch, CEO Rotimi Thomas said the investment will help SunFi grow its operations and improve its capabilities to recommend the best systems at the lowest cost to customers.\n\nSunFi isn’t Thomas’ first rodeo at the helm of an energy startup. In 2018, he co-founded Aspire, a solar installation company based on the knowledge he acquired in college on renewable energy and working in several roles relating to energy, gas and power projects across Nigeria and other African countries, including a five-year stint at Siemens as head of market development. Though this business morphed into SunFi three years later, launching Aspire was the first of a lifelong journey that Thomas had envisioned in trying to fix the electricity issues individuals and businesses face in Nigeria, he said on the call.\n\nNigerian households and businesses have little or no access to affordable and reliable solar technology, which reduces their reliance on grid-based power that suffers from insufficient generation capacity and fails to serve most of Nigeria’s 200 million people who live in rural areas. Turning to off-grid solutions that use solar energy is an option for these people who need electricity for simple necessities like lighting, heating and communication. And that’s what Rotimi’s previous upstart did. Aspire ran a power-as-a-service business model that helped install more than 500 solar systems for individuals and businesses. But despite being marketed as a cheap option, rural electrification in the form of microgrids and solar systems can be expensive to these sub-consumers because of their low spending power.\n\n“Customers would always ask us if there was a way for them to pay for the solar systems in installments,” Thomas said. “Because of that, we went to the banks and tried to work with them to finance this kind of payment, but we realized that banks also had a problem: they couldn’t dash out credit to customers to finance retail solar systems when they didn’t understand the technical risks involved in owning them.”\n\nFurther market research revealed that other solar providers faced the same issue of customers requesting to pay in installments. Thomas and his co-founders — COO Tomiwa Igun and CTO Olaoluwa Faniyi — decided to provide credit and began leasing these systems in what later became SunFi. They believed that as an outfit, they could manage the technical risk involved with solar systems and that it was highly likely that customers would pay because they valued solar systems and saw them as critical pieces of power infrastructure.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThink about it. Retail solar systems are marketed via word of mouth, but with distribution being fragmented and minimal avenues to provide financing, platforms like SunFi that act as aggregators become appealing to customers.\n\n“The challenge customers face with solar providers is that they want solutions they can pay small for; however, these solar platforms can’t offer. Because banks are afraid of the technical risk involved, they need something in between to talk with good solar providers and do the installation work while providing good capital to customers looking for the right solution. We’re the guys in the middle of all this,” Thomas said.\n\nSunFi creates value for these clean energy investors by de-risking the technical and credit risk involved in financing portfolios of solar solutions, opening avenues for lending as a service play for clean energy providers. Since its official launch last February, SunFi has onboarded over 40 solar system vendors to its platform at various stages of vetting; 10 are its core providers, which have served more than 129 customers. Within the past year, the one-year-old energy startup has deployed more than $600,000 to these customers via its partnerships with financial institutions.\n\nThe Nigeria-based energy company provides customers with two payment methods: a lease to own, where after an initial deposit, customers make payments in installments before owing the solar system, and a subscription model, where customers pay to use the solar system monthly. SunFi’s revenues are from the margin on the lease-to-own model and subscription fees from the latter. The company said it is working on a third revenue stream where it will assist solar providers with inventory financing.\n\nSome startups already finance solar systems with one or multiple entities, such as Carbon. But Thomas doesn’t regard them as competitors; the same goes for solar system providers. Instead, most of these platforms are partners since they already fill a need in the market and SunFi’s job aggregates them. “Because we have a unique experience having been a solar provider initially and seeing the frustration and challenges of installations in Nigeria, we’ve taken all that technical and credit knowledge to build a system that hopefully works for customers, solar providers and banks,” said the chief executive.\n\n“SunFi also has a portal for the solar provider to log in, track and manage their business of building several types of products to market to customers and get access to financing. Investors have their dashboard to manage their portal to track how their money is spent in terms of being deployed to manage portfolios or retail customers. So we’re built as a fintech for the clean tech space, which doesn’t exist in Nigeria.”\n\nThe clean tech with fintech features will be looking to enhance its platform over the next 12-18 months with this financing. It also intends to convert more than 4,000 customers within that same time frame as the 29-person team continues to grow. The clean tech is in talks to raise additional third-party capital, most likely debt, from commercial banks and other financing partners to channel that money through the system and finance all the energy platform’s demands to take care of this year.\n\n“SunFi has the ability to transform the way clean energy is accessed by households and businesses across Nigeria by creating a marketplace of clean energy products combined with flexible payment options — all of which are personalized to the customer’s financial and energy needs,” said Lyndsay Holley-Handler, partner and chief venture builder at Factor[e] on the investment. “Platforms like these have unlocked access to clean energy in other markets but don’t yet exist in Africa. This type of innovation and disruption is why we decided to be part of SunFi’s journey…”"}