{"url": "https://techcrunch.com/2025/04/24/revolut-the-45b-neobank-posts-1b-profit-in-2024/", "title": "Revolut, the $45B neobank, posts $1B profit in 2024", "authors": ["Ingrid Lunden", "Europe Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-24T00:00:00", "text": "Revolut, the $45 billion neobanking startup founded in the U.K., may have put its IPO plans on ice, but its balance sheet is looking pretty hot.\n\nThe company reported net profit of $1 billion (£790 million) in 2024, while its customer base grew by 38% to 52.5 million, according to its annual report. Revenues increased 72% to $4 billion (£3.1 billion) in the year.\n\nThe message here is one of strong growth overall.\n\nThis is Revolut’s fourth straight year of being in the black. 2024 was a big year for the company — its net profit more than doubled what it earned in 2023 ($428 million), and it finally secured a banking license in its home market of U.K., which is its biggest. It moved up to a $45 billion valuation on the back of a big secondary share sale. And it launched a crypto exchange, Revolut X.\n\nSome have thought the exchange would be a precursor to Revolut launching its very own stablecoin. From what we understand, it will span multiple jurisdictions beyond Europe and its MiCA crypto region, and it’s taking some time to set up as a result of that complexity.\n\nThe company didn’t break out revenue numbers for Revolut X specifically, but it’s looking like a bit of a juggernaut. The exchange is part of Revolut’s Wealth group, which saw revenue grow 298% to $647 million from just $158 million in 2023. Wealth, which also includes revenue from its savings products, is now the second-largest part of Revolut’s business after the cut it makes on card payments (that business was up 43% to $887 million last year).\n\n“2024 was a landmark year for Revolut,” said CEO and co-founder Nik Storonsky (pictured above), in a statement. “We not only accelerated our customer growth, welcoming nearly 15 million new users globally, but critically, we also saw customers engaging more deeply by adopting a wider range of our services across both our retail offering and Revolut Business.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nLooking ahead, the company said two of its biggest priorities for 2025 will be to “formally” launch banks in the U.K. and Mexico (on the back of its licenses) as well as to double its customer base to 100 million.\n\nThat’s much more positive news than the recent revelation that Rippling is suing Revolut to disclose who transferred money to the so-called “Deel Spy,” allegedly seeded in Rippling’s ranks to report on internal workings.\n\nThat new crypto exchange could end up playing a role there. Revolut has found it challenging to break into the U.S. market up to now, but the U.S. government’s moves to free up activity around cryptocurrency could pave the way for Revolut to drive up users through the newer products.\n\nThat could also help Revolut close the deal on new financing, too, following reports that it might be approaching another share sale at a $60 billion valuation, on top of launching that stablecoin.\n\nRevolut declined to comment on future secondary fundraises, and was equally non-committal on the subject of a public offering.\n\n“We have no immediate plans or timeline to announce regarding an IPO,” a spokesperson said. “Our current focus is firmly on executing our strategy — driving growth, expanding globally, and continuing to innovate for our customers.”"}