{"url": "https://techcrunch.com/2023/01/23/mckinsey-eyeing-the-mlops-space-buys-tel-aviv-based-iguazio/", "title": "McKinsey, eyeing the MLOps space, buys Tel Aviv–based Iguazio", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-01-23T00:00:00", "text": "The same day Microsoft invested billions in OpenAI, McKinsey snatched up enterprise-focused AI firm Iguazio for a relative steal.\n\nThe consulting giant reportedly paid around $50 million for Iguazio, a Tel Aviv–based company offering an MLOps platform for large-scale businesses — “MLOps” refers to a set of tools to deploy and maintain machine learning models in production. In a press release, McKinsey says it plans to use the startup’s tech and team of 70 data scientists to bolster its QuantumBlack platform, McKinsey’s data analytics–focused group, with “industry-specific” AI solutions.\n\n“We analyzed more than a 1,000 AI companies worldwide and identified Iguazio as the best fit to significantly accelerate our AI offering — from the initial concept to production, in a simplified, scalable and automated manner,” McKinsey senior partner Ben Ellencweig said in a statement. Over time, he added, the Iguazio and QuantumBlack teams will be fully integrated and work from a single product roadmap, combining the best of both worlds (with any luck).\n\n“Iguazio has a state-of-the-art technology that has generated significant market traction with some of our marquee clients and earned them top-industry recognition,” Ellencweig continued.\n\nIguazio, whose customers included Payoneer, was co-founded in 2014 by Asaf Somekh, Orit Nissan-Messing, Yaron Haviv and Yaron Segev. The four previously served in senior roles at XtremIO (acquired by EMC), XIV (acquired by IBM), Mellanox (acquired by Nvidia) and Radvision (acquired by Avaya).\n\nIguazio’s product suite collects data and preps it online or offline, accelerating and automating AI model training for deployment via APIs. Beyond this, Iguazio attempts to streamline machine learning pipeline steps like scaling, tuning and continuous delivery with features such as rolling upgrades, A/B testing, logging and monitoring.\n\nPrior to the acquisition, Iguazio managed to raise $72 million in venture capital from investors, including INCapital Ventures, Pitango VC, Jerusalem Venture Partners (JVP) and Magma Venture Partners, according to CrunchBase data. TechCrunch previously reported that the startup was valued at $100 million.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMLOps might not be as sexy as, say, ChatGPT. But demand is growing. By one estimation, the market for MLOps could reach $4 billion by 2025.\n\nUnsurprisingly, there’s no shortage of startups going after the space, such as Comet, which raised $50 million in November 2021. Other vendors with VC backing include Arize, Tecton, Diveplane, Iterative, Galileo and Taiwan-based InfuseAI.\n\nBut for McKinsey, the price — and timing — was apparently right, where Iguazio is concerned. The firm notes that Iguazio is its first acquisition in Israel and that the newly extended team will serve as the foundation for a new QuantumBlack location that McKinsey expects to grow in the coming years.\n\n“Attracting exceptional tech talent and expanding our tech ecosystem will enable us to welcome colleagues from around the globe to Tel Aviv’s exciting tech scene,” McKinsey partner Matt Fitzpatrick said in a blog post.\n\nOver the past year, McKinsey has made several acquisitions in the data analytics space, including Caserta, a firm specializing in data architecture and engineering. SCM Connections, another recent addition to the consultancy’s portfolio, offers services for digital transformation, including building tech stack infrastructure."}