{"url": "https://techcrunch.com/2020/10/06/scribe-therapeutics-launches-a-platform-for-engineering-crispr-based-therapeutics/", "title": "Scribe Therapeutics launches a platform for engineering CRISPR-based therapeutics", "authors": ["Darrell Etherington", "Editor At Large", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2020-10-06T00:00:00", "text": "A new company called Scribe Therapeutics founded by two former members of CRISPR pioneer Jennifer Doudna’s UC Berkeley genetics lab (alongside Doudna herself) launched on Tuesday, debuting a platform designed specifically to help develop and engineer new therapeutics based on CRISPR for addressing specific diseases, with permanent treatments in patients.\n\nDoudna is part of the leadership team behind Scribe, but it’s primarily led by CEO and co-founder Benjamin Oakes, along with VP of Platform Brett T. Staahl. Oakes and Staahl shared time at Doudna’s lab, with Oakes as a student while Staahl was a post-doc. Staahl’s interest was specifically in how gene editing, and CRISPR in particular, could be used to help treat Huntington’s disease — while Oakes, who originally set out to be a practicing medical doctor, realized early on he actually wanted to do more with solving the underlying causes of disease, and changed tack to pursue genome editing.\n\n“I set out on this journey to understand how we could, and how we could best actually solve those underlying problems of disease,” Oakes explained in an interview. That led to him pursuing research in Zinc-Finger Nuclease (ZFN)-based genome editing — a precursor technique to CRISPR that was far less specific and much more work-intensive and time-consuming. Doudna’s groundbreaking paper on CRISPR was published in 2012, and Oakes immediately saw the potential, so he joined her lab at Berkeley.\n\nMeanwhile, Staahl was looking at treatment for disorders that specifically lead to neural degeneration — something that had not previously been part of Doudna’s lab’s research prior to him joining.\n\n“He spent several years in the lab, developing strategies for neurons, and really trying to bring that technology to a point where it could be deployed as a real treatment for neurodegenerative disease, with Huntington’s as a model,” Doudna told me. “So Ben and Brett met up, they came from very different backgrounds, they had really different scientific training originally, but they hit it off. And they saw a really exciting opportunity to use the kind of technology development that Ben had been doing, and that he was very keen on continuing, and to focus it on this challenge of neurodegeneration.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe result is Scribe Therapeutics, which has already raised $20 million in a Series A funding round (plus some small amount of earlier seed financing contributed by the founders) led by Andreessen Horowitz. Scribe has been at work on their solution since 2018, but remained mostly quiet about their progress until Oakes felt confident that what they’re presenting is a real, viable technology that can be used to produce therapeutics now. Representative of that progress, the company is also announcing a new collaboration with large drug maker Biogen, Inc. to collaborate on CRISPR-based medicines for treating neurological diseases, and specifically Amyotrophic Lateral Sclerosis.\n\nThat deal is valued at $15 million in upfront commitments, with as much as $400 million or more in milestone payouts to follow, as well as royalties attached to any shipping therapeutics that result. Oakes says it’s a testament to the maturity of their platform that they were able to secure this partnership. But Scribe will also be pursuing development of its own therapeutics in-house, while partnering where it makes sense — a strategy Oakes says is in service of addressing the greatest number of possible disease treatments the startup can manage. And while it’s already generating revenue, and Oakes says he’s in no rush to secure additional funding, he does believe that ultimately they will seek additional investment in order to help ensure they can treat as many potential conditions as possible, as quickly and safely as possible.\n\nAs for the fundamental science behind Scribe, their advantage lies in the work they’ve done to adapt a molecule called CRISPR-CasX, which is a bit smaller than Cas9 and not derived from pathogen molecules, both of which make it better-suited to therapeutics. Scribe has spent the past year-and-a-half turning CasX into the basis of a platform that works better than any CRISPR protein that exists for delivery via adeno-associated virus (the current state-of-the-art in gene therapy delivery), as well as engineering it for greater specificity.\n\n“We built Scribe specifically to do that, to build an engineering core focused exclusively on making the most advanced the very best therapeutic genome editing molecules that we could,” Oakes said."}