{"url": "https://techcrunch.com/2025/04/01/who-are-climate-conscious-consumers-not-who-youd-expect-says-northwind-climate/", "title": "Who are climate-conscious consumers? Not who you’d expect, says Northwind Climate", "authors": ["Tim De Chant", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-01T00:00:00", "text": "Sometimes, surprises are lurking in everyday data.\n\nTake a category of consumers that Doug Rubin’s startup, Northwind Climate, calls “climate doers.” They’re concerned about climate change and tend to prioritize climate-friendly purchases, the sort of identifiers who might be stereotypically associated with things like buying organic foods or prioritizing local businesses.\n\n“Turns out that the climate doers category actually are the consumers who most frequent fast-food restaurants,” Rubin told TechCrunch. What’s more, some 30% of climate doers are Republicans, he added.\n\nNorthwind Climate evolved from Rubin’s work in the political world, where surveys are vital to understanding shifts in public sentiment and identifying likely voters. The startup has raised a $1.05 million pre-seed round, it exclusively told TechCrunch, with participation from angel investors, including Tom Steyer, former Massachusetts governor Deval Patrick, and Alexander Hoffmann of Susty Ventures.\n\nRather than divide people into demographic buckets that might segment along political, generational, or regional lines, Northwind Climate analyzes survey responses for behavioral clues that can be used to classify consumers.\n\nIn addition to climate doers, who comprise about 15% of all U.S. consumers, Northwind Climate has identified four other behavioral groups, ranging from “climate distressed,” or people who are slightly less concerned about climate change and aren’t as financially secure as the climate doers, to the climate deniers, who tend to be retirees who think the media is exaggerating the problem.\n\nBut, Rubin adds, “even in that [climate deniers] bucket, there are messages and ways that work with them.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nNorthwind Climate has found five discrete segments that describe consumers’ views on climate change. Image Credits:Northwind Climate\n\nTake some analysis Northwind did on electric vehicles. For climate doers and “climate distressed,” two categories of consumers who are most likely to buy an EV, the startup suggests that automakers frame the cars as matter of choice. “We’re providing choices for those who care about reducing pollution, saving money on gas, and helping address climate change,” reads one of Northwind’s suggested pitches.\n\nBut for climate doubters and deniers, who are less likely to buy one, the focus of the pitch shifts from choice to freedom: “Americans should have the freedom to drive what they want. We want to make electric vehicles clean, affordable, and practical for the millions of Americans who want one.”\n\nThe startup has built a database that consists of 20,000 survey respondents across eight surveys, and Rubin says it’s growing by 2,500 respondents per month. Every three months, Northwind also runs an industry-specific survey to capture deeper insights for different customers.\n\nCompanies that subscribe to the service, which costs $10,000 per quarter or $40,000 per year for a typical customer, can add up to four of their own questions every quarter, which Rubin said is less than what they’d shell out for one annual survey.\n\nWithin the platform, customers get access to the data Northwind has collected, questions it has asked, and some basic analyses like cross tabulations. The startup is building a chatbot to allow users to ask for more specific analyses using plain language queries.\n\nConcerned consumers might cast a wary eye on such a platform, worried that it might help companies greenwash their businesses. But Rubin isn’t concerned, saying surveys have shown that consumers are pretty savvy. “Our data shows there is a clear risk to brands and their reputations from making claims that are exaggerated or otherwise untrue,” Rubin said.\n\nRubin said that Northwind is also developing what he calls a virtual focus group. It’s essentially an AI model, trained on survey responses, that can analyze a company’s marketing materials like TV spots or social media ads and provide feedback, just like a human focus group would. The startup hopes to have it available in the next four to five months, Rubin said, though it will use new data to continually refine the model.\n\nRubin is convinced that companies have been missing opportunities to connect with climate-conscious consumers. “If you look at the data and where consumers are — and it’s across the board, it’s not just Democrats or Independents — they really want this, and they will reward companies who are willing to be smart about it,” he said."}