{"url": "https://techcrunch.com/2022/04/25/ghanaian-agtech-farmerline-to-use-new-funding-to-strengthen-its-infrastructure-help-farmers-create-wealth/", "title": "Farmerline gets $12.9M to help farmers access quality inputs", "authors": ["Annie Njanja", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-04-25T00:00:00", "text": "A McKinsey and Co. study suggests that while sub-Saharan Africa has the potential to increase (even triple) its agricultural output and overall contribution to the economy, the sector remains untapped largely due to lack of access to quality farm inputs, up to par infrastructure like warehousing and market. This is in an economy that derives 23% of its GDP from agriculture, with 60% of its population being involved in small-scale farming.\n\nNoting critical gaps in the region’s agri-food space, Ghanaian agritech Farmerline has stepped in to deliver technologies that are envisaged to increase farmers’ access to high-quality production inputs and education on the best farming practices, including on how to better deal with the effects of climate change. Its solutions are also designed to support quick access to markets by farmers for better incomes and a reduction of post-harvest loss and waste.\n\n$12.9 million pre-Series A funding\n\nFarmerline was founded in 2013 by Alloysius Attah and Emmanuel Owusu Addai. It is now ready for a rapid take-off with plans to reach 300,000 farmers in 2022, a nearly 400% increase in growth compared to last year. It will start its expansion in Ghana before expanding to the neighboring Ivory Coast, accelerated by a fresh $12.9 million ($6.4 million equity and $6.5 million debt) pre-Series A funding.\n\nThe equity round was led by Acumen Resilient Agriculture Fund (ARAF) and FMO, the Dutch entrepreneurial development bank, with participation from Greater Impact Foundation. Debt lenders included DEG, Rabobank, Ceniarth, Rippleworks, Mulago Foundation, Whole Planet Foundation, the Netri Foundation and Kiva.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAttah told TechCrunch that the agtech will use its first equity funding to build physical infrastructure like warehouses and distribution networks.\n\n“We think of ourselves as the Amazon of farmers… a digital and physical infrastructure powering a marketplace that allows the movement of goods and services to and from rural areas,” said Attah.\n\n“We plan to use the funding to strengthen our infrastructure, that is warehouses and distribution channels. Having a network of partners that can help us quickly move inputs like fertilizer and seeds to rural areas, and farm produce from rural areas, is important and part of what we do. We don’t intend to bring all of the logistics and storage in-house, but we want to be more efficient and that means working with the right partners,” he said.\n\nGreater reach\n\nFarmerline works with agribusinesses (usually small retail shops that stock farm inputs) to ensure that farmers get access to high-quality supplies. These shop owners, usually the first point of knowledge for the farmers, are used by Farmerline to distribute educational material and to gather farmers together for training. The partnering shops use the startup’s Mergdata, a proprietary AI technology platform for supply chain intelligence, to digitize the farmers they serve, and to generate the data the agritech needs to predict the demand of farm supplies.\n\n“We are tapping into that network of agribusiness, and in a way, we are tapping into a network of trust — the relationship that these shop owners have with farmers to help us expand,” said Attah.\n\nThe partnership with retailers, said Attah, emerged after Farmerline realized that working directly with the farmers would amount to “competing with local businesses, and it didn’t make any sense. The cost of going door to door to each farmer was really high,” he said.\n\n“Working with the agribusinesses made our businesses scalable, and it also helped us make more impact especially during the pandemic when we couldn’t travel — they became our eyes and ears on the ground. We sent trucks full of fertilizer and seeds to them that they would then distribute to farmers. That model worked really well.”\n\nUsing Mergdata, Farmerline can tell the performance of their partnering agribusinesses (retail shops), and develop a credit scoring program that guides the extension of business expansion loans.\n\nAccording to Attah, the startup more than doubled its direct-reach last year to 79,000 farmers, up from 36,000 in 2020 and 8,000 in 2019.\n\nMoreover, through third party licensing for Mergdata — which is now used by 180 clients including governments, non-governmental organizations and agri-companies to ensure transparency in their supply chain and traceability — the agtech has digitized over 1 million farmers in 26 countries across the globe. Benin, in West Africa, uses the platform as a national market information system."}