{"url": "https://techcrunch.com/2024/10/02/femtech-startup-perelel-is-acquiring-founders-fund-backed-sexual-health-startup-loom/", "title": "Femtech startup Perelel is acquiring Founders Fund-backed sexual health startup LOOM", "authors": ["Dominic-Madori Davis", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-10-02T00:00:00", "text": "Women’s health company Perelel announced on Wednesday the acquisition of LOOM a women’s educational health platform, for an undisclosed amount. LOOM’s founder Erica Chidi will join Perelel as a strategic advisor.\n\nChidi co-launched LOOM in 2017 as an in-person experience, offering women educational content about reproductive and sexual health education. By 2020, it expanded into an online subscription digital platform, providing courses, content, and community support to women. It raised a total of $6.5 million from investors like Slow Ventures, and Founders Fund, as well as celebrities such as actress Tessa Thompson and Goop founder Gwyneth Paltrow.\n\n“I was like, the 34th Black woman to raise over a million dollars in venture capital,” Chidi recalled to TechCrunch, adding that she didn’t expect she would raise the nearly $3 million in three months back in late 2019. “At the moment, there was just a new interest in women’s health.”\n\nMeanwhile, Alex Taylor, Dr. Banafsheh Bayati, and Victoria Thain Gioia launched Perelel in 2020 to offer clinically-backed vitamins to support women’s hormonal health. The company says it has grown its product portfolio by 50% year-over-year, says it has sold more than 48 million capsules since its launch, with overall growth hitting more than 120% year-over-year, although it declined to disclose revenue. It closed a $6 million Series A led by Unilever in February.\n\nThe past few years have seen the topic of women’s health thrown into the sociopolitical spotlight, particularly since the Supreme Court overturned national access to abortion in the U.S.\n\nPerelel hormonal products, courtesy of Perelel\n\nThain Gioia, who is co-CEO alongside Taylor, remembers Perelel’s pre-launch when investors were asking them how big the women’s health market was for fertility, pregnancy, and postpartum, believing it was a small opportunity for returns. “The positive of today is that, at least from the investor community, they’re actually realizing that women’s health is a huge underserved opportunity for all of us to tackle,” she told TechCrunch.\n\nThe numbers indeed show some healthy growth, though all companies in recent years — unless they are AI — are still seeing some trouble in the funding environment. A 2023 report by Silicon Valley Bank found that there has been a 314% increase in venture dollars flowing to women’s health companies since 2018 compared to a 28% increase for the overall health sector. Billions are flowing into the sector: Deloitte found that 2% of venture dollars into the health sector went to women’s health companies, hitting $41.2 billion in 2023.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIt was natural, then, that the paths of Perelel and LOOM would cross and Chidi would find herself at brunch earlier this year with Taylor and Thain Gioia, talking about what the next steps for both of their companies would be. Chidi wanted to sell LOOM.\n\n“Once we launched our app in the App Store last October, I knew I wanted to move forward and ideally find a company that had a higher clinical acuity — or a higher consumer acuity — and could use what we built to better support women in a more 360 way,” Chidi said.\n\n“This type of intentional education and health information and content isn’t really bucketed together in any other brand within the category,” Thain Gioia said. “It’s exciting to be creating something very different, but from two very strong existing brands.\n\nPerelel says its next steps are to continue its “broader mission of supporting women and supporting women’s health.”\n\nLOOM had scaled its team back over the past few months and by the time the acquisition finished this week, Chidi was the only employee left. She says she’s not one for idle hands and, aside from coming on as an advisor to Perelel, she’s working as a consultant for other brands at the moment, including Nike. She wrote a book ten years ago and is working on an anniversary edition. “More time to write would be really nice,” she said.\n\nThis piece was updated to reflect to whom Chidi would become an advisor."}