{"url": "https://techcrunch.com/2023/01/05/amazon-sidewalk-adds-new-partners-plans-to-open-to-developers-soon/", "title": "Amazon Sidewalk adds new partners, plans to open to developers soon", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-01-05T00:00:00", "text": "At CES today, Amazon announced that a number of new devices from four manufacturers will soon join its Sidewalk network. Sidewalk, Amazon’s long-range, low-bandwidth IoT mesh network that is powered by sharing a small portion of a user’s bandwidth from devices like the company’s Echo speakers and Ring cameras, currently supports the Tile tracker, Amazon’s own Ring cameras and sensors, as well as Level smart locks and CareBand’s senior-care systems. Now you can add sensors from Browan and New Cosmos, Meshify and Deviceroy’s Aria to this list, though only the Deviceroy system, which will connect solar inverters to the internet, is currently available, with the rest launching later this year.\n\nFor the most part, these four new partners are not exactly household names. Amazon’s Tanuj Mohan, the company’s GM and CTO for Sidewalk, however, told me that a number of new partners will launch over the course of this year. More importantly, he also said that Amazon plans to open up the Sidewalk network to developers in the first half of this year. This, he noted, will enable virtually anyone who wants to get started with building IoT products to order a reference kit from Amazon’s partners and get going in days, all without having to worry about connectivity.\n\n“Anybody who has an idea should be able to go to an AWS website, find a hardware kit from Silicon Labs, TI or from somebody, order the kit and be able to get this kit flowing data via AWS into an application,” he explained. “They can start writing literally as soon as the kit is in their hands. So that is what we expect [when we] open for developers. My vision is that with some of these kits and devices, they could actually try building something real out of it and maybe even in low numbers for proof of concepts to prove their business case in a timespan that was never before possible.”\n\nAs Mohan noted, one of the major challenges for the Sidewalk team is to get people to change the way they think about IoT connectivity. “The market doesn’t fully appreciate why Sidewalk is different,” he said when I asked him what his team’s hardest challenge is. “They have heard that, oh, Matter solves everything, or Zigbee solves everything, or we have had this forever. But not really. You haven’t had a network that’s just there and a device that ships to your house that you power on and it’s on. Yes, maybe a cell phone with a SIM card does that. But nothing else.”\n\nSome manufacturers may have gotten started with Zigbee or Wi-Fi to add smarts to everyday devices like a faucet, he noted, but then learned that people didn’t have a Zigbee hub or just wouldn’t configure it. “It was an investment that wasn’t worthwhile,” he said. “If you look at the percentages of some of these smart things that smartness was forced on, a very low percentage of them ever got connected.”\n\nIdeally, that’s not a problem with Sidewalk and while Matter is trying to solve some of these problems, Mohan argued that Sidewalk may actually help Matter to grow because it can provide the initial networking capabilities for the Matter network to allow for setting up new devices."}