{"url": "https://techcrunch.com/2023/03/02/betterhelp-owes-customers-7-8m-after-ftc-alleges-data-mishandling/", "title": "BetterHelp owes customers $7.8M after FTC alleges data mishandling", "authors": ["Amanda Silberling", "Senior Writer", "Kyle Wiggers", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-03-02T00:00:00", "text": "The Federal Trade Commission (FTC) is requiring online therapy company BetterHelp to pay $7.8 million to consumers in a settlement over alleged data mishandling between 2017 and 2020. This marks the first proposed FTC order that would compensate consumers whose health data was compromised.\n\nAccording to the FTC, BetterHelp assured customers that it would not share their health data except for the purpose of providing counseling. But the FTC alleged that BetterHelp shared customer emails, IP addresses and health questionnaire responses with advertisers like Facebook, Snapchat and Pinterest.\n\n“The FTC alleged we used limited, encrypted information to optimize the effectiveness of our advertising campaigns so we could deliver more relevant ads and reach people who may be interested in our services,” BetterHelp wrote in a statement. “This industry-standard practice is routinely used by some of the largest health providers, health systems, and healthcare brands.”\n\nCustomers who used BetterHelp between August 1, 2017 and December 31, 2020, when these advertising practices were in effect, will be eligible for partial refunds.\n\n“When a person struggling with mental health issues reaches out for help, they do so in a moment of vulnerability and with an expectation that professional counseling services will protect their privacy,” said Samuel Levine, director of the FTC’s Bureau of Consumer Protection, in a statement. “Instead, BetterHelp betrayed consumers’ most personal health information for profit.”\n\nBetterHelp said it has never received payment from any third parties for information about its customers.\n\nThe FTC’s proposed order also requires BetterHelp to limit how long it can retain customer data and ask third parties to delete consumer health data that they shared. BetterHelp is also ordered to obtain express consent before disclosing customer health information to third parties, and to develop a more comprehensive privacy program.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“This settlement, which is no admission of wrongdoing, allows us to continue to focus on our mission to help millions of people around the world get access to quality therapy,” BetterHelp wrote in its statement."}