{"url": "https://techcrunch.com/2022/11/28/frankieone-series-a-plus/", "title": "AirTree and Greycroft return to lead Australian regtech FrankieOne’s Series A+", "authors": ["Catherine Shu", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-11-28T00:00:00", "text": "FrankieOne, a Melbourne-based startup that provides an API platform for identity verification and fraud detection, said it has added $23 million AUD (about $15.4 million USD) in a Series A+, taking its Series A’s total to $45 million AUD (about $30 million USD). FrankieOne says this is the largest amount of VC funding raised by an Australian regtech so far.\n\nThe funding included a group of returning investors, including lead backers AirTree Ventures and Greycroft, and participants Reinventure (financial services company Westpac’s venture arm), Tidal Ventures and Apex Capital Partners, which are all also existing investors. New strategic investors include Binance Labs and Kraken Ventures.\n\nFounded in 2019 by serial fintech entrepreneurs Simon Costello and Aaron Chipper, FrankieOne connects banking, fintech, crypto and gaming companies to hundreds of data sources and works with 170 financial institutions around the world. The startup says it has seen 4x revenue growth over the last 12 months and its customers now include Westpac, Shopify, Afterpay, Binance, Zipmex and PointsBet. Its team doubled over the past year, and it opened a new office in San Francisco.\n\nCostello told TechCrunch that FrankieOne grew out of a neobank venture he also founded with Chipper called Frankie. Costello and Chipper wanted Frankie to differentiate from the rest of the industry with the best onboarding experience, using the top identity and fraud prevention tools available, but “this process proved to be unnecessarily complicated, requiring multiple integrations and it was clear we would need to create our own risk-based onboarding,” Costello said. They realized other fintech companies also had the same problems.\n\nAs a result, FrankieOne was created to streamline processes around regulation and compliance. It now provides a single API that connects third-party vendors with over 350 data sources in 48 countries.\n\nCostello explained that most fintechs, banks and crypto companies deal with shortfalls in match rates, coverage or ability to scale because they connect to a single vendor for their identity needs. This means their tech stacks also need constant maintenance.\n\nFrankieOne solves this problem by connecting to hundreds of data sources from multiple vendor partners, which means their clients no longer have to rely on a single vendor. Its API’s connected vendors include established financial services companies like Equifax, Experian and Socure and fast-growth startups such as Sardine AI.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“What sets FrankieOne apart is it allows its customers to switch on vendors, create dynamic workflows, add in further fraud signals and add new markets, ensuring our customers can respond quickly to changing regulations and updated business requirements, without taking on any additional work burden,” Costello said.\n\nFrankieOne’s customers are usually mid- to large-sized organizations in highly regulated industries that need to adapt to complex policies that frequently change, he added.\n\nAs an example of how FrankieOne has been used by its clients, Costello pointed to sports betting app PointsBet, which previously used a single provider for customer onboarding but dealt with high numbers of prospective users who couldn’t be verified in real time. This resulted in customer drop-offs, or further manual work to verify their details. Since working with FrankieOne, PointsBet has been able to increase customer onboarding by 14%.\n\nWhen Westpac began digitizing more of their financial services, they still used separate legacy systems and, as a result, needed to increase their pass rates to reduce drop-offs. They integrated FrankieOne’s platform for their KYC (know your customer) feature on their new BaaS (banking-as-a-service). This significantly increased pass rates, so the firm added FrankieOne across its entire group.\n\nThe latest round of funding will allow FrankieOne to scale more quickly and expand in North America, Europe and Asia-Pacific. Costello said it will also enable FrankieOne to make a significant investment into its ecosystem of vendors, data sources and fraud capabilities, enabling it to grow its customer base."}