{"url": "https://techcrunch.com/2023/09/20/ghanas-complete-farmer-which-connects-farmers-to-global-food-buyers-raises-10-4m/", "title": "Ghana’s Complete Farmer, which connects farmers to global food buyers, raises $10.4M", "authors": ["Tage Kene-Okafor", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-09-20T00:00:00", "text": "Africa’s agricultural sector has a significant social and economic impact, per McKinsey. The percentage of smallholder farmers in sub-Saharan Africa exceeds 60%, while agriculture accounts for approximately 23% of the region’s gross domestic product.\n\nBut despite the apparent opportunity in the agricultural sector, it is difficult for Africa to successfully participate in global supply chains due to supply chain and infrastructure limitations. As a result of the preponderance of small and medium-sized farms, increasing productivity is essential for enhancing economic conditions in African countries.\n\nTo that end, Ghanaian agritech Complete Farmer seeks to transform farming practices in the region by developing critical technical and physical infrastructure to enhance efficiency in the agricultural value chain. It raised a recently concluded $10.4 million pre-Series A funding round ($7 million equity and $3.4 million debt) to consolidate its efforts.\n\nThe Acumen Resilient Agriculture Fund (ARAF) and Alitheia Capital (via its uMunthu II Fund in partnership with Goodwell Investments) co-led the equity part of the round. Additionally, Proparco, Newton Partners via the DP World Venture Fund and VestedWorld Rising Star Fund participated. Sahel Capital’s SEFAA (Social Enterprise Fund for Agriculture in Africa) Fund, Alpha Mundi Group’s Alpha Jiri Investment Fund and Global Social Impact Investments provided debt financing.\n\n“We have been impressed with the progress that Complete Farmer has made in facilitating access to global trade for Ghanaian farmers, as well as introducing them to new crops and sustainable farming practices,” Tamer El-Raghy, the managing director of ARAF, said of the investment. “Complete Farmer’s technology platform and farming protocols enable farmers to access quality inputs, agronomical support and premium markets, resulting in improved yields and income as reported by the farmers themselves.”\n\nComplete Farmer describes itself as an end-to-end agricultural marketplace that connects African producers and global industries to competitive markets, resources, data and each other. This platform is a comprehensive one-stop resource that leverages proprietary cultivation protocols for crop production, enabling smallholder and commercial farmers to cultivate commodities that conform to global market specifications, thereby ensuring post-harvest offtake.\n\nSince its launch in 2017, the agritech has undergone several iterations before its current state. After graduating as a mechanical engineer, CEO Desmond Koney tried his hands on multiple projects, including a device that converted kitchen organic refuse into methane gas and a vertical farming venture. However, Koney quickly found his footing in agriculture after inheriting his father’s farm, where he discovered several challenges widespread throughout the value chain.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“My area of expertise was in production engineering, and I desired to digitize my father’s property. On the call, he stated that this was how Complete Farmer started. “However, this aspiration can be vague, as one must determine what business model works, what the product is, etc. We’ve had to make several adjustments to determine both.”\n\nInitially, the company operated as a contractor to cultivate farms on behalf of clients. In 2018, the group launched a crowdfunding platform permitting users to invest in sustainable farms and monitor agricultural activities. The TechCrunch Battlefield Africa’s finalist received approximately $150,000 in pre-seed funding from MEST Africa. Complete Farmer moved forward with its solution until the pandemic, which disrupted the operations of numerous crowdfunding businesses, leading to scalability and payment default issues, struck.\n\nDue to these issues, platforms such as Farmcrowdy and Crowdyvest have suspended or ceased operations. It became apparent to Complete Farmer, which started raising a seed round in 2020, that investors were not enthusiastic about agricultural crowdfunding. Consequently, it transitioned to an aggregator and marketplace model, similar to what Thrive Agric, a former crowdfunding platform, now employs with considerable success.\n\nThe marketplace model integrates the agritech’s experience operating as a contractor and being crowdfunded, Koney said. Complete Farmer realized it could provide customers with the necessary crops by leveraging its relationship with thousands of farmers from earlier platform iterations, he explained. The Accra-based agritech raised $2.2 million for its seed round from investors and accelerators, including Ingressive Capital, EchoVC, Launch Africa, Samurai Incubate, Kepple Ventures and Norrsken Accelerator.\n\n“We realized there was demand and needed to determine how to satisfy it. “One of the most important insights we gained was that for the majority of the large buyers, such as FMCGs and food processors, there was a specific quality they wanted that most African farmers, who were seeking market access and higher yields, lacked,” the CEO noted. “As farmers, they may know how to cultivate soybeans. However, they wouldn’t know how to obtain the specifications that these large buyers desired, such as oil and protein content. So using a data-driven methodology, we developed cultivation protocols that help smallholder farmers farm more efficiently, produce superior commodities and satisfy market demand.”\n\nComplete Farmer provides producers and agricultural commodity purchasers with two primary solutions: CF Grower and CF Buyer. Its farmer-centric product, CF Grower, assists African farmers in optimizing their productivity, gaining access to global markets, and enhancing their living standards through precision farming instruments and data-driven cultivation protocols.\n\nCF Buyer, on the other hand, provides global purchasers with dependable and convenient access to commodities grown to their specifications. On the platform, buyers have access to a vast network of qualified producers, can obtain quality-certified items through a streamlined digital process and can monitor the progress of their orders from order to fulfillment transparently, giving them complete control over their procurement process. Khula, Twiga Foods and Farmerline are some of Complete Farmer’s competitors.\n\nGrowth in terms of users and revenue has been instant following the pivot two years ago. Complete Farmer says it has successfully brought together over 12,000 farmers across five key regions in Ghana. The platform has also overseen the cultivation of over 30,000 acres of land, delivering commodities to Asia, Europe and other parts globally while reducing post-harvest losses. The six-year-old agritech takes a 30% commission of the profits made per trade between farmers and buyers.\n\nNew product lines will generate additional revenue streams, which are essential for Complete Farmer to meet its projections. Koney says the agritech is working on an embedded finance product to facilitate direct remittance from buyers to farmers and a vendor platform where farmers can purchase fertilizers and commodities to make their farms more efficient.\n\nAs the agritech company enters its next growth phase, a portion of the investment will be used to scale these products, forge strategic partnerships with key stakeholders, bolster its team and expand domestic operations. In addition, it plans to use the debt facility to finance both CAPEX and working capital investments, such as expanding its fulfillment centers in Ghana (it currently has eight) and launching new ones in markets such as Togo."}