{"url": "https://techcrunch.com/2022/09/19/ford-drivers-could-get-alerts-from-nearby-pedestrians-phones/", "title": "Ford drivers could get alerts from nearby pedestrians’ phones", "authors": ["Jaclyn Trop", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-09-19T00:00:00", "text": "Ford is working on a mobile app designed to alert drivers to pedestrians and bicyclists nearby.\n\nThe app, scheduled to debut at the Intelligent Transportation Society of America’s World Congress in Los Angeles this week, uses Bluetooth Low Energy to send a location alert from a pedestrian or cyclist’s smartphone to passing Ford vehicles equipped with the latest infotainment system. The system then calculates potential crash risks, providing screen and audio alerts.\n\nFord said it will demonstrate the technology using T-Mobile’s 5G Advanced Network Solution, as well as research from Commsignia, PSS, Ohio State University and Tome Software. The technology has other potential uses, including detecting construction zones and construction workers, according to Ford.\n\nThe automaker said the function is intended to complement, not replace, its Co-Pilot360 advanced driver assistance system. The safety package includes features such as automatic lane keeping and blind spot assistance.\n\n“Newer Ford vehicles already with Ford Co-Pilot360 Technology can detect and help warn drivers of pedestrians, bicyclists, scooter riders and others — and even apply brakes if drivers do not respond in time,” Jim Buczkowski, Ford’s executive director of research and advanced engineering, said in a statement. “We are now exploring ways to expand vehicle sensing capability, for areas drivers cannot see, to help people drive even more confidently on roads increasingly shared by others using their two feet or two wheels.”\n\nInstead of relying upon cameras or radar, which can only detect people and objects in line of sight, Bluetooth Low Energy uses radio waves to sense behind buildings and other obstructions. Ford didn’t provide details on how far away a pedestrian might be detected — a key factor for drivers who might need to respond quickly.\n\nThe technology is already widely available in smartphones, which typically must pair with other devices in order to communicate. Ford said its application can communicate with multiple similarly-equipped devices within range without pairing them."}