{"url": "https://techcrunch.com/2023/01/05/circleci-breach/", "title": "CircleCI warns customers to rotate ‘any and all secrets’ after hack", "authors": ["Carly Page", "Sr. Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-01-05T00:00:00", "text": "CircleCI, a company whose development products are popular with software engineers, has urged users to rotate their secrets following a breach of the company’s systems.\n\nThe San Francisco–headquartered DevOps company said in an advisory published late Wednesday that it is currently investigating the security incident — its most recent in recent years.\n\n“We wanted to make you aware that we are currently investigating a security incident, and that our investigation is ongoing,” CircleCI CTO Rob Zuber said. “At this point, we are confident that there are no unauthorized actors active in our systems; however, out of an abundance of caution, we want to ensure that all customers take certain preventative measures to protect your data as well.”\n\nCircleCI, which claims its technology is used by more than a million software engineers, is advising users to rotate “any and all secrets” stored in CircleCI, including those stored in project environment variables or in contexts. Secrets are passwords or private keys that are used to connect and authenticate servers together.\n\nFor projects using API tokens, CircleCI said it has invalidated these tokens and users will be required to replace them.\n\nCircleCI, which in 2021 announced a $100 million Series F at a $1.7 billion valuation, hasn’t shared any more information about the nature of the incident and has yet to respond to TechCrunch’s questions.\n\nHowever, the company is also advising users to audit their internal logs for unauthorized access occurring between December 21, 2022, and January 4, 2023, which suggests the company’s breach began some two weeks earlier. On December 21, the company also announced that it had released reliability updates to the service to resolve underlying “systemic issues.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIn 2019, CircleCI was hit by a data breach after a third-party vendor was compromised. This saw hackers compromise user data, including usernames and email addresses, usernames and email addresses associated with GitHub and Bitbucket, along with user IP addresses.\n\nIn November, CircleCI said that it had also witnessed an increasing number of phishing attempts whereby unauthorized actors were impersonating CircleCI to gain access to users’ code repositories on GitHub."}