{"url": "https://techcrunch.com/2021/01/28/spacs-are-the-construct-vcs-need-to-fund-cleantech/", "title": "SPACs are the construct VCs need to fund clean tech", "authors": ["Brian Walsh", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-01-28T00:00:00", "text": "In light of climate change and escalating global energy demand, more emphasis is being placed on emerging clean technologies — ranging from renewables and energy storage to nuclear power. Although these technologies have tremendous potential, they require lots of innovation, and innovation needs abundant capital.\n\nThe issue: early-stage financing for clean tech hasn’t been plentiful, and it’s stifling the growth of new energy companies. Why is this? In general, clean tech companies lack the startup advantages of agility and flexibility.\n\n“Moving fast” works for products such as consumer mobile apps and SaaS solutions. The clean tech sector, on the other hand, tends to involve highly regulated, capital-intensive, mission-critical infrastructure.\n\nThat has hurt both returns and well-intentioned impact. According to Cambridge Associates, venture-backed companies have returned, on average, -15% internal rate of return (IRR) since 2000. Contrast that to venture-backed companies in healthcare, which returned 24% in IRR over the same time period.\n\nWhy clean tech lacks funding\n\nWhile noble in its aims to make the world a better, cleaner, safer, healthier place through technology, clean tech venture capital has suffered simply because clean tech does not fit the traditional venture capital model. Central to the venture capital model is the ability to de-risk new ideas and significantly capitalize the most promising ones, allowing for liquidity via M&A or initial public offering (IPO).\n\nThis construct allows for the return of venture capital dollars, plus appreciation that enables VC firms to raise new funds. These capitalization events also allow the venture-backed company to accelerate growth and maximize market impact.\n\nHow this construct works is evident when comparing healthcare and clean tech. In healthcare, new innovations are de-risked by VCs. More mature innovations are acquired or reach IPO every year. As a result, the average annual ratio of dollars raised via an exit to VC-invested dollars since 2012 is 1.8. This ratio is only 0.2 for clean tech, an 800-plus percent difference in the wrong direction. This has resulted in poor returns and limited capitalization of clean tech companies.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nEnter (or reenter) the SPAC\n\nGiven the state of the world’s environment and lack of abundant energy in emerging economies, we need to collectively fix this issue. Special purpose acquisition companies (SPACs) are significantly improving clean tech’s venture capital construct. According to Investopedia:\n\nSPACs are companies with no commercial operations that are formed strictly to raise capital through an initial public offering (IPO) for the purpose of acquiring an existing company. Also known as “blank-check companies,” SPACs have been around for decades. In recent years, they’ve become more popular, attracting big-name underwriters and investors and raising a record amount of IPO money in 2019.\n\nIn 2020, more than 110 SPACs completed transactions in the U.S., capitalizing these companies with more than $29 billion.\n\nIn 2020, SPACs capitalized clean tech companies with almost $4 billion of capital, including Fisker, Lordstown Motors, QuantumScape, Hyliion, XL Fleet and others. This helped push the ratio of funds raised at exit to venture capital invested in 2020 from the previous 0.2 average to a much healthier 0.6, a 200% improvement.\n\nIn 2021, we will likely see even further improvement. Why? Because there are 43 active SPACs looking toward or finalizing merger targets with a clean tech focus, potentially providing $12 billion in growth capital. Even if there are no more new SPACs in 2021 and a historically low average of M&As and IPOs, 2021 promises continued improvement for clean tech investment.\n\nDon’t let Nikola tarnish the pack\n\nOne of the most high-profile clean tech SPACs was Nikola Corporation. The battery-electric and hydrogen-powered truck maker has attracted much fanfare since going public last June through a reverse merger with special purpose acquisition company VectoIQ. The company’s market capitalization soared and things seemed to be going well, but things became controversial later in the year when the company was accused of making false statements about its technology and other things.\n\nAlthough examples such as Nikola have the potential to tarnish the emergence of SPACs as a way to spur clean tech investing, they shouldn’t. There are plenty of examples of emerging companies that scream quality and integrity. For example, Stem*, a leader in the energy storage optimization space, is now going public, pending SEC approval, via the Star Peak SPAC.\n\nPublic markets are receiving the SPAC with enthusiasm. Assuming the merger happens, Stem will be capitalized with greater than $450 million of cash to accelerate growth and drive impact. It’s an illustration of SPACs as a positive venture capital construct that is needed to make clean tech work and become a thriving sector.\n\nAs a long-time clean tech venture capitalist myself, it is interesting that public investment via the SPAC may be the correcting element for the clean tech VC construct. For years, I assumed that corporates would step up their M&A activity at premium valuations to solve this issue, but I’ve spent a long time waiting.\n\nJudging by activity, corporates seem content to continue playing the still very important investor/nurturer role, versus the “owning” role. Regardless, capitalizing promising clean tech companies can only mean one thing: clean-tech-related impact is coming like never before as these companies require and use capital to scale.\n\nNew and more diverse approaches to finding and funding new, great clean tech companies are sorely needed. SPACs are going to be the tool needed to bring clean tech up to par with sectors such as healthcare. It’s a development that will benefit all of us.\n\n*Stem is a Wind Ventures portfolio company."}