{"url": "https://techcrunch.com/2021/03/26/extra-crunch-roundup-clubhouse-ux-teardown-yc-demo-day-favorites-proptech-vc-survey-more/", "title": "Extra Crunch roundup: Clubhouse UX teardown, YC Demo Day favorites, proptech VC survey, more", "authors": ["Walter Thompson", "Annie Siebert", "Managing Editor", "Contributions", "Tc", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos"], "publication_date": "2021-03-26T00:00:00", "text": "Since the pandemic began, I have been pushing the limits of my imagination to try to picture what cities will look and feel like in the coming years.\n\nIf your town looks like San Francisco, where I live, it’s a pressing question: Our once-bustling financial district is a ghost town, but even in outer neighborhoods, the number of vacant storefronts is unsettling. People are starting to emerge after sheltering in place for a year, but we are a long way from fully restoring our shared spaces.\n\nWhat’s going to happen to those semi-vacant office towers, some of which are still under construction? There’s been renewed talk of converting some skyscrapers into residential housing, but there are real economic/logistic hurdles to clear before that can be broadly applied. Scores of restaurants have closed in recent months; who will take over those spaces? I spend a lot of time walking around, and it’s been a long time since I’ve noticed a “Grand Opening” sign.\n\nSeeking answers, Managing Editor Eric Eldon interviewed 10 VCs who are active in proptech and found that most were generally “optimistic.”\n\nSeveral expressed genuine uncertainty about the future of offices, but most were bullish about prospects for remote work, the rebirth of physical retail and the emergence of “third spaces” that will fill the gap between work and home.\n\nIn a companion article on TechCrunch, Eric explores these broader shifts, concluding, “you can start to see a world emerging that sounds a lot more like the fantasies of a New Urbanist than the world before the pandemic.”\n\nHere’s who he interviewed:\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nClelia Warburg Peters, venture partner, Bain Capital Ventures\n\nChristopher Yip, partner and managing director, RET Ventures\n\nZach Aarons, co-founder and general partner, MetaProp\n\nCasey Berman, general partner, Camber Creek\n\nVik Chawla, partner, Fifth Wall\n\nAdam Demuyakor, co-founder and managing partner, Wilshire Lane Partners\n\nRobin Godenrath and Julian Roeoes, partners, Picus Capital\n\nStonly Baptiste, founding partner, and Shaun Abrahamson, managing partner, Urban Us\n\nAndrew Ackerman, managing director, Dreamit\n\nThanks very much for reading Extra Crunch this week. Have a great weekend!\n\nWalter Thompson\n\nSenior Editor, TechCrunch\n\n@yourprotagonist\n\nFull Extra Crunch articles are only available to members.\n\nUse discount code ECFriday to save 20% off a one- or two-year subscription.\n\nIt’s time to abandon business intelligence tools\n\nIdeally, BI transforms raw data into actionable information, but according to Charles Caldwell, VP of product management at Logi Analytics, “a gap exists between the functionalities provided by current BI and data discovery tools and what users want and need.”\n\nFew BI tools actually integrate with existing workflows and most offer clunky user experiences, “leaving many individuals feeling like they need an advanced computer science degree to actually be able to pull insights out.”\n\nInstead of requiring workers to abandon workflow applications to access data, embedded analytics are more efficient and easier to use, says Caldwell.\n\nIn short, “it’s time to abandon BI — at least as we currently know it.”\n\nPre-seed round funding is under scrutiny: Is VC pandemic posturing here to stay?\n\nAmid the pandemic, investors became laser-focused on sections of the pitch deck that address monetization and business viability — signs that founders need to come to the table with better-defined businesses in order to succeed.\n\nInvestors’ heightened expectations for monetization potential and a company’s positioning within its competitive landscape are unlikely to lessen in the years to come, even in a post-COVID economy.\n\nClubhouse UX teardown: A closer look at homepage curation, follow hooks and other features\n\nClubhouse’s hockey-stick growth is something most startups would kill for.\n\nHowever, it also means that UX problems can only be addressed while in “full flight” — and that changes to the user experience will be felt at scale rather under the cover of a small, loyal and (usually) forgiving user base.\n\nOur favorite companies from Y Combinator’s W21 Demo Day\n\nWe’re not investors, so we’re not pretending to sort the unicorns from the goats.\n\nBut TechCrunch reporters spend a lot of time talking with startups, hearing pitches and telling their stories; if you’re curious about which companies stood out from Y Combinator’s W21 Demo Day, read on.\n\nA look at 4 IPO updates and 2 late-stage funding rounds\n\nThere’s a lot going on: The venture capital market is redlining its engines while public markets remain sympathetic to growing, unprofitable companies.\n\nLet’s round up IPO news from DigitalOcean, Kaltura, Robinhood and Zymergen, and big rounds for Lattice and goPuff.\n\nDear Sophie: When can I finally come to Silicon Valley?\n\nDear Sophie:\n\nI’m a startup founder looking to expand in the U.S. I was originally looking at opening an office in Silicon Valley to be close to software engineers and investors, but then … COVID-19 :)\n\nA lot has changed over the last year — can I still come?\n\n— Hopeful in Hungary\n\nStaying ahead of the curve on Google’s Core Web Vitals\n\nAside from improved SEO, small business websites optimizing for Google’s new Core Web Vitals will reap the rewards of an improved user experience for their site visitors.\n\nWhile many are looking at the Core Web Vitals as a big hoop to jump through to please the search powers that be, others are seeing — and seizing — the opportunities that come along with this change.\n\nSteady’s Adam Roseman and investor Emmalyn Shaw outline what worked (and what was missing) in the Series A deck\n\nWhen it comes to Steady — the platform that helps hourly workers manage and maximize their income and access deals on things like benefits and financial services — the strengths of the business are clear.\n\nBut it took time for founder and CEO Adam Roseman to clearly define and communicate each of them in his quest for fundraising.\n\nDiscord’s reported $10B exit; Compass and Intermedia Cloud Communications set IPO price ranges\n\nAlex Wilhelm dug into Discord’s possible $10 billion exit to Microsoft and explored IPO price ranges for real estate tech company Compass and Intermedia Cloud Communications, a unified-communications-as-a-service company.\n\n“It’s a lot,” he noted, “but if we don’t get through it all now, we’ll fall behind and feel silly later.”\n\nWill fading YOLO sentiment impact Robinhood, Coinbase and other trading platforms?\n\nThe consumer trading frenzy could be slowing.\n\nWhat would happen to Robinhood and its cohorts if the apparent cooling in consumer trading demand continues?\n\nHow VC and private equity funds can launch portfolio-acceleration platforms\n\nAlmost every private equity and venture capital investor now advertises that they have a platform to support their portfolio companies, “however, most of us don’t have the budget of an Andreessen Horowitz to support almost every major need” for each startup they’ve bet on, says Versatile VC founder David Teten.\n\nIf you’re prioritizing a platform buildout for your firm, consider using the framework he’s outlined.\n\nAutomakers, suppliers and startups see growing market for in-vehicle AR/VR applications\n\nDespite all of the pomp and promises about the potential for AR and VR, there isn’t a clear understanding of market demand for bringing the technology to cars, trucks and passenger vans.\n\nEstimates of the global market range from $14 billion by 2027 to as much as $673 billion by 2025, showing just how nascent the market currently is and how much opportunity is present.\n\nAmid pandemic, Middle East adtech startups play essential role in business growth\n\nThe Middle East is a promising region with growing digital advertising solutions despite locals’ attachment to traditional means of advertising.\n\nIn recent years, there has been a shift to the active use of social media and online shopping, meaning the Middle East embodies great potential for adtech startups.\n\nSocial+ payments: Why fintechs need social features\n\nSocial+ products are seeing mass adoption because they marry community with functionality.\n\nThis applies even to fintech companies as taboos around money fall away.\n\nThe lightning-fast Series A that was 3 years in the making\n\nIt took Christine Tao, founder of Sounding Board, just over three years to recognize the value of executive coaching and get her company to a Series A.\n\nHere’s how she did it.\n\nNFTs could bridge video games and the fashion industry\n\nMusic companies, celebrities and fashion brands are some of the latest entities to dip a toe into the burgeoning NFT market.\n\nIn part two of a three-part series, we take a look at why NFTs are “the next chapter of digital art history.”\n\nWhere is the e-commerce app ecosystem headed in 2021?\n\nThe pandemic-induced growth of e-commerce is, by now, well documented.\n\nWhat is happening in the app ecosystem that supports e-commerce? Is it growing, or are we more likely to see consolidations and IPOs?\n\nLet’s explore.\n\nironSource is going public via a SPAC and its numbers are pretty good\n\nYou’ll want to pay attention to this one: Israel’s ironSource, an app-monetization startup, is going public via a SPAC.\n\nIt’s the second SPAC-led debut from an Israeli company in recent weeks worth more than $10 billion, and ironSource is actually a pretty darn interesting company from a financial perspective.\n\nCoursera set to roughly double its private valuation in impending IPO\n\nThe market views Coursera’s edtech business warmly ahead of its impending public offering.\n\nCoursera is being valued as a software company, likely a breathe-easy moment for still-private edtech companies, since the debut could be an industry bellwether."}