{"url": "https://techcrunch.com/2023/03/22/rippling-gusto-deel-velocity-global-ipo/", "title": "When the tech IPO market reopens, keep an eye on HR unicorns", "authors": ["Alex Wilhelm", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-03-22T00:00:00", "text": "The back half of 2023 is expected to unlock the technology IPO market. Whether the public-offering window opens later this year or early in 2024, TechCrunch+ expects to see a few familiar names in the mix from the HR tech space.\n\nAnd perhaps some less familiar names.\n\nRegular TechCrunch readers are likely familiar with HR-tech unicorns like Rippling, Gusto and Deel, late-stage startups with valuations around or above the $10 billion mark.\n\nVelocity Global is another name to include in the startup cluster. Worth a few billion dollars, its recent growth and profitability mean that when we consider potential exits in the HR technology market, it should be on the list.\n\nThe Exchange explores startups, markets and money.\n\nRead it every morning on TechCrunch+ or get The Exchange newsletter every Saturday.\n\nEven more fun, Velocity Global CEO Ben Wright shared a grip of financial data about his company with TechCrunch+ recently. The new numbers give us even more perspective into the growth and worth of startups that help other companies run payroll.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThere is nuance in the HR tech space. First, the dividing line between running payroll and hiring workers: While Deel and Velocity Global appear more focused on being employers of record (EoR) for domestic companies looking to hire internationally, Rippling and Gusto are more known for running payroll for customers’ domestic workforces. But don’t try to jam the four companies into two distinct groups; Rippling also offers customers the ability to be their co-employer, and both Rippling and Gusto offer support for international staff.\n\nIn short, while the four companies may have started off with a particular focus and geographic bent, they are overlapping more over time as they broaden their product lineup to support more customer use cases and, we presume, to grow their revenue footprint with existing customers.\n\nAs we wait for some brave company to be the first IPO out of the gate, let’s chat through Velocity Global’s numbers and valuation and contrast both with what we know about some of its private-market competition. For you digit-heads out there, we’re going to close with a question about which company’s valuation makes the most sense. Ready? To work.\n\nGrowth\n\nI love a startup cluster. Normally, however, we spot them when they are filled with early-stage startups; for example, we noted the OKR software cohort and the insurtech marketplace troop during the last venture cycle. Given that our payroll group is later stage, we have more information about their individual performance.\n\nVelocity Global started life helping other companies hire in other countries as a services business back in 2014. Per Wright, about five years in, the company decided it needed more technology to run its business. Why? “We were just getting so big [that we] couldn’t just be a services business anymore,” he said.\n\nThe company initially tried to buy technology off the shelf before building its own software. This timeline helps explain why Velocity Global has a far more impressive history of profitability than most startups, and why it raised capital so much later than most. It raised a $100 million Series A in 2021 and added $400 million last May, bringing its total fundraising to a half billion dollars and a self-reported valuation of $2 billion.\n\nAs with any company with a services origin that pivots into technology, we want to understand its gross margins, which are a great way to get a gut check on whether we’re looking at a services company with a tech side hustle or a tech company that may retain more services DNA than other startups.\n\nTechCrunch+ asked Wright about his company’s revenue mix and margins, to which the CEO responded that in the case of gross margins, “you can look at public-market comps for SaaS companies of our size and larger, and we are right in that sweet spot.” That implies that Velocity Global has evolved into a tech business and that we can confidently bucket its revenue with unicorn peers. (We vet every company’s pre-IPO comments when they do go public, so expect a fact check on all of this when the four companies debut.)\n\nSo what does Velocity Global have to back up its $2 billion price tag? Per the company, it has surpassed $200 million worth of annual recurring revenue, is growing around 40% organically (sans acquisitions) and was profitable in seven of its nine years of operation.\n\nOn the profit basis, Wright’s company uses adjusted EBITDA as its measuring stick, though the CEO did say that the adjustments aren’t massive — he joked that Velocity Global is not using something akin to WeWork’s infamous community-adjusted EBITDA metric — and that his company’s adjusted profitability is close to an unadjusted EBITDA figure.\n\nFair enough. Adjusted EBITDA is popular with tech companies because of their penchant for paying employees partially in stock, so we’re accustomed to it, even if we prefer GAAP net income.\n\nVelocity Global is clearly an IPO candidate; growth, nine-figure revenue and a history of profitability are the traditional requirements for a public debut. Now, let’s get some more numbers to play with.\n\nCompetitive metrics\n\nHow do Velocity Global’s numbers and valuation stack up against its competition? A few notes:\n\nDeel recently announced that it reached $295 million worth of ARR at the end of 2022, up from $57 million at the close of 2021. When Deel crossed the $100 million ARR milestone in early 2022, we asked the company about its own gross margins — we’re consistent, at least — which it said were slightly above average for SaaS companies.\n\nrecently announced that it reached $295 million worth of ARR at the end of 2022, up from $57 million at the close of 2021. When Deel crossed the $100 million ARR milestone in early 2022, we asked the company about its own gross margins — we’re consistent, at least — which it said were slightly above average for SaaS companies. Deel is worth around $12 billion and also claims EBITDA positivity since September of last year. At its end of 2022 valuation and recurring revenue, the company sported an ARR multiple of around 41x.\n\nis worth around $12 billion and also claims EBITDA positivity since September of last year. At its end of 2022 valuation and recurring revenue, the company sported an ARR multiple of around 41x. Gusto told TechCrunch+ this week that it crossed the 300,000 customer threshold at the end of 2022, up from 200,000 in August 2021, when it shared that it had closed its most recent funding round, a $175 million investment that pushed its valuation to $9.5 billion.\n\ntold TechCrunch+ this week that it crossed the 300,000 customer threshold at the end of 2022, up from 200,000 in August 2021, when it shared that it had closed its most recent funding round, a $175 million investment that pushed its valuation to $9.5 billion. Gusto revenue is harder to pin down, but in late 2021, Forbes reported that the company’s CEO said that it had “several hundred million dollars” worth of annual revenue, a figure that was growing “steadily at 50% year-over-year.”\n\nrevenue is harder to pin down, but in late 2021, Forbes reported that the company’s CEO said that it had “several hundred million dollars” worth of annual revenue, a figure that was growing “steadily at 50% year-over-year.” Rippling recently told Reuters that it has over $100 million worth of ARR and more than 400,000 “users across industries from retail to healthcare.” Reuters also notes that the company is more than doubling each year.\n\nrecently told Reuters that it has over $100 million worth of ARR and more than 400,000 “users across industries from retail to healthcare.” Reuters also notes that the company is more than doubling each year. Rippling’s numbers are a bit more restrained than others; I presume that its revenue figure is a lowball disclosure given the size of its customer base and its valuation, recently reaffirmed at $11.25 billion.\n\nThat’s a lot of numbers. To help a bit, Deel’s ARR multiple is pretty expensive compared to current market norms for SaaS companies. However, Deel is growing at a bonkers pace, meaning it can likely command a hefty growth premium in its equity pricing. Rippling’s growth rate, in the triple digits, as we understand it, also implies a growth premium to support its valuation and, we presume, an ARR multiple above what we tend to see on the public markets presently.\n\nVelocity Global and Gusto are growing a bit slower, but without more precise numbers from Gusto, we cannot compare them directly. Velocity Global is sitting atop an ARR multiple of around 10x, depending on how far above the $200 million ARR mark the company has scaled. I would hazard that Gusto’s ARR multiple is closer to Velocity Global’s than, say, Deel’s.\n\nThis creates an interesting intellectual exercise: Have private-market investors nailed valuations among the four companies regarding their growth rates and profitability — it seems that HR-tech companies in the payroll space find it far easier than other software companies to reach EBITDA positivity — for each to be fairly valued? Or are Velocity Global’s valuation and ARR multiple low?\n\nGiven recent changes to the value of software companies, we’d normally be more willing to argue that the more richly priced startups are expensive, but not in this case. Why? Because we don’t have quite enough data to make that call, and how much of a premium growth is worth today may not be the case when we get to IPO season.\n\nThe takeaway is that we have a cluster of companies in the payroll space with increasingly similar product lines, nine-figure revenue bases and a mix of 10- and 11-figure valuations. Collectively, the companies have raised billions. Yes, that sound you hear is us rubbing our hands together in anticipation of the eventual filings.\n\nSurely no unicorn in high repair will skip the next IPO window, yeah?"}