{"url": "https://techcrunch.com/2024/05/15/alkira-connects-with-100m-for-a-solution-that-connects-your-clouds/", "title": "Alkira connects with $100M for a solution that connects your clouds", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-05-15T00:00:00", "text": "As annual spending on cloud computing surges toward the $1 trillion mark, we’re seeing a wave of enterprise startups gaining traction with customers and investors as they build tools to help manage that usage.\n\nIn the latest development, a startup called Alkira has raised $100 million for its “network infrastructure as a service,” which lets users virtualize and orchestrate hybrid cloud assets, and manage them as a whole.\n\nTiger Global Management, a new investor in the startup, is leading this Series C. Other new investors, NextEquity Partners and Geodesic Capital, as well as previous backers Dallas Venture Capital, Sequoia Capital, Kleiner Perkins and KDT (Koch Disruptive Technologies) also participated in the round.\n\nAlkira’s CEO, Amir Khan, did not disclose the startup’s valuation, but said that it’s “certainly an up-round.” PitchBook estimates that Alkira was last valued at $234 million, although that dates from a funding round back in 2020, and the company has grown since then. Its customers come from a range of verticals like industry (Koch is a strategic investor in the firm), financial services (S&P) and media (Warner Music), and the company has raised $176 million to date.\n\nAlkira is addressing one of the thornier aspects of the cloud revolution. Customers typically adopt a hybrid approach to cloud networking to hedge their bets, get the most competitive pricing by region, and lean into flexible arrangements, using multiple vendors, and in many cases, running private, public and on-premises servers in tandem depending on their needs.\n\nThe problem with that, though, is that buying, implementing and managing that plate of spaghetti can prove to be an indigestible nightmare. The spike in the popularity of AI-based applications, which might require even more compute and resources, is certainly exacerbating this issue, but this is a problem that has persisted for years and will continue to, regardless of whether AI is here to stay.\n\nAs Khan described it to me, with Alkira, end-users can negotiate and manage their own compute deals, but they can hand over the designing of those deals to Alkira. The company essentially integrates all those disparate services behind the scenes so that they can be managed and viewed as a single service — kind of orchestrating and virtualizing an organization’s infrastructure on a grand scale. Alkira can support integration with all major cloud providers, Khan told me.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe startup offers a range of services around that integrated, network-as-a-service experience: Cloud backbone as a service (aimed at hyperscalers and heavy activity); extranet as a service (end-to-end connectivity for customers and third parties, created when needed to interface with an organization’s core network); cloud “insights” (visibility services for ops personnel); and secure connectivity (secure remote VPN access).\n\nKhan claims that running a company’s network assets through Alkira can cut down years of integration and management work into hours.\n\nOne customer, he said, faced a mess of day-to-day troubleshooting, visibility, and routing controls. “Everything was so tedious, and it took them two years to build that system… In our first meeting with them, sitting in a conference room with them in Reno, Nevada, we were able to replicate all that work in four hours.”\n\nOut of that meeting, they won not just the business pitch, but an investor: The end user was Koch Industries.\n\nKhan co-founded Alkira with his brother Atif (the CTO). The two have years of experience working in the world of telecoms — a wonderful training ground, it turns out, for the incredible fragmentation of today’s cloud computing landscape. (“Alkira” is an Aboriginal word roughly meaning “bright, blue sky,” a reference to clearing up the darkness of today’s “clouds.”)\n\nThey previously founded another startup that was closer to that legacy networking space: Viptela, which specializes in software-defined wide area networking, and was acquired by Cisco for $610 million in 2017.\n\nThis new turn into cloud computing puts Alkira up against a completely different wave of would-be competitors, though the very biggest players, like AWS, Azure and Google, are yet to make significant progress in working together. That leaves a wide opening for third-party players to do the stitching and virtualizing for them.\n\nIt’s interesting to see Tiger Global leading this round. The firm is still investing, although as you can see by the table below that its activity has really dropped off a cliff in the last two years. That context makes this deal all the more significant.\n\nTiger’s investments by year. Image Credits: PitchBook\n\nThe combination of a proven track record and obvious market opportunity seemingly got Tiger over the line on this one. “Increasing cloud and AI use is also increasing the complexity, velocity, and scale requirements of network infrastructure,” said Rohit Iragavarapu, an investor at Tiger Global, in a statement. “We believe Alkira is well-positioned to unlock the growing potential of this rapidly evolving space with its visionary approach, market traction and cutting-edge technology.”"}