{"url": "https://techcrunch.com/2023/08/31/tiktoks-effect-house-ar-development-platform-exits-beta/", "title": "TikTok’s ‘Effect House’ AR development platform exits beta", "authors": ["Aisha Malik", "Consumer News Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-08-31T00:00:00", "text": "TikTok’s AR development platform called “Effect House,” which allows creators to build AR effects for use in the video app, is officially out of beta. Creators can now download Effect House 3.0 and join TikTok’s official Effect House community on Discord, where they can be kept up-to-date on the latest events and challenges, office hours, and also connect with other effect creators.\n\nSince its launch last year, effects made by Effect House’s community of creators have inspired more than 21 billion videos, garnering more than 8.6 trillion views globally and bringing together more than 400,000 members on the Effect House Discord.\n\nOver the past year, TikTok has released more than 20 updates to Effect House. Among the updates are AI-powered tools like Art Maker and Asset Studio, which give creators the ability to generate assets for their effects with AI. There are also new tools like User Media Texture, which incorporates images from a camera roll into effects, and Material Editor, which helps you incorporate sophisticated textures and materials to enhance the appearance of effects.\n\nThe official launches comes as TikTok recently launched an “Effect Creator Rewards” fund that rewards creators for the effects they make through Effect House. The $6 million fund offers payments to creators based on users’ engagement with their effects. At launch, for every effect that’s used in 500,000 unique videos within 90 days of being published, a creator will collect $700 USD. For every 100,000 videos published thereafter within the same 90 days, creators will collect an additional $140.\n\nThe launch of the platform last year put TikTok in closer competition with both Snap and Meta, both of which have long offered a range of tools that allow developers to build out AR experiences and effects for their own respective families of applications."}