{"url": "https://techcrunch.com/2025/01/29/resolution-games-announces-battlemarked-an-upcoming-vr-dungeons-and-dragons-game/", "title": "Resolution Games announces Battlemarked, an upcoming VR Dungeons & Dragons game", "authors": ["Lauren Forristal", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-01-29T00:00:00", "text": "Last year, Wizards of the Coast and Resolution Games announced an exciting development: Dungeons & Dragons (D&D), the popular tabletop role-playing game (RPG), is being adapted for virtual reality.\n\nUntil now, specific details about the new game have been kept closely under wraps. However, on Wednesday, the companies finally unveiled the official title and more information, bringing players one step closer to experiencing a VR D&D experience.\n\nThe upcoming game, titled Battlemarked, leverages Resolution Games’ Demeo system, which emphasizes a virtual tabletop environment and features gameplay similar to D&D with turn-based combat. Demeo also incorporates an action point system that uses playing cards.\n\nNotably, Battlemarked is the first partnership between Resolution Games and Wizards of the Coast, so it’s expected to feel more like an official D&D experience than Demeo. However, unlike the real thing, Battlemarked doesn’t require a Dungeon Master (DM). Instead, Resolution Games intends for players to concentrate more on strategy and decision-making rather than roleplaying.\n\nAt launch, Battlemarked will have two story-driven campaigns that up to four players can enjoy.\n\nThe game will be available on various platforms, including VR, PC, and console. Although the company did not provide a specific list of supported devices, we do know that Demeo is available on Meta Quest, Pico, SteamVR, PlayStation VR2, PlayStation 5, PC, Mac, and iPad. Battlemarked may launch on these same devices as well.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAlongside the announcement, the company also released a new trailer, showing off the art style from Wizards of the Coast we’ve all come to know and love, as well as some of the classes and races we can look forward to, such as a fighter Dragonborn, a rogue Tiefling, and more.\n\nMuch about the new title is still unclear, including its launch date and price. The details of the campaigns remain unknown as well. Resolution Games has stated that they plan to introduce additional campaigns set in “different D&D settings” in the future. The company declined to answer our questions.\n\nResolution Games is a decade-old gaming studio based in Stockholm, Sweden. It has a wide range of games, including Angry Birds: Isle of Pigs, Cook-Out: A Sandwich Tale, and Spatial Ops, among others. The company has raised around $38.6 million to date, according to PitchBook.\n\nToday’s announcement reflects the ongoing trend of D&D gaining mainstream popularity. It has evolved into a multi-media franchise, including popular web series such as Critical Role and Dimension 20, video games like Baldur’s Gate 3 from Larian Studios, as well as the theatrical release, “Honor Among Thieves.”"}