{"url": "https://techcrunch.com/2022/10/06/google-assistant-gets-an-upgrade-on-pixel-7-with-voice-typing-calling-and-transcription-improvements/", "title": "Google Assistant gets an upgrade on Pixel 7 with voice typing, calling and transcription improvements", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-10-06T00:00:00", "text": "Alongside news of its brand-new Pixel 7 smartphone line and Pixel Watch, Google today also announced a number of ways it’s improving the technology running on its new devices, powered by Google Assistant. With a set of features that will be exclusive to the new Pixel at launch, Google is updating Assistant’s abilities to aid in areas like voice typing, navigating businesses’ phone menus, voice message transcription and more.\n\nMany of these capabilities are updates on existing features Google has already offered Pixel device owners. Last year, for example, Google announced support for voice typing on the Pixel 6, and quick phrases — which let you quick off voice queries without having to say “Hey Google” — were first rolled out to the Pixel 6 and 6a.\n\nNow, Google is updating these and other features to entice consumers to its latest smartphone.\n\nGoogle’s voice typing feature is essentially a voice-to-text solution that allows users to not just type but also edit and send messages using Google Assistant. The company claims it’s 2.5 times faster to use this feature than to type on the keyboard, in fact. Today, Google says the feature will expand to more languages, including Spanish, Italian and French. It will also introduce emoji suggestions and search, which will automatically suggest emojis related to your text and allow users to search for an emoji with their voice. Even if you don’t know the emoji’s proper name, you’ll be able to ask Google Assistant for something like “winky emoji” or “hey emoji,” for instance, and Assistant will select the correct one.\n\nThis feature is not only helpful to speed up typing, in general, it can also be useful as an accessibility feature for people who have difficulties typing directly on their device’s keyboard.\n\nAnother new feature is an expansion on Google’s clever “Direct My Call” service, launched last year for the Pixel 6 devices. The feature is designed to help you navigate the complicated phone menus you encounter when you dial a business’s 1-800 number. Direct My Call uses Google Assistant to translate the various phone tree options for you so you don’t have to listen, you can just read through the options presented on your phone screen and then tap the one that offers the information you want or gets you to a live agent.\n\nWith the Pixel 7, Direct My Call is being updated so you can actually see the phone tree menus before they’re spoken, which saves even more time. To accomplish this, Google says it’s leveraging its Google Duplex AI technology, which has already been put to use in other areas, like making your reservations by phone for you.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We use our state-of-the-art Duplex and Assistant technology to basically understand the menu options of these businesses in advance,” explains Minni Shahi, Assistant’s director of Product Management.\n\n“The Google Duplex technology calls…[and] it actually caches the list of menu options in advance. In other words, Duplex has already called the business and learned the menu options before the user places the call for the first time, allowing it to present the phone tree options. But this is not available for any phone number that has a phone tree, we should note. Instead, it’s focused on U.S.-based businesses that are enrolled in Direct My Call, Google explains.\n\nDirect my Call uses the same technology as Duplex — the technology that also uses AI to call local businesses to ensure hours of operation shown in Search or Maps are up to date. That means businesses don’t need to opt into this feature or take any integration steps, Google tells TechCrunch. Duplex technology works by proactively calling toll-free numbers to understand phone tree options in advance of users calling these numbers themselves. The amount of pre-loaded, toll-free numbers will increase over time, the company added.\n\nMeanwhile, for those who love voice messages when texting, but hate listening to others’ messages back, another new feature will be a big improvement. Google Assistant will now be able to transcribe those messages as soon as you receive them, so you can easily read what the person had to say.\n\nOther updates are more minor, including an addition to the quick phrases that let you access Assistant without the “Hey Google” command. Pixel 7 owners will be able to now say “Silence” without the “Hey Google” voice command to dismiss incoming calls they don’t want to answer.\n\nGoogle will also update its Recorder voice recording app to include speaker labels to differentiate who’s talking.\n\nGoogle Assistant will power the Pixel 7’s new At a Glance feature, which puts information on your home or lock screen, like weather forecasts, package delivery updates, video feeds from a Nest doorbell, flight information and more.\n\nAssistant technology is coming to the new Pixel Watch, too, allowing device owners to send messages, set reminders, control smart home devices, start a run and more, using their voice. And it will work on the Pixel Buds and upcoming Google Pixel Tablet, arriving next year, as well.\n\nThe Google Assistant updates leverage the Tensor chip design Google introduced last year for the Pixel 6. But at launch, the new features will be exclusive to the Pixel 7 line."}