{"url": "https://techcrunch.com/2024/06/06/spacex-launches-mammoth-starship-rocket-and-brings-it-back-for-the-first-time/", "title": "SpaceX launches mammoth Starship rocket and brings it back for the first time", "authors": ["Aria Alamalhodaei", "Reporter", "Space", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-06-06T00:00:00", "text": "SpaceX has shown once again that subjecting rocket hardware to the real-world flight environment pays dividends. In its latest launch, the company achieved a key milestone in its Starship flight test campaign: returning the booster and the upper stage back to Earth in controlled ocean splashdowns.\n\nBringing the two parts of the launch vehicle back — the Super Heavy booster and the upper stage, which is also called Starship — are essential to the company’s long-term plans to make Starship the first-ever fully reusable rocket. But to reuse, you have to recover, and SpaceX is proving that it will be able to do just that with Starship.\n\nThe ultimate goal is to fly Super Heavy and the Starship upper stage back to Starbase, SpaceX’s private Starship launch and development site in southeast Texas, where they’d make vertical landings on solid ground. A controlled ocean splashdown is the first step toward executing this plan. SpaceX was the first company to ever reuse a part of a rocket that’s flown to space, but even its workhorse Falcon 9 rocket is only partially reusable (the second stage is expended in orbit).\n\nStarship lifted off from Starbase at 8:50 a.m. CT, the fourth launch in the rocket test campaign. SpaceX aims to use the rocket to launch heavier versions of its Starlink satellites, deliver astronauts to the moon for NASA, and eventually make life multi-planetary.\n\nAlthough this is only the fourth time that the mammoth Starship has ever launched to orbit, the test went remarkably smoothly. Only one of the 33 Raptor engines on the Super Heavy booster went out, and the company completed its novel “hot-staging” stage separation technique. (During hot staging, the engines on the upper stage ignite temporarily while it is still attached to the booster, essentially helping to “push” the booster away.) SpaceX also successfully jettisoned the “hot stage ring” that sits in between Starship and Super Heavy for the first time, in order to reduce the weight of the booster as it returns to Earth.\n\nShortly after launch, the booster successfully splashed down in the Gulf of Mexico. A little over an hour after launch, Starship followed suit, surviving the extreme heat from traveling through the Earth’s atmosphere at hypersonic speeds and splashing down in the Indian Ocean.\n\nSuper Heavy has splashed down in the Gulf of Mexico pic.twitter.com/hIY3Gkq57k — SpaceX (@SpaceX) June 6, 2024\n\nOf the 18,000 heat shield tiles on the ship, engineers intentionally replaced one with a thinner version and removed two tiles completely in order to “measure how hot things get without tiles in those locations, while also testing some thermal protection options,” the company said. SpaceX CEO Elon Musk later said on X that the ship successfully splashed down despite having a damaged flap and losing “many tiles.” Musk has said before that the heat shield system is “the biggest remaining problem” in Starship development.\n\nStarship has come a long way since its first orbital test flight in April 2023 — that launch saw the mid-air explosion of both parts of the rocket and the dysfunction of many of the rocket engines. Each subsequent test has gone further, and Starship reached orbit for the first time in the third test this past March. During that test, SpaceX also tested capabilities that will be key for delivering payload to space, including opening and closing the payload door."}