{"url": "https://techcrunch.com/2025/03/28/fintech-vc-powerhouse-frank-rotman-stepping-down-from-qed-investors-to-found-his-own-startups/", "title": "Fintech VC powerhouse Frank Rotman stepping down from QED Investors to found his own startups", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-28T00:00:00", "text": "Prolific fintech investor and QED Investors co-founder Frank Rotman said Friday that he will transition to a partner emeritus role by year’s end to focus on founding his own startups.\n\nBut those startups won’t necessarily be financial technology companies. In a post on X, Rotman — who helped start QED in 2007 — declared that “the first business” that he plans “on getting out of the ground is in the music industry.”\n\nHe wrote: “It’s easy to call me crazy for all the obvious reasons, but it’s worth reserving judgment until you learn more about the business that’s evolved in my head and sat on the shelf for years. It will be fun to build and could actually make a huge difference to an industry that none of us could imagine living without.”\n\nRotman started Alexandria, Virginia-based QED, which today has $4 billion in assets under management, nearly two decades ago with Nigel Morris and Caribou Honig. He led the firm’s investment in Credit Karma and played a role in QED’s investments in unicorns such as GreenSky, Flywire, and SoFi. (In fact, QED was the first institutional money into Credit Karma.) Other companies that the firm has backed include Creditas, Nubank, AvidXchange, and Bitso.\n\nQED exclusively invests in companies building financial technology at the pre-seed to Series A stages.\n\nRotman, who goes by the handle “The Fintech Junkie” on X, said he will transition to his new role on January 1, 2026. He will continue to serve in a part-time advisory role to QED over the coming years.\n\nBesides founding music startups, Rotman said he likely plans to write a book centered around his “observations and frameworks for the startup and VC worlds.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nHe wrote in the X post: “This shouldn’t surprise anyone who knows me – writing is my oxygen. I can’t imagine a life without it even though ChatGPT and Claude are better writers than I am.”\n\nIn a statement, QED Managing Partner Nigel Morris noted that he and Rotman had worked together for over 30 years — previously also at Capital One.\n\n“Frank, at his core, is an entrepreneur and I have no doubt he will excel in his next chapter,” he said.\n\nQED Investors’ partner Amias Gerety will be promoted to lead QED’s U.S. investment team."}