{"url": "https://techcrunch.com/2023/08/18/ive-never-seen-so-many-crap-startups/", "title": "I’ve never seen so many crap startups", "authors": ["Matthew Panzarino", "Neesha Tambe", "Startup Battlefield Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2023-08-18T00:00:00", "text": "Startups are so full of shit right now.\n\nThe pipes are jammed and there are so many companies that are full to bursting with the desire to un-pack them.\n\nWe’ve just been through determining the shape of this year’s TechCrunch Startup Battlefield 200 and we are seeing a huge amount of waste recycling, poop and urine startups. Because SBF gets applicants that are often at bootstrap or pre-seed stages, we’re betting that this trend will show up on everyone else’s dance card next year.\n\nOne of the cool advantages of being a first-party witness to the thousands of companies that come through our application pipeline every year is that we see emergent trends bubbling up far sooner than most do. It’s a huge privilege to be able to see the future this way and one of the most exciting parts of our job. We featured generative AI companies five years before the popular investors took notice and climate tech 2.0 was in the Battlefield before it was in vogue.\n\nThis year, it’s all about poop for some reason. We’re seeing input/output startups that want to rewrite the rules of recycling and purification with new tech. Founders focusing on gut health, optimizing the way our bodies process waste and what that can do to the brain. There are insanely stacked teams working on the future of urinalysis. There are companies using new tech that analyzes waste in the aggregate to help catch disease outbreaks in small populations and large. And yes, smart toilets — they will be a thing.\n\nFrom toilet seats to sewer sensors, this arena is booming for a few reasons (breakthroughs in sample size, sensitivity and regulatory bottlenecks mostly).\n\nBlood, of course, remains a hot topic. Using less of it for faster testing is the great white whale.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBodily excretions of all kinds are just all over our screens right now and it’s becoming clear that they’re the only way to really understand what’s happening in our bodies. It’s a big new data rush.\n\nWe’re seeing other wildly interesting trends too.\n\nClean tech – Tied in with the biotech trend, we’re seeing a continued surge in input/output companies that process waste to produce byproducts like energy and potable water. These virtuous cycle companies are largely coming out of academia and are either licensing or minting patents. Carbon capture and removal is on the horizon. It’s deep tech but actionable. We may be so bold as to say it gives us…hope.\n\nMiltech – Once an arena just for contrarian VCs, miltech is booming and there is an appetite for the government sector to outsource R&D to the VC crowd. Drones, sensors, field medicine, space, weapon systems, analysis… you name it. More of the “centrist” crowd is beginning to field these companies in their portfolio. There’s an allegory here to the “wait, weed is legit” wave we saw a few years ago when firms started sliding it out of the “vice clause” column.\n\nSilver tech – Life expectancy is on the rise and the U.S. market is terrible at taking care of elderly and infirm people, in general. Technology that enables people to live longer on their own (not as big a factor in other countries where it is normal for multi-generational households to exist) and to take ownership of their health and care is on the rise. The robotics, AI and biotech sectors all play a part here.\n\nSocial – The category is up in the air, again. After years of moribundity due to the major players being massively entrenched, there is an air of uncertainty as we watch Twitter collapse and many entrepreneurs are taking advantage of the vacuum to try new stuff. There will be interesting experiments and more self-aware takes on social.\n\nFintech – Fintech is going deep over the next year building infrastructure in huge but un-addressed world economies rather than over-indexing on the western markets. Whatever holdover grip that foreign banking and social norms have on those systems is getting unraveled by startups that are creating new ways for populations in those markets to engage with finances. From investing to credit to compliance in local custom, these founders are seeing opportunity in their ability to be more specific and flexible.\n\nOn the AI front, yeah there are a huge number of companies building what amounts to superlayers on top of the foundation of products like ChatGPT — but there’s also a wave of open source companies that are leveraging available models to make life interesting for the big players. But the big trend we’re seeing is that AI is actually everything. Instead of having a pocket of “AI companies,” we looked to the ways that every industry is using ML tools and modeling as an accelerant to their businesses. We’re seeing it speed up internal processes, customer acquisition, marketing and operations. It’s not a new category of companies, it’s a new layer that everyone has to consider mandatory. And yes, we saw that one coming too.\n\nBut, for us, the big bet is in the bowels. ShitVC, now is your time. We’re announcing the Startup Battlefield 200 next week and a whole lot more at TechCrunch Disrupt, coming up on September 19-21st, 2023 — get your tickets now!"}