{"url": "https://techcrunch.com/2025/01/01/robinhood-already-a-comeback-stock-has-even-more-aggressive-plans-for-2025/", "title": "Robinhood, already a ‘comeback’ stock, has even more aggressive plans for 2025", "authors": ["Connie Loizos", "Editor In Chief", "General Manager", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2025-01-01T00:00:00", "text": "Robinhood CEO Vlad Tenev has a lot to celebrate this holiday season. After a bumpy few years following Robinhood’s 2021 IPO — a period during which shares of the commission-free trading app plummeted by more than 90% after it abruptly restricted trading in some meme stocks — the 12-year-old company was just declared Yahoo Finance’s “comeback stock” of the year.\n\nAsked about that accolade in recent days over Zoom, Tenev was beaming. “When we were a young company and just got started, everyone was kind of rooting for us,” said Tenev, who oversees roughly 2,500 employees at Robinhood. “Then at one point we started being treated as an incumbent … the vibe became negative, [and] during COVID, it just became strange. [We] were growing like crazy, but people were unhappy, and we hit our low, and now it has been very positive.”\n\nIt’s what’s around the corner that has Tenev truly excited, however. Like a lot of fintech entrepreneurs, he’s feeling very enthusiastic about a second Trump administration, given that deregulation appears to be a priority, along with a far warmer embrace of cryptocurrency.\n\nUnsurprisingly, he plans to take advantage of the fast-changing landscape. Indeed, during our chat, we talked about “exploding” job offers and about crypto. We discussed copytrading, a trading strategy that allows clients to automatically replicate the trades of another trader. We also talked about prediction markets, where Robinhood plans to increasingly compete with still-private startups like Kalshi and Polymarket that are squarely focused on allowing people to bet on the outcome of future events.\n\nYou can listen to the whole thing here; meanwhile, below, you can find excerpts specifically pertaining to prediction markets that have been edited lightly for length.\n\nI’m seeing that one in 10 Americans [with brokerage accounts] have a Robinhood account, yet you only have a quarter percent of the total retail assets in the United States. Can that be right?\n\nI haven’t heard that stat. I mean, it doesn’t sound crazy to me. There’s trillions [of dollars] of assets [in the world]. Robinhood’s [AUM] is right around $200 billion, so we’ve still got a long ways to go. We’re bigger than when we started, but some of these guys, like the Schwabs and the Fidelitys, have $10 trillion in assets. So we’re still growing, but our assets are growing 40%-plus year over year, rather than 2% to 3%.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhen we last sat down in person, this was a much smaller company with ambitions to become a financial services giant; you’ve since gotten into wealth management and credit cards. I’m wondering about some newer financial mechanisms, like prediction markets; how big an opportunity is there, do you think?\n\nI’ve been a big fan of prediction markets for a long time, and it became clear to me relatively early on that political contracts are the ideal product in that space, because [politics] is very newsworthy and highly correlated to market performance, so useful as a hedge.\n\nThe one other thing was: Everyone watches the polls and early results on election night to figure out what’s going on, and if you’re watching the news, the picture they paint is very unclear, right? They’re doing all this math for you and tabulating [votes], but they’re not really telling you what the odds are of one candidate or the other winning the election. You contrast that with the prediction markets … and I think what’s even more powerful is just distilling where things stand right now based on all the information that’s out there. And that’s a very useful use case, not necessarily for prediction itself, but really for the news.\n\nWe didn’t think it’d be possible to launch [our own presidential election market] for this election because there was the lawsuit with the [Commodity Futures Trading Commission, or CFTC], then Kalshi prevailed in the 11th hour [to offer contracts that pay off as bets on U.S. political elections], and the team mobilized. We put a lot of great people on it, and we went from intending to launch to actually shipping in about two and a half weeks…\n\nDid you ever talk to Kalshi about potentially buying it?\n\nI’ve talked to Kalshi, not about buying it. We ended up working with ForecastEx [a CFTC-registered designated contract market (DCM) for forecast contracts]. And, this is a little bit technical, but we’re an FCM, a futures commission merchant, which is kind of like the customer-facing part of a futures or swaps dealer, and so we need to rely on an exchange functionally to serve as the back end of all these trades. And we ended up using ForecastEx because they had all the licensure to be able to do that. My understanding is that Kalshi is only able to offer it to retail directly, not able to serve other FCMs.\n\nI read that you’ve indicated a move into sports could take the form of event contracts, too.\n\nI think that was taken a little bit out of context. Certainly, our focus is on federally regulated event contracts rather than traditional sports betting. Right now, event contracts do not permit sports outcomes [but] that might change.\n\nYou know, there’s going to be a new CFTC Commissioner [and] a lot of people are interested in sports entering the federally regulated realm. I think those products would look very different from traditional sports betting. But yeah, our focus is on event contracts. I think that’s going to be a big thing. The presidential election market proved to us that there’s a lot of demand for these types of products. We had over half a billion contracts traded in about a week [by more than] half a million people. And so I think that the number one thing we were hearing afterward was: Can we have more contracts? Can this be a more-fleshed-out product and not just for the election?\n\nObviously sports would be huge and perennial. What other types of contracts are you imagining?\n\nThere’s a lot of possibilities. A natural fit for Robinhood is economic ones. You can see some examples of a Fed hike, a Fed drop … anything that’s at the intersection of news and financial markets is interesting to us. In my opinion, news has increasingly started to merge with entertainment.\n\nThere are two ways to look at [event contracts]. One is as an active trader asset, that active traders like to trade alongside options and futures and other things. But the other is as a passive experience, where, if you just want the news, event contracts can be a way to deliver that to you in real time. We’re also thinking about this, and I think that opens up a broader set of possibilities. You can have event contracts on pretty much anything from the Oscars and entertainment events to sports to politics. And the categories of event contracts almost become like the sections of a newspaper, right? Art, style, leisure, sports, business, [the] front page, which is real time. So you can imagine the digital equivalent of a newspaper being delivered via event contracts.\n\nAgain, for much more with Tenev, you can tune in here."}