{"url": "https://techcrunch.com/2022/06/13/meta-pharmaceuticals-funding-china-series-a/", "title": "Meta Pharmaceuticals lands $15M to make autoimmune drugs with AI, new immuno-metabolism tech", "authors": ["Rita Liao", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-06-13T00:00:00", "text": "Biotech startup Meta Pharmaceuticals sets itself an ambitious goal as it secures its initial investment. The Shenzhen-based company, which sets out to develop treatments for autoimmune diseases with the help of artificial intelligence, has raised $15 million from its seed and pre-A rounds.\n\nThere is no lack of investor interest in companies applying machine learning to small-molecule drug discovery. New York-based Immunai picked up $215 million last year to create an “atlas” of the human immune system. Insilico from Hong Kong recently landed $60 million despite undergoing what the CEO dubbed a “biotech winter.”\n\nMeta’s technology falls under the emerging field of immuno-metabolism, which studies the relationship between the historically distinct disciplines of immunology and metabolism. Drugs created using this new method are purported to regulate the immune system more effectively with fewer side effects. Originally from southwestern China, Meta’s co-founder and CEO Xu Ke graduated from Weill Cornell Medicine and conducted research at Memorial Sloan Kettering Cancer Center, one of the top cancer hospitals in the U.S.\n\nMeta is merely 10 months old but is built off the back of an industry incumbent. It’s a project “incubated” by AI-assisted drug discovery and development upstart Xtalpi, which was founded in 2014 and has raised nearly $800 million in funding to date from the likes of Tencent, Softbank Vision Fund and Sequoia Capital China.\n\nInvestors from Meta’s financing rounds included Xtalpi itself, Forcefield Ventures, IMO Venture and Tiantu Capital.\n\nMeta and Xtalpi clearly play complementary roles to each other by working to translate new drug targets into patents and marketable products. Meta’s proposed therapeutic targets will first go to XtalPi for drug discovery or de novo drug design, which refers to computer-assisted molecular design. Once a pre-clinical candidate is identified, Meta may take over to carry out subsequent development, investigational new drug (IND) filing, and clinical trials, an Xtalpi spokesperson told TechCrunch.\n\nMeta claims to have already discovered a series of metabolic protease targets after sifting through thousands of proteases on its AI-enabled target discovery platform.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe startup is using public data for the initial training of its target discovery technology and plans to collect samples and omics data from patients and healthy donors in collaboration with hospitals in China down the road, Xu explained to TechCrunch.\n\n“Our pipeline has the potential to be used for treating a wide range of autoimmune problems, cancer and age-associated diseases,” Xu said when asked about competition. “It’s still too early to share the specifics just yet or limit ourselves to one or two existing drugs and indications.”\n\nHeadquartered inside an innovation free-trade zone in Shenzhen bordering Hong Kong, Meta plans to market its drugs globally. In its infancy, the zone is one of many government-led initiatives to promote technological collaboration between Shenzhen and Hong Kong. Support for startups comes in various forms and in Meta’s case, it means tax exemption on imported lab equipment. The area is also home to Xtalpi and one of China’s largest autonomous driving startups Deeproute.ai."}