{"url": "https://techcrunch.com/2023/07/10/pano-series-a-extension/", "title": "Wildfire detection startup Pano AI extends its $20M Series A with another $17M", "authors": ["Haje Jan Kamps", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-07-10T00:00:00", "text": "Not all use cases for AI make sense, but Pano AI makes a life-saving contribution in the “yes” column. Just last week, the company was able to send early warnings of the Kutch Road Fire, which broke out near Kutch Mountain in Yamhill County, Oregon. The company showed me how it was able to detect fire and issue a warning 14 minutes before the first 911 call — illustrating its value to firefighters, even as the licensing cost per station clocks in at $50,000.\n\nThe company’s solution is to mount high-definition remote-controllable cameras. They can be operated manually by a human operator, or go into scanning mode, where they rotate at about one rotation per minute. The video footage is checked out by an AI, which looks for smoke and fire; if it sees anything, it raises the alarm.\n\n“We design the network of stations so that we can see fires from two stations. Next, we have our own proprietary algorithm where we triangulate and calculate the latitude and longitude that’s really critical because you don’t get this from your 911 call,” Sonia Kastner, CEO of Pano AI explains. “Only 5% of 911 calls are actually a fire, so a 911 call needs to be verified by dispatching a truck. That takes a long time, and you can’t launch a heavy response based on just one call. We double-check that [what the AI detected] is a true fire before we trigger an alert to the fire chief.”\n\nThe combination of early detection and much higher fidelity of the alerts — both in terms of what was detected and where, means that emergency responders can leave the helicopters and bulldozers safely parked when they aren’t really needed — or start moving them toward the fire hours before they would have been able to without Pano AI’s systems.\n\nThe company just closed a Series A extension, and hints at the fundraising environment being hard at the moment.\n\n“If the VC market hadn’t taken a downturn, we would have raised a Series B this year. But there’s been a pullback in the venture capital funding market. Valuations were down, but we’re growing like crazy, and we decided to raise less capital,” Kastner explains of the company’s decision to raise less in 2023 and focus on a larger round next year. She believes the market is recovering as we speak. “We’ll be able to raise a nice big Series B and continue on with our Series B plans. The wildfires aren’t slowing down, so this additional capital now means that we don’t have to slow anything down either.”\n\nPano AI says it raised its current $17 million Series A extension at a slightly higher valuation than last year’s $20 million Series A. The extension round was led by Valor Equity Partners, and added a couple of strategic investors too; T-Mobile Ventures and Salesforce.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We have witnessed Pano AI’s rise as an exemplary leader in climate adaptation. The team’s unwavering commitment to innovation is fueling the development of transformative and scalable solutions to help combat the escalating devastation caused by wildfires,” Abe Yokell, co-founder and managing partner at Congruent Ventures said in a statement. “The urgency to mitigate and prevent the impacts of wildfires has never been more clear, and we are proud to continue supporting Pano’s efforts to address these threats.”\n\nThe partnership with T-Mobile is particularly interesting; Pano AI uses the company both for its 5G network and even uses some of the same masts to mount its hardware. The company’s business model is interesting: Pano AI owns the cameras and infrastructure and sells licenses to its software to companies and organizations. Currently, Pano AI says most of its customers are power utilities, private landowners (such as ski resorts) and government fire agencies, whether on the local, regional or federal level. Notable customers of Pano AI include PacifiCorp, Xcel Energy, Portland General Electric (PGE), Holy Cross Energy, Big Sky Fire Department, Aspen Fire Protection District, Telluride Fire Protection District, Boulder County, Washington DNR, Forestry Corporation of NSW (Australia), Southern Cross Forests (Australia) and Noosa Council’s FireTech Connect Program (Australia).\n\n“Our price varies by customer; we customize the offering, but the typical pricing is $50,000 per station per year per customer,” Kastner explains. The company says it is focusing on its first product for now, responding to international demand for its fire detection platform, before building out its product offering with a Series B financing in 2024. “So for a customer who is subscribing to 20 stations, it would be approximately a million dollars a year.”\n\nThe company currently employs around 45 people, and says it is actively monitoring more than 6 million acres of land.\n\n“I think we have about 100 units deployed, and we’re going to be at hundreds by the end of this year,” Kastner describes. “Right now we are growing rapidly in both the U.S. and Australia. We already have deployments in six states in the U.S., two states in Australia. We’re starting some early discussions in Europe as well.”"}