{"url": "https://techcrunch.com/2025/01/22/angellist-coinlist-partner-to-help-crypto-startups-raise-and-manage-funds/", "title": "AngelList, CoinList partner to help crypto startups raise and manage funds", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-22T00:00:00", "text": "Crypto is making such a big comeback that AngelList and CoinList are launching a way to help raise capital for crypto-specific founders using crypto coins.\n\nThey are teaming up to launch crypto special purpose vehicles (SPVs) and crypto roll-up vehicles (RUVs), the companies shared with TechCrunch exclusively on Wednesday.\n\nThe partnership, they said, will give users a way “to raise with syndicates and manage crypto startup investments the crypto way.” Syndicates are a group of companies or individuals that work together to jointly manage a large financial transaction.\n\nAngelList said the users will be able to fund crypto SPVs in stablecoins — currently for a $0 fee.\n\n“Investors can fund with USDC, which is easier for crypto investors who don’t operate via banks,” said CoinList CEO Raghav Gulati. USDC is the term for a digital dollar, also known as a stablecoin, that can be redeemed 1:1 for U.S. dollars as it is pegged to the dollar.\n\nTokens can be distributed in kind to LPs and are compatible with “many non-U.S. token issuers and investors.” An integration with CoinList’s software is “coming soon,” the companies said.\n\n“The model is significant because investors receive tokens once they are available, instead of receiving cash returns, which is aligned with the crypto ethos of stakeholder participation and self-ownership of assets,” Gulati told TechCrunch.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe crypto roll-up vehicles are designed to collect investments that a founder has raised for a particular round. The advantage, the companies said, is that startups don’t have to worry about “managing compliance for many stakeholders” at an early stage.\n\n“Crypto startups often seek to bring on many angel investors. With RUVs, dozens of angels who need to sign paperwork, send money, and get proper reporting on an ongoing basis can do so with AngelList Crypto RUVs,” Gulati said.\n\nCrypto’s acceptance in the mainstream investor world where AngelList belongs wavered during crypto winter. That’s when all things Web3 fell out of favor and industry bigwigs like Sam Bankman-Fried and Binance founder Changpeng Zhao were sentenced to jail.\n\nBut between bitcoin hitting record highs and the Trump administration’s clear interest in it, crypto is poised to come back in vogue in broader tech circles."}