{"url": "https://techcrunch.com/2020/09/03/amazon-launches-an-alexa-service-for-property-managers/", "title": "Amazon launches an Alexa service for property managers", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2020-09-03T00:00:00", "text": "Amazon wants to bring Alexa to property managers. The company this morning launched a new service, Alexa for Residential, that aims to make it easier for property managers to set up and maintain Alexa-powered smart home experiences in their buildings, like condos or apartment complexes. At launch, IOTAS, STRATIS and Sentient Property Services will be among the first smart home integrators to use the Alexa for Residential service.\n\nThe idea is to make Alexa a tool for smart home management, even for those without their own Amazon account. The way the service works, new residents won’t have to purchase their own device or set anything up to get started. Instead, they can just speak to Alexa to control the various smart home features available at their residence and use basic Alexa features. like timers, alarms or getting information like news and weather.\n\nProperty managers can choose to create custom Alexa skills for each unit, allowing the residents to submit maintenance requests, make amenity reservations or even pay their rent via Alexa.\n\nIf the residents have their own Amazon account, they can go through a few steps to link it to their in-home Echo device. Once linked, the residents would then be able to use Alexa’s full range of features, including the ability to listen to music playlists or call friends and family from the Alexa device, for example.\n\nThe property manager would have no access to the customer’s personal data, in this case — it would be as if the customer had set up their own Alexa device. In addition, the resident’s voice recordings are deleted on a daily basis under the new service.\n\nHowever, when the resident’s lease is up or they move out, the service allows property managers to remotely reset the device to the default settings to be ready for the next resident, without disrupting the device’s existing configurations for smart home management.\n\nThe launch sees Amazon further investing in a market which would allow it to expand Alexa’s footprint without having to increase direct sales of Echo devices to consumers.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAmazon has worked on partnerships in this area before, having teamed up in November 2018 with Zego, now a subsidiary of PayLease, to roll out Alexa smart home devices to 30,000 apartments. Also in 2018, RedAwning partnered with Amazon to launch property management tools, enabled by Amazon’s Alexa for Hospitality service, originally aimed at hotels. Vacation rentals have leveraged Alexa in their own properties for similar integrations, too, as have senior living centers. There are also independent smart home technology platforms aimed at property managers and Alexa skills designed for this space.\n\nMore broadly, Amazon has rolled out other services and announced partnerships that could scale Alexa use in homes through B2B deals, as with its 2018 launch of Alexa for Hospitality or its deal with home builders, like Lennar, to integrate devices in their new construction. The success of these efforts have been hit or miss, as some felt shared devices raise privacy concerns and other deployments have been badly managed.\n\nAmazon is pitching the idea for this latest service as a way for property managers to increase revenues, however. The company cited National Apartment Association data which said 84% of renters want an apartment with smart home amenities and 61% said they would pay a monthly fee for a voice assistant. That data, of course, may not reflect the current economy where the coronavirus pandemic has led to widespread unemployment and has wreaked havoc on the economy. Alexa devices — and an extra fees for their use — may now be seen as more of a luxury, not a necessity."}