{"url": "https://techcrunch.com/2023/11/09/bytedances-oculus-challenger-pico-lays-off-hundreds-halts-aggressive-expansion/", "title": "ByteDance’s Oculus challenger Pico lays off hundreds, halts aggressive expansion", "authors": ["Rita Liao", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-11-09T00:00:00", "text": "When Pico launched its Oculus Quest challenger in China last year, it did so with great optimism. Light (295 grams) and affordable ($420), the virtual reality headset released by the ByteDance-owned manufacturer was expected to drive adoption in a market inaccessible to Meta.\n\nThe odds were against Pico. Its sales have been sluggish, and this week, Pico, which was acquired by the TikTok parent two years ago, initiated a fresh round of layoffs.\n\nThis week, Pico held an internal meeting announcing a major reorganization. A person familiar with the matter told TechCrunch that “a few hundred” employees were let go, leaving Pico with “under 2,000” people.\n\nEven after the layoff, Pico, as it stands today, has a significantly bigger headcount than the team of 200-300 when it was acquired. The shakeup suggests that Pico is regrouping to slash costs and pursue more sustainable growth after a period of aggressive expansion.\n\nIn a statement, a Pico spokesperson said that the unit was restructuring to focus more on “hardware and core technologies.”\n\n“We frequently assess our business needs and make adjustments to strengthen our organization and better align our teams with company goals,” the spokesperson said.\n\nFrequent assessments are indeed needed at a time when China’s post-COVID economic recovery misses expectations. China’s VR shipments shrank by 56% year-over-year in the first half of 2023, according to market research firm Counterpoint.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe slump “marked the end of the Chinese VR market’s two-year growth streak, spanning 2020-2022, and reverting to a state of stagnation,” the report said.\n\nThe decline was due to several factors. For one, Chinese consumers are spending less amid a weakening economy. To weather the tepid economic recovery, Pico has scaled back its marketing investments, leading to a smaller shipment target, according to Counterpoint’s analysis.\n\nAnother contributing factor is the lack of high-quality VR content that’s needed to drive mass adoption. VR technology is still in its infant stage of development, with hardware awaiting some meaningful advancements. At a time when businesses are tightening their belt, it only seems logical for Pico to focus on improving its hardware rather than investing heavily in content creation.\n\nFurther adding to its sales pressure is that in China, youth gaming — arguably one of the largest VR consumer categories — is “heavily regulated, with complicated content vetting processes and legally capped screen time,” suggested Gavin Newton-Tanzer, host of mixed-reality conference AWE Asia. Regulatory barriers also “complicated” Pico’s U.S. launch, said Newton-Tanzer.\n\n“Pico has strong fundamentals, but luck and timing conspired against them, so some degree of restructuring was inevitable due to lackluster consumer sales,” he added.\n\n“While I firmly believe consumer VR in China will have its breakout moment, it just won’t be in 2023. In this context, Pico’s choice to bide its time and focus on hardware makes sense: they’ll continue to make progress in the B2B market while keeping options open for another run at the consumer market in the future.”"}