{"url": "https://techcrunch.com/2020/11/30/the-road-to-smart-city-infrastructure-starts-with-research/", "title": "The road to smart city infrastructure starts with research", "authors": ["Dominik Schiener", "Mathew Yarger", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block"], "publication_date": "2020-11-30T00:00:00", "text": "In the United States, critical city, state and federal infrastructure is falling behind. While heavy investment, planning and development have gone into the U.S. infrastructure system, much of it is not keeping up with the pace of new technology, and some of it hasn’t had a proper update in decades, instead just adding new systems onto old systems. This can be allotted to a combination of liability structures in the U.S., difficulty in enabling interconnection between infrastructure in different jurisdictions, worry over introducing large-scale security risks and an attempt to mitigate that risk.\n\nThere is interest in upgrading city systems to be more efficient, to be more in line with real-time demand and to move into the 21st century, but it’s going to take work. It’s also going to take new technology.\n\nDistributed ledger technology (DLT), when applied correctly, can do for a city’s infrastructure what existing technologies cannot. Where existing technologies are heavy, requiring expensive servers and a larger energy draw, distributed ledger technology is light and can be implemented on individual nodes (code environments) and directly onto things like traffic light sensors. It also allows for more oversight from a privacy perspective. The ability to bring distributed ledger technology into lightweight frameworks allows for more security and upgrades to critical infrastructure.\n\nBenefits of smart infrastructure\n\nThe biggest impact of smart infrastructure is that it enables local governments to focus on the reason they’re there in the first place; to increase the quality of life of the local residents, bring stability and culture to local businesses, and create a welcoming and frictionless environment for tourists or visitors. Governments can create stability, streamline sources of revenue, and integrate a frictionless operational environment for people and organizations in their jurisdiction.\n\nConsider transportation infrastructure. A lot of revenue in cities and states comes from things like tolls and roadside parking, and of course taxes. States control the highways, interstates, and tolling infrastructure commonly through collaboration with service providers. Cities control the local roadside and passthrough streets and the revenue accrued through parking solutions. With the pandemic, these resources have dried up due to people staying at home, social distancing, using less public transit and working remotely.\n\nThis now offers an opportunity for an expanded example of the desire to understand the transportation flow. If cities had more real time insights into this, they’d be able to understand the demand and have a more fluidly flowing traffic condition. This can be done through new technologies such as what are seen deployed in Singapore like green link determinings systems, parking guidance systems, and expressway monitoring systems allowing for enhanced traffic awareness and guidance.\n\nThere are also keen ways to incentivize traffic guidance while bringing stability to local small and medium businesses throughout cities such as using parking guidance systems to enable local businesses to offer discounts for parking nearby.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAn open transportation grid (in the sense of data points gathered for streamlining and managing) can create smoother traffic patterns in cities with smaller road grids. Transportation centers could communicate with delivery services, understanding their routes and setting up parking reservation windows. Traffic flow could be managed so that delivery services are able to get in and out without causing back-ups on tight, busy roads.\n\nAnother offering of smart infrastructure can be seen with cross border connections for transportation of goods and services. The ownership of infrastructure in the U.S. is highly fragmented; with cities owning local and neighborhood roadsides, and states owning highways and interstates. This also means that the infrastructure supporting this is highly distributed, because each entity has to have it’s own systems in place to support their infrastructure, typically using different solutions, services and data structures.\n\nWhen a vehicle is transporting goods and services through different jurisdictions, the infrastructure they’re connecting to belongs to different entities. So the way they connect to that infrastructure, or don’t connect in many instances, changes rapidly and decreases the amount of utility and intelligence that infrastructure can supply at scale. Whether this be a delivery service provider, or a grocery shipment coming across state lines.\n\nThe tolling systems often don’t interoperate so data sharing isn’t even an option in many cases. And the city infrastructure doesn’t connect with the state owned highway infrastructure, so there’s no adequate or cost efficient mechanism to share insights and guide travelers from the highway, into the city, and to an ideal parking area with ease. However, this highly fragmented and distributed system is an ideal area of integration for DLTs, as a lightweight, energy efficient, acting as a connective fabric for these disconnected systems.\n\nAllowing an easier, more secure, and more privacy preserving solution for allowing different jurisdictions to enable the infrastructure they own and manage to share data and insights with the devices and vehicles passing through, without needing to give privileged access to other organizations and put their systems security at risk.\n\nRegardless, all this requires a real-time understanding of what’s going on in the distributed systems that are critical state and city infrastructure.\n\nUsing that real-time understanding to show residents the benefits of a smart city infrastructure, either through discounts or reduced public transit or utilities, is something cities are interested in. They just need to understand and trust the technology before they can implement it without risk.\n\nOvercoming risk with research\n\nCities around the world have implemented smart systems for gathering data on its infrastructure movement. The prime examples of Hong Kong and Shanghai have also become illustrative of the negative consequences of implementing such a system under less resident-centric rules of law. These cities are massively clean and efficient, but also monitor their citizens through the same infrastructure. That is not a benefit of a smart city in the eyes of most residents anywhere in the world.\n\nThat kind of risk, infrastructure being used for surveillance, is just one risk factor that can be mitigated with proper research and testing.\n\nThe other risk factor of course being malicious hacking. Cities are rightfully worried about their systems being hacked with ransomware. No mayor wants to be standing in front of the podium for that news conference.\n\nWhile simply stating that decentralization of the technology on a distributed ledger system isn’t enough to alleviate that feeling of risk, showing it in action can. The willingness layered with the fear of upgrading must be tempered with the reality of understanding. Many of the current practices for understanding new technologies operate in a manner that is known as the waterfall development method. This is defined by when individual organizations may research new capabilities and test new technologies in their private labs, reducing the amount of active feedback they’re getting and limiting the amount of collaboration, while also increasing the costs.\n\nThis results in long time requirements for planning city and state upgrades, and longer and less precise deployment time frames and budges. This leaves some cities in the U.S. using infrastructure systems that are at their core decades old. It’s time to move cities and states towards new, lean, agile ways of testing and developing solutions for them to implement. They just need a place to test it all before implementing.\n\nIn the EU, there are well over 100 regulatory labs. From the EU Policy Lab, the EU Blockchain Lab and so on, these facilities allow for sandbox testing of new technologies and how they can be applied to infrastructure grids, among many other projects. This makes it easier for European cities to make informed decisions about infrastructure changes, to understand how the technology works and how to prioritize its integration. The key benefit being an agile and rapid testing and development process that fosters collaboration while reducing the upfront costs. Governments can often spend substantially less time testing and understanding new technologies prior to implementing them, ensuring that what’s implemented is what’s needed through iterative development. Instead of starting with heavy and expensive procurement processes and siloed research initiatives\n\nIn the U.S., there is no such network of collaborative labs. There are a handful that are starting, but overall the U.S. is at least four to five years behind the EU when it comes to collaborative sandbox testing grounds and lean government processes. There are a number of labs throughout the US, but as mentioned they are often independent labs that are not centralized on the concept of bringing multiple parties from public and private sector together, in an effort to iteratively discover the right path as efficiently as possible\n\nThis is what needs to change before we can begin to truly implement smart infrastructure, especially in larger cities such as Los Angeles. While some cities, such as Austin, TX, are working on their own initiatives in moving toward a smart transportation grid, most lack the finances and ability to simply implement something and need testing and research at a national level. This type of research would alleviate concerns of hacking, regulatory issues and implementation.\n\nMoving forward means letting go\n\nPalo Alto, CA has spent the past few years implementing a smart city plan. Throughout, it has focused on the needs of its ~70,000 city residents, and surrounding population of 1.7 million, to create smart infrastructure that creates as many benefits as efficiencies. It laid the groundwork for other cities of similar size across the U.S., performing its own stringent research and forming partnerships to implement the tech. To do this it required the right leadership and a willingness to shed the physical constraints of past technologies.\n\nTo move forward, other cities must take this tact of ownership. While it would be ideal to have in place a level of local, state and federal collaborative research facilities that would allow cities of any size to develop their own smart infrastructure plans, it’s not a current reality. So until that is in place, cities like Austin and Palo Alto prove that it can be done, it just takes time, research and a desire to toss 50 year-old infrastructure pieces in the trash."}