{"url": "https://techcrunch.com/2024/09/15/a-walk-through-the-crypto-jungle-at-korea-blockchain-week/", "title": "A walk through the crypto jungle at Korea Blockchain Week", "authors": ["Kate Park", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-09-15T00:00:00", "text": "Blockchain technology is all about decentralization and virtualization. So it’s a little ironic that humans love to come together in person at big blockchain events. Such was the case last week in Seoul, where a record 17,000 people and 300 speakers came together for Korea Blockchain Week.\n\nLike traditional tech conferences, the event featured a lot of big names in the field, both the high-profile (Vitalik Buterin, Richard Teng of Binance, and Mark Karpeles among them) and the no-profile (researchers, professors, and many founders of new startups).\n\nUnlike normal confabs, you also got the ha-profile: apes, penguins, ducks, and bears were also on the list.\n\nNo one would ever accuse the crypto world of lacking merry pranksters. But all the same, there remained a strong undercurrent of unease in the crowd. Mainstream adoption appears to have stalled, and with the U.S. elections coming up, there is a big question mark over what regulation will look like going forward.\n\nWe walked the halls of the event, and chatted with lots of attendees. Here are some of our impressions:\n\nBeyond the protocols\n\nHistorically, scalability has been a major issue for blockchains with high fees and slow transaction speeds. Now, second-layer blockchains (so-called “layer-2 blockchains”) have made transactions both faster and cheaper, meaning scalability is no longer an issue for most use cases. The most popular layer-2 blockchains can handle millions of transactions per day without any hiccup.\n\nBut despite that, usage isn’t necessarily picking up, in part because we remain in a kind of application vacuum.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“I think the expectations for real application content have significantly increased,” said Simon Kim, CEO of Hashed, a venture capital firm focusing on blockchain and crypto. Speaking to TechCrunch, Simon highlighted a need for more practical use cases.\n\nThere are some glimmers of that starting to emerge, specifically in the world of IP content tracking. Last month, Story raised $80 million to build a blockchain to help IP owners track usage of their content more effectively. And Sony Block Solutions Labs, a joint venture formed by Sony and Startale Labs, unveiled its new public blockchain network, Soneium, that promises to make it easier for users to protect creators’ rights and share profits fairly.\n\n“These are the industry’s first attempts at creating a content-focused IP ecosystem,” Simon said.\n\nOthers at the show said they were looking for more real-world applications that consumers could grasp.\n\n“For the past six years, we’ve developed various infrastructure — roads and highways — in the crypto world. Now, we need to focus on things people enjoy or use such as convenience stores, clothing stores, and department stores,” according to Steve Lee, co-founder of Neoclassic Capital, a Miami-based crypto investment firm backed by venture capitalists Marc Andreessen, Chris Dixon, and Tampa Bay Lightning owner Jeff Vinik.\n\nThe firm, as it happens, focuses on applications in consumer and financial services. “From a consumer perspective, we are particularly bullish on use cases in gaming IP, entertainment, and social applications,” he said.\n\nNeoclassic launched its first fund in April, and the firm aims to pursue more investment opportunities in these sectors. “While the West may continue to lead in infrastructure development, we view Asia as having greater potential for these [web3 consumer use cases] compared to the West,” he said, citing the high volume of bitcoin trading in the region and its track record in areas like gaming and entertainment. Countries like Japan and Korea, he said, “have been leaders in adopting new technologies faster than any other country in the world.”\n\nOld-school with a side of crypto?\n\nWhile some crypto companies are still looking for breakthrough successes, others are trying to convince traditional enterprises that they should add a crypto twist to their existing products.\n\nJustin Kim, head of Asia at Ava Labs, a blockchain platform focused on decentralized apps (“dApps”) and enterprise blockchain deployments, noted that more organizations are launching their own custom blockchains on top of Avalanche.\n\n“The list includes California DMV, Konami Digital Entertainment, Nexon MapleStory Universe, OtherWorld’s Solo Leveling animation, and financial institutions such as JP Morgan and Citi,” he said.\n\nTokenizing new asset classes is also a recent trend, Justin added. For example, Republic, a New York-based investment platform, is tokenizing funds to support film financing. IT consulting firm Questry and Japanese bank Mizuho Securities are tokenizing a fund to support animated content production. Justin noted that both projects are based on the Avalanche platform.\n\nStablecoins are also making their way into mainstream financial and messaging apps.\n\nOne notable development has been PayPal introducing a stablecoin called PYUSD and other messaging apps like Japanese Line and Telegram integrating crypto wallets. Naver, a part-owner of Line, also recently launched a crypto wallet within its payment app in Korea. “Stablecoin] trading activity is picking up,” Simon said.\n\nHashed collaborates with other traditional companies such as Korean entertainment company HYBE, Japan-headquartered gaming company Nexon, financial institutions KB Kookmin Bank in South Korea, and Siam Commercial Bank in Thailand, Simon said.\n\nAnother area that’s drawing attention from the industry, he pointed out, is the gaming space. The gaming industry is one of the fastest-growing sectors, particularly with the increase in online transactions, Simon added.\n\n“So there’s content, and then the AAA games are going to start pouring out of the market later this year,” Simon said. In the past, blockchain-based games with experimental tokens or NFT ownership were released while still in the experimental phase. “Now, well-made, high-quality games are coming out.”\n\nYat Siu, co-founder and executive chairman of Animoca Brands, a Hong Kong-based game and software company that also operates a web3 VC firm, disagreed, saying that gaming projects, which have basically been launch pads for tokens, so far haven’t done that well.\n\n“People are not excited about [gaming] right now, but I think we will come back,” Siu said.\n\nIn the same way, NFTs are not grabbing people’s attention at the moment, but boosters still have hope.\n\n“Back in the early days, when people didn’t see the internet as interesting or real, they just kept building it, and eventually it just grew, right? That’s pretty much how I see the [NFT] space as well,” Siu added.\n\nBig backers, and bigger regional forces\n\nIn 2023, lower- and middle-income countries were driving cryptocurrency adoption; this year, adoption is spread more evenly between richer and poorer countries, said Diederik van Wersch, regional director of ASEAN and Hong Kong at blockchain data platform Chainalysis.\n\n“The mainstream adoption of cryptocurrency could be a result of the launch of Bitcoin ETFs, which triggered an increase in the total value of Bitcoin activity across all regions,” van Wersch told TechCrunch.\n\nIn keeping with that, institutions are facilitating the adoption of cryptocurrency in nations such as Singapore and Indonesia, he said. The U.S. followed a similar pattern. When the U.S introduced a Bitcoin ETF, Siu said it was a step change for the market.\n\n“Tokens that have institutional backing tend to do better. That’s how things are shaping up for crypto moving forward,” Siu said.\n\n“In Singapore, we’re seeing a rise in the use of crypto merchant services, while in Indonesia, crypto is being used as a trading instrument and has become one of the fastest-growing crypto markets in the region with the highest year-over-year growth at nearly 200%,” van Wersch said.\n\nThat’s not all good news: As more people adopt it, there will likely be more crime, he added. “As adoption grows, so will crime. And today, crypto is encompassing all types of crime — including fraud and narcotics.”\n\nImage Credits:Kate Park / TechCrunch\n\nBullish on Telegram’s future (despite Durov’s arrest)\n\nThe arrest of Telegram founder Pavel Durov in France last month definitely led to an aftershock for the Telegram-linked Toncoin, which slumped in price in the wake of the news. But by the time KBW rolled around just a week later, the mood was buoyant.\n\nRushi Manche, co-founder of Movement Labs, told TechCrunch that Telegram had become a useful communication tool for many in the crypto community, and that was not likely to change in the short term.\n\n“What happened to Pavel Durov and what’s happening with Telegram and TON is proof that decentralization is working quite well. Despite the fact that Pavel was arrested, everything was still working,” Siu told TechCrunch. “I would say it’s a net positive and, to me, shows the resilience and strength of decentralization and the benefits of running something on the blockchain. So I’m long-term bullish on TON and Telegram.”\n\nAnimoca Brands is an investor in TON, the blockchain that is deeply integrated into the messaging app.\n\nSimon acknowledged one takeaway from the incident: It highlighted how new regulations need to be created to manage these virtual spaces independently, because there are no physical borders in the digital world and states can’t control what’s on the internet.\n\nImage Credits:Kate Park under a TechCrunch license.\n\nRegulation remains a major hurdle\n\nRegulation time and again came up as the biggest concern among people we spoke to at KBW, and not just among those working in Asian crypto, but those from other regions, too.\n\n“Until a few years ago, many blockchain builders had established their headquarters in Singapore,” Simon said. “Most recently, the UAE has emerged as the most industry-friendly country, providing clear regulations and guidelines within the nation.”\n\nRegulations — and specifically the clear establishment of light regulation — have shaped where development has thrived.\n\n“The main concern we hear is the need for regulatory clarity across different Asian jurisdictions,” said Manche of Movement Labs. “However, this is driving a push for more coherent, innovation-friendly policies. Regulatory clarity should improve globally, potentially accelerating institutional adoption. We also foresee a focus on sustainable blockchain solutions and innovative token economics.”\n\nA lot of it has been piecemeal, however. Japan was the first mover in this space, and Singapore started early, too, with a light-touch regime focused on anti-money laundering (AML) and countering the financing of terrorism (CFT), according to Chengyi Ong, head of policy for the APAC region at Chainalysis. Then Hong Kong and India followed suit with their own regulatory framework. “And that’s how we ended up with a regulatory patchwork,” she said.\n\nThe U.S. election in November could be a moment when some of this finally comes to a head in that country. “Depending on who wins, this industry will accelerate faster. But I think crypto will grow in America regardless,” Siu said. “This is not an endorsement, by the way.”"}