{"url": "https://techcrunch.com/2025/05/14/youtube-introduces-an-interactive-product-feed-for-shoppable-tv-ads/", "title": "YouTube introduces an interactive product feed for shoppable TV ads", "authors": ["Lauren Forristal", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-05-14T00:00:00", "text": "YouTube made its pitch to advertisers on Wednesday, accompanied by a flashy performance from Lady Gaga and special appearances from popular YouTubers like Brittany Broski and MrBeast.\n\nDuring its Upfront presentation, YouTube executives introduced new ad formats coming to the platform, including an enhanced shoppable connected TV (CTV) offering that includes a new interactive product feed.\n\nThe move is strategic for YouTube, as it recognizes that viewers often watch videos on the big screen while also using their phones to scroll through social media or shop online.\n\nThe new shoppable format allows advertisers to display products on the right side of the TV screen during ads. The interactive feed acts as a storefront for brands where viewers can easily browse multiple products using their remotes. When a viewer selects an item, they’re prompted to scan a QR code with their smartphone to get a direct link for purchase.\n\nAdditionally, there’s a button for viewers to press and hold, allowing them to send the link to their phones to shop for all the products at once.\n\nImage Credits:YouTube\n\nYouTube has become a dominant force in TV viewing. Nielsen reported that it has been the top platform for streaming watch time in the U.S. for over two years, surpassing streaming giants Netflix, Disney+, and Prime Video. In the first quarter of 2025, TVs were the primary device for YouTube viewing in the U.S., according to internal data from the company.\n\nNotably, the company pointed to a Kantar survey, indicating that U.S. participants ranked YouTube as the No. 1 platform for seeking out information about brands. The company also said YouTube campaigns on CTV generated over 50 million monthly average conversions in the fourth quarter.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nShoppable ads have gained traction among streaming services and advertisers in recent years. Just this week, Amazon announced a new interactive shoppable ad format on Prime Video that highlights Amazon deals, user reviews, and Prime shipping details."}