{"url": "https://techcrunch.com/2021/11/30/amazon-announces-the-preview-of-aws-private-5g/", "title": "Amazon launches preview of new AWS Private 5G managed service", "authors": ["Aisha Malik", "Consumer News Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-11-30T00:00:00", "text": "At Amazon’s AWS re:Invent conference this morning, the company announced the preview of “AWS Private 5G,” which is a new service that aims to make it easy to deploy and manage your own private network. The launch is meant to address the challenges companies are facing with leveraging 5G. AWS CEO Adam Selipsky said that with AWS Private 5G, you can set up and scale a private mobile network in days instead of months.\n\n“You get all the goodness of mobile technology without the pain of long planning cycles, complex integrations and the high upfront costs,” Selipsky stated during the company’s keynote. “You tell us where you want to build your network and specify the network capacity. We ship you all the required hardware, the software and the SIM cards.”\n\nSelipsky outlined that AWS Private 5G automates the setup and deployment of the network and scales capacity on-demand to support additional devices and increased network traffic. There are no upfront fees or per-device costs with AWS Private 5G, and customers pay only for the network capacity and throughput they request.\n\n“Customers want to build their own private 5G networks to address these limitations, but private mobile network deployments require customers to invest considerable time, money and effort to design their network for anticipated peak capacity, and procure and integrate software and hardware components from multiple vendors. Even if customers are able to get the network running, current private mobile network pricing models charge for each connected device and make it cost prohibitive for use cases that involve thousands of connected devices,” the company said in a blog post about the new service.\n\nAmazon outlines that AWS Private 5G simplifies deployment allowing customers to deploy their own 4G/LTE or 5G quickly, scale up and down the number of connected devices rapidly and benefit from a familiar on-demand cloud pricing model."}