{"url": "https://techcrunch.com/2025/01/23/quantum-vc-qdnl-hits-e25m-first-close-on-new-fund/", "title": "Quantum VC QDNL hits €25M first-close on new fund", "authors": ["Mike Butcher", "Editor At Large", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-23T00:00:00", "text": "VC investment into quantum computing declined by 50% last year according to the “State of Quantum 2024” report, dropping from $2.2 billion in 2022 to $1.2 billion, with funds switching in favor of generative AI. However, government spending on quantum was predicted to hit $40 billion over the next decade. Now a new VC European fund hopes to capitalize on that trend.\n\nThe idiosyncratically named QDNL Participations has reached a €25 million first close on a proposed €60 million global fund for early-stage quantum startups.\n\nHowever, QDNL plans to expand outside the country and make investments more internationally.\n\nThe firm’s previous €15 million fund focused on the Dutch quantum ecosystem, backing startups including Qblox, QuantWare, QphoX, and Q*Bird.\n\nSpeaking to TechCrunch, Ton van ‘t Noordende, general partner at QDNL Participations, said: “Quantum is a global field. There’s been incredible research done in the past decade or so and we’ve seen the emerging of a new, startup ecosystem, with 600 or more companies coming up. There’s also been more than $42 billion invested by over 20 governments in the last two or three years. So this has built up the infrastructure, the clean rooms, the facilities, and essentially de-risking the technology.”\n\nQDNL’s appearance is the latest sign that the Netherlands is making a play to be a key quantum computing ecosystem, and the government (with EU financial backing) has already backed an entire initiative called Quantum Delta NL, which also just happens to be an investor in QDNL.\n\nIts team includes quantum computing pioneer Chad Rigetti as venture partner in the U.S. and specialist quantum VC Kris Kaczmarek in London, who joined as investment director from quantum VC firm 2xN. They join advisors Nadia Carlsten (CEO of the Danish Centre for AI Innovation) and Charles Marcus of the University of Washington.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nQuantum computing had a tricky start to the year with both Mark Zuckerberg and Nvidia’s Jensen Huang sounding downbeat on when Quantum would arrive. But Nvidia did a quick about-turn and announced a quantum-exclusive Nvidia Day at its upcoming event in March."}