{"url": "https://techcrunch.com/2021/01/07/f5-snags-volterra-multi-cloud-management-startup-for-500m/", "title": "F5 snags Volterra multi-cloud management startup for $500M", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-01-07T00:00:00", "text": "Applications networking company F5 announced today that it is acquiring Volterra, a multi-cloud management startup, for $500 million. That breaks down to $440 million in cash and $60 million in deferred and unvested incentive compensation.\n\nVolterra emerged in 2019 with a $50 million investment from multiple sources, including Khosla Ventures and Mayfield, along with strategic investors like M12 (Microsoft’s venture arm) and Samsung Ventures. As the company described it to me at the time of the funding:\n\nVolterra has innovated a consistent, cloud-native environment that can be deployed across multiple public clouds and edge sites — a distributed cloud platform. Within this SaaS-based offering, Volterra integrates a broad range of services that have normally been siloed across many point products and network or cloud providers.\n\nThe solution is designed to provide a single way to view security, operations and management components.\n\nF5 president and CEO François Locoh-Donou sees Volterra’s edge solution integrating across its product line. “With Volterra, we advance our Adaptive Applications vision with an Edge 2.0 platform that solves the complex multi-cloud reality enterprise customers confront. Our platform will create a SaaS solution that solves our customers’ biggest pain points,” he said in a statement.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nVolterra founder and CEO Ankur Singla, writing in a company blog post announcing the deal, says the need for this solution only accelerated during 2020 when companies were shifting rapidly to the cloud due to the pandemic. “When we started Volterra, multi-cloud and edge were still buzzwords and venture funding was still searching for tangible use cases. Fast forward three years and COVID-19 has dramatically changed the landscape — it has accelerated digitization of physical experiences and moved more of our day-to-day activities online. This is causing massive spikes in global Internet traffic while creating new attack vectors that impact the security and availability of our increasing set of daily apps,” he wrote.\n\nHe sees Volterra’s capabilities fitting in well with the F5 family of products to help solve these issues. While F5 had a quiet 2020 on the M&A front, today’s purchase comes on top of a couple of major acquisitions in 2019, including Shape Security for $1 billion and NGINX for $670 million.\n\nThe deal has been approved by both companies’ boards, and is expected to close before the end of March, subject to regulatory approvals."}