{"url": "https://techcrunch.com/2024/04/25/gravitics-to-develop-tactically-responsive-orbital-platforms-for-the-space-force/", "title": "Gravitics to develop ‘tactically responsive’ orbital platforms for the Space Force", "authors": ["Aria Alamalhodaei", "Reporter", "Space", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-04-25T00:00:00", "text": "Space station module developer Gravitics scored a $1.7 million contract from the U.S. Space Force to develop orbital platforms to enable responsive space missions.\n\nThe contract is part of a larger push from the Force to procure space capabilities — like launch, satellite payload integration, and even satellite operations — from private industry on timelines that have been previously unheard of. The initiative is called tactically responsive space, or TacRS, and it’s already resulted in record-breaking missions: Firefly Aerospace’s Alpha rocket left the pad just 27 hours after it received its launch notice from the Space Force under its TacRS contract last year.\n\nWhile Gravitics was unable to provide more details as to the exact concept of operations, startup co-founder and CMO Mike DeRosa did clarify in an email that the company is not putting a module on a rocket for a tactically responsive launch. Instead, the mission is related to developing “platforms to enable a new kind of tactically responsive space mission,” he said.\n\nThe $1.7 million contract was awarded by SpaceWERX in partnership with Space Systems Command’s Space Safari Program Office. In a statement, Space Safari’s director of operations Lt Col Jason Altenhofen, said Gravitics’ module “offers an unconventional and potentially game-changing solution for TacRS.”\n\n“As we look into the future, the innovative use of commercial technologies will be an important aspect to solving some of our toughest challenges,” he said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nGravitics will be working with several other companies under the contract, including Rocket Lab, True Anomaly, Space Exploration Engineering and Eta Space. While there are scant concrete details about how the firms will work together, the company said the partners will “assist in refining mission architecture, developing use-case specific outfitting, and developing flight hardware.”\n\nRocket Lab and True Anomaly were awarded separate responsive space contracts for a mission called Victus Haze earlier this month. Under that contract, each company will build spacecraft that will then be rapidly commissioned and readied for rendezvous operations in orbit."}