{"url": "https://techcrunch.com/2024/06/13/spotify-creative-labs-ad-agency-for-advertisers/", "title": "Spotify announces an in-house creative agency, tests generative AI voiceover ads", "authors": ["Lauren Forristal", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-06-13T00:00:00", "text": "Spotify announced on Thursday that it’s venturing further into the ad space with its first in-house creative agency called Creative Lab, helping brands create custom marketing campaigns. It will also begin testing generative AI ads, the company said.\n\nThe launch of Creative Lab shows that Spotify is ramping up its efforts to attract advertisers to the platform. This could likely be an attractive offering for marketers, as they’ll be able to reach Spotify’s 615 million listeners.\n\nAdditionally, Spotify is working on a new AI tool for advertisers: “Quick Audio,” which enables brands to create scripts and voiceovers using generative AI. A company spokesperson told us the tool will soon launch in Spotify Ads Managers.\n\nImage Credits:Spotify\n\nA Spotify exec had earlier said the company was looking to use AI to generate host-read ads for podcasters.\n\nBrands will be able to work with the new Creative Lab team to produce things like video and audio ads, in-app digital experiences and other interactive ad formats like call-to-action (CTA) cards, the spokesperson told TechCrunch.\n\n“Every campaign Creative Lab touches is highly customized to each specific brand and business need,” the spokesperson said.\n\nSpotify used client Rockstar Energy Drink as an example, which launched a “Press Play” livestreamed concert series within the music streaming app, featuring artists like British rapper Stormzy. Another beverage company, Aperol, will also be a Creative Lab client."}