{"url": "https://techcrunch.com/2024/12/05/chainalysis-permanently-parts-ways-with-its-founding-ceo/", "title": "Chainalysis permanently parts ways with its founding CEO", "authors": ["Connie Loizos", "Editor In Chief", "General Manager", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-12-05T00:00:00", "text": "Michael Gronager, the co-founder and longtime CEO of Chainalysis, has agreed to leave the company permanently, two months after taking a temporary personal leave of absence.\n\nChainalysis, a buzzy 10-year-old, New York-based blockchain data platform, will now be led by co-founder Jonathan Levin, as Levin told TechCrunch, explaining that on Tuesday, its board of directors gave him Gronager’s job. But Levin, who has long served as the outfit’s chief strategy officer, will do more than run the company as CEO; he will also maintain his other roles.\n\n“I’ve been running R&D, and I think the CEO should be the chief product officer, so I’m making no changes to our R&D leadership team; it will continue to report directly to me,” he said in an interview on Wednesday.\n\nLevin declined to provide more information about Gronager other than to say that Gronager is also no longer on the Chainalysis board but retains his equity in the company.\n\nA message to Gronager on Wednesday from TechCrunch went unreturned.\n\nAsked about Chainalysis’ financial health, Levin said the startup is “continuing to invest in our growth,” and that “we don’t need to raise capital. We raised $175 million in 2022 and [still] feel strong about the cash position of company.” He added that his focus will be on “executing, the expansion of our risk platform, and going deeper with our government clients across the world to ensure they can deal with the increased demand of crypto.”\n\nChainalysis, whose early investors include Benchmark, was valued by investors at $8.6 billion during that 2022 funding round. Crypto investor Katie Haun, who first discovered Chainalysis in her capacity as federal prosecutor, reportedly began buying up secondary shares of the company at a valuation of $2.5 billion this past April.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nConsidered a “crypto detective,” one whose clients include the U.S. government and a wide range of corporations, Chainalysis in late 2023 laid off slightly more than 15% of its staff of 900, with plans to focus more squarely on government contracting, according to The Block.\n\nThe entire crypto industry has been in bounce-back mode in more recent weeks, as the incoming Trump administration signals a far friendlier stance toward digital currencies. The most obvious proof point: The price of bitcoin reached a record high of $100,000 on Wednesday.\n\nAbove: Levin at a StrictlyVC event hosted by TechCrunch in November 2024."}