{"url": "https://techcrunch.com/2024/05/23/expressable-brings-speech-therapy-into-the-home/", "title": "Expressable brings speech therapy into the home", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-05-23T00:00:00", "text": "Leanne Sherred, a pediatric speech therapist, has long encountered challenges putting caregiver-led therapy into practice in traditional care settings.\n\nResearch suggests that caregiver-led speech therapy, which involves training the caregivers of patients in skill-building therapeutic techniques to use at home, can be highly effective. But as Sherred observed in the course of her practice, therapists often have limited access to caregivers and face serious educational and tech roadblocks.\n\nIn 2020, around the start of the pandemic, Sherred saw an opportunity to attempt a new, tech-forward speech therapy care model, one that put caregivers “at the center of care” (in her words). She teamed up with Nick Barbara (Sherred’s spouse), Spencer Magloff and Ryan Hinojosa to found Expressable, a platform that offers one-on-one virtual sessions with speech language pathologists.\n\n“Layered on top of Expressable’s synchronous care is a platform that includes multimedia home programming, interactive weekly practice activities, therapist SMS support and more,” Magloff, Expressable’s chief marketing officer, told TechCrunch in an interview. “With Expressable, speech therapy isn’t limited to one to two times per week, void of caregiver participation.”\n\nExpressable is covered by some insurance plans (including Medicaid) but also offers private pay rates and accepts HSAs and FSAs. It matches patients with speech therapists who might be able to meet their needs and fit their schedules. The matched therapist develops a treatment plan and then regularly meets with the patient and/or their caregiver for online sessions.\n\nImage Credits:Expressable\n\nSome aspects of the plan are designed to be done on the patient’s own time, through Exressable’s self-service platform. Patients and caregivers can track progress week-to-week toward goals and milestones in their individualized plans.\n\nExpressable, which caters to both adult and child patients with conditions ranging from language disorders to speech delays, aphasia, stuttering and autism spectrum disorder, differentiated itself early from many other telehealth startups by hiring its health specialists as W2 employees as opposed to contractors. While this increased Expressable’s medical licensing burden, it positioned the company well to handle challenging speech cases, Magloff says, which often require intensive, years-long treatment plans.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“With Expressable, parents and caregivers become active members of their patient’s care team, extending care into the home and throughout the entire therapeutic progress for faster outcomes,” Magloff said.\n\nThe digital and telehealth sector enjoyed liberal access to capital in the height of the pandemic but has cooled noticeably. But Expressable is bucking the trend, earlier this week closing a $26 million Series B round led by HarbourVest Partners with participation from Digitalis Ventures, F-Prime Capital and Lerer Hippeau.\n\nWith $50 million in the bank, Expressable plans to make improvements to its care delivery model and core tech, expand its payer relationships and grow its network of therapists as well as its operational team. The company’s also experimenting with various forms of AI, Magloff says.\n\n“There are a number of relevant AI use cases we’re currently exploring or adapting to improve the client experience,” he added. “These could help catalog common speech errors, reduce administrative burdens on clinicians and improve operational efficiency.”"}