{"url": "https://techcrunch.com/2024/05/07/machine-learning-aids-in-discovery-of-sperm-whale-alphabet/", "title": "Machine learning aids in discovery of sperm whale ‘alphabet’", "authors": ["Brian Heater", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-05-07T00:00:00", "text": "Researchers at MIT CSAIL and Project CETI believe that they have unlocked a kind of sperm whale alphabet with the aid of machine learning technologies. Results from the study, which were published under the title, “Contextual and Combinatorial Structure in Sperm Whale Vocalizations,” point to key breakthroughs in our understanding of cetacean communication.\n\nThe study deals with codas — a series of clicks that serve different linguistic functions. “What we have discovered is that there is previously undescribed variation in the coda structure,” CSAIL director Daniela Rus told TechCrunch. “We have discovered that coda types are not arbitrary, but rather they form a newly discovered combinatory coding system.”\n\nWhile whale vocalization has been a key subject of research for decades, the teams behind this new research suggest that they’ve uncovered a level of previously unknown nuance among the chatty sea mammals. The paper notes that previous research has noted 150 different sperm whale codas.\n\n“A subset of these have been shown to encode information about caller and clan identity,” it explains. “However, almost everything else about the sperm whale communication system, including basic questions about its structure and information-carrying capacity, remains unknown.”\n\nThe teams drew on work from Roger Payne, the pioneering marine biologist who passed away last June. Payne’s most influential work involved the songs of humpback whales. “He has really inspired us to want to use our most advanced technologies to want to have a deeper understanding of the whales,” says Rus.\n\nThe teams deployed machine learning solutions to analyze a dataset of 8,719 sperm whale codas collected by researcher Shane Gero off the coast of the small eastern Caribbean island, Dominica.\n\n“We would get the inputs, and then we adjust our machine learning, to visualize better and to understand more,” explains Rus. “And then we would analyze the output with a biologist.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe team’s method marked a change from older analysis, which studied individual coda. A richer picture forms when the sounds are studied in context, as exchanges between whales. Contextual details are classified using music terminology. That includes tempo, rhythm, ornamentation and rubato. From there, the team isolated what it refers to as a sperm whale phonetic alphabet.\n\n“This phonetic alphabet makes it possible to systematically explain the observed variability in the coda structure,” says Rus. “We believe that it’s possible that this is the first instance outside of human language where a communication provides an example of the linguistic concept of duality of patterning. That refers to a set of individually meaningless elements that can be combined to form larger meaningful units, sort of like combining syllables into words.”\n\nThe meaning of those “words” take on different meanings based on various context. The paper adds:\n\nOur results demonstrate that sperm whale vocalizations form a complex combinatorial communication system: the seemingly arbitrary inventory of coda types can be explained by combinations of rhythm, tempo, rubato, and ornamentation features. Sizable combinatorial vocalization systems are exceedingly rare in nature; however, their use by sperm whales shows that they are not uniquely human, and can arise from dramatically different physiological, ecological, and social pressures.\n\nWhile the breakthrough is exciting for all involved, there’s still a lot of work to be done, first with sperm whales and then potentially broadening out to other species like humpbacks.\n\n“We decided to go to sperm whales because we had an extensive dataset, and we have the possibility of collecting many more datasets,” says Rus. “Also, because the clicks form a kind of discrete communication system, it is much easier to analyze than a continuous communication system. But even Roger Payne’s work showed that the songs of humpback whales are not random. There are segments that get repeated and there is interesting structure there. We just haven’t gotten to do an in-depth study.”"}