{"url": "https://techcrunch.com/2025/03/17/snap-expands-spectacles-capabilities-with-gps-and-hand-tracking-features/", "title": "Snap expands Spectacles’ capabilities with GPS and hand-tracking features", "authors": ["Lauren Forristal", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-03-17T00:00:00", "text": "It’s only been around six months since Snap released the fifth generation of Spectacles, its AR glasses for developers, and the company is already enhancing its latest pair with new Lenses and platform features.\n\nSnap announced on Monday that it’s launching the ability to create Spectacles-focused Lenses that tap GPS, new hand-tracking capabilities, and more. Now, developers can build Lenses using GPS, GNSS (Global Navigation Satellite System), compass heading, and custom locations, allowing them to access geo-location data and create things like AR walking courses.\n\nThe update is primarily aimed at improving location-based experiences on Spectacles.\n\nSnap showcased a few examples that utilize the new capabilities, such as NavigatAR from Utopia Labs, which directs users with Snap Map Tiles by displaying glowing arrows to assist wearers in reaching their destinations.\n\nOther new platform features for Spectacles include the aforementioned hand-tracking capabilities, which detect grab gestures and when a user has a phone in their hands. Snap also now lets developers easily add a leaderboard to their Lenses for competition-focused experiences.\n\nAdditionally, there’s a new AR keyboard.\n\nImage Credits:Snap\n\nSpectacles are currently accessible only through Snap’s developer program, which costs $99 per month.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nHowever, Snap recently introduced a 50% discount for educators and students, indicating that its long-term goal is to bring AR experiences to the masses while also helping it compete with tech giants like Apple, Google, and Meta.\n\nAlongside today’s announcement, Snap unveiled a series of challenges that will award $20,000 to Spectacles-owning developers who create the top 10 best Lenses each month. Called the “Spectacles Community Challenges,” the series begins April 1."}