{"url": "https://techcrunch.com/2023/01/05/qualcomm-partners-with-iridium-to-bring-satellite-messaging-to-android-phones/", "title": "Qualcomm partners with Iridium to bring satellite messaging to Android phones", "authors": ["Brian Heater", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-01-05T00:00:00", "text": "For the past several CESes, Qualcomm’s big announcements have largely revolved around automotive news. There will likely still be a fair bit of that this week, as well, but the company just announced an upcoming mobile feature in this down time between the Snapdragon Summit and MWC.\n\nThe Southern California chipmaker is partnering with Iridium to bring satellite messaging to select Android devices, starting with those running its new flagship SoC, Snapdragon 8 Gen 2. The technology utilizes the 5G Modem-RF Systems on the Qualcomm hardware, coupled with Iridium’s satellite constellation to deliver emergency messaging, following in the recent footsteps of Apple and T-Mobile.\n\nGarmin is in the mix here, as well, adding support by way of its Response feature built atop the Iridium network for emergency messages in remote locations where no carrier coverage exists. That technology was built with hikers in mind, though certainly there are plenty of other scenarios in which such SOS features could prove a literal life saver.\n\n“Garmin Response supports thousands of SOS incidents each year and has likely saved many lives in the process,” Garmin VP Brad Trenkle says in a release, “and we are looking forward to collaborating with Qualcomm Technologies and Iridium to help people connect to emergency services no matter where life takes them.”\n\nApplications include two-way emergency texting and messaging applications beyond SMS, using Iridium’s L-band. With today’s news, Qualcomm is opening access to the feature up to OEMs. The first batch of smartphones to get the feature will be arriving this year. I’d anticipate some more concrete announcements on that front right around MWC."}