{"url": "https://techcrunch.com/2024/10/17/sam-altmans-worldcoin-becomes-world-and-shows-new-iris-scanning-orb-to-prove-your-humanity/", "title": "Sam Altman’s Worldcoin becomes World and shows new iris-scanning Orb to prove your humanity", "authors": ["Maxwell Zeff", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-10-17T00:00:00", "text": "Worldcoin, the Sam Altman co-founded “proof of personhood” crypto project that scans people’s eyeballs, announced on Thursday that it dropped the “coin” from its name and is now just “World.” The startup behind the World project, Tools for Humanity, also unveiled its next generation of iris-scanning “Orbs” and other tools at a live event in San Francisco.\n\nCo-founder and CEO of Tools for Humanity, Alex Blania, said the project’s old name “just doesn’t work anymore,” potentially signaling the startup is looking to expand its identity beyond its original cryptocurrency mission. (Eye-scanning initially was seen as a way to get access to Worldcoins, though the founders say this never happened.)\n\nOpenAI’s CEO, Sam Altman, spends a good chunk of his time working on World, Blania told TechCrunch during a press conference, but said the two startups’ missions are independent from each other. However, Blania didn’t rule out that World’s cryptocurrency could be incorporated into ChatGPT one day.\n\n“Well, he’s a co-founder and he’s been so from the beginning. So, we talk a couple times a week. He’s involved in all the decisions,” Blania told TechCrunch.\n\n“Of course, he’s focused on OpenAI,” Blania continued. “How tied is World’s success to OpenAI? I think actually not at all. I think these are two very separate missions, and I think AI is heading where it’s heading, and we think what we built here is very important infrastructure for the world, and that will not change.”\n\nWorld executives, who would like to scan your eyeball, during a press conference. Image Credits:Maxwell Zeff\n\nThe World project is predicated on the idea that advanced AI systems — like the one Altman’s OpenAI is trying to build — will one day make it impossible to tell whether you are talking to a human online. Its solution is “human verification services” based around blockchain. The startup also promises to make the benefits of AI accessible to everyone, potentially by redistributing the wealth generated by AI to people through its Worldcoins.\n\nIf all this sounds a bit dubious, you’re not the only one who thinks so. Governments around the world — including Kenya and countries in the EU — have probed and suspended Worldcoin over the years over privacy, security, and financial concerns. The Kenya investigation concluded, allowing World to continue operating, but some of those EU investigations are ongoing, and World’s fate there remains uncertain.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAltman and Blania detailed World’s four-step roadmap onstage Thursday. The first and second steps — developing the Orb and building a distributed ownership network with blockchain — are already done, Blania said. The last step is redistributing the benefits of AI, but before we get to that, we have to complete the third step: scale. World had several announcements on Thursday, including the launch of a new blockchain and a new app, but they all revolved around scaling up the company’s 7 million verified humans to something much larger.\n\nIn order to do that, the World team needs to scan more eyeballs across the globe. And to that end, Tools for Humanity unveiled its next-generation Orb on Thursday. The startup promised everyone (including TechCrunch) attending the live event would receive an Orb to take home, though it’s not immediately clear how individuals would put it to use.\n\nThe new Orb. Image Credits:Maxwell Zeff\n\nThe new Orb is easier to mass-produce, has fewer parts, and operates three times faster. Tools for Humanity says people will soon be able to verify themselves at coffee shops, and announced a partnership with the No. 1 delivery service in Latin America, Rappi, so people can schedule a home Orb verification.\n\nAlso on Thursday, Tools for Humanity unveiled Deep Face, an attempt to combat online deepfakes and impersonation using the company’s human-verification services. The startup said Deep Face could be used to augment apps like FaceTime, Zoom, and X but provided no details on how that would happen.\n\nThe startup announced a beta of its World ID credential, an alternative to government IDs for use online. They aren’t meant to replace national IDs, an executive clarified during a press conference, but could let people verify their identities online without giving up too much extraneous information, like they might by uploading a driver’s license or passport.\n\nAdoption may be an obstacle for the World project moving forward. At the event, Tools for Humanity asked guests to verify their own identity by presenting their government-issued ID. Trusting a cryptocurrency company with your identity is a big ask for most people, but especially one led by Sam Altman, who has been accused of lying to OpenAI’s board.\n\nCorrection: Tools for Humanity is the startup behind the project, World. A previous version of this story did not make clear that World is not a startup, itself."}