{"url": "https://techcrunch.com/2022/08/04/armed-with-19-5m-liveeo-plots-a-big-data-course-between-satellite-geospatial-information-and-industry/", "title": "LiveEO plots big data course", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-08-04T00:00:00", "text": "When it comes to geospatial and mapping data and how they are leveraged by organizations, satellites continue to play a critical role when it comes to sourcing raw information. Getting that raw data into a state that can be usable by enterprises, however, is a different story. Today, a Berlin-based startup called LiveEO, which has built a satellite analytics platform to do just that, has raised €19 million ($19.5 million) on the back of strong demand for its tech from companies working in transportation and energy infrastructure.\n\nThe rise of companies like LiveEO comes on the back of a period of rapid commercialization in infrastructure intended to be used in space, typified by companies like SpaceX but also others building, for example, a new wave of satellites themselves. As with the larger opportunity in enterprise IT, big data players like LiveEO are essentially the second wave of that development: applications built leveraging that infrastructure.\n\n“Someone has to build applications for end users to really make it simple to use and integrate that data into processes,” explained Daniel Seidel, who co-founded and co-leads LiveEO with Sven Przywarra. “That is what we are doing at scale.”\n\nMMC Ventures is leading the investment, which is not tied to a specific round, and in addition to €17 million of venture capital, the round also includes backing from two public bodies, the European Commission and Investitionsbank Berlin. Previous backers Dieter von Holtzbrinck Ventures (DvH Ventures), Helen Ventures, Matterwave and motu ventures, and new backers Segenia Capital and Hannover Digital Investments (HDInv), are also participating. LiveEO had previously raised a €5.25 million Series A in 2021, and it said that in that time, it’s tripled revenues with customers in five continents and more than doubled its headcount to about 100, with more than half of those engineers and data scientists.\n\nAs a German company, LiveEO is one of a small but growing group of startups in Europe capitalizing on increasing interest in space among investors in recent years, despite the wider pressures on tech finance. Relatively speaking, though, the sums are still modest compared with other areas of tech: LiveEO says that this €19 million round is one of the largest in earth observation tech in Europe. LiveEO is focused on enterprise, specifically industrial applications for its analytics — although given the geopolitical landscape, and how that is bringing a new host of interested parties playing the part of financiers to foster its growth, it will be interesting to see how that develops.\n\nLiveEO’s platform addresses a specific gap between space tech and enterprise data. Satellites are collectively producing more data about our world than ever before, covering not just physical objects in the most minute detail, but thermal progressions, how systems are moving and more.\n\nIronically, a lot of that data is very locked up when it comes to enterprises using it: Given the fragmentation in the satellite industry itself, the data is not only often in very raw formats, but coming from multiple sources, too, so getting it into forms that can be integrated into existing IT systems and specifically (and more trickily) the IT systems that integrate with the infrastructure that is the building block of a lot of industrial deployments — let alone parsing it for insights — are all tall tasks, so much so that the opportunities of doing them often go unrealized.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe core of the company’s platform brings all this together, in what LiveEO describes as an “infrastructure monitoring suite powered by satellite imagery.” This involves taking the earth observation data produced by satellites and applying AI to it to analyze it in the context of what LiveEO’s industrial clients — which include major railway companies like Deutsche Bahn, or the energy company e.on — are seeking to understand better.\n\nThat could include data on risks from vegetation on railways or other lines; ground deformation; or other physical movements or activities; and it also includes the ability for a LiveEO user to directly integrate this data to link up with its own IT management systems for its infrastructure, for example those that monitor systems to make sure they are working as they should. It also pitches its solution as greener: using satellites to source the kind of geographic data that these industrial applications need means no need to use on-the-ground teams and vehicles to source it in other ways.\n\n“One of the great advantages of satellite data is that we don’t require hardware to be installed at the infrastructure itself,” said Przywarra.\n\nThat data, they believe, is also more complete: As Seidel describes it, the combination of terabytes of data from multiple sources means it is not just 3D, but “4D” — with thermal and other kinds of details available, “is like the difference between using an image from a smartphone, and a high-end camera with high resolution.”\n\nAll of this is also still a relatively new field, Przywarra added. “Prior to Google Earth, satellite maps were only used by experts,” he said. “We enable more non-experts to use satellite data. We make it accessible and usable.”\n\nLead investor MMC is one of the more prominent deep tech investors in Europe, and it’s notable that they’re putting focus in this area as an opportunity.\n\n“We are excited to lead this round for LiveEO and it reflects MMC’s continued focus on emerging datasets and companies that develop AI analytics to power core business decisions,” said Andrei Dvornic, a principal at MMC Ventures, in a statement. “LiveEO offers a critical tool that paves the way for sustainable industry automation, and we wholeheartedly support the company’s vision of leveraging satellite technologies, big data, and the latest developments in artificial intelligence to help companies adapt to the challenges posed by climate change.”\n\nUpdated to correct that this is not a Series B."}