{"url": "https://techcrunch.com/2024/05/03/cloud-revenue-accelerates-21-to-76-billion-for-the-latest-earnings-cycle/", "title": "Cloud revenue accelerates 21% to $76 billion for the latest earnings cycle", "authors": ["Ron Miller", "Enterprise Reporter", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block"], "publication_date": "2024-05-03T00:00:00", "text": "If you were concerned about slowing cloud infrastructure growth for a time in 2023, you can finally relax: The cloud was back with a vengeance this quarter. The market as a whole was up a healthy $13.5 billion to $76 billion, up 21% over the first quarter in 2023, per Synergy Research.\n\nThat’s healthy growth by any measure.\n\nIf you’re wondering what’s driving the growth, you probably guessed that it’s related to generative AI and the copious amount of data required to build the underlying models. Whether it’s Microsoft’s close links to OpenAI, Google Cloud making a slew of AI announcements at its recent customer conference or Amazon’s infrastructure managing the data side of the equation, AI is driving lots of business for these vendors.\n\n“There is a symbiotic relationship between the rapid advancement and adoption of AI and the scalable ‘Big 3’ cloud infrastructure providers,” said Rudina Seseri, founder and managing partner at Glasswing Ventures, a firm that invests heavily in AI startups. “AI actually makes the cloud providers more valuable. By creating more capabilities for computing through automation and augmentation within the enterprise, there is a corresponding increased demand for the underlying computational power provided by the Big 3 cloud infrastructure vendors, as evidenced by their immense growth in recent quarters.”\n\nSeseri also sees the cloud vendors making it easier for startups to build on top of their infrastructure in the coming years. “For startups, many depend on the cloud providers, having built atop these immense platforms. I predict we will see immense investment in AI-optimized infrastructure by the major cloud platforms, as it is a key driver behind the sustained growth in cloud computing, which will make it easier to build AI platforms and products on the cloud,” she said.\n\nAnd these companies are reaping the financial windfall for the newfound interest in this technology. Altimeter partner Jamin Ball reports that those rewards started coming in last quarter, and the ball kept on rolling into this one. Amazon cloud growth had dropped as low as 12% in Q2 and Q3 last year, climbing a bit to 13% in Q4. But the company really kicked it up a notch this quarter with revenue of $25 billion, up 17% over the prior year. That’s a $100 billion run rate, good for 31% market share.\n\nBall’s numbers indicate that Azure continues to kill it. The company now has 25% market share, good for a $76 billion run rate, up 31% over the previous year. Google is a strong third with 11% market share, up 28% YoY (although it’s important to note that Ball’s number includes Google Workspace, and Synergy’s numbers are only infrastructure and platform numbers).\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nImage Credits: Jamin Ball Image Credits:Jamin Ball\n\nThe days of cost cutting in the cloud appear to be over. And although we probably aren’t going back to the heady growth numbers of 2021 and 2022, AI seems to be bringing a new wave of substantial growth to the cloud vendors.\n\n“In terms of annualized run rate, we now have a $300 billion market, which is growing at 21% per year,” Synergy’s chief analyst John Dinsdale said in a statement. “We will not return to the growth rates seen prior to 2022, as the market has become too massive to grow that rapidly, but we will see the market continue to expand substantially. We are forecasting that it will double in size over the next four years.”\n\nAs companies’ continuing thirst for AI and the data management related to that grows, it seems that the cloud glory days are back. The growth may not be as gaudy as back in the day, but it’s still pretty darn good for a maturing industry sector, with all signs pointing to solid growth in the coming years."}