{"url": "https://techcrunch.com/2022/11/15/apple-emergency-sos-via-satellite-hands-on/", "title": "Supported iPhones in the US and Canada can now contact emergency services via satellite", "authors": ["Kyle Wiggers", "Ai Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-11-15T00:00:00", "text": "Months after it was announced at an event in September, Emergency SOS via satellite, Apple’s service for the iPhone 14 and iPhone 14 Pro that uses satellite to route emergency calls, launched today. Supported iPhones in the U.S. and Canada updated with the latest iOS 16 can send an SOS even when they’re off the grid, no dish required, thanks to an upgraded wireless chipset and Apple’s partnership with satellite service provider Globalstar.\n\nEmergency SOS via satellite will expand to France, Germany, Ireland and the U.K. next month, Apple announced this morning.\n\nAs my colleague Devin Coldewey noted in his coverage of Emergency SOS earlier this year, the service differs from the satellite-based data and text connectivity offered by Lynk and T-Mobile and Starlink. While those rely on cell towers strong enough to reach and receive a satellite signal, Emergency SOS — via Globalstar — uses bands that normally require a special antenna.\n\nIt’s a costly venture. Apple recently pledged $450 million through its Advanced Manufacturing Fund toward expanding the infrastructure powering Emergency SOS, including the satellite network and ground stations. A part of the funding went toward installing custom-built antennas designed to receive signals transmitted by Globalstar’s satellite constellation.\n\nOne presumes that Apple intends to eventually recoup its investment. But for now, Emergency SOS is fee-free. Existing iPhone 14 and iPhone 14 Pro owners won’t have to pay for at least two years from today, while new iPhone owners will receive free service for two years from when they activate their phones.\n\nOn a drizzly Friday morning in Brooklyn’s Prospect Park, I — along with other reporters — had a chance to give Emergency SOS a test drive ahead of the launch. Apple spokespeople arranged for us to place calls to 911 using the service, albeit calls that weren’t actually routed to first responders.\n\nSo how’s the experience? Pretty smooth, I must say. Emergency SOS can be activated either by dialing an emergency number or automatically through Siri or the crash detection feature on the newer iPhone and Apple Watch models and fall detection on the Apple Watch. (In non-emergencies, Emergency SOS can also be used to send your location to friends and family via the Find My app.) After dialing 911, once Emergency SOS detects that cell and Wi-Fi service is unavailable, a prompt appears to launch Emergency SOS via satellite.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhile active, Emergency SOS prompts you to select one of several types of emergencies — e.g. illness, crime, physical injury — and provide details about the emergency, such as whether you’re struggling to breathe or have medication handy. If you’ve set up emergency contacts, you can choose to notify them along with emergency responders.\n\nAt this stage, Emergency SOS will instruct you to point your phone at the nearest satellite, showing an animation that indicates when you’ve locked on to the signal. If you’re not in a position to do so — say, unconscious or incapacitated — Emergency SOS will, where cellular and Wi-Fi aren’t available, attempt a satellite connection even if there isn’t a clear view.\n\nIn my tests, Emergency SOS reliably found a signal through the thick tree branches in Prospect Park. The time to lock on varied from just a few seconds to as long as 10, though Apple says that lock-on success will depend on a number of factors, including the weather and obstructions in the way of the antenna. Like most satellite-based services, Emergency SOS doesn’t work indoors.\n\nApple also notes in a support page that mountains, steep hills and canyons can block Emergency SOS via satellite’s connection. But Prospect Park is devoid of these, so I wasn’t able to truly put Emergency SOS through its paces. Alas.\n\nPost-connection, Emergency SOS texts the answers to the aforementioned questions along with your phone’s battery life, location (including elevation) and — if you’ve entered it beforehand — basic medical information to either a public safety answering point (the local call center where emergency calls usually end up) or an Apple-operated emergency relay center. Which party receives the satellite-bound texts depends on whether the nearest public safety answering point supports text to 911. If it doesn’t, staffers in the emergency relay center will communicate the info to an emergency responder via voice, acting as intermediaries.\n\nFollow-up Emergency SOS texting happens in iMessage, where responders can ask about your specific location and current status. A notification shows the sending progress of each message; send times can range from a few seconds to up to around a minute for weaker signals.\n\nIt’s worth noting that Emergency SOS via satellite, as it currently exists, has a number of limitations. It’s only available in English, Spanish and French in Canada and the U.S., as mentioned — excluding Guam and American Samoa. It might not work in places above 62° latitude, such as northern parts of Canada and Alaska. And international travelers who purchased iPhones in mainland China, Hong Kong or Macao can’t use it.\n\nBut it’s safe to assume we’ll see Emergency SOS via satellite evolve in the coming months to years, particularly if it someday gains a premium component — or Apple Watch support."}