{"url": "https://techcrunch.com/2024/10/20/thrones-toilet-camera-takes-pictures-of-your-poop/", "title": "Throne’s toilet camera takes pictures of your poop", "authors": ["Brian Heater", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-10-20T00:00:00", "text": "Throne is an Austin-based health startup. It sells a camera. That clips onto the side of a toilet bowl. It takes pictures of your poop. Currently in beta, the system utilizes artificial intelligence to examine your dookie as a way of determining things like gut health and hydration.\n\nTurns out we have a surprising amount to learn from our logs.\n\nThrone calls its underlying technology “artificial gut intelligence.” That AI is “trained by physicians to help you understand what your waste is trying to tell you about your health,” per the company. The doctors are looking for various signs of health found in waste matter, including “nuances” in urine to determine hydration levels.\n\nThe company is quick to note that the images are “anonymized.” TechCrunch reached out to the company to get a better idea of what Throne is doing to address the inevitable security and privacy red flags that arise when discussing a toilet camera.\n\nImage Credits:Throne\n\nAt TechCrunch’s behest, the firm on Friday posted a “privacy and security” page outlining some of those measures. At the top of that list, no doubt, are the joint questions of what, precisely, Throne is recording and how it uses those images. The camera is mercifully trained down at the bowl.\n\n“We only capture images of the contents of your toilet bowl,” Throne writes. “Any other data is irrelevant to our mission and could compromise our ability to provide accurate health insights. We use image recognition technology to automatically delete any non-relevant images. This ensures that only toilet-related data is retained.”\n\nUsers can request full access to their data to see what manner of crap Throne is collecting. The company will also delete everything upon request. All data is encrypted by TLS 1.2 or higher on the company’s servers.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We do not access an individual’s data,” Throne adds. “Our team only analyzes anonymized, aggregated data, which means the data can’t be traced back to the original user — to you!”\n\nFew of us expect to get into the toilet camera business. That much can be said about Throne’s founders. CEO Scott Hickle tells TechCrunch that the startup began life as a marketplace for healthcare staffing, only to realize almost immediately that it had entered an already overcrowded field.\n\nImage Credits:Throne\n\nShortly after raising an initial $1.2 million from investors, including Night Capital, Rief Ventures, and Hustle Fund, the company found itself at a crossroads.\n\n“Within six weeks we came to the painful realization that the market was saturated and not a sandbox we wanted to play in,” says Hickle, “so we pivoted, and our investors were shockingly cool with us tackling consumer hardware.”\n\nThrone didn’t just pivot. It pivoted to poop. The company is focused on both the aging population and those with chronic digestive conditions, including Crohn’s disease, ulcerative colitis, and IBS.\n\nIf that sounds like you — and you’re able to get past the idea of mounting a camera to your toilet — Throne’s system is up for preorder following a limited beta. The going price for a smart toilet camera is $499, though the company is making it available for $299 if you want to get in on it early."}