{"url": "https://techcrunch.com/2022/03/02/indonesian-agritech-agriaku-reaps-6m-in-pre-series-a-funding/", "title": "Indonesian agritech AgriAku reaps $6M in pre-Series A funding", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-03-02T00:00:00", "text": "AgriAku, a Jakarta-based B2B marketplace for farmers, announced today it has raised a pre-Series A of $6 million. The round was led by Go-Ventures, with participation from MDI Arise, MDI Centauri, Mercy Corps Social Venture Fund and angel investors. The funding will be used on hiring and increasing AgriAku’s market penetration.\n\nThe marketplace enables retailers to buy supplies, including seeds, fertilizers and agrochemicals, from wholesalers and manufacturers. Then the retailers sell those items to farmers. AgriAku’s goal is to give retailers and farmers a bigger selection of products and access to transparent pricing. It also gives suppliers business software, like bookkeeping and inventory management tools, to help them make forecasts about what farmers will need.\n\nAgriAku’s marketplace launched in May 2021 and the company says it has seen average month-on-month growth of 200% in gross merchandise value over the past four months. The number of active users on AgriAku is now about 10,000 registered farmer stores.\n\nThe company was launched last year by Irvan Kolonas, also founder of social enterprise agritech startup Vasham, and Danny Handoko, who was previously CEO of Airy, an Indonesian hospitality startup. The team also includes Rezky Haryanto Agustia, former assistant vice president for supply chain and operations at e-commerce giant Bukalapak.\n\nKolonas told TechCrunch that AgriAku is a “culmination of a lifelong mission for me, as I first took on the mission 10 years ago with the start of my first company Vasham, a social enterprise, doing a full close-loop, full-stack model helping smallholder corn farmers.”\n\nAfter spending years trying different models, including direct-to-farmer and retail stores, Kolonas said he realized it was not sustainable to sell directly to farmers.\n\n“Instead, we believe firmly now that the most important stakeholder is the Toko Tanis. The Toko Tanis are our mitras or agents who distribute not only inputs but eventually other services to farmers. We want to leverage the decades of relationship that have been built up by them as community leaders with the farmers in their surrounding areas.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAgriAku is the latest among several agritech startups in Indonesia that have recently announced funding rounds. Other B2B marketplaces include TaniHub Group, which focuses on connecting farmers with customers to sell their produce. Kolonas said AgriAku eventually also wants to enable farmers to sell produce by connecting them to offtakers or factories like rice millers or corn dryers\n\n“Indonesia’s agricultural industry contributes significantly to the economy, at approximately 13.5% of GDP,” Go-Ventures partner Aditya Kamath said in a statement. “However, the upstream agricultural market is highly fragmented with a disorganized value chain for agricultural inputs such as seeds, fertilizers and agrochemicals. AgriAku’s B2B input marketplace platform is ideally positioned to improve price transparency and market access for all stakeholders in the agricultural inputs sector.”"}