{"url": "https://techcrunch.com/2025/04/03/x-may-soon-start-selling-inactive-usernames-to-verified-organizations-starting-at-10k-code-reveals/", "title": "X may soon start selling inactive usernames to Verified Organizations starting at $10K, code reveals", "authors": ["Sarah Perez", "Consumer News Editor", "Kyle Wiggers", "Julie Bort", "Maxwell Zeff", "Marina Temkin", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size"], "publication_date": "2025-04-03T00:00:00", "text": "X’s plan to boost revenue by selling off dormant usernames on its service is starting to shape up. According to recent changes found in X’s web application, the company is setting up a “handle inquiry” process that will allow Verified Organizations — companies and other organizations that already have a $1,000 per month X subscription — to bid on abandoned X handles. Those bids will start at $10,000 and may range to over $500,000, according to an FAQ discovered in the web app.\n\nThe updates were first spotted by reverse engineer Nima Owji, who told TechCrunch that he saw the changes to the web app go live on Wednesday. The website where organizations could acquire a handle is not yet live to the public, however.\n\nThe idea of making money by selling handles is something X floated before under Elon Musk’s ownership. The New York Times reported in January 2023 that the company, then still called Twitter, was considering setting up an online auction process for bidding on handles.\n\nMusk has also long supported the idea of freeing up X’s namespace for active users, having already purged a number of inactive accounts on the service back in May 2023.\n\nIn November 2023, Forbes also reported that X was actively soliciting buyers who may be interested in acquiring unused handles, but a formal announcement was not made. X’s documentation on inactive accounts states that the company “cannot release inactive usernames at this time,” though there have been some reports of people buying usernames on X outside of an official process.\n\nBy allowing companies to officially buy their desired usernames, X could generate another revenue stream outside of subscriptions, ads, and developer access. The move could also encourage other X users to keep posting if they don’t want their handle to become dormant and then go up for sale.\n\nSo far, the FAQ details the answers to a handful of common questions X users may have about the process, including how to start a handle inquiry, what the sales process is like, and how the transfer will work.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAs the still-nonpublic website explains, interested users will work with an automated support bot to start an inquiry about a username they want to purchase, and X will respond if the handle is available within three business days. After the handle is purchased, it will be transferred to the new owner within one or two days, or it can be moved to another account the business already owns, the FAQ states.\n\nDiscounts may also be available for those purchasing multiple handles at once, depending on the number and size of the quote, the website notes.\n\nX was asked for comment on its plans around handles but did not respond."}