{"url": "https://techcrunch.com/2023/08/03/haus-which-helps-companies-measure-marketing-roi-raises-17m/", "title": "Haus, which helps companies measure marketing ROI, raises $17M", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-08-03T00:00:00", "text": "Several years ago, Zach Epstein was leading marketing measurement initiatives at Google, helping large corporate customers to build out measurement infrastructure. After leaving the tech giant, Epstein — who observed while at Google that this type of infrastructure tended to be expensive and complicated — set out to build what he describes as an affordable, streamlined “growth intelligence” platform to enable brands to measure the impact of their media spend.\n\n“The digital marketing industry is under more scrutiny than ever,” Epstein told TechCrunch in an email interview. “New privacy regulations are rolling out and platforms are more concerned about user privacy and data sharing. This creates an opportunity for new companies to create value using novel econometric and machine learning techniques.”\n\nEpstein’s platform, Haus, is designed to be used by any brand spending on marketing across one or more channels (e.g. social media, SMS, display advertising and so on). With Haus, users can configure on-demand regional experiments to test different marketing strategies and conduct demand forecasts, accounting for the effects of seasonality and a business’ general health.\n\n“Enterprise organizations have extreme difficulty differentiating signal from noise in their marketing efforts,” Epstein said. “Large organizations have a lot of organic momentum, and it can be very difficult to isolate the impact of marketing … Using Haus, marketers, board members, executive teams and finance are able to evaluate the effectiveness of their marketing relying only on their own internal data.”\n\nIndeed, companies often struggle to measure a marketing campaign’s return on investment (ROI). The reasons are myriad, but as one survey reveals, many marketing leaders aren’t confident in their employer’s own data. Complicating matters is a lack of alignment on the measurement of marketing ROI; the same survey found that marketing, sales and finance teams at 40% of companies can’t agree on a definition of “successful ROI.”\n\nYet, thanks to macroeconomic headwinds, marketers are under increasing pressure to show that they’re making gains. Responding to a Marketing Week poll, 77% of CMOs said that they feel the need to prove their campaigns are providing “enhanced short-term ROI,” lest their CEOs redirect their budgets.\n\n“The broader slowdown in tech, and the economy writ large, has pushed organizations to think about profitability and efficiency,” Epstein said. “In this market, every dollar is being scrutinized, and Haus’ platform enables companies to run experiments that identify what works and what drives profitability.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhether or not there’s truth to that, Haus has found success since its launch in 2021, growing its customer base to around 25 brands. That momentum, in turn, has attracted investors. Haus today announced that it raised $17 million in a funding round led by Insight Partners, bringing its total raised to $24 million.\n\nEpstein says the proceeds will be put primarily toward growing Haus’ headcount from 24 to roughly 35 by the end of the year.\n\n“This new money will allow Haus to continue to hire world-class economists, data scientists and engineers to build out the suite of analytics tools on the Haus roadmap,” he added. “Haus will be looking to scale its go to market efforts, generating broader awareness for these tools.”"}