{"url": "https://techcrunch.com/2024/08/05/uks-riverlane-scores-75m-to-correct-quantum-errors/", "title": "UK’s Riverlane scores $75M to correct quantum errors", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-08-05T00:00:00", "text": "Quantum computing may still largely be in the theoretical domain, but the money that it’s attracting is very real. Riverlane, a specialist in quantum error correction technology, has raised $75 million to continue expanding its R&D and operations to build its operations amid a surge of interest from quantum computing customers — technologists hard at work building what could be the next great leap in computing power, if only they can tame those fail rates.\n\nRiverlane believes it holds the answer to that problem: The startup is building technology that fits on chips used in quantum computing systems and can track, predict and fix the errors generated by quantum bits (known as qubits).\n\n“Even five years ago, I would have said that only one of these qubit types is going to work,” said Steve Brierley, Riverlane’s founder and CEO, in an interview in his Cambridge office. “But actually, what we’ve seen is they’ve all progressed [along a] Moore’s law rate. It seems to me that the pieces are in place to get to the first generation of error-corrected quantum computers. And this will be really significant because it will be the first time that a quantum computer goes beyond the capability of any supercomputer.”\n\nSources close to the company told TechCrunch that with this round, Cambridge, England-based Riverlane’s valuation is now above $400 million.\n\nAnd for a company that is working on breaking completely new ground in a cutting-edge field, it’s achieved another kind of first with this fundraise: It’s the first quantum computing startup in Europe to raise a Series C.\n\nIn itself, this is a signal that — while quantum computing specialists are still working to scale their models — the industry is moving into more mature growth funding on the heels of confidence and commitment that they will.\n\nA trio of investors who describe themselves as focused on sustainability are coming in as first-time backers of the startup with this round. Planet First Partners is leading the Series C, with participation from ETF Partners and Singapore’s EDBI. Previous backers Cambridge Innovation Capital (CIC), Amadeus Capital Partners, the U.K.’s National Security Strategic Investment Fund (NSSIF), and Altair also invested.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nQuantum computing efforts are somewhat based on a leap of faith, as much of the concept has been proven only on smaller-scale efforts. Founded by Brierley while he was still a research fellow at Cambridge, where he had been researching how to solve the problem of error rates, Riverlane is very much part of that continuum.\n\nHowever, visiting the startup’s offices in Cambridge, there are clear signs of how activity is gradually moving from concept into production. The company has built an operations center where it is remotely linking up with early quantum computers before embedding chips into physical systems.\n\nRiverlane focuses on a product it calls Deltaflow, a combination of QEC chips and hardware, as well as software, which it says will be capable of correcting billions of errors per second.\n\nIf used in a system today, the company says the tech would represent a massive jump for current quantum computing efforts, which can typically run a few hundred operations before failing due to error rates.\n\nThe idea is that using error correction tech like Deltaflow can improve operations enough to run millions of operations, and with time, trillions of them. That would in turn make quantum computers usable for calculating and working on the thorniest and most complex problems in areas like pharmaceuticals, transportation, chemistry and more (perhaps even in AI applications).\n\nThe company’s vision — it’s still very much a vision, even with more than 100 engineers and other specialists (it’s hiring more now) and some customers — is laid out in a quantum error correction (QEC) roadmap that it published in July, which lays out what it plans to release in future products.\n\nRiverlane doesn’t disclose its full list of customers but said it includes Rigetti Computing, Alice & Bob, QuEra Computing, Infleqtion, Atlantic Quantum and the Oak Ridge National Lab in the U.S. and the U.K.’s National Quantum Computing Centre (NQCC).\n\n“We invest in companies with the potential to have a transformative impact on society and the environment,” said Nathan Medlock, managing partner at Planet First Partners, in a statement. “Riverlane’s focus on quantum error correction, coupled with its collaboration with quantum computer makers worldwide, can accelerate the global market and enable new quantum computing applications that can substantially contribute to solving social and environmental issues.”\n\nUpdated to correct the spelling of Steve Brierley."}