{"url": "https://techcrunch.com/2025/05/13/government-email-alert-system-govdelivery-used-to-send-scam-messages/", "title": "GovDelivery, an email alert system used by governments, abused to send scam messages", "authors": ["Zack Whittaker", "Security Editor", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Kyle Wiggers", "Cindy Zackney", "Amanda Silberling", "Theresa Loconsolo", "Anthony Ha"], "publication_date": "2025-05-13T00:00:00", "text": "An email notification system used by U.S. federal and state government departments to alert residents to important information has been used to send scam emails, TechCrunch has learned.\n\nThe U.S. state of Indiana said Tuesday that it is “aware of fraudulent messages purportedly sent by state agencies” to residents about unpaid tolls. TechCrunch has seen one email message sent from an Indiana government department that claimed the recipient had an outstanding toll balance, and contained a disguised link that redirected to a malicious site.\n\nA statement from the Indiana Office of Technology said it was “working with the company that was used to deliver those messages to stop any further communication.”\n\nIndiana said a contractor’s account was hacked and used to send the scam messages. The state said it was not aware of “any current state systems” being compromised, but did not rule out an earlier breach.\n\nThe statement said that the contract with the unspecified company, which TechCrunch has learned is govtech giant Granicus, ended in December 2024, but the state claimed that the company “did not remove the state’s account.”\n\nWhen reached for comment, Granicus spokesperson Sharon Rushen told TechCrunch: “We are aware of the recent malicious emails sent via GovDelivery from Indiana’s government domain.” The company confirmed the breach was caused by a compromised user account, but did not comment on Indiana’s claims.\n\n“Granicus systems themselves were not breached,” said Rushen. When asked, the company said it does have the technical means to determine how many individuals received the malicious emails, but did not immediately provide a figure of those affected.\n\nOther local governments are also reporting issues related to GovDelivery. When asked about this, Granicus said the company has “seen an uptick in targeted social engineering of govDelivery customers with the goal of sending malicious emails through govDelivery systems.”\n\nFake toll messages are an increasingly common scam, as the Federal Trade Commission warned in January. The scam involves sending text messages and emails that claim the recipients owe money to tolling agencies across the United States. By targeting email systems used by governments to notify the public, scammers are hoping victims will be more likely to open official-looking emails.\n\nA person who received the scam message shared the email with TechCrunch. The scam email was sent from an official Indiana government email address associated with the state’s Emergency Operations Center, which coordinates responses and alerts in the event of a natural disaster or other emergency events. The email claimed the recipient had unpaid tolls in Texas, and that “failure to pay may result in penalties or vehicle registration holds.”\n\nThe scam email contained a link, which appears as an official govdelivery.com web address, but when clicked redirects to a malicious site impersonating the website of Texas’ Department of Transport’s road toll collection service, TxTag.\n\nThe scam website attempted to trick users into turning over their personal information, such as their name, phone number, home address, and their credit card details. The site (and another clone site hosted on a similar domain) appeared to be offline as of Tuesday morning on the U.S. east coast.\n\nA spokesperson for the Indiana government did not immediately comment.\n\nDoña Ana County in New Mexico also confirmed on Tuesday that its news portal, which is managed by Granicus, was compromised. The county’s IT director Kent English described the compromise as a “system-wide issue affecting other government clients.”\n\nTechCrunch has seen an email, provided by a reader, that originated from a govdelivery.com email address associated with Doña Ana County, but the contents impersonate a professional services company that included a link to a scam site demanding a payment.\n\nA spokesperson for Doña Ana County did not respond to a request for comment.\n\nUpdated with additional details of the GovDelivery issue affecting multiple customers, and additional comment from Granicus."}