{"url": "https://techcrunch.com/2024/08/28/the-ceo-of-boeings-satellite-maker-millennium-space-has-quietly-left-the-company/", "title": "The CEO of Boeing’s satellite maker, Millennium Space, has quietly left the company", "authors": ["Aria Alamalhodaei", "Reporter", "Space", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-08-28T00:00:00", "text": "Update: The day after TechCrunch published this story, Firefly Space announced that Jason Kim is joining the company as CEO.\n\nBoeing’s satellite maker Millennium Space Systems will soon have a new CEO. Jason Kim, the executive who held the position for nearly four years, has departed the company, TechCrunch has learned.\n\nBoeing acquired Millennium Space Systems in 2018. Since that point, the company has scored mega-deals with the U.S. Department of Defense to build satellites to help warfighters track missiles and other threats. Millennium also successfully executed a “responsive space” mission for the U.S. Space Force; that mission, called Victus Nox, sought to establish a new record for the time it takes to put a defense payload into orbit.\n\nMillennium and its partner for the mission, Firefly Space, accomplished just that: Last September, the two firms were able to integrate the Millennium-built satellite with Firefly’s launch vehicle after 58 hours. The satellite was operational just 37 hours after launch.\n\n“We are grateful to Jason for his leadership, growing the portfolio and evolving the company to a workforce of nearly 1,000, and wish him the best in the next phase of his career,” a Millennium spokesperson said in a comment. “We anticipate announcing a CEO in the near term who can carry forward Millennium Space Systems’ spirit and culture of rapid delivery. Millennium Space Systems’ mission has not changed, and the team continues their unwavering focus on customer commitments.”\n\nKim did not immediately respond to TechCrunch’s request for comment. Kim was not a founder of Millennium Space Systems but was appointed around two years after Boeing acquired the company. Its founder and former CEO, Stan Dubyn, led the company for 17 years. Prior to Millennium, Kim held leadership positions at Raytheon’s space division and Northrop Grumman. He also served in the U.S. Air Force.\n\nThe move comes at a time of uncertainty for Boeing’s space businesses more broadly. The aerospace giant has come under the microscope for its bungled Starliner mission, which experienced technical problems shortly before docking with the International Space Station, leading NASA officials to decide that the spacecraft should return to Earth without astronauts onboard. However, the reason for Kim’s departure is unclear. There are other executive vacancies in the industry right now — including at Firefly, whose CEO departed just days after Payload Space published a report alleging he was under investigation at the company."}