{"url": "https://techcrunch.com/2022/03/23/google-moving-movies-tv-tab-play-store-google-tv/", "title": "Google is moving the ‘Movies & TV’ tab from the Play Store to Google TV", "authors": ["Aisha Malik", "Consumer News Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-03-23T00:00:00", "text": "Google is removing the “Movies & TV” section from the Play Store and moving it to the Google TV app, the company announced in a blog post. The upcoming change will go into effect starting in May. Google says the Google TV app will become the place for users to buy, rent and watch movies and tv shows on their Android mobile device or tablet, as they’ll no longer be supported on the Google Play app.\n\nThe company notes that your purchased content will continue to be available in the Google TV app and that purchases on the Google TV app will continue to be eligible for family sharing and Google Play Points. You can also still use Play credit and Play gift cards to make purchases in the Google TV app. Your wishlist will also still be accessible in the Google TV app. Google notes that you can still view and request refunds for your purchases on Google Play.\n\n“Google Play will continue to be your store for apps, games, and books,” the company said in the blog post. “On Google TV, you will find the same experience you are used to on Google Play Movies & TV with the latest new releases, rentals, deals, and great recommendations for you.”\n\nThe company redesigned the Google TV app last year with an updated user interface, expanded set recommendations, and more TV and movies to watch. Google had updated the app’s look and feel with new 16:9 widescreen movie and show posters, which it said would give the app a more “cinematic” look.\n\nIn addition, the app’s recommendation system was overhauled to be based on what you’ve watched in the past, your interests from your Google account and trending and popular content in your region. The app had also expanded its content lineup by adding new providers like Discovery+, Viki, Cartoon Network, PBS Kids and Boomerang, as well as on-demand content from live TV services, including of course, YouTube TV, as well as Philo and fuboTV."}