{"url": "https://techcrunch.com/2018/04/14/austin-is-piloting-blockchain-to-improve-homeless-services/", "title": "Austin is piloting blockchain to improve homeless services", "authors": ["Danny Crichton", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2018-04-14T00:00:00", "text": "While the vagaries of the cryptocurrency markets are keeping crypto traders glued to their CoinDesk graphs, the real potential of blockchain is its capability to solve real human challenges in a decentralized, private, and secure way. Government officials have increasingly investigated how blockchain might solve critical problems, but now one city intends to move forward with an actual implementation.\n\nThe city of Austin is piloting a new blockchain platform to improve identity services for its homeless population, as part of a competitive grant awarded by the Mayor’s Challenge program sponsored by Bloomberg Philanthropies. Austin was one of 35 cities to be awarded pilot grants, and the top city from that group will ultimately be awarded $5 million.\n\nSteve Adler, the mayor of Austin since 2015, explained to TechCrunch that “at a high level, [the pilot] is trying to figure out how to solve one of the challenges we have in our community related to the homeless population, which is how to keep all the information of that individual with that individual.”\n\nIdentity is among the thorniest challenges for governments to solve, particularly for marginal populations like the homeless or refugees. As Sly Majid, Chief Services Officer for Austin, said, “If you have your backpack stolen or if your social security card gets wet and falls apart, or if you are camping and the city cleans up the site and takes your possessions, you have to start all over from the beginning again.” That is devastating for marginal populations, because it means that the cycle of poverty persists. “It really prevents you from going about and doing the sort of activities that allow you to transition out of homelessness,” he continued.\n\nAustin has been on an economic tear, becoming one of the top startup hubs in the United States and increasingly drawing talent from major cities like San Francisco. But, “For everything that is going right, we have some challenges that are shared by a lot of large cities,” Adler said. That dizzying growth has raised housing prices, making it more difficult to improve the city’s homelessness rate. Some 2,000 individuals are homeless in the city according to a census taken earlier this year, with several thousand more at various states of transition.\n\nThe city wanted to improve the ability of its patchwork of government and private homeless service providers to offer integrated and comprehensive aid. There are a number of separate challenges here: verifying the identity of a person seeking help, knowing what care that individual has previously received, and empowering the individual to “own” their own records, and ultimately, their destiny.\n\nThe goal of the city’s blockchain pilot program is to consolidate the identity and vital records of each homeless person in a safe and confidential way while providing a means for service providers to access that information. Adler explained that “there are all kinds of confidentiality issues that arise when you try to do that, so the thought was that blockchain would allow us to bridge that need.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBy using blockchain, the hope is that the city could replace paper records, which are hard to manage, with electronic encrypted records that would be more reliable and secure. In addition, the blockchain platform could create a decentralized authentication mechanism to verify a particular person’s identity. For instance, a homeless services worker operating in the field could potentially use their mobile device to verify a person live, without having to bring someone back to an office for processing.\n\nMore importantly, vital records on the blockchain could build over time, so different providers would know what services a person had used previously. Majid provided the example of health care, where it is crucially important to know the history of an individual. The idea is that, when a homeless person walks into a clinic, the blockchain would provide the entire patient history of that individual to the provider. “Here was your medical records from your last clinic visits, and we can build off the care that you were given last time,” he said. Austin is partnering with the Dell Medical School at the University of Texas to work out how best to implement the blockchain for medical professionals.\n\nIdentity is a popular area for investors interested in blockchain and decentralization more generally. As I wrote about earlier this week, Element, a New York City-based startup co-founded by famed deep learning researcher Yann LeCun, hopes to provide decentralized identity to people in developing countries like Indonesia and the Philippines. Austin is exploring partnering with decentralized startups like BanQu to implement the details of the service for the city.\n\nMajid noted that “It’s an iterative process for us, … and we need to crawl before we walk, and walk before we run.” Adler believes that the program is an example of the power of fusing government and private industry. Austin “tries to work with new industries, and new technologies, and new economies and tries to find the proper intersection of government innovation and responsibility,” he said. If blockchain can improve homelessness here, that solution could carry throughout the world."}