{"url": "https://techcrunch.com/storyline/aws-reinvent-2024-live-updates-from-amazons-biggest-event/", "title": "AWS re:Invent 2024: Live updates from Amazon’s biggest event", "authors": ["Kyle Wiggers", "Frederic Lardinois", "Morgan Little", "Tim De Chant", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", ".Post-Authors-List__Authors --Font-Size Var"], "publication_date": null, "text": "AWS CEO Matt Garman’s keynote has come to a close, but there’s still plenty more to come from this year’s re:Invent 2024 conference. In the words of Editor Frederic Lardinois, who is on the ground in Las Vegas right in the midst of all things re:Invent 2024:\n\n“As far as re:Invent keynotes go, there was plenty of news, but the overall experience felt a bit disjointed, with AWS CEO Matt Garman going deep into the weeds of some new and existing services at the start. He was then upstaged by Amazon CEO Andy Jassy announcing new foundation models — which was maybe the marquee moment of the event so far — only to then have to go back to announce updates to Amazon Q and SageMaker.”\n\nThose new models include four text generators, an image generation model and a video generation model, all of which follow the new Nova naming convention.\n\n“We’ve continued to work on our own frontier models,” Jassy said, “and those frontier models have made a tremendous amount of progress over the last four to five months. And we figured, if we were finding value out of them, you would probably find value out of them.”\n\nYou can get the full rundown on each of the Nova models and their rollout plans here. The Nova reveal came amid some other Tuesday reveals, like updates to Q Developer, Amazon’s coding assistant platform competing directly with GitHub Copilot, and upgrades to Q Business AI agents to bring together data more swiftly from numerous third-party tools and platforms."}