{"url": "https://techcrunch.com/2024/08/14/eliseais-chatbots-for-property-owners-nets-it-75m-in-funding/", "title": "EliseAI lands $75M for chatbots that help property managers deal with renters", "authors": ["Kyle Wiggers", "Ai Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-08-14T00:00:00", "text": "EliseAI, a company developing a suite of AI-powered property management tools for landlords, has raised $75 million in a Series D round that values the startup at $1 billion.\n\nEliseAI is the brainchild of co-founder and CEO Minna Song, who met the company’s second co-founder, Tony Stoyanov, while the two were undergraduate students at Cambridge. After graduating, Song moved to New York City, where she took a job as an administrative assistant at a residential real estate firm.\n\nAt the firm, Song saw how inefficiencies in the rental and leasing industry — particularly inefficiencies around messaging current and prospective tenants — were contributing to management teams’ exhaustion and burnout, she says.\n\n“Recognizing this challenge, Stoyanov and I began creating AI software to automate communication,” Song told TechCrunch, “and we founded EliseAI in 2017.”\n\nToday, EliseAI employs an army of chatbots to text with, email and respond to calls from renters about things such as apartment tours, maintenance requests, lease renewals and delinquencies. Song says the chatbots are trained on renters’ questions and conversations — both people looking to lease apartments and current residents — and are designed to hand off requests to humans automatically where necessary.\n\nImage Credits:EliseAI\n\n“We only use data that we generated internally,” Song said. “We do not buy or use external data. This gives us control over the data we use.”\n\nAs a generally privacy-conscious person, I would be wary of texting chatbots like EliseAI’s any personal information — and volunteering chats for the company’s AI training. So I asked Song about EliseAI’s data retention policies. She said that the company lets users request that their data be deleted, opt out of providing their info for training and, in compliance with laws like the California Consumer Privacy Act, receive a copy of any data that EliseAI has on them.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We do not sell, re-license or otherwise share any consumer data for any purpose,” Song added. “Consumer data is the exclusive property of our relevant customer — a property manager or owner — and we only use that data for limited purposes as expressly permitted by our customer contracts, our privacy policy and applicable law.”\n\nSome reviews of EliseAI’s chatbots are critical and suggest that nuance isn’t the AI’s strong suit. According to one reviewer, the chatbots — which don’t clearly identify themselves as AI — sometimes fail to loop in managers and agents when they should, and book tours of properties without key info such as a move-in date or phone number.\n\nSong, however, asserts that EliseAI’s chatbots “continuously improve their ability to anticipate renter needs,” and on average boost lease tour bookings by 125% while decreasing overdue payments by 50%, according to the company’s internal data.\n\nImage Credits:EliseAI\n\n“Our technology is designed for multifamily and single-family rental owners, operators and third-party property management companies to enhance operational efficiency, reduce tech stacks and costs associated with single-point solutions, increase occupancy, reduce delinquent payments and improve the renter experience,” Song said.\n\nIn addition to the chatbots, EliseAI offers a dashboard where property managers can keep tabs on prospects’ and residents’ requests (e.g. work orders), generate reports on operations and track the progress of renewals. The dashboard comes free with any of EliseAI’s AI products, which the company offers as modules priced according to a software-as-a-service model.\n\nEliseAI competes with vendors including Colleen AI, Funnel, Knock and LeaseHawk. Song says that the company has more than 350 customers, including 70% of the top 50 rental housing operators in the U.S.\n\n“We did not pursue hyper-growth in headcount, instead focusing on controlled hiring and sustainable burn management while continuously investing strategically in revenue growth,” Song said. “We have observed that funding has remained strong for companies like EliseAI that effectively address enduring enterprise challenges such as operational efficiency, particularly in foundational markets like housing, which are always in demand.”\n\nWith another successful funding round under its belt, EliseAI, which employs around 150 full-time employees out of its NYC offices, plans to further expand into a rather unexpected market: healthcare. Song thinks that much of the company’s tech stack can be adapted to serve health clinics’ administrative needs, like appointment scheduling and billing and payments.\n\nIndeed, EliseAI launched a healthcare solution in 2023 called HealthAI, and Song says that several providers are already using it.\n\nImage Credits:EliseAI\n\nIt’s a crowded market, though; EliseAI will have to compete against startups like Hyro, which similarly use AI to handle text and voice conversations between healthcare organizations and their patients.\n\nSapphire Ventures led the round with participation from Point72 Private Investments, Divco West, Navitas Capital and Koch Real Estate Investments. Bringing EliseAI’s total raised to $140 million, the new capital will be put toward hiring, AI R&D, product development and supporting EliseAI’s go-to-market efforts, Song said.\n\n“Our primary focus was bringing in an excellent partner for the business; that is why we chose Sapphire,” Song added. Sapphire partner Cathy Gao will be joining EliseAI’s board of directors.\n\n“While EliseAI is currently the most widely adopted AI platform in this space, the residential real estate market is still in the early stages of leveraging AI to its potential,” Gao said in a statement. “I believe the company is well-positioned to lead the charge in housing and deliver similar results in new verticals like healthcare.”"}