{"url": "https://techcrunch.com/2022/12/07/linevision-and-ge-team-up-to-fortify-the-electrical-grid-to-handle-more-renewables/", "title": "LineVision and GE team up to fortify the electrical grid to handle more renewables", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-12-07T00:00:00", "text": "One of the biggest hurdles to decarbonizing the grid is getting electricity from point A to point B.\n\nBut that’s often easier said than done. Today, nearly a terawatt of zero-carbon generating capacity is waiting to be hooked up to the grid. That’s enough to decarbonize 80% of U.S. electricity by the end of the decade, according to the Lawrence Berkeley Lab.\n\nTo get there, though, the grid needs some upgrades, which also couldn’t come at a better time. The U.S. electrical grid is aging (70% of transmission lines are over 25 years old) and outmoded — it was originally designed with massive fossil fuel power plants in mind not distributed renewable sources.\n\nBut new transmission lines — the large, high-tension wires that form the backbone of the grid — are expensive. Depending on the voltage and where they’re being built, they start at over $1 million per mile and go up from there.\n\nThat’s why for the last five years, LineVision has been working on a way to unlock additional capacity on existing transmission lines. The startup recently closed a $33 million Series C led by Climate Innovation Capital and S2G Ventures. With the new funding, the company has been growing its team and moved into new offices down the street from Greentown Labs in Somerville, Massachusetts, where it incubated. It’s also been expanding partnerships with major utilities.\n\nNow, LineVision tells TechCrunch that it’s teaming up with GE’s Grid Solutions division, integrating its dynamic line rating technology with complementary offerings from GE to give utilities a more comprehensive way to monitor their transmission lines and boost the amount of electricity they can safely carry.\n\nThe partnership was driven in part by utilities, which are necessarily cautious about integrating new technologies — after all, crashing the grid comes with pretty significant consequences.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“When I talked to utility executives, they’d say, ‘We love all these different technologies. But it’s really hard for us as a utility to be put in the position of having to kind of piece them all together,’” LineVision co-founder and CEO Hudson Gilmer told TechCrunch. “Now we can say, ‘We’ve already done that for you.’”\n\nLineVision’s and GE’s teams are already integrating the technologies behind the scenes, said Jonathan Marmillo, LineVision’s co-founder and VP of product. “We’re going to our clients jointly, together and telling them we’ve developed this integrated solution.”\n\nTransmission lines are all rated to carry certain amounts of electricity. It’s determined by a number of variables, including the size of the wire and what it’s made of, how far it is off the ground and weather conditions, including temperature, wind speed and the intensity of the sunlight. If a line exceeds its rating, it may sag too far, endangering people below and increasing the risk of fire if it touches a tree or shrub.\n\nSome line ratings are based on worst-case scenarios, like a hot, sunny day with low winds and lots of current flowing through the line. Others take seasonality into account, but they’re still rough estimates.\n\nMost transmission lines operate in conditions that are often far better than the ratings assume. But without real-time data, grid operators have to err on the side of caution and send less power through the line. That means lines can become congested and operators end up leaving capacity on the table.\n\nIf high demand overloads a line, it can act just like congestion on a highway. Cheaper sources of power aren’t able to get through, so grid operators have to call on the power that is available, which is often more expensive.\n\nBy itself, LineVision’s dynamic line rating technology can allow a transmission line to carry 15% to 40% more power, Gilmer said, though in one ideal scenario the boost was over 50%. They install sensors, including a lidar unit that watches for line sag and other parameters, to determine whether the line is handling more power than it’s rated for.\n\nLineVision’s pitch to utilities is that its system costs about 5% of what it would cost to build a new line, Gilmer said, and the payback period is often on the order of months, not years, in part because utilities can more readily access cheaper forms of power without having to build new lines.\n\nGilmer pointed to a trade organization study that shows that the amount of renewables that the grid could support in Kansas and Oklahoma, for example, could more than double if grid-enhancing technologies are installed. “The payback period would be less than six months,” he added.\n\nThe grid will still need new transmission lines, but grid-enhancing technologies could help bridge the gap. “There is such a compelling urgency to get the most out of the existing wires,” Gilmer said. “That’s the low-hanging fruit.”"}