{"url": "https://techcrunch.com/2024/01/07/isomorphic-inks-deals-with-eli-lilly-and-novartis-for-drug-discovery/", "title": "Isomorphic inks deals with Eli Lilly and Novartis for drug discovery", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-01-07T00:00:00", "text": "Isomorphic Labs, the London-based, drug discovery–focused spinout of Google AI R&D division DeepMind, today announced that it’s entered into strategic partnerships with two pharmaceutical giants, Eli Lilly and Novartis, to apply AI to discover new medications to treat diseases.\n\nThe deals have a combined value of around $3 billion. Isomorphic will receive $45 million upfront from Eli Lilly and potentially up to $1.7 billion based on performance milestones, excluding royalties. Novartis, meanwhile, will pay $37.5 million upfront in addition to funding “select” research costs and as much as $1.2 billion (once again excluding royalties) in performance-based incentives over time.\n\n“We’re thrilled to embark on this partnership and apply our proprietary technology platform,” DeepMind co-founder and Isomorphic CEO Demis Hassabis said in a press release. “The focus we share on advancing groundbreaking drug design approaches and appreciation of state-of-the-art science makes [these] partnership[s] particularly compelling.”\n\nFiona Marshall, president of biomedical research at Novartis, added in a statement: “Cutting-edge AI technologies . . . hold the potential to transform how we discover new drugs and accelerate our ability to deliver life-changing medicines for patients. This collaboration harnesses our companies’ unique strengths, from AI and data science to medicinal chemistry and deep disease area expertise, to realize new possibilities in AI-driven drug discovery.”\n\nIsomorphic, which Hassabis launched in 2021 under DeepMind parent company Alphabet, draws on DeepMind’s AlphaFold 2 AI technology that can be used to predict the structure of proteins in the human body. By uncovering these structures, the hope is that researchers can identify new target pathways to deliver drugs for fighting disease.\n\nThe tech isn’t perfect. A recent article in Nature Methods pointed out that AlphaFold occasionally makes obvious mistakes and, in many cases, is more useful as a “hypothesis generator” rather than a replacement for experimental data. But the scale at which the model can generate reasonably accurate protein predictions is beyond most methods that came before.\n\nResearchers recently used AlphaFold to design and synthesize a potential drug to treat hepatocellular carcinoma, the most common type of primary liver cancer. And DeepMind is collaborating with Geneva-based Drugs for Neglected Diseases initiative, a nonprofit pharmaceutical organization, to apply AlphaFold to formulating therapeutics for Chagas disease and Leishmaniasis, two of the most deadly diseases in the developing world.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe latest version of AlphaFold can generate predictions for nearly all molecules in the Protein Data Bank, the world’s largest open access database of biological molecules, DeepMind announced in October. The model can also accurately predict the structures of ligands — molecules that bind to “receptor” proteins and cause changes in how cells communicate — as well as nucleic acids (molecules that contain key genetic information) and post-translational modifications (chemical changes that occur after a protein’s created).\n\nAlready, Isomorphic is applying the new AlphaFold model — which it co-designed with DeepMind — to therapeutic drug design, helping to characterize different types of molecular structures important for treating disease.\n\nThe pressure’s on for Isomorphic to start generating a profit. In 2021, the company recorded a £2.4 million (~$3 million) loss as it ramped up hiring ahead of opening its second office location in Lausanne, Switzerland."}