{"url": "https://techcrunch.com/2025/01/29/moviepass-might-pivot-to-crypto/", "title": "MoviePass might pivot to crypto", "authors": ["Amanda Silberling", "Senior Writer", "Kyle Wiggers", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-01-29T00:00:00", "text": "After MoviePass’s historic implosion, subscribers to the “Netflix for movie theaters” were already cautious around the company’s 2023 relaunch. These moviegoers may grow even more skeptical after MoviePass sent out an email blast on Wednesday, which surveyed customers about their interest in web3.\n\n“Artificial Intelligence and Blockchain technologies are transforming the business landscape at an unprecedented pace,” the email says. “As a community-driven company, we’d love to understand your interest and knowledge in the blockchain space.”\n\nThe survey asks basic questions about the respondent’s familiarity with web3, like if they own any assets like NFTs, or if they have a digital wallet. Customers were also asked whether they believe blockchain technology is promising, and if they’re interested in learning more about it.\n\nMoviePass’s possible pivot to web3 didn’t come out of nowhere. When the company relaunched, it raised seed funding from Animoca Brands, a Hong Kong-based software company and venture capital firm that specializes in blockchain technology. Last year, MoviePass partnered with the Sui blockchain to allow subscribers to make payments with USDC, a cryptocurrency pegged to the price of the U.S. dollar.\n\nAt the time, MoviePass co-founder Stacy Spikes said that MoviePass intended to use web3 as a means of “making moviegoing more accessible and able to reach a wider audience through deeper fan engagement.” The company said it was looking toward offering on-chain rewards for seeing movies, or allowing users to invest in the movies they see (there are no further details about how that would actually work).\n\nIt’s not clear whether fans want these on-chain bonuses, though, or whether that sort of blockchain infrastructure would even help the company succeed. In some cases, adding crypto elements to a company that functions perfectly fine without it can alienate users rather than entice them. Patreon also once surveyed its users about their interest in crypto, but the creator membership platform was met with a clear no.\n\nWithout adding in a web3 component, the new-and-improved MoviePass already turned its first-ever profit in 2023.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhile the first version of MoviePass was impossibly unsustainable — subscribers could see unlimited movies in theaters for just $10, less than the cost of one movie ticket — the new iteration of MoviePass makes a more modest offer. Now MoviePass operates on a somewhat confusing credits system, where each movie showing can be redeemed for a certain number of credits, which fluctuates depending on the time of day and the format of the screening (IMAX, 3D, etc.). For subscribers who live in places where movie tickets cost more, like New York City or Los Angeles, their monthly fee will be higher.\n\nLast February, MoviePass announced that subscribers had seen 1 million movies through its offerings, but it did not specify how many subscribers it has."}