{"url": "https://techcrunch.com/2021/06/15/edge-computing-startup-macrometa-gets-20m-series-a-led-by/", "title": "Edge computing startup Macrometa gets $20M Series A led by Pelion Venture Partners", "authors": ["Catherine Shu", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-06-15T00:00:00", "text": "Macrometa, the edge computing cloud and global data network for app developers, announced today it has raised a $20 million Series A. The round was led by Pelion Venture Partners, with participation from returning investors DNX Ventures (the Japan and U.S.-focused enterprise fund that led Macrometa’s seed round), Benhamou Global Ventures (BGV), Partech Partners, Fusion Fund, Sway Ventures and Shasta Ventures.\n\nThe startup, which is headquartered in Palo Alto, with operations in Bulgaria and India, plans to use its Series A on feature development, acquiring more enterprise customers and integrating with content delivery networks (CDN), cloud and telecom providers. It will hire for its engineering and product development centers in the United States, Eastern Europe and India, and add new centers in Ukraine, Portugal, Greece, Mexico and Argentina.\n\nThe company’s last round of funding, a $7 million seed, was announced just eight months ago. Its Series A brings Macrometa’s total raised since it was founded in 2017 to $29 million.\n\nAs part of the new round, Macrometa expanded its board of directors, adding Pelion general partner Chris Cooper as a director, and Pelion senior associate Zain Rizavi and DNX Ventures principal Eva Nahari as board observers.\n\nMacrometa’s global data network combines a globally distributed noSQL database and a low-latency stream data processing engine, enabling web and cloud develops to run and scale data-heavy, real-time cloud applications. The network allows developers to run apps concurrently across its 175 points of presence (PoPs), or edge regions, around the world, depending on which one is closest to an end user. Macrometa claims that the mean roundtrip time (RTT) for users on laptops or phones to its edge cloud and back is less than 50 milliseconds globally, or 50x to 100x faster than cloud platforms like DyanmoDB, MongoDB or Firebase.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSince its seed round last year, the company has accelerated its customer acquisition, especially among large global enterprises and web-scale players, co-founder and chief executive officer Chetan Venkatesh told TechCrunch. Macrometa also made its self-service platform available to developers, who can try its serverless database, pub/sug, event processing and stateful compute runtime for free.\n\nMacrometa recently became one of two distributed data companies (the other one is Fauna) partnered with Cloudflare for developers building new apps on Workers, its serverless application platform. Venkatesh said the combination of Macrometa and Cloudflare Workers enables data-driven APIs and web services to be 50x to 100x faster in performance and lower latency compared to the public cloud.\n\nThe COVID-19 pandemic accelerated Macrometa’s business significantly, said Venkatesh, because its enterprise and web-scale customers needed to handle the unpredictable data traffic patterns created by remote work. The pandemic also “resulted in several secular and permanent shifts in cloud adoption and consumption,” he added, changing how people shop, consume media, content and entertainment. That has “exponentially increased the need for handling dynamic bursts of demands for application infrastructure securely,” he said.\n\nOne example of how enterprise clients use Macrometa is e-commerce providers who implemented its infrastructure with their existing CDN and cloud backends to provide more data and AI-based personalization for shoppers, including real-time recommendations, regionalized search at the edge and local data geo-fencing to comply with data and privacy regulations.\n\nSome of Macrometa’s SaaS clients use its global data network as a global data cache for handling surges in usage and keep regional copies of data and API results across its regional data centers. Venkatesh added that several large telecom operators have used Macrometa’s data stream ingestion and complex event processing platform to replace legacy data ingest platforms like Splunk, Tibco and Apache Kafka.\n\nIn a statement, Pelion Venture Partners general partner Chris Cooper said, “We believe the next phase of computing will be focused on the edge, ultimately bringing cloud-based workloads closer to the end user. As more and more workloads move away from a centralized cloud model, Macrometa is becoming the de facto edge provider to run data-heavy and compute-intensive workloads for developers and enterprises alike, globally.”"}