{"url": "https://techcrunch.com/2024/06/18/xreal-introduces-a-200-device-that-brings-android-apps-to-its-ar-glasses/", "title": "XReal introduces a $200 device that brings Android apps to its AR glasses", "authors": ["Brian Heater", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-06-18T00:00:00", "text": "XReal has largely flown under the radar here in the States. The Beijing firm’s Air 2 Pro AR glasses got a bit of review love late last year, but the product is seldom mentioned among the Metas, Apples and HTCs of the world when discussing mixed reality.\n\nThis week at the AWE (Augmented World Expo) conference in Southern California, the company is showcasing the Beam Pro. The $200 device looks like an Android phone and quacks like an Android phone, but it’s not really an Android phone. Instead, it’s a mobile device designed specifically for XReal’s glasses.\n\nImage Credits:XReal\n\nIn essence, the Beam Pro is designed to deliver Google Play apps to the glasses in “3D space.” XReal writes: “As the ultimate companion device for XReal glasses, XReal Beam Pro gives users a simple way to access all their favorite apps, social media content, streaming entertainment, professional needs, and gaming platforms in a stunning 3D-aware AR environment.”\n\nThe Snapdragon-powered device runs Android 14 and features a pair of 50-megapixel cameras for taking 3D images and spatial videos, but it’s extremely purpose-built and not looking to replace your handset. It’s a unique approach, certainly — one that harkens back to a bygone era when people owned iPod Touches in addition to iPhones. There’s a little bit of Amazon Fire Phone DNA in there by way of the 3D cameras, but the less said about that, the better.\n\n“The average user will instantly recognize the smartphone-like form factor,” the company writes. “In terms of connectivity, XReal Beam Pro offers dual USB ports for simultaneous use with XReal glasses while charging. 27W fast charging means battery anxiety during a binge-watching or gaming session is a thing of the past.”\n\nImage Credits:XReal\n\nOther specs are what one would expect from a $200 device. That includes a 6.5-inch (2400 x 1080) display, 6 or 8GB of RAM and 128 or 256GB of storage — not exactly flagship numbers there. There’s a Wi-Fi-only option, as well as one with 5G, as which point we’re pretty much talking about a phone.\n\nXReal built its NebulaOS proprietary software layer on top of Android. The skin is designed to deliver 2D apps in 3D, while offering a unique way to interface with the system.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“It’s exciting to see companies like XREAL bring new devices to the ecosystem, making AR more accessible,” Qualcomm Senior Director Sahil Bansal said in a statement. Other big names involved include Nvidia by way of the off-device CloudXR tech and Amazon Web services.\n\nThe Beam Pro is up for sale now in the U.S., China, Japan and parts of Europe through the XReal site. It hits Amazon next month."}