{"url": "https://techcrunch.com/2021/03/08/new-clinical-trial-data-from-locus-biosciences-shows-promise-in-crispr-cas3-technology/", "title": "New clinical trial data from Locus Biosciences shows promise in CRISPR-Cas3 technology", "authors": ["Sophie Burkholder", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-03-08T00:00:00", "text": "Antibiotic resistance is one of the biggest potential threats to global health today. But Locus Biosciences is hoping that their crPhage technology might provide a new solution.\n\nBased in North Carolina’s Research Triangle, the startup recently announced promising phase 1b clinical trial results for their use of CRISPR-Cas3-enhanced bacteriophages as a treatment for urinary tract infections caused by escherichia coli. Led in part by former Patheon executive and current Locus CEO Paul Garofolo, the startup launched in 2015 with the goal of using a less popular application of CRISPR technology to address growing antimicrobial resistance.\n\nCRISPR-Cas3 technology has notably different mechanisms from its more well-known CRISPR-Cas9 counterpart. Where the Cas9 enzyme has the ability to cleanly cut through a piece of DNA like a pair of scissors, Garofolo describes Cas3 more like a Pac-Man, shredding the DNA as it moves along a strand.\n\n“You wouldn’t be able to use it for most of the editing platforms people were after,” he said, noting that meant there wouldn’t be as much competition around Cas3. “So I knew it would be protected for some time, and that we could keep it quiet.”\n\nGarofolo and his team wanted to use CRISPR-Cas3 not to edit harmful bacteria found in the body, but to destroy it. To do this, they took the DNA-shredding mechanism of Cas3 and used it to enhance bacteriophages — viruses that can attack and kill different species of bacteria. Together, co-founder and Chief Scientific Officer Dave Ousterout — who has a PhD in biomedical engineering from Duke — thinks this technology offers an extremely direct and targeted way of killing bacteria.\n\n“We armed the phages with this Cas3 system that attacks E. coli, and that sort of dual mechanism of action is what comes together, essentially, as a really potent way to remove just E. coli,” he said in an interview.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThat specificity is something that antibiotics lack. Rather than targeting only harmful bacteria in the body, antibiotics typically wipe out all bacteria they come across. “Every time we take antibiotics, we’re not thinking about all the other parts of us that are impacted by the bacteria that do good things,” said Garofolo. But the precision of Locus Biosciences’ crPhage technology means that only the targeted bacteria would be wiped out, leaving those necessary to the body’s normal function intact.\n\nBeyond offering this more specific approach to treatment of pathogens, or any bacteria-based disease, Garofolo and his team also suspect that their approach will also be extremely safe. Though deadly to bacteria, bacteriophages are typically harmless to humans. The safety of CRISPR in humans is well-established, too.\n\n“That’s our secret sauce,” said Garofolo. “We can build drugs that are more powerful than the antibiotics they’re trying to replace, and they use phage, which is probably one of the world’s safest ways to deliver something into the human body.”\n\nWhile this new technology could certainly help treat pathogens and infectious diseases, Garofolo hopes that indications in immunology, oncology and neurology might benefit from it too. “We’re starting to figure out that some bacteria might promote cancer, or inflammation in your gut,” he said. If researchers can identify the bacteria at the root cause of those conditions, Garofolo and Ousterout think the crPhage technology might prove to be an effective treatment.\n\n“If we’re right about that, it’s not just about infections or antimicrobial resistance, but helping people overcome cancer or delay the onset of dementia,” Garofolo said. “It’s changing the way we think about how bacteria really help us live.”\n\nEarly Stage is the premier “how-to” event for startup entrepreneurs and investors. You’ll hear firsthand how some of the most successful founders and VCs build their businesses, raise money and manage their portfolios. We’ll cover every aspect of company building: Fundraising, recruiting, sales, product-market fit, PR, marketing and brand building. Each session also has audience participation built-in — there’s ample time included for audience questions and discussion."}