{"url": "https://techcrunch.com/2023/02/22/finch-lands-40m-to-connect-disparate-hr-systems-with-a-single-api/", "title": "Finch lands $40M to connect disparate HR systems with a single API", "authors": ["Kyle Wiggers", "Ai Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-02-22T00:00:00", "text": "Finch, a platform that helps companies connect to various HR apps, services and systems, today announced that it raised $40 million in a Series B round co-led by General Catalyst and Menlo Ventures with participation from QED Investors, Altman Capital and PruVen Capital.\n\nCo-founder and CEO Jeremy Zhang says the new cash will be put toward adding coverage for more payroll and benefits systems, expanding into new employment data verticals and growing Finch’s engineering, product and customer success teams. Zhang claims that the company was cash flow-positive before the funding round, with revenue increasing 12x since Finch’s Series A last June.\n\n“This funding validates Finch’s leading position in the employment API ecosystem and fuels our focus on building deeper connectivity and broader coverage,” Zhang told TechCrunch in an email interview. “Finch’s mission is to democratize access to the infrastructure that underpins the employment sector, unlocking much-needed innovations and creating tremendous economic value for both employers and employees.”\n\nFinch was co-founded by Jeremy Zhang and Ansel Parikh in 2020, initially to address the challenges lenders faced around processing Paycheck Protection Program applications. (Zhang previously worked at Amazon’s robotics R&D division, while Parikh was an investor at Kleiner Perkins.) The goal was to help businesses get the funding they needed without having to send payroll journal PDFs to lenders. But once Finch launched, Zhang and Parikh realized that there was much higher demand for connectivity in the HR software space beyond that limited use case.\n\n\n\nTo that end, Finch today enables companies like Vanta, Lendio, Middesk and OpenComp to gain access to more than 200 HR systems by taking what Zhang calls a “multi-factor” approach. Sort of like a “Plaid for HR,” Finch leverages APIs and protocols like SFTP to sync with existing apps and services while offering customers a unified API.\n\n“Our direct competitor is the current status quo in the industry, which operates in three main models: spreadsheet uploads, SFTP servers and internal operations,” Zhang told me in a previous interview. “Applications require HR admins to upload employee information, enrollment and pay statements. Most of the industry has adopted transferring files through SFTP servers, which is more secure than sending employee data via email, but it requires setting up SFTP servers and lacks standardization across companies. As a result, many companies depend on an internal operations team to manually log in and pull employee reports or set deductions and contributions.”\n\nBy contrast, a company can use Finch’s APIs to build dashboards and experiences for onboarding employees, adjusting employee benefit contributions, tracking cost savings and spending and more. The HR system data Finch handles is encrypted both in transit and at rest, Zhang claims, and the platform layers on several levels of access management for added privacy.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nFinch competes with Merge and Flexspring, both of which offer platforms that connect different HR systems to enable data sharing between them. Merge recently closed a $55 million Series B round, highlighting investors’ enthusiasm for the category. Larger, established vendors have begun eying it, too, with Plaid for example releasing a payroll API system for income verification called Plaid Income.\n\nWhen asked about the competition, General Catalyst’s Alex Tran had this to say (via email): “As early backers of Stripe and Gusto, we have come to appreciate the importance of fintech infrastructure as well as the evolving nature and use cases around employment data. We’re excited to see Finch innovating at the intersection of two areas we care a lot about.”\n\nZhang averred that, from a growth perspective, there were “positive tailwinds” for Finch stemming from the large amounts of hiring activity in 2021 and 2022. It led to high demand and budgets for HR tools, he said; Finch has more than 1.5 million employees connected through its platform. But recently, Finch’s business has shifted toward use cases more essential to employers regardless of the macroeconomic conditions, like retirement benefits and insurance plan enrollment.\n\n“We had a majority of our Series A funds still in the bank and this funding extends our runway for multiple years, giving us a path to breakeven before considering a next fundraise,” Zhang continued. “The world is moving towards more standardized, open and interconnected data systems. However, employment infrastructure remains complex, closed and fragmented. Finch’s mission is to democratize access to the infrastructure that underpins the employment sector, unlocking much-needed innovations and creating tremendous economic value for both employers and employees.”\n\nThe funding brings Finch’s total raised to more than $68 million. Zhang says that Finch will continue to hire across all areas of its business in 2023, aiming to grow the company’s workforce from 57 employees to north of 80."}