{"url": "https://techcrunch.com/2024/04/17/dark-space-is-building-a-rocket-powered-boxing-glove-to-push-debris-out-of-orbit/", "title": "Dark is building a rocket-powered boxing glove to push debris out of orbit", "authors": ["Aria Alamalhodaei", "Reporter", "Space", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-04-17T00:00:00", "text": "Paris-based Dark is taking on the dual problems of debris and conflict in orbit with their mobile platform designed to launch, attach to, and ultimately de-orbit uncooperative objects in space.\n\nDark CEO Clyde Laheyne said the company is aiming to become the “S.W.A.T. team of space.”\n\nThe three-year-old startup is developing Interceptor, a spacecraft that is essentially a rocket-powered boxing glove that can be launched on short order to gently punch a wayward object out of its orbit.\n\nInterceptor is launched from a specially outfitted aircraft. Much like a Virgin Galactic launch, the aircraft will take the rocket above the tumultuous lower atmosphere, where it can be released and ignited. Once the rocket reaches the vicinity of the target object, the spacecraft detaches and uses onboard sensors and propulsion to find and approach it. When it’s lined up correctly, Interceptor pushes against the object with its cushioned “effector,” eventually de-orbiting it.\n\n“All the space sector is organized to do planned, long missions … but orbital defense is more about unplanned, short missions,” Laheyne said. In that sense, Interceptor “is more like an air defense missile,” he explained. “It has to be ready all the time. There is no excuse to not be able to use it.”\n\nUnlike an actual missile or anti-satellite weapon, however, the gentle strike of the Interceptor doesn’t produce a debris field or any other dangerous, unpredictable effects.\n\nDark was founded by Laheyne and CTO Guillaume Orvain, engineers who cut their teeth at multi-national missile developer MBDA. This work experience shines through in the Interceptor concept, which is being designed to operate on-call, similar to missile systems. That’s also why Dark is developing its own launching platform: to ensure readiness for defense, civil and commercial companies at a moment’s notice, Laheyne said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nDark closed a $5 million funding round in 2021, with the cap table composed of European investors, including lead investor Eurazeo. The team closed a $6 million extension yesterday, including participation from its first U.S.-based investor, Long Journey Ventures. (That fund is led by Arielle Zuckerberg, the younger sister of Meta founder Mark Zuckerberg.)\n\nThe company has a lot of work ahead before it comes close to removing something like a defunct rocket second stage from orbit. Dark has been focused on developing critical systems, like the cryogenic engine and software. Now the team is shifting its focus to developing the technologies needed for the type of unplanned, quick missions Interceptor will execute, like long-distance detecting and tracking, autonomous flight algorithms, and a system for reliable controlled reentry.\n\nThe team must also retrofit an aircraft — which Laheyne estimated could cost $50 million, or around the price of building a new launch pad — and have the entire platform ready for a demonstration mission in 2026.\n\nThat mission would validate many of the core technologies of the full-scale platform, though it won’t actually aim to de-orbit an object, just touch one. Even this is incredibly ambitious: No company has yet cracked so-called rendezvous and proximity operations, meaning moving close to another object in space and interacting with it.\n\nThe second demonstration mission, which is currently planed for 2027, will include a de-orbit attempt. If all goes to plan, the company would start de-orbiting objects for allied civil agencies. As far as defense customers go, “hopefully we don’t have to use it,” Laheyne said.\n\n“I’ve been doing missiles for years, and it’s always the same topic: If you use it first, it’s an act of war. If you’re second, it’s an act of defense. If you can do it, and people know you can do it, it’s dissuasion,” he said. “The ideal is dissuasion, the system that makes the conflict unthinkable.”"}