{"url": "https://techcrunch.com/2023/04/10/bidirectional-charging/", "title": "EV-to-grid charging is complicated, but California is gearing up to clear the way", "authors": ["Haje Jan Kamps", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block", "Margin-Top Flex Font-Size Var"], "publication_date": "2023-04-10T00:00:00", "text": "If you have solar panels on your roof, it makes sense to add batteries, too, so you have some degree of self-sufficiency should you lose power. In fact, it might be a good idea to have such a storage system even if you don’t generate your own power. That way, you can charge the batteries when power is cheap and use that stored energy when electricity is eye-wateringly expensive and the mercury is reaching for the sky like it’s at a midsummer rave party and the bass just dropped.\n\nFrom a distributed power strategy point of view, it would make a lot of sense for everyone to have their own local power storage. But it’s unlikely that folks who don’t have solar, wind or, in some cases, hydroelectric power on their property will spend on huge and expensive powerwalls.\n\nHowever, there’s an unlikely solution for this: The enormous battery packs people already have in their electric vehicles, and the California Senate is discussing a bill that is hoping to cut through the red tape associated with V2G (vehicle-to-grid) charging.\n\nV2G has incredible potential: There are around 1 million plug-in electric vehicles in California. If we (blindly) assume that all of them are Nissan Leaf EVs with a 50 kWh battery pack kept at 50% charge, and that they all volunteer to deliver power to the grid until they hit 20%, we would have 15 kWh available per vehicle, times a million.\n\nThat’s enough power to keep just over 600,000 homes powered for a day (assuming average usage of 715 kWh per month). And we could drastically extend that time frame by asking people to use less power (not run the AC, etc.).\n\nHowever, reality is as usual a pesky little problem: 600,000 homes represent only 4% of households in California, and the largest power cut on record in the region took out 2.5 million homes or so. V2G isn’t going to be the solution to end all discussion about power management. On the other hand, a distributed power strategy aimed at households, communities or even building resiliency for the entire grid is probably worth striving for, especially given the semi-regular power cuts we’re starting to see in California, which are usually linked to wildfires or extreme weather.\n\nLet’s talk about some of the challenges involved in V2G charging, and why the California Senate may be eager to get involved.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThere has been a fair amount of pushback against V2G charging. Some argue that warranties on vehicles are expressed in miles traveled and using the vehicle batteries for anything but propulsion could cause some quirks there. The same goes for secondhand vehicle sales. If you buy a Tesla with 20,000 miles on it, you wouldn’t expect it to have also powered a home 50% of the time and the state of the batteries to be far worse than the car’s mileage would indicate.\n\nThe biggest pushback against vehicle-to-grid or vehicle-to-home (V2H) charging is that automakers don’t care all that much. Offering bidirectional charging doesn’t help them sell cars, and that’s the business they are in.\n\nFor EV owners, bidirectional charging makes sense if you have a power cut, but the truth is that most houses aren’t wired to accept power from anything but the grid. In theory, to power just your house, you’d need to isolate yourself from the grid. That isn’t complicated but it does involve some rewiring and probably a new breaker box; all costs that have no obvious benefits in day-to-day use.\n\nAnother problem is that there aren’t many incentive programs for owners to allow their EV to pump electricity back to the grid, as the grid isn’t set up to handle a huge amount of distributed generation. Utilities know what is flowing through their own power stations and can distribute power from there, but adding a few hundred thousand small “power stations” raises a surprisingly complicated problem. FERC 2222 is trying to resolve this and is making some progress, but it’s going to take a lot of time to get things going.\n\nOne of the biggest challenges for delivering power to the grid is getting interconnection approvals. Many utilities are backlogged with simply handling the existing queue of rooftop solar projects, so adding V2G would make an already bad situation worse. For rooftop solar, the installers are motivated so they handle the interconnection request/approval process on behalf of the project owner, but it’s unclear how this would be handled for V2G.\n\nBy and large, incentives aren’t aligned: Car dealers don’t really care, the utility companies don’t have it as a priority, car owners are unsure whether their expensive EVs will retain value, and power cuts and grid strain is rare enough (for now) that it doesn’t seem urgent. But it is: Grid strain is real and climate change means we are going to see more power anomalies in the coming years.\n\n“Distribution utilities need to be truly ready for distributed generation, or else they’re just going to deny interconnection requests. Inverter installation needs to be made super simple for vehicle owners; otherwise, not enough people will make it through,” explained Cody Smith, CTO and co-founder of Camus Energy, told TechCrunch+. “Legislation will need to force automakers to enable V2G functionality, because motivation is probably not going to come from within.”\n\nThis legislation is about to get really interesting. In SB233, California State Senator Nancy Skinner (D) suggests it’s time for some change. The bill points out, “Batteries in electric vehicles are storage resources and have the potential to be deployed to assist in renewable energy integration and electrical grid reliability and during emergencies, including power outages.” It also reminds us that “wildfires, heatwaves, and other climate change-fueled extreme weather events pose an increasing threat to the reliability of California’s electrical grid.”\n\n“As California builds out electric vehicle service equipment in order to meet the charging needs of an anticipated 8,000,000 electric vehicles by 2030, there is a unique opportunity to leverage significant federal, state and private sector investments in electric vehicles and electric vehicle service equipment to ensure they are bidirectionally capable,” the bill states. It also starts to map out the future for bidirectional charging, including what it is, and how car manufacturers could be compelled to participate.\n\nVehicle-to-home charging seems like the logical first step, but it may be more complicated than that.\n\n“You might think that V2H has some potential to be a stepping stone, but it’s being done in a way that doesn’t bring us much closer to V2G in practice,” Smith explained. “It helps sell cars, because using the car as backup power is appealing to people, as the F-150 Lightning has proven. But Ford side-stepped regulation by putting the inverter *in* the vehicle, and that loophole probably won’t stay open forever.”\n\nThe state senate bill is suggesting changing the charging cycle of bidirectional-capable EVs away from peak demand times to periods with excess and lower-cost renewable electricity generation, allowing the EVs’ dispatchable energy capacity to serve as an alternative to fossil fuel peaker power plants, mitigating the air pollution and public health impacts on disadvantaged communities.\n\nThere are still a lot of hoops to jump through, but it’s encouraging that the ball is rolling."}