{"url": "https://techcrunch.com/2024/11/05/flash-founded-by-ex-flipcart-exec-launches-in-the-us-to-help-shoppers-juggle-online-orders/", "title": "Flash, founded by ex-Flipkart exec, launches in the US to help shoppers juggle multiple online orders", "authors": ["Lauren Forristal", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-11-05T00:00:00", "text": "Flash, the payment management service that tracks all your online purchases, announced Tuesday its entry into the U.S. market, giving American customers the ability to manage all of their spending in one place while also earning rewards, such as gift cards and cash back.\n\nThe U.S. is home to many big spenders, making it a strategic choice to launch the app here. The Census Bureau of the Department of Commerce estimates that online shopping in the U.S. brought in about $291.6 billion during the second quarter of 2024. It estimated that total retail sales amounted to roughly $1.8 trillion. Projections for the global e-commerce market are also promising, with estimates suggesting it will surpass $6 trillion this year.\n\nThe app was previously only available to users in India.\n\nFlash, available now to download on both iOS and Android devices, lets you centralize all of your online purchases into one place, while also letting you track multiple shipments, receipts, and your entire order history for the year. By connecting your email to the app, it compiles all the messages sent from brands to create an overview of where you shop, how much you spend, and which brands you frequent the most. It also categorizes your spending into separate areas such as shopping, travel, food and groceries, and entertainment. The insights feature could help you budget more effectively and gain a clearer understanding of your spending habits. For instance, maybe refrain from all those sweet treats at Starbucks (it adds up!).\n\nAdditionally, when you place new orders through various brands, such as Amazon, Booking.com, DoorDash, Instacart, Target, and Walmart, you’ll earn points that can be redeemed for $5-$100 gift cards. With the free version of the app, you earn 10 points for every order and 100 points for flights and hotels. If you opt for the paid plan, you can earn five times the number of points.\n\nThe app is free to download; however, if you upgrade to the Flash Plus plan for $49/year, you’ll receive an email ID (@flash.co) to get a dedicated smart inbox that you can use for all shopping-related emails. The subscription also includes AI-powered spam protection, advanced tracking features, and other benefits.\n\nImage Credits:Flash\n\nFounded by Flipkart’s former senior vice president, Ranjith Boyanapalli, the India-based startup got its start in 2022, when Boyanapalli realized how flooded his email inbox had become with promotional messages from brands.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“If you look at the genesis, it started by being a power shopper and realizing 60% of all my personal communication, the primary email that I use, is actually commerce related,” Boyanapalli told TechCrunch. “I find myself spending across 20 to 30 brands in a year minimum, across all these domains. For example, last year, I received about 12,500 [shopping-related] emails, of which probably 10,400 emails were promotional in nature… So that created the genesis that, ‘Hey, it’s probably time to have a separate shopping identity.’ And that’s how Flash got created.”\n\nSince its launch, the platform has achieved success among users in India, with one million app downloads.\n\nThe company has always planned to expand into additional markets, with the U.S. being a clear choice. Boyanapalli noted that Flash’s U.S. app has been tested by around 200 beta users. Over the past year, these users collectively placed nearly 35,000 orders, totaling around $2 million across hundreds of different brands.\n\n“We thought now is the right time for us to launch and scale up, especially given the holiday season kicking in,” Boyanapalli added.\n\nThe only difference between the two versions is the subscription offering, which is exclusively available in the U.S. Meanwhile, Flash opted for an advertising model in India. However, Boyanapalli noted that this could change.\n\nNext on the roadmap is a global version of the app, which is set to launch in mid-June 2025. The company also plans to raise new capital to support its expansion in the U.S., which is set to take place in the first quarter of 2025.\n\nThe story was updated to clarify that Flash doesn’t have any direct partnerships with brands as of yet."}