{"url": "https://techcrunch.com/2024/04/15/meta-quest-educational-product-for-schools-students/", "title": "Meta thinks it’s a good idea for students to wear Quest headsets in class", "authors": ["Lauren Forristal", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-04-15T00:00:00", "text": "Meta continues to field criticism over how it handles younger consumers using its platforms, but the company is also planning new products that will cater to them. On Monday, the company announced in a blog post that later this year it will be launching a new education product for Quest to position its VR headset as a go-to device for teaching in classrooms.\n\nThe product is yet to be named, but in the blog post describing it, Nick Clegg, the company’s president of global affairs — the ex-politician who has become’s Meta’s executive most likely to be delivering messaging around more controversial and divisive topics — said that it will include a hub for education-specific apps and features, as well as the ability to manage multiple headsets at once without having to update each device individually.\n\nBusiness models for hardware and services also have yet to be spelled out. With nothing on the table, the company is framing it as a long-term bet.\n\n“We accept that it’s going to take a long time, and we’re not going to be making any money on this anytime soon,” Clegg said in an interview with Axios.\n\nOn the plus side, a push into education could mean more diversified content for Quest users, along with a wider ecosystem of developers building for the platform — not the killer app critics say is still missing from VR, but at least more action.\n\nOn more problematic ground, the news is coming on the heels of a few other developments at the company that are less positive. Meta’s instant messaging service WhatsApp has been getting a lot of heat over lowering the minimum age for users to 13 in the U.K. and EU (it had previously been 16).\n\nMonday’s announcement arrives on the heels of Meta prompting Quest users to confirm their age so it can provide teens and preteens with appropriate experiences.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe new initiative will roll out later this year and will only be available to institutions with students 13 years old and up. Meta said it will launch it first in the 20 markets where it already supports Quest for Business, Meta’s workplace-focused $14.99/month subscription. That list includes the U.S., Canada, the United Kingdom and several other English-speaking markets, along with Japan and much of western Europe.\n\nThere are a number of companies already in the market exploring the idea of VR in the classroom, with names like Immersion VR, ClassVR and ArborXR, not to mention the likes of Microsoft, which has been pushing its HoloLens as an educational tool for a while now.\n\nIt’s not clear how ubiquitous VR use is in schools: one provider, ClassVR, claims that 40,000 classrooms worldwide are using its products.\n\nBut all the same, there remain hurdles to mass market usage. It’s not clear, for example, whether strapping a headset to someone’s face is necessarily a help in a live, educational environment, considering some of the research around young people already getting too much screen time as it is.\n\nAnd another big question mark will relate to the cost of buying headsets (Quest 3, the latest headset, starts at around $500 apiece for basic models), buying apps, and then subsequently supporting all of that infrastructure. Meta said that it has already donated Quest headsets to 15 universities in the U.S., but it’s not clear how far it will go to subsidize growth longer term."}