{"url": "https://techcrunch.com/2025/04/21/columbia-student-suspended-over-interview-cheating-tool-raises-5-3m-to-cheat-on-everything/", "title": "Columbia student suspended over interview cheating tool raises $5.3M to ‘cheat on everything’", "authors": ["Charles Rollet", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-21T00:00:00", "text": "On Sunday, 21-year-old Chungin “Roy” Lee announced he’s raised $5.3 million in seed funding from Abstract Ventures and Susa Ventures for his startup, Cluely, that offers an AI tool to “cheat on everything.”\n\nThe startup was born after Lee posted in a viral X thread that he was suspended by Columbia University after he and his co-founder developed a tool to cheat on job interviews for software engineers.\n\nThat tool, originally called Interview Coder, is now part of their San Francisco-based startup Cluely. It offers its users the chance to “cheat” on things like exams, sales calls, and job interviews thanks to a hidden in-browser window that can’t be viewed by the interviewer or test giver.\n\nCluely has published a manifesto comparing itself to inventions like the calculator and spellcheck, which were originally derided as “cheating.”\n\nCluely also published a slickly produced, but polarizing, launch video of Lee using a hidden AI assistant to (unsuccessfully) lie to a woman about his age, and even his knowledge of art, on a date at a fancy restaurant:\n\nCluely is out. cheat on everything. pic.twitter.com/EsRXQaCfUI — Roy (@im_roy_lee) April 20, 2025\n\nWhile some praised the video for grabbing people’s attention, others derided it as reminiscent of the dystopian sci-fi television show “Black Mirror”:\n\nImagine making a black mirror short as a product ad https://t.co/2GKXQj8e1v — Cody Blakeney (@code_star) April 21, 2025\n\nLee, who is Cluely’s CEO, told TechCrunch the AI cheating tool surpassed $3 million in ARR earlier this month.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe startup’s other co-founder is another 21-year-old former Columbia student, Neel Shanmugam, who is Cluely’s COO. Shanmugam was also embroiled in disciplinary proceedings at Columbia over the AI tool. Both co-founders have dropped out of Columbia, the university’s student newspaper reported last week. Columbia declined to comment, citing student privacy laws.\n\nCluely began as a tool for developers to cheat on knowledge of LeetCode, a platform for coding questions that some in software engineering circles — including Cluely’s founders, of course — consider outdated and a waste of time.\n\nLee says he was able to snag an internship with Amazon using the AI cheating tool. Amazon declined to comment on Lee’s particular case to TechCrunch, but said its job candidates must acknowledge they won’t use unauthorized tools during the interview process.\n\nCluely isn’t the only controversial AI startup launched this month. Earlier, a famed AI researcher announced his own startup with the stated mission of replacing all human workers everywhere, causing a brouhaha of its own on X."}