{"url": "https://techcrunch.com/2024/09/04/reonic-raises-e13-million-to-help-small-installers-of-green-tech-like-heat-pumps-and-solar-panels/", "title": "Reonic raises €13 million to help small installers of green tech like heat pumps and solar panels", "authors": ["Anna Heim", "Freelance Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-09-04T00:00:00", "text": "European regulators are pushing hard for greener energy. The REPowerEU plan calls for 10 million additional heat pumps to be added by 2027, and solar panels are also on the rise.\n\nBut most installations are done by small businesses that could be more productive with better work processes.\n\nThis is where German startup Reonic comes in. “We give renewable installers the tools to be extremely efficient, and we do that mainly by providing them with planning and workflow software,” said co-founder Tristan Menzinger (sitting on the right in the picture above).\n\nMenzinger, Lars-Manuel Schneider (sitting in the middle in the picture above) and their university mate and third co-founder Udo Sill all worked at a research institute exploring renewable energy deployment. It sparked their interest in starting Reonic, but they had to listen to real customers to bridge the gap between theory and knowledge. They concluded that installers needed end-to-end software, rather than separate tools.\n\nStartups in other sectors have reached a similar conclusion, but it can be a tough sell when the target audience already has ingrained habits. Reonic’s promise is to make it worth it by helping installers sell faster, and sell more. “Being able to combine heat pumps, for example, with solar systems, doubles the volume that you’re selling,” Schneider said.\n\nUnlike some competitors with narrower niches, such as solar, Reonic’s focus is renewable energy as a whole, whether that’s photovoltaics, energy storage systems, wall boxes or heat pumps. Beyond a specific type of installation, the bigger goal they see is energy self-consumption for every household or business, Schneider said. “And this is something in the core of our product that always works the same, regardless where we are.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe promise to accelerate renewable energy adoption seems to resonate with investors; in order to expand across Europe, Reonic just raised a €13 million Series A funding round led by Northzone, with participation from existing investors Point Nine and Puzzle Ventures.\n\nThis matches the preference that VCs are showing for climate-focused startups that face market risk with their go-to-market strategy, as opposed to science risk from inventing a new technology.\n\nEven then, market risk is still real. Aurora Solar, a U.S. company that provides software to help solar installers manage their sales, laid off 20% of its staff of about 500 people earlier this year after raising a total of $523 million.\n\nBut with 21 team members so far and €16 million in funding to date, Reonic is more akin to smaller companies like Arch, Enerflo, Lun and Scoop Solar.\n\nImage Credits:Reonic\n\nIt’s also seeing growth typical of early-stage companies that have found some product-market fit, tripling its recurring revenue in the past six months alone, the company says. “Though we’ve had some real momentum since we started the business three years ago, in truth, we feel like we’re just getting started,” said Schneider.\n\nWhile subsidies and other legal frameworks vary from country to country, Reonic’s internationalization is driven by its founders’ conviction that it can enter new markets without a lot of customization. After the DACH region, it went live in France and also did a soft launch in Italy, said Menzinger, who oversaw most of the process.\n\nAugsburg, Bavaria is still their headquarters, but almost half their staff works in Berlin where they opened a second office earlier this year to recruit international talent more easily — another important piece for the expansion that its new round will help fund."}