{"url": "https://techcrunch.com/2025/01/07/alta-resource-breaks-down-e-waste-for-rare-earth-metals-that-electronics-need/", "title": "Alta Resource breaks down e-waste for rare earth metals that electronics need", "authors": ["Tim De Chant", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-07T00:00:00", "text": "Rare earth metals are largely unknown to the general public, but are used in a huge variety of products. The elements, including neodymium, praseodymium, and cerium, themselves aren’t rare. But they’re concentrated in certain parts of the globe and are very challenging to refine into anything useful. Their unique electric and magnetic properties make them essential for electronics like hard drives and headphones, and some are used as contrast agents for MRI and CT scans. Many sell for tens of thousands of dollars per metric ton.\n\nIn recent years, China has become the dominant refiner of rare earths, and the Chinese Communist Party uses them as bargaining chips in tit-for-tat trade disputes with the U.S.\n\n“Typically, there’s 330,000 to 350,000 tons of rare earths produced per year. Historically, almost none of them are produced in the U.S.,” said Nathan Ratledge, co-founder and CEO of Alta Resource Technologies.\n\nThe U.S. Department of Defense is nervous enough that it has made securing the elements a key part of its industrial strategy.\n\n“China can very easily weaponize this critical mineral supply,” Ratledge said. The potential fallout extends beyond defense applications, too. “They’ve already put export restrictions on some stuff that’s pretty critical to a lot of real valuable companies like Nvidia and Apple.”\n\nThe U.S. currently has one operating rare earth mine in California, but it has had a rocky history. Ratledge said there’s an alternative, though, lurking in the tons of e-waste the country generates every year.\n\nAlta claims it has developed a way to extract rare earth elements from low-grade supplies more efficiently than current refining techniques, which tend to rely on toxic chemicals applied over dozens of steps. The company, which until now has operated in stealth, instead uses a series of proteins that are specially designed to latch onto rare earth elements, whether they’re from virgin ore or electronic waste.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“It’s hard for chemicals to differentiate between neighboring elements on the periodic table,” Ratledge said. “When things are less complex, chemicals can tend to win, because chemicals are cheaper. And when things are more complex, biology tends to shine because of the selectivity. The trick is harnessing biology in the right way.”\n\nAlta’s proteins are attached to a resin and loaded into a column through which solutions containing rare earth elements are allowed to percolate. The proteins snatch rare earths out of solution and, when they’re saturated, the column is flushed and washed to release the metals. Ratledge said the proteins have proven to be surprisingly durable.\n\nThe company is planning to build a pilot-scale plant this year that’s about the size of a shipping container. Ratledge said that Alta “has reasonable conviction” that the federal government will help fund at least part of the cost of the pilot.\n\nTo help with refining the technology and scaling it up, Alta has raised a $5.1 million seed round, the company exclusively told TechCrunch. The round was led by DCVC and Voyager Ventures with participation from Orion Industrial Ventures, Overture, and WovenEarth Ventures. The startup has also secured about $1 million in grant funding from DARPA and the state of Colorado.\n\nThough Alta won’t be able to shift rare earth refining back to the U.S. overnight, Ratledge is optimistic that his company can produce enough metal to help the Pentagon breathe easier.\n\n“To de-risk some of the core national security concerns, you don’t need hundreds of thousands of tons. You’re talking single-digit-thousands of tons. Being able to meet those needs for the U.S. government is a near-term opportunity for us and other people like us,” he said."}