{"url": "https://techcrunch.com/2025/03/12/ditto-lands-82m-to-synchronize-data-from-the-edge-to-the-cloud/", "title": "Ditto lands $82M to synchronize data from the edge to the cloud", "authors": ["Paul Sawers", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-12T00:00:00", "text": "Ditto, a company that’s setting out to bring “resilient” connectivity to edge devices, has raised $82 million in a Series B round of funding at a post-money valuation of $462 million, more than double its Series A valuation from 2023.\n\n“Edge,” in the context of Ditto’s industry, refers to a distributed computing model that brings data processing and storage closer to where it’s generated (e.g. IoT sensors, 5G routers, or smartphones) rather than having to rely on centralized data centers and cloud platforms. It’s all about reducing latency and optimizing bandwidth requirements by processing data either on a device itself, or on dedicated “edge servers” located near where the data is generated.\n\nIn the age of AI and computationally intensive machine learning models, this can be vital, particularly when real-time decisions are paramount, or any situation where connectivity is patchy. Speed is the name of the game.\n\nDitto bypasses physical edge servers, which its CEO and co-founder Adam Fish says is a costly, labor-intensive endeavor that customers can do without.\n\n“Imagine your local fast food restaurant chain — if they’ve added in additional servers and built out Wi-Fi networks in all their locations, when something goes wrong, no one on-site is equipped to fix it,” Fish told TechCrunch over email. “This restaurant is required to have costly technicians available. One customer described the situation as ‘whack-a-mole’.”\n\nInstead, Ditto uses the hardware that companies’ workforce already employ, such as smartphones.\n\n“We replace hardware with software — a no-brainer choice,” Fish added.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nFlying high\n\nDitto team photo Image Credits:Ditto\n\nFounded in 2018, San Francisco-based Ditto raised $45 million in Series A funding two years ago, in addition to a $9 million seed round in 2021. The company has already amassed an impressive roster of customers, including a $950 million contract with the U.S. Air Force in 2022. In the past year, Ditto says its customer count has doubled to more than 30, and its annual recurring revenue (ARR) has increased by 250%, though it declined to divulge specific numbers.\n\nDitto’s platform constitutes a core “edge sync” component, which is an embeddable software development kit (SDK) that device-makers can integrate with their application. This allows companies to tap into devices’ built-in Bluetooth, Wi-Fi, or local LAN capabilities to create “ad-hoc mesh networks,” whereby apps can discover and communicate with each other independently of a centralized cloud server. Ditto serves as a mobile database that apps read and write to locally.\n\nIt’s this approach that has led Ditto to attract several major airlines as customers, including Delta, Japan Airlines, and Lufthansa.\n\n“Airlines require constant crew collaboration, especially while in-air, but cabin connectivity is often unstable,” Fish said. “This means the apps [that] cabin crew use to stay in touch during takeoff, in-flight, and landing can often be disrupted, leading to poor communication among the team and, at times, a poor customer experience.”\n\nDelta, for example, has built a mobile app for its flight attendants that integrates Ditto’s SDK and works on standard company-issued iPhones.\n\n“Flight attendants can now chat with each other from anywhere in the cabin, making it easy to collaborate with team members consistently during the flight and provide the best customer experience,” Fish added.\n\nFrom the edge to the cloud\n\nThere’s no ignoring the power of modern cloud computing, though, and certain functions require the kind of computing power only a remote server can provide. For instance, autonomous vehicles pack a bunch of sensors and cameras to capture real-time data on their surroundings, and they need to be able to process this data locally in real time to safely maneuver around vehicles rather than relying on cloud connectivity.\n\nAt the same time, an AV company will also need to pool vast swathes of data to perform more advanced machine learning tasks and improve its AI models. Such tasks would typically require the company to pass data to the cloud.\n\nThe same principle applies to myriad other industry verticals, from point-of-sale (POS) systems in retail to IoT sensors in factories.\n\nDitto bridges edge devices and the cloud, letting developers store and sync data “peer-to-peer” (P2P) across their systems while remaining synchronized with data stored elsewhere. As such, Ditto offers distinct pricing for customers that only want to sync between the cloud and their edge devices, without the mesh networking element.\n\nUltimately, it’s all about creating resilient software infrastructure, where bottlenecks or bandwidth issues don’t impede a company’s ability to operate.\n\n“The goal is that your architecture does not rely on the cloud, but it doesn’t mean the cloud and centralized systems don’t have a place,” Fish said. “Instead with Ditto, they can do what they are best at — large-scale data integration and long-term storage, but not act as a bottleneck for operational data.”\n\nDitto’s product tiers Image Credits:Ditto\n\nWith the fresh $82 million in the bank, Fish says the company plans to grow its team and scale its core product, including forging partnerships with cloud database vendors. This will build on its existing partnership with database giant MongoDB — the two recently launched the MongoDB Connector, which is a native integration to synchronize data between edge devices and MongoDB databases.\n\nMoreover, as AI encroaches into the fabric of society, edge computing could come into its own given that many AI-driven applications demand real-time data processing and low latency. And then there’s the data privacy aspect, as sensitive data can be processed locally rather than sent to the cloud.\n\n“There are massive tailwinds to edge computing, especially with the rise of AI,” Fish said. “Running models at the edge not only adds resiliency, but improves privacy and lowers costs, too. Our vision with Ditto is it becomes the de facto company and platform you turn to when thinking about ‘edge’.”\n\nDitto’s Series B round was led by Top Tier Capital Partners and Acrew Capital, and saw participation from Advance Venture Partners, Amity Ventures, Friends & Family Capital, Fundrise, Innovative Technology Fund (USIT), Internet Initiative Japan (IIJ), and True Ventures."}