{"url": "https://techcrunch.com/2024/01/30/acorai-seed/", "title": "Heart failure monitoring startup Acorai turns heads with oversubscribed seed", "authors": ["Natasha Lomas", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-01-30T00:00:00", "text": "Swedish medical device startup Acorai is pairing proprietary sensing hardware and machine learning software with the goal of putting a non-invasive heart pressure monitoring tool in the hands of clinicians — starting with doctors in the U.S.\n\nPatients hospitalized with heart failure typically need to undergo an invasive procedure, such as catheterization or having an implant, in order for their medical team to gain information on the pressures inside the chambers of their heart to support their care and treatment. Acorai’s novel Heart Monitor device offers the promise of a far more accessible way for qualified medical professionals to get this kind of reading — directly through the patient’s skin.\n\nThe 2019-founded startup has patented a multipronged sensing system that’s able to pick up different signals through the patient’s chest — vibrations, sounds, a visual read of blood flow and the heart’s electrical activity — in order to estimate intracardiac pressure without the patient having to undergo anything more invasive than having a nurse or clinician pop the sensing hardware on their chest for a few minutes.\n\n“The original idea was to be a remote monitoring tool for patients,” CEO Filip Peters tells TechCrunch. “For a patient to take home the tool and do this themselves, in their home, enabling preventive care . . . But then we realized that the in-hospital workflow seems to be completely overlooked and cardiologists and nurses and hospitals were sort of screaming out for a tool that they could use to help manage patients that are already in the hospital. And realized that that was perhaps a a superior value proposition — at least to start off with. And that’s what we’ve focused the company on.”\n\nThe initial target for the heart monitoring product is suspected or confirmed heart failure patients — of which he says there are about 60 million worldwide.\n\n“By our estimates, only about 10% of [heart failure] patients actually get the invasive procedure,” he adds. “So I think one of the benefits that we have is that you can follow your patient temporarily — you can measure two or three times per day and then see the trend of these measurements over time. Which with a one-off catheterization you can’t by definition.”\n\nInside the handheld unit — which is roughly the size (and shape) of a smartphone, in a visual nod at the growing consumerization of medical kits — are seismic sensors that detect tiny vibrations on the surface of the patient’s chest; acoustic sensors (“effectively our own optimized stethoscopes,” per Peters) that he says listen for “very specific frequency ranges”; visual sensors that aim to detect blood flow just under the skin; and ECG sensors to measure the electrical activity of the heart.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We borrowed heavily from non-medical industries — in terms of choosing the sensor stack, the technology stack,” he explains. “Primarily the oil and gas industry — and kind of engine diagnostics. What we found there is that there’s been a lot of research into non-invasive sensing of fluid and pressure dynamics, using seismic sensors and acoustic sensors. So non-ultrasonic sensors and detecting, effectively, very small vibrations that correlate with pressure and flow.”\n\nPeters says the system feeds the raw sensor data into proprietary machine learning algorithms Acorai has developed, which are trained to identify patterns and combine signals “optimally” to estimate patients’ intracardiac pressures directly.\n\n“There’s no traditional signal processing that creates a waveform for someone to look at. But we’ve found that there’s a lot of signal value in raw [sensor] data,” he suggests. “So what we present on the screen is a direct estimate of the pressure — and not, you know, a red/yellow/green risk index or something like that. But a very real and interpretable number that [clinicians] can then bake into the overall assessment of those patients.”\n\n“We are able to estimate these pressures directly, as opposed to an AI index of risk or something like that — and I think that’s a very important competitive differentiator for us,” he adds. “It is what the cardiologists and nurses want to see in terms of the output. Something that doesn’t tell them what to do but that they can bake into the overall assessment of their patients. That’s been a recurring recurring theme for a lot of the market interviews that we’ve done.”\n\nOn accuracy, he says the data the Heart Monitor presents is “clinically meaningful information” — summarizing it as “similar to the implantable sensors on the market.”\n\n“What that means in numbers is we have correlation of above .8 versus that right heart cath[eterization] gold standard,” he also tells us, adding: “Given that we are non-invasive, we have a bit more leeway to be, perhaps, less accurate — even though we’re currently meeting those standards.\n\n“Equally, when we’re looking at specific cut-off points — so identifying elevated pressures, for example — we are in the high 80s in terms of percentage accuracy levels. So, overall, really good. That was our pilot study in Sweden — which was over 300 patients and over 1,000 measurements. And now we’re doing that same study with a second generation of the device in a large global study with 1,500 patients, 14 hospitals in six countries.”\n\nAsked about risks of bias in AI-powered analysis of sensor data, such as if training datasets do not properly reflect the diversity of the patient population, he says they’ve used a mix of their own proprietary datasets (collected during clinical studies) and other data they were able to access, via healthcare provider partners including in Sweden, London, the U.S. and Canada, to try to ensure the development of robust machine learning algorithms.\n\nHe also says the decision to include a range of sensors in the hardware was aimed at shrinking bias and accuracy risks, so the device can, for example, adapt outputs to the patient. “Part of why we have such a diverse range of sense technologies is for our machine learning models to be able to dynamically adapt to the type of patient that we are looking at,” he says.\n\n“So if it is a patient with, perhaps, a darker skin pigment, then the visual sensors may be less important in making a final estimate of that patient, for example. So we’ve built in internal controls on bias — but then also, you know, robustness in terms of how the device records, so adjusting for patient movement, adjusting for loud environments when the patient is recording and things like that.”\n\nIt’s also worth noting Acorai is positioning the handheld product as a clinician-support tool, rather than a diagnostic medical device. So the tool is intended to be always in the hands of a trained medical professional who would, ultimately, be responsible for taking any patient care decisions.\n\nDespite prototyping and building the product in Europe, Acorai’s go-to-market strategy is initially focused on the U.S., where — pending regulatory clearance — it’s hoping to get the handheld to market and into hospitals in the second half of 2025.\n\nBack in August, it was granted a “Breakthrough Device Designation” by the U.S.’ medical device regulator, the Food and Drug Administration (FDA), under a new program it’s running. Specifically, the designation was for “the non-invasive estimation of diastolic pulmonary artery pressure (dPAP), systolic pulmonary artery pressure (sPAP); and mean pulmonary artery pressure (mPAP) in patients with Stage C Heart Failure who have been referred for hemodynamic monitoring.”\n\nFor that it provided preliminary data of 281 patients from a 400-patient Swedish pilot study, which its PR claims “demonstrated a strong correlation to the invasive gold-standard measurements of pulmonary pressure.”\n\nThe next step will entail Acorai undertaking a larger study so it can submit more data to the FDA to support an application for clearance for clinical use of its tool in the U.S.\n\nIt’s one of a handful of startups participating in the FDA’s “Breakthrough Device Program,” which is aimed at supporting the development of novel devices to get to market. Peters says this program’s “tailored support” has been extremely helpful — saying it’s one of the reasons why the team is opting to commercialize their product in the U.S. first, rather than in Europe, where healthcare regulation (and markets) are more fragmented.\n\nHe also points to recent changes to EU medical device rules that he says have slowed down clearances for novel medical devices as the notified bodies that have to do conformity assessments get up to speed with the 2021 Medical Devices Regulation.\n\n“Whereas the FDA seems to be going the other direction — streamlining the process for, particularly, ‘breakthrough technologies’ . . . and making it easier for companies like ours to get to the market,” he suggests.\n\nThe startup, which eagle-eyed attendees of TechCrunch Disrupt 2022 might recall since it was exhibiting as one of the Startup Battlefield 200, has just closed a $4.5 million+ seed raise. The oversubscribed seed round was led by Solardis Health Ventures, with participation from KHP Ventures, Carma Fund and a number of other new U.S. investors. Acorai adds that “significant” follow-on investment came from existing investors from across Sweden and the EU.\n\n“Both Mayo Clinic and Cedars-Sinai invested,” notes Peters. “We have Bayer on the heart failure pharma side invested. And then, as usual, a lot of angel investors — but then also some smaller VCs out of London.”\n\nHe says the seed funding will “mainly” be used for clinical studies as it works toward FDA approval for clinical use (rather than the “investigational” use the FDA’s breakthrough device designation permits). Toward the end of this year, the team will also be looking to raise a Series A, per Peters, “for getting us through the regulatory pathways around the world but also for that initial go-to-market commercialization primarily in the U.S.”"}