{"url": "https://techcrunch.com/2024/08/27/creators-are-angered-by-metas-spark-ar-shutdown-saying-theyll-be-out-of-work-with-little-notice/", "title": "Creators are angered by Meta’s Spark AR shutdown, saying they’ll be out of work with little notice", "authors": ["Sarah Perez", "Consumer News Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-08-27T00:00:00", "text": "Creators are unhappy with Meta’s decision on Tuesday to shut down its Spark platform, which allowed third parties to build augmented reality (AR) effects. In posts published to the Meta Spark Community on Facebook, creators are posting about their disappointment in Meta’s decision, noting that for some of them, the move will put them out of work — and they only learned this from a Facebook post this morning. Others seem either confused or angry about the plan to close Spark and are demanding to know the reasoning behind the company’s move.\n\nOn the Meta Spark website, the company said it will be shutting down its platform of third-party AR tools and content effective Tuesday, January 14, 2025. After that point, the AR effects built by brands and AR creators will no longer be available for use. Those built and owned by Meta will remain available across Meta’s family of apps, however.\n\n“We are deeply grateful to the community of creators, businesses, and other key stakeholders who have been part of the Meta Spark journey,” according to the announcement. “When we first launched this platform seven years ago, experiences infused with augmented reality were new to most consumers. Since then, the imagination, innovation, and creativity of our AR creator community has helped extend the reach of AR to hundreds of millions of people across Meta’s platforms.”\n\nFirst launched in 2017, Meta Spark debuted when augmented reality experiences were still relatively novel and new to many consumers. Since then, the AR effects have been used “billions of times” by “hundreds of millions of Meta users,” the company said in the announcement. The sizable traction had made Meta Spark one of the largest AR platforms at the time.\n\nIn addition to building effects for Facebook and Instagram, the program expanded in 2021 with the ability to build AR effects for video calls on Messenger, Instagram and (the now discontinued) Portal devices. At that time, the company said more than 600,000 creators from over 190 countries had built AR effects using its tools.\n\nMeta suggested its decision wasn’t related to the platform’s adoption or traction, saying the decision to shut down Spark was made “following a thorough assessment” and that the move will allow Meta to “prioritize the products we believe will best serve the future needs of our consumers and businesses alike.” Likely the products Meta aims to now prioritize are those associated with its AI tools and initiatives, though the company didn’t say that directly.\n\nMeta may have more news about what’s next for developers at its upcoming Meta Connect event scheduled to kick off September 25 in Menlo Park. Of particular interest is that Meta is rumored to be working on an updated version of its AR smart glasses that will differ from its current Ray-Ban Smart Glasses. Given the tech giant’s reported interest in AR technologies, it’s somewhat odd for it to shutter a program that catered to fostering AR development while risking the ire of its developers.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAccording to one creator, Douglas Costa, in a post on the Meta Spark Community page on Facebook: “Over the past few years, we creators have invested money, knowledge, advertising, and an entire infrastructure to make this our livelihood. You can’t just abruptly end support for filters in such a simple and easy way — it’s a huge disrespect to us and also to the Facebook/Instagram users, most of whom continue using the platform because of these effects. Five months to end development? It should be at least a year so that we creators can have a better opportunity to build a new portfolio or find a new job. This is inadmissible. I sincerely hope you reconsider this absurd idea of shutting down the platform.”\n\nCosta’s post was followed by a poll about the shutdown. (Unsurprisingly, most creators voted that Meta shouldn’t end Meta Spark.)\n\nMeta recommends that AR creators who have published effects to Instagram, Facebook or Messenger should download and save their project files, assets and demos before the shutdown date of January 14. The company said it will also archive the Meta Spark Community group after this date as well."}