{"url": "https://techcrunch.com/2023/08/29/quantum-machines-next-gen-quantum-control-solution-that-can-scale-beyond-1000-qubits/", "title": "Quantum Machines’ next-gen quantum control solution that can scale beyond 1,000 qubits", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-08-29T00:00:00", "text": "Tel Aviv-based Quantum Machines today announced the OPX1000, the latest iteration of its quantum controller. Built for large-scale quantum computers, the OPX1000 can control 1,000 qubits and more, well beyond what its predecessors the OPX and OPX+ controllers could handle.\n\nQuantum Machine’s controllers have allowed many of the leading quantum computer manufacturers to deliver on the existing roadmaps. But now, those companies are looking to build machines with 100,000 qubits or more within the next decade and beyond, getting the noise under control — figuring out how to control them is yet another major challenge.\n\nQuantum Machines co-founder and CEO Itamar Sivan told me that he believes the original OPX in 2019 and then the OPX+ drove a major paradigm shift in how people looked at quantum control and orchestration. “It was a paradigm shift in the sense that people used to operate quantum processors with what you could call a memory-based control system,” he explained. He likened those memory-based systems to memorizing massive multiplication and division tables. That allows you to program the quantum processors but it’s not a smart system. It can’t quickly react to changes in the processing unit and it can’t handle increasingly complex algorithms.\n\nQuantum Machine’s original breakthrough was that it moved from memory-based to processor-based machines. The QPX1000 pushes this a step further by not just featuring an updated version of the company’s Pule Processing Unit (PPU), but also an increased number of control channels (64 output and 16 input channels), which Quantum Machines says allows it to offer “the highest in-class density of control and readout channels” on the market right now. In part, it’s the improved networking stack that allows Quantum Machines to now scale its solution to more than 1,000 qubits.\n\nAll of this fits into a data center-ready 3U package and it’s worth stressing that this is very much a solution for some of the most sophisticated players in the quantum space. That also means that not everyone currently needs the OPX1000 and Quantum Machines will continue to offer the OPX+, too.\n\nCurrently, hundreds of research labs, HPC centers and quantum computer manufacturers are using the existing OPX controllers. For the OPX1000, Quantum Machines recruited a small number of beta users who are already testing the new systems. The company wasn’t quite ready to go on the record with their names, though. The OPX1000 will be generally available later this year, though, and I expect we’ll hear more from Quantum Machines’ customers then.\n\nLooking ahead, Sivan explained that figuring out how to scale beyond 10,000 qubits is still an open question.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“When if you have a wonderful Quantum Processing Unit with 20 cubits, let’s say, if you’re not using the most advanced control system in the industry, you’re really not even getting a fraction of its capabilities,” he told me. “If you look beyond 10,000, there’s still question marks. Even for players like Quantum Machines that have sold what’s needed for the 1,000 [qubits], I can tell you for sure that there are still many open questions and a lot of research left to do with what’s happening beyond that.”\n\nIn part, he noted, that’s why Quantum Machines recently partnered with Nvidia to combine classical and quantum machines."}