{"url": "https://techcrunch.com/2024/03/14/even-with-nft-sales-down-pallet-exchange-raised-2-5m-with-a-plan-to-make-trading-more-social/", "title": "Former web3 gaming founders raise $2.5M for their NFT marketplace to retain users even when there ‘isn’t money to be made’", "authors": ["Jacquelyn Melinek", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-03-14T00:00:00", "text": "Even though NFT sales volume is still down 88% from 2022 all-time highs (and down 38% year-to-date), Pallet Exchange is building a new type of NFT marketplace focused on user retention. And it’s doing it on a blockchain less known for NFT trading: Sei.\n\nCo-founders Kelvin Wang and Davy Li have convinced investors that there’s still enough of a future in NFTs beyond silly social media profile pictures (PFPs) to have raised a $2.5 million in a private funding round with participation from Spartan Group, Symbolic Capital, Cypher Capital and angel investors from Coinbase, MoonPay and more, TechCrunch learned exclusively.\n\nWang and Li are probably best known for creating The Beacon, one of the most popular web3 games on Arbitrum, a layer-2 blockchain built on top of Ethereum. “That was the initial impetus, we saw the landscape of games and thought we could build a better game and had a vision of that,” Li said of why they next built an NFT marketplace.\n\nThey see strong promise in the future of NFTs due to human behavior. “The fundamental draw from a user to trade and flip is very human naturey,” Wang said. “We’ve seen that with collectibles, cars and toys.”\n\nWhile building out The Beacon, they saw friction at the marketplace level with speed, transaction time and user experience, so they decided to build a marketplace that was faster and easier to use, Wang said.\n\nIn crypto, platforms are often hyper focused on all things financial.\n\n“It’s cool if there’s a lot of financial innovations happening, but at the same time we saw there’s pain points from a user experience,” Li said. “It’s hard for novices to jump in and be hit with numbers and dashboards. Imagine throwing a beginner person who’s never touched stocks into the Bloomberg terminal. It’s like that.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nStill, making money is a key driver for crypto enthusiasts (and many fail, for what it’s worth).\n\nAnd the Pallet founders say they recognize that in the bear market, such as the most recent one, when it’s far harder to make money, especially for a novice, new marketplaces like theirs will have a harder time retaining customers. “That’s the piece we wanted to experiment with and innovate on liquidity and retention mechanisms.”\n\nSo, even in instances where the “number doesn’t always go up,” the marketplace wants to make users feel like they’re progressing and doing meaningful, fun things with their NFT collections. It’s using social media tactics like in-app messaging that lets people interested in the same NFT collections engage with each other on its marketplace.\n\n“Imagine the moment you purchase an NFT you’re added to a group chat with other holders and there’s a community aspect to it,” Li said. “We want to roll out certain clans where friends can collaborate and we’re trying to take a page out of the live operation games we see and [create] an enhanced system compared to pure points that a lot of marketplaces use” to gamify the NFT marketplace experience.\n\nAll in all, Pallet wants to be a “good trading experience for normies,” Wang said. “We want to create a platform that brings liquidity, and regular crypto people and regular users through gamification of social features.”\n\nBut when it comes to the largest blockchains in the NFT space, Ethereum, Bitcoin and Solana lead the pack with over $1.3 billion in sales volume during the last 30 days, according to CryptoSlam data. So why build a marketplace on a blockchain with less traction?\n\nWell, Sei’s layer-1 blockchain is extremely fast at 12,500 transactions per second and has low gas fees, aka transaction costs. And the team thinks there’s opportunity in its less-chartered territory.\n\n“We saw it as a parallel to early Solana days. We took a leveraged bet this is going to be the chain of the future because it allows for something Solana wasn’t able to do, tap into the EVM liquidity market in a natural way,” Wang said.\n\nPlus the creators of the Sei blockchain are working on attracting the hoards of Ethereum Virtual Machine (EVM)-based developers by creating a tech called The Parallel Stack — something that hopes to make Ethereum faster and less costly.\n\nSei’s EVM work has convinced Pallet that Sei’s overlords will “grow the pie here,” Wang says.\n\nBetting on Sei, its social aspects and its friendly user interface has paid off so far. Pallet is one of the fastest growing NFT marketplaces by volume growth across all blockchains.\n\nPallet launched in September, and saw a “boom” in December, Wang said. That’s when Seiyans, an Sei-based NFT collection fueled by meme culture, capitulated the new blockchain and marketplace into the talk of the crypto world. Seiyans NFTs can be bought and sold on Pallet.\n\nToday, it has about 99% of NFT market share on Sei and has done over $20 million in trading volume year to date, with over 2 million users visiting its platform this past year, and has 40,000 to 50,000 daily users, Wang said. Its revenue model includes taking a 2% fee on transactions, which brings its annual run rate to $2 million or more, Wang said. “It’s a great start for us.”\n\nOver the past few weeks, Wang says there’s been a growing interest in art NFTs, collectables that aren’t throwbacks to the whole Bored Apes PFP phenom, although PFPs still have their fans as well. Down the line, Pallet plans to look into working with big partners in the art marketplace and create a separate marketplace for those creators. “We don’t want to put a one-of-one artist with a bunch of PFPs, we want to create unique experiences for both,” Wang said."}