{"url": "https://techcrunch.com/2022/05/06/ava-sets-the-example-for-universal-live-captioning-and-raises-10m-to-keep-building/", "title": "Ava's tools provide instant captions", "authors": ["Devin Coldewey", "Writer", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-05-06T00:00:00", "text": "When we last checked in with AI-powered captioning service Ava, they had just raised a seed round and it was six months into a pandemic that would reshape how we all work together. Eighteen months later they have investors banging on their door following huge growth, and aim to keep showing the tech industry how deaf and hard of hearing people ought to be included in the hybrid workplace.\n\nThe company’s tools provide instant captions for any voice the user hears, whether that’s in a video call, on a Tiktok video or out with friends. (There are different apps and capabilities for each platform, naturally, but they all work together.)\n\n“In the last year and a half since our interview, we’ve grown revenue and client base by roughly 10x, largely as our empowerment products rolled out to users in search for better solutions,” Ava CEO Thibault Duchemin told TechCrunch.\n\nBetter is certainly the operative word there, as we’ve seen accessibility options pop up here and there in the productivity tools we often use. But the truth is things like automatic transcription of calls, as useful as they are, amount to only the barest minimum of inclusion, and people with impaired hearing or vision are otherwise almost entirely left out. (And that’s if there are accessible options at all, which is not true of many popular online platforms.)\n\nAva’s approach is to provide a richer and independently configurable captioning tool that works on all content, from podcasts to all-hands meetings to in-person chats, and in such a way that the person can actually make use of it.\n\nWhat’s the point of captioning if you can’t tell who’s talking? Why listen if you can’t respond? Whose job is it to provide transcriptions of content shared on the internal network?\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAva at least provides ways forward in all of these situations, and while a lot of this responsibility is put on the person using the tool, its capabilities mean the workplace can adapt to them more seamlessly. Duchemin noted that the company has deaf and hard-of-hearing people in leadership positions across the team that bring real hands-on experience to the topic.\n\n“With the funding, we’re doubling down on product and engineering, enabling new experiences that integrate Ava in the day-to-day needs of our deaf and hard-of-hearing users, keeping our signature around self-empowerment and accessibility done right,” said Duchemin.\n\nThe funding, a $10 million A round, was led by Khosla Ventures, which participated in the seed but came to Ava wanting to lead this one. Duchemin also noted a new strategic investor in Jim Sorenson, founder of a deaf and hard-of-hearing telecom, hinting at mobile industry integration to come. Initialized Capital, Lerer Hippeau Ventures, LeFonds VC and Ring Capital all participated in the round.\n\nIn addition to the expected improvements on the product and engineering side, and some new partnerships coming down the road, Duchemin said they’re working to “massively expand” the network of “Scribes,” professional human captioners, so that content can be transcribed by a pro nearly instantly.\n\nThese people aren’t full-on transcribers but rather work with the AI tools to correct and augment the process live. While automatic transcripts are very useful, they are not nearly accurate enough to be considered a final output, for example to be published without editing in an article like this one. Human transcription is necessarily slower and more expensive, but Ava thinks it can get the delay down to the point where you can have a nearly perfect transcript within a minute of something taking place.\n\nIncidentally, the matters of deafness and being a child of deaf adults were recently top of mind as the film CODA took home a couple Oscars for its depiction thereof. And Ava was on set, being used by the cast and crew when interpreters weren’t around and sign language wasn’t an option.\n\n“This was unprompted, we discovered this while reading Apple TV’s feature promoting the apps on the set,” said Duchemin. “I think deaf and hard-of-hearing users ultimately choose the tools that serve them, and their entourage benefits from them. This is a virtuous circle!”"}