{"url": "https://techcrunch.com/2025/04/16/bolts-ryan-breslow-pins-his-hopes-on-a-new-app-that-takes-on-coinbase-zelle-and-paypal/", "title": "Bolt’s Ryan Breslow pins his hopes on a new app that takes on Coinbase, Zelle, and PayPal", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-16T00:00:00", "text": "Ryan Breslow is officially back.\n\nWhile the founder of one-click checkout company Bolt re-assumed its helm as CEO in March, Breslow is unveiling Wednesday a new “superapp” that he hopes will formally mark his return as the fintech’s leader. He describes the new product as “one-click crypto and everyday payments” in a single platform, in an exclusive interview with TechCrunch.\n\nThe controversial entrepreneur famously stepped down in January 2022 from the San Francisco-based company he started in 2014 after dropping out of Stanford. In recent years, Breslow has been the target of more than one investor lawsuit and faced allegations that he misled investors and violated security laws by inflating metrics while fundraising the last time he ran the company.\n\nBreslow acknowledges that Bolt’s revenue has not been robust in recent years. But he hopes to change that with this new consumer app, which he ambitiously hopes will serve as “a centralized and personalized hub for financial services.”\n\nThe app at once competes with a number of other companies such as crypto exchange Coinbase, payments platform Zelle, and PayPal. Its advantage, Breslow claims, is the ability to do what all these others do from one place via mobile.\n\nFor example, the app will allow users to buy, sell, send, and receive major cryptocurrencies such as Bitcoin, Ethereum, USDC, Solana, and Polygon directly within the app. Users are provisioned an on-chain balance powered by Zero Hash and will be able to see their balance in real time, Breslow says.\n\n“I founded Bolt 11 years ago to build the easiest app to buy, sell, and send crypto. I believe this still hasn’t been done well in the marketplace. Today marks a significant day: the return of that original vision,” said Breslow. “We call it ‘Coinbase for the 99%’ who may not be the most technical, but still want to participate in the buying and selling of crypto.” (Bolt in 2022 paid $1.5 billion for cryptocurrency payments company Wyre. It started out as an “easy way to buy, sell, and send crypto” before pivoting to build one-click checkout first.)\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBreslow is also hoping to pick up where Zelle left off with the shutdown of its standalone app. With Bolt’s new offering, users can process peer payments “with just a single click” within its app. With Zelle, users can only send payments to peers through banking apps.\n\nOn top of that, Bolt has partnered with Midland States Bank to now also offer a debit card that features a rewards program, including up to 3% direct cash back on eligible purchases and up to 7% in Love.com store credits. (Love.com is another startup founded by Breslow in 2023 that is focused on health and wellness. He remains its CEO.)\n\nAs Bolt doesn’t offer banking services, users will have to transfer money from another bank account into this one to fund purchases with the debit card.\n\nAnd lastly, the new app also provides real-time order tracking for users — something other companies such as Klarna offer in their app, as well.\n\nThe app is available today in iOS and will soon be available in the Google Play store. Once downloaded, users will be added to a waitlist with iOS users being the first to get off the waitlist.\n\n“Working nights and weekends”\n\nThe new “superapp” was built within just six months, Breslow claims. Justin Grooms (Bolt’s president and former interim CEO) and Kartik Ramachandran (Bolt’s chief product officer) began work on the app before Breslow was reinstated. Breslow helped advise them during the months prior to his reinstatement.\n\n“Our team has been working nights and weekends to get this ready in time,” Breslow said. Presently, Bolt has about 140 employees.\n\nDespite lackluster revenue growth, Breslow claims that Bolt has managed to still grow in terms of users — with a two-sided network of tens of millions of U.S. shoppers and “hundreds” of merchants such as Revolve and Kendra Scott.\n\nBolt’s ARR stood at about $28 million with $7 million in gross profit as of the end of March 2024, tech publication Newcomer reported last year.\n\n“Prior to my return, our revenue did not grow much and we haven’t closed as much business as we’d like. We don’t think the company was run as well as it could have been. And that’s something I’m going to change very quickly,” Breslow told TechCrunch. “However, our platform kept on enrolling shoppers and attracting network growth. When I left, it was at 10 million. Now our total shopper network is 80 million in the U.S. and even larger globally.”\n\nHe’s hoping to turn that network into revenue for Bolt by earning money from interchange fees for every debit card transaction and charging fees for the purchase and sale of crypto.\n\n“We already have a large trove of data users have provided that has been verified and charged successfully,” he said.\n\nSettling lawsuits\n\nThe fintech company last year was reportedly trying to raise $450 million in an unusually structured deal that would have valued it at $14 billion. That deal raised questions over its unusual use of $250 million in “marketing credits” and lack of confirmation from an investor mistakenly identified as its lead.\n\nSome of Bolt’s investors, including BlackRock and Hedosophia, sued to block the round, Forbes reported, but that was voluntarily dismissed by all parties, Bolt announced in March.\n\nToday, Bolt is in “early conversations” on a new round that Breslow projects could close “in the mid to near future.”\n\nBreslow was also previously sued by former investor Activant Capital over a $30 million loan that the founder had taken out. Activant claimed Breslow saddled the startup with $30 million in debt by borrowing that amount and then defaulting, with company funds used to pay it back.\n\nThe case was eventually settled, with Bolt agreeing to repurchase Activant’s shares for $37 million last year.\n\nSpeaking at Fintech Meetup in Las Vegas in March, Breslow defended the loan, framing it as an act of loyalty to Bolt rather than the self-dealing the Activant lawsuit alleged it was.\n\n“I’ve had a tremendous amount of decline over the last three years and have been winning back the trust of judges, investigators, and our team, so it’s been incredibly challenging, but it’s been a remarkable learning experience,” he told TechCrunch. “I’ve learned more in these last three years than in the 10 years prior to that.”\n\nHe added: “And even though it’s been challenging, I couldn’t be more excited about the opportunity in front of us. I feel so grateful that our company has weathered the storm.”\n\nBolt, which provides software to retailers to speed up checkout, raised around $1 billion in total venture-backed funding and at one time was valued at $11 billion. Investors include funds and accounts managed by BlackRock, Schonfeld, Invus Opportunities, CreditEase, H.I.G. Growth, and Moore Strategic Ventures, among others."}