{"url": "https://techcrunch.com/2025/04/03/could-web3-change-the-game-in-the-coming-tariff-wars/", "title": "A web3 startup aims to change the game in the tariff wars", "authors": ["Mike Butcher", "Editor At Large", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-03T00:00:00", "text": "With President Donald Trump’s latest round of tariffs coming out today — a day he is calling “Liberation Day” — a web3 startup thinks it could track tariffs automatically on goods coming into and out of the USA using its blockchain platform. The claim may well be bold — and typical of many such bold claims made by other web3 startups. However, Watr‘s platform is already being used to validate commodities by large mining companies and auto manufacturers, so there may be more to the claim than meets the eye.\n\nCreated by former Shell, BP, and JP Morgan executives, the company is headed by Maryam Ayati, who lead global origination and investment at Shell Trading — so she ought to know what she’s talking about. Watr counts investors from a syndicate of thus-far unnamed crypto VCs and commodity executives, but TechCrunch has seen evidence to suggest that it has several millions of dollars in backing already, and a number of, as yet unnamed, commodities giants.\n\nSaid Ayati over a call: “We will also soon be able to augment reported data with machine-sourced data from the myriad of satellites, sensors, and open source repositories out there watching to see where commodities have come from… were they transferred from a different ship on the sea, for instance?”\n\nThe example that may catch Trump’s ear, she says, is one where a commodity can be pre-checked for tariff before a transaction takes place.\n\n“Some non-western governments we’ve spoken to say that Western-country commodities traders sometimes claim that a commodity they’ve bought will be going to, for example, Europe, but then it’s sent to, for example, and Asian market,” she said. “And they make a lot more money on that because they don’t give the correct cut to the original commodity owners. With our system, the minute tariffs are due, even before money changes hands, the commodity can be checked for whether a tariff is due or not.”\n\nPerhaps the claim would be music to Trump’s ears, but it could certainly have the potential to speed up global trade hit by any tariff-induced slowdowns. The global commodities industry is already worth $20 trillion, so the stakes are clearly high.\n\nWatr’s platform tracks commodities using blockchain-based tools — employing everything from decentralized IDs for institutions to digital fingerprints for raw materials.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAccording to Ayati, the goal is to modernize the plumbing of the global economy: “This isn’t about token hype,” she said. “It’s about transforming how trust, traceability, and liquidity work in the real world.”\n\nBack in 2022 Watr started out with a “nutrition label” to track the provenance of a commodity in terms of regulations, such as CO 2 emissions or other ESG considerations.\n\nBut with ESG falling out of favor, it is now switching to sanctions and tariffs, using its blockchain platform to test for the provenance of commodities to make sure its clients aren’t inadvertently over-stepping any regulatory hurdles before a trade even gets done.\n\nWatr also this week announced its migration to the Avalanche blockchain network. Avalanche is a blockchain developed by Ava Labs which allows companies like Watr to create so-called “sovereign chains” — tailored to specific industry needs, in this case, the world of commodities. It’s already used by JP Morgan, Citibank, and FEMA.\n\nAdmittedly, this isn’t the first time blockchain has been pitched as the fix for the commodities trade.\n\nIn the U.S., “The Seam,” an agriculture-focused digital exchange, partnered with IBM in 2017 to explore blockchain-based cotton trading, targeting transparency and accountability in agricultural supply chains.\n\nThen, in 2018, a group of industry giants including ING, Shell, and ABN AMRO backed the komgo initiative, a blockchain-based platform aimed at streamlining trade finance for commodities. Its goal was to reduce fraud and delays by digitizing key documents like letters of credit and KYC records. Coincidentally, Ayati was also part of that initiative.\n\nHowever, outside of Watr, many of those earlier projects have fallen by the wayside.\n\nCommenting, independent web3 VC Keld van Schreven, founding partner of KR1, told TechCrunch that Watr’s plans would have to be tested by the market: “We’ve seen plenty of grand claims from web3 startups on supply chains, but if Watr can truly bring pre-trade tariff validation ‘onchain’ to scale — especially with backing from major players and a seasoned leadership team — this could mark a serious inflection point for blockchain adoption in global trade.”\n\nHe added that the move to the Avalanche blockchain “also signals they’re thinking about scalability from the start. That said, as ever the proof will be in actual transaction volume and industry adoption beyond the initial pilot stage.”"}