{"url": "https://techcrunch.com/2023/11/02/xage-security-raises-20m-more-to-expand-its-security-platform/", "title": "Xage Security raises $20M more to expand its security platform", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-11-02T00:00:00", "text": "While the number of cybersecurity funding deals reached a high point in 2022, that doesn’t mean that the sector’s tapped out — far from it. According to Statista, there were 148 deals in Q2 2023 worth a combined $1.6 billion.\n\nAnd — at least anecdotally — Q3 deal flow seems healthy, too. Case in point, Xage Security, a startup providing software to thwart network intrusions, today announced that it raised $20 million in a B2 funding round that brings the company’s total raised to $80 million.\n\nPiva Capital, March Capital, SCF Partners, Overture Climate Fund, Valor Equity Partners, Chevron Technology Ventures and Science Applications International Corporation participated in Xage’s B2. A source familiar with the matter tells TechCrunch that the premoney valuation is roughly 60% higher than Xage’s premoney as of January 2022, when the company initially closed its Series B.\n\nGeoffrey Mattson, who was appointed Xage’s CEO in September, says the proceeds will be put toward R&D and expanding Xage’s go-to-market operations — with a focus on expanding its presence in the Asia Pacific region.\n\n“Despite the mixed tech economic conditions, cybersecurity attacks on critical infrastructure are on the rise, and Xage has seen strengthening tailwinds versus headwinds given the threat environment and customers’ needs,” Mattson told TechCrunch in an email interview. “With more businesses operating remotely to reduce costs, delivering zero trust security solutions to critical infrastructure and distributed operations including operational technology, IT and cloud environments has never been more important — and prioritized.”\n\nXage was founded by Susanto Irwan and Roman Arutyunov in 2016 after the two came to realize that attacks on Internet of Things (IoT) devices, including devices like surveillance cameras and temperature sensors, were growing. (The trend continues; in the first two months of 2023, there was a 41% uptick in the average number of weekly attacks per organization targeting IoT devices compared to 2022.)\n\nWith Xage, Irwan and Arutyunov set out to develop a cybersecurity platform that could protect IoT devices and operational technology — the hardware and software used to monitor, control and upgrade industrial systems — whether they’re isolated or connected to the cloud.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nXage’s core offering lays on top of existing environments ostensibly without the need for network changes, either as a part of an on-prem or software-as-a-service installation. Xage “sees” device interactions and data movement and changes on a company’s network, spotting policy violations and executing security policies like invoking multifactor authentication for system logins from unknown locations.\n\nXage certainly isn’t alone in the market for platforms to secure IoT and industrial systems. Dragos is perhaps its biggest rival — at least on the startup front. But Xage has done well for itself where it concerns customer acquisition, securing a $17 million contract with the U.S. Space Force and a $743,000 contract with the U.S. Air Force.\n\nXage’s other clients include infrastructure operators in energy, manufacturing, utilities and transportation. Mattson claims that the ~90-employee startup’s revenue grew 420% while bookings grew 560% in the first half of 2023 year-over-year.\n\n“When the pandemic first hit, Xage saw a short pause in demand as customers tried to sort out their own businesses,” Mattson said. “Luckily, Xage had a comfortable runway as companies are seeing information and data security as key to their continued operations."}