{"url": "https://techcrunch.com/2025/04/18/a-new-kids-show-will-come-with-a-crypto-wallet-when-it-debuts-this-fall/", "title": "A new kids’ show will come with a crypto wallet when it debuts this fall", "authors": ["Lauren Forristal", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-04-18T00:00:00", "text": "A new animated kids’ series expected to premiere this year won’t be headed for a TV network. Or a streaming service. Instead, the founders of production studio We Ghosted Media plan to launch on a decentralized web platform that uses blockchain technology.\n\nAnd yes, a crypto wallet will be involved.\n\nWe Ghosted Media — founded by Chris Jammal, an assistant director for “Bob’s Burgers,” and Jaclynn Demas, producer of hit children’s show “Peg + Cat” — is a TV production studio abandoning traditional show release methods in favor of a decentralized approach, commonly referred to as web3.\n\nThe studio announced Friday it was teaming up with Lamina1 to launch the new animated kids’ series entitled “Owen Nowhere.”\n\nLamina1 was founded by “Snow Crash” author Neal Stephenson and launched in 2022 as a Layer 1 blockchain platform designed to give creators an environment to protect, control, and monetize their intellectual property. Lamina1’s overarching mission, however, is to build an open metaverse. Stephenson’s vision of the metaverse — a concept he coined in his 1992 acclaimed novel — consists of a virtual world where users get their own lifelike 3D avatar.\n\nBlockchain technology and the metaverse are buzzwords in the tech world and they have been slow to achieve mass adoption. Introducing a kids’ show in this space is particularly bold, considering the production studio will have to figure out how kids will navigate a platform that requires a crypto wallet.\n\nBut Jammal and Demas are banking on the freedom of a decentralized platform, which allows the audience to interact and even participate, as a selling point that will win over users.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nImage Credits:We Ghosted Media\n\nThe new show centers around Owen B. Gloom, a preteen aspiring content creator on a family road trip, documenting their visits to unusual tourist attractions, starting with the largest ball of twine in Cawker City, Kansas. The family’s dynamic is funny, sweet, and slightly dysfunctional, featuring Owen’s adoptive vampire parents, a magical transforming vehicle, a pet cat, and a fish in a stroller.\n\nBut as Jammal and Demas told TechCrunch, this is more than a show. It’s really about their mission to set a “new standard for the future of children’s entertainment in the decentralized era.”\n\nThe project will be developed and viewable on Lamina1’s yet-to-be-launched Spaces, an offering that enables creators to create their own virtual worlds. In these worlds, creators can build interactive experiences, digital items, and content in various formats, including 2D, 3D, augmented reality (AR), and virtual reality (VR).\n\nJammal and Demas envision “Owen Nowhere” as an immersive experience that allows fans to engage with the world and contribute their ideas for the series.\n\nThe virtual space will also include exclusive behind-the-scenes content, collectible digital assets, and online community-driven experiences like voting. The studio believes that the most attractive feature is the opportunity for viewers to make key decisions for the story, such as suggesting destinations for the family’s adventures.\n\n“We were thinking [fans could] vote for where the Glooms can travel next. Do you want them to come to your hometown? Maybe they want to buy that souvenir that Owen picked up at the Grand Canyon [as] their own digital asset. Maybe they want to change his outfit. There are so many possibilities of how this can go,” Jammal said.\n\nImage Credits:We Ghosted Media\n\nWhile it’s clear that this show has all the ingredients to resonate with viewers and hold their attention, there will be challenges, including convincing parents to manage a crypto wallet for their child.\n\nParents may worry that introducing kids to this ecosystem, even indirectly, could expose them to financial manipulation or loss, even if the parents are the ones in control of the wallet.\n\nHowever, some parents are more open to the idea, with some sending their five-year-olds to crypto summer camps. In 2022, Zigazoo introduced NFTs for several IPs, including CoComelon.\n\n“It’s a big topic of discussion. It’s like, ‘What permissions do we need in place around it?’” Lamina1 CEO Rebecca Barkin said, adding, “I won’t tell you that we have the perfect answer right now…we’re going to learn real fast as this develops, what protections need to be put in place.”\n\nOwen Nowhere’s digital assets are positioned as a way for fans to be involved in the show and enable them to contribute financially to the show’s production by owning digital collectibles — including artwork, characters, and outfits — fostering a community of supporters who are invested in its success.\n\n“That token can be used as a loyalty token, it doesn’t have to be about cash and trading and the traditional crypto stuff. It’s about token-gated access and rewarding those who are sharing things, who are making really creative contributions to the community,” Barkin explained.\n\nWhile the new series is primarily aimed at kids and preteens, it’s also designed to appeal to adults. This is similar to how “Bob’s Burgers” attracts many adult fans through its hilarious storylines about parenting.\n\n“We’re not going after that super young demographic,” said Barkin.\n\nNonetheless, they may need to approach this with transparency and possibly even parental controls to appeal to their entire audience.\n\nLamina1’s Spaces product is slated to launch in the fall. Another virtual world launching on Spaces is “Artefact,” a project by visual effects company Wētā, known for its work on the “Lord of the Rings” film trilogy.\n\nLamina1 has raised $9 million to date from notable investors and angels, such as LinkedIn co-founder Reid Hoffman and Bloq co-founder Matthew Roszak."}