{"url": "https://techcrunch.com/2024/08/14/virtuixs-vr-treadmill-is-finally-launching-in-september/", "title": "Virtuix’s VR treadmill is finally launching in September", "authors": ["Brian Heater", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-08-14T00:00:00", "text": "Big day for VR motion peripherals. An hour after Roto VR announced its $799 spinning game chair, Virtuix has finally revealed a September 10 launch date for its Omni One VR treadmill. I say “finally” because this $2,595 (plus shipping) system has been in the works for more than a decade now.\n\nIn fact, the last story we wrote about the system carried the headline, “A decade later, this VR treadmill is finally ready to ship.” That was from April 3 of last year. Sometimes it feels like technology is moving impossibly fast. Other times it’s painfully slow. Hardware startups often fall into the latter camp.\n\nIn the past decade or so of building, Virtuix has amassed a good bit of interest. Locomotion is still a largely unsolved problem in VR. Tricking your brain into moving when sitting or standing perfectly still is a less than ideal experience; it can also cause unfortunate side effects like nausea.\n\nVirtuix’s timeline has coincided with a rise of interest around mixed reality, led by Oculus/Meta, HTC and now Apple, among others. The startup says it’s managed to raise a total of $40 million so far, through a combination of venture capital and individual investment. The Omni One also received some of the best exposure imaginable by serving as the model for a similar system in Steven Spielberg’s “Ready Player One” adaption.\n\nThe Omni One is a deceptively simple system. Rather than relying on a mechanical treadmill, it works passively. The user straps on special footwear and advances by effectively slipping in place in the concave saucer.\n\n“With the official launch date set for September 10, we’re eager to welcome gamers into the Omni One community,” CEO Jan Goetgeluk said in a release. “The overwhelmingly positive reactions from our beta users have fueled our excitement, and we can’t wait to launch Omni One and transform the gaming experience for players of all ages.”\n\nVirtuix says it has sold 3,000 units during the One’s preorder period."}