{"url": "https://techcrunch.com/2024/02/01/5-ways-construction-tech-founders-can-win-in-2024/", "title": "5 ways construction tech founders can win in 2024", "authors": ["Michelle Moon", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-02-01T00:00:00", "text": "Construction often gets a bad rep as one of the “dinosaur” industries. This is not entirely unwarranted: Productivity growth in the sector averaged just 1% over the past 20 years versus 2.8% for other industries. Nonetheless, having spoken with many developers, builders, materials suppliers, construction tech entrepreneurs, and investors over the last 12 months, I believe the industry is far more open to experimenting and embracing technology than many realize.\n\nThe built environment is confronted with opportunities and challenges of unprecedented scale, including the growing global demand for infrastructure and housing; an ongoing, escalating labor shortage; cost inflation; supply chain disruptions; and ESG (environmental, social, and governance) requirements. These challenges are pushing construction to evolve faster than ever — and there are plenty of ways founders can capitalize on new trends in the space.\n\nOver the last five years, the construction industry has become more sophisticated and well-versed in software. For instance, 84% of general contractors implemented autonomous solutions over the past year. Innovative technology and ideas are influencing construction wherever you look. These new technologies help builders achieve higher levels of productivity, profitability, and safety. Tech founders may find that construction customers are more selective than five years ago when sharing data or buying. Conversely, most general contractors now have a technology budget, well-defined evaluation process, and team.\n\nConstruction tech founders who solve the most critical priorities for general contractors — building on budget, on time, and on scope — are well-positioned for growth in 2024.\n\n1. Capitalize on growing subsectors of construction tech, in a hot market for funding\n\n(Please note not all financings completed in 2023 have been announced to date and the number will likely rise substantially.)\n\nVenture capital interest in construction tech reached all-time highs in the past four years, and the last three months of 2023 were an incredibly active time for construction tech startup funding. I predict 2024 to be another active year, outpacing 2023, with approximately $1 billion to $1.5 billion in total capital invested (shown in light blue).\n\nIn terms of opportunity, IT spending in construction comprises a mere 1% to 2% of revenue (versus 3% to 5% across other industries), so construction tech has plenty of runway. Buyers are also becoming more sophisticated — they increasingly value software tools that digitize workflows and help deliver superior outcomes leveraging data, AI, or automation. Seizing these opportunities and market demand, 2024 should be a good year for founders to launch construction tech startups and raise capital.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n2. Bring forth sustainable practices that help customers meet ESG goals\n\nThere is an ever-increasing focus on sustainability in today’s construction and real estate industries. Per the International Energy Agency, the built environment accounts for 30% of the global energy footprint and 26% of global energy-related emissions. As such, governments are tightening the screws on builders and real estate owners to ensure buildings are up to code regarding energy consumption and carbon emissions during construction and operations.\n\nFor example, a new law in New York City will require any building of more than 25,000 square feet to meet new energy efficiency and greenhouse gas emission standards. The penalties are stiff: $268 for every metric ton of carbon dioxide above the allotted limit, which studies estimate could amount to $200 million per year for some buildings.\n\nRegulations, building standards, and pressure from owners and tenants increasingly push the construction industry to prioritize sustainability. In 2024, we can expect to see a wave of construction tech startups that focus on ESG, too. From green materials to AI that helps design sustainable buildings, technology can help the industry adopt sustainable practices across the entire building life cycle.\n\nFor example, Snaptrude is a collaborative, browser-based conceptual BIM (building information modeling) tool — think of it as a modern alternative or complement to Autodesk Revit. Snaptrude has partnered with Cove.Tool to incorporate LEED-compatible performance metrics inside its design platform. Architects, designers, and LEED (Leadership in Energy and Environmental Design) consultants can iterate on design collaboratively to achieve performance targets.\n\nGreen building practices are becoming the norm, and major behavior changes are underway in the construction industry. Construction tech founders must think about how their products can serve customers with their ESG goals. If you don’t get sustainability, you can’t understand construction customers.\n\n3. Build modern collaboration and communication tools\n\nGiven the prevailing market conditions, the construction industry focuses more on profitability than ever. But picture hundreds of back-and-forth replies on a single email thread with 20+ people cc’d — how does work ever get done? Details get buried or misconstrued, possibly cratering an entire project. In an era where tools like Figma, Miro, Slack, Airtable, and Notion have become the norm in other industries, many construction companies are stuck in the 20th century with legacy software tools.\n\nBetter collaboration and communication are some of the lowest-hanging fruits that can elevate operational excellence and unlock savings. This will lead the industry to focus more on strategy, embracing modern collaboration and communication tools more aggressively in 2024.\n\nCollaborative delivery, negotiated bids, and self-perform contracts, which are growing in popularity, depend on collaboration and communication for success and are pushing builders to seek best practices and tooling in these areas. Better collaboration and communication can make the next stage of construction more informed and less risky, bringing more transparency and certainty to projects. Every software founder should consider incorporating modern collaboration and communication features into their products; construction is no exception.\n\nIn 2024, startups like Planera will introduce true real-time collaboration to the construction industry and remedy other collaborative issues posed by legacy software tools, such as Oracle Primavera P6, emails, or spreadsheets. Planera’s digital whiteboard helps more builders accurately lay out their scope of work, develop estimates and bids, and create a timeline for project completion. In addition, better planning means better equipment utilization and less idling and wastage. This not only improves margin but also lowers the total carbon footprint of each project.\n\n4. Help construction firms achieve more with less by increasing automation and/or integrating HR technology\n\nTalk to five general contractors and four will bring up labor shortage and brain drain as the most significant challenge today. Construction firms will turn to automation and HR tech in 2024 to achieve more with fewer resources.\n\nThe availability of skilled construction talent continues to dwindle. Associated Builders and Contractors, a trade association, reports that one in four construction workers is older than 55, and there needs to be more younger workers interested in entering the profession.\n\nThese labor shortages present a sterling opportunity for construction tech startups focused on bolstering productivity. Companies like Field Materials, a construction tech company that digitizes procurement of construction materials, are bringing automation to the “low value-add” stages of the construction value chain. Field Materials empowers contractors and vendors to streamline every aspect of procurement, freeing up time for more valuable work while generating margin gains and cost savings.\n\nAnother example is OnsiteIQ, a construction intelligence platform that uses computer vision to monitor building progress, pinpoint issues, and enable collaboration with teammates. They are digitizing manual labor-based monitoring and supplying real-time insights to interested parties that can pinpoint problems upfront and prevent delays or workovers.\n\nI believe that the people side of construction is the most significant white space opportunity for construction tech founders. I’d love to see more HR tech startups serving the construction end market. As it has done in other industries, HR tech can help deliver a superior experience to workers and employees, allowing employers to better compete for and retain the highest quality labor. HR tech can help automate the recruiting process (e.g., FactoryFix for manufacturing). Also, HR tech can help with onboarding, training, and upskilling. Think Pluralsight, but for construction.\n\n5. Grow your market — how can your tech serve construction and real estate customers\n\nValuable data and knowledge generated during construction can carry over once a building is completed (e.g., ISO 19650). I expect to see a few companies pop up to help real estate owners glean insights from data and knowledge generated during design and construction so that they can manage, operate, and maintain their buildings better. For instance, Passive Logic is the developer of robust physics-based digital twins, which can be leveraged to design better, build (i.e., construction), operate, maintain, and manage our buildings (i.e., real estate).\n\nI expect the line between construction tech and proptech to blur in 2024. Construction tech founders should consider how their products can serve construction and real estate customers.\n\nPlenty to build on\n\nHeading into 2024, there is much to be giddy about if you are a construction tech entrepreneur, buyer, user, or investor.\n\nAs a construction tech investor, this is what I’m looking for in founders and their products:\n\nAn ambitious founder solving a big problem that impacts a sizable portion of the overall construction market.\n\nA thoughtful product. This means the founder deeply understands how customers do business and has a clear vision for how multiple stakeholders can interact with and benefit from the product.\n\nDisclaimer: Planera and Pluralsight are Sorenson investments."}