{"url": "https://techcrunch.com/2022/11/14/real-time-data-startup-quix-raises-a-12-9m-series-a-round-led-by-mmc-ventures/", "title": "Real-time data startup Quix raises a $12.9M Series A round led by MMC Ventures", "authors": ["Mike Butcher", "Editor At Large", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-11-14T00:00:00", "text": "The complexity of streaming data technologies — not just streaming video but any kind of streaming data — has created a headache around dealing with that high-speed data processing.\n\nAccordingly, companies like Spark and Flink have sprung up to address this ksqlDB. Many are either either Java-based solutions or SQL-based analytics solutions. However, U.K. startup Quix says it is a platform for developing event-driven applications with Python, which can have uses in, say, physics-based data modelling and anomaly detection in machine learning.\n\nIt’s now raised an £11 million / $12.9 million Series A funding round led by London-based VC MMC Ventures, with participation from existing investors Project A Ventures (out of Berlin) and Passion Capital (London).\n\nThe Quix founders are familiar with real-time decision-making, having worked in Formula 1, where success is based on milliseconds. In fact, one of its customers is McLaren, as well as mobility startup Voi, and the National Health Service (U.K.), among others.\n\nIn a statement, Mike Rosam, co-founder at Quix, said: “Many companies are struggling to combine raw technologies like Kafka into real-time data capabilities… This new capital will fuel our mission to simplify event-driven data engineering so that more companies can build modern data-intensive apps.”\n\nOliver Richards, partner at MMC Ventures, added: “We have been doing an increased amount of research in the data infrastructure space, it is clear that there is a growing demand for real-time streaming data, both across consumer and B2B use cases.”"}