{"url": "https://techcrunch.com/2024/08/20/the-rounds-series-b-funding-round-24-million/", "title": "The Rounds scoops up $24M to bring its ‘household restocking’ delivery service to more markets", "authors": ["Lauren Forristal", "Tim De Chant", "Sarah Perez", "Rebecca Bellan", "Kyle Wiggers", "Julie Bort", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-08-20T00:00:00", "text": "The Rounds, the startup that delivers recurring grocery and household essentials in reusable packaging, announced on Monday its $24 million Series B funding round. The new capital will go toward product development, hiring and expanding the service to additional markets.\n\nAlongside the funding announcement, The Rounds introduced new features for customers, including the ability to make one-time purchases and the flexibility of choosing their delivery day. It also enhanced its AI-powered algorithm to provide smarter predictions on when customer’s products need to be restocked.\n\nLaunched in 2019, The Rounds offers a $10 subscription for shoppers to order weekly bundles, ranging from things like household basics and personal care items to pantry staples and dry goods, as well as items from local bakeries, coffee roasters or other sellers. The Rounds recently added more than 100 new products, bringing more fresh produce options and home essentials to its catalog. The new additions bring the new total to 1,200 SKUs, almost double the amount available last year when it was at 650 SKUs.\n\nUsers can customize how frequently they’d like certain items restocked, setting up regularly scheduled deliveries designed so customers never run out of necessary supplies like toilet paper, milk and eggs. Until recently, customers couldn’t choose when the weekly “Refill Day” was as The Rounds determined the date for each neighborhood. Now, they have the flexibility to select their own refill day to better suit their schedule.\n\nCommitted to sustainability, The Rounds delivers items in reusable bags and refillable containers. The company also uses what it calls a “reverse logistics” system where the customers can leave their empty containers on their doorsteps for delivery workers to return, sanitize and recirculate — significantly reducing waste. To date, the company has saved more than 1 million pounds of packaging waste, a significant milestone compared to the 375,000 pounds of waste TechCrunch previously reported.\n\nImage Credits:The Rounds\n\nThe Rounds recently introduced a new feature that allows users to make one-time purchases instead of automatically restocking items before the next delivery. This helps prevent users from receiving products they don’t need. Users have always been able to add or remove items before delivery; this new option ensures that they won’t forget to remove unwanted items.\n\nThe company applies machine learning to provide smarter predictions on when everyday items need to be refilled and to offer personalized product recommendations. According to co-founder and CEO Alex Torrey, these predictions are even more accurate than before, bringing the AI closer to being a “psychic home manager” that knows exactly what the customer needs to restock and when.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“The accuracy of the prediction, which is where our sustainable approach of using reusable packaging has an extremely valuable benefit,” Torrey said. “By collecting empty containers when you finish, we actually create a reinforcement learning feedback loop for our prediction engine that allows us to more accurately and faster predict your consumption at your household level. [All that competitors] can do is make predictions based on purchase history. We can make predictions based on purchase history [but] we also have that data based on consumption.”\n\nHe added that, at some point in the future, the goal is to get its prediction algorithm to be so advanced that, for example, “pollen count influences our prediction.” Torrey explained, “I view a world where we’re able to say, ‘Hey, we know you have allergies, the pollen count is up, or the pollen count appears to be going up next week. We’re going to accelerate your box of tissues.’”\n\nImage Credits:The Rounds\n\nThe Rounds is currently available in select U.S. markets, such as Atlanta, D.C. and Philadelphia. However, in early 2025, The Rounds will expand to “a couple” more markets, Torrey told us, yet declined to say where. What we do know, though, is that New York City is not on the company’s radar yet.\n\n“The reason we picked our markets is to really help us learn as much as possible. The downfall of launching in New York is it doesn’t teach you how to operate anywhere other than New York… Atlanta is a lot like Houston or Los Angeles. Philly is a lot like Boston. So we’ve been thinking about markets where we can learn a lot and transfer those learnings to make sure that we’re a company that works everywhere and can have a really big impact by serving as many members as possible,” Torrey noted.\n\nThe recent round was led by Moderne Ventures, with participation from Construct Capital, First Round Capital, FJ Labs and Redpoint Ventures, among others. The company is currently focused on expanding its machine learning and data science teams and is looking to bring in a chief marketing officer and chief operations officer.\n\nTo date, The Rounds has raised $66 million in funding."}