{"url": "https://techcrunch.com/2024/04/16/space-startups-licking-their-lips-after-nasa-converts-11b-mars-mission-into-a-free-for-all/", "title": "Space startups are licking their lips after NASA converts $11B Mars mission into a free-for-all", "authors": ["Devin Coldewey", "Writer", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-04-16T00:00:00", "text": "NASA administrator Bill Nelson has pronounced the agency’s $11 billion, 15-year mission to collect and return samples from Mars insufficient. But the strategy shift could be a huge boon to space startups, to which much of that planned funding will almost certainly be redirected.\n\n“The bottom line is, an $11 billion budget is too expensive, and a 2040 return date is too far away,” Nelson said at a press conference. “We need to look outside the box to find a way ahead that is both affordable and returns samples in a reasonable timeframe.”\n\nIn other words, clear the decks and start over — with commercial providers on board from the get-go.\n\nThe Mars Sample Return mission was still in the planning stages, but an independent review of the project last year found that, given budget, technology and other constraints, the mission was unlikely to complete before 2040, and at a cost of $8 billion to $11 billion.\n\nThough NASA proposed a revised plan in the mold of the original, it has now also challenged the space community to go further: “NASA soon will solicit architecture proposals from industry that could return samples in the 2030s, and lowers cost, risk, and mission complexity.”\n\nConsidering how heavily both primes and space startups have been investing in interplanetary capability, this announcement arguably amounts to a historic windfall. A company like Intuitive Machines, riding high after accomplishing the first private lunar landing, will almost certainly be firing on all cylinders to take on what could be a multi-billion-dollar contract.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nEven if NASA wants to assign only half or even a quarter of the original budget to an endeavor led by a commercial space company, private industry has already shown that it can do more with less when compared to legacy outfits.\n\nIt’s also catnip for launch companies, since the time horizon is far enough out that heavy launch vehicles like Blue Origin’s New Glenn, Rocket Lab’s Neutron and, of course, SpaceX’s Starship may be cleared to fly when the mission is ready to progress. That was undoubtedly also the plan with the 2040 timeline, but the notional new one is a lot closer to the present.\n\nBetween the lines can be seen the admission that any mission planned before the present bloom of orbital and interplanetary capability is, very simply, no longer feasible. Although NASA’s troubled Space Launch System heavy launch vehicle is perhaps the largest such project, to abandon it now would be to throw away a great deal, while preemptively opting for a leaner Mars program fueled by commercial ambitions seems to have no obvious downside. (There’s plenty of time to save and repurpose the most important concepts and research already done by NASA and its partners.)\n\nNo doubt that many of the companies this decision stands to benefit — not just startups and growing space companies but also primes and launch providers — saw the writing on the wall and have been looking forward to this day. But the official announcement, and the implication that it is the new generation of space companies that will accomplish ambitious goals like a there-and-back trip to Mars, must be very validating.\n\nTo be clear, there is no money on the table just yet — but the promise has essentially been made that what would have belonged to the Mars Sample Return mission will be repurposed according to whatever new plan the expansive “NASA community” decides on. Whatever that new plan may be, it will almost certainly rely far more than before on commercial services and hardware.\n\nJust as the Commercial Lunar Payload Services accelerated and incentivized the proliferation of vehicles, spacecraft and landers we see today — including some by companies that didn’t exist a few years ago — the newly recast Mars Sample Return mission may have fired the starting gun on commercial ambitions for the red planet."}