{"url": "https://techcrunch.com/2022/06/10/boulder-care-takes-in-funding-as-its-opioid-telehealth-program-yields-industry-leading-retention-rates/", "title": "Boulder Care takes in funding as its opioid program grows", "authors": ["Christine Hall", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-06-10T00:00:00", "text": "Boulder Care, a Portland, Oregon–based telehealth provider focused on medical treatment and support for people overcoming substance use disorders, raised $36 million in Series B funding.\n\nFounded in 2017 by Stephanie Strong, the company has a mission to address national overdose rates, particularly with opioid and alcohol use disorders. Analysis from the White House in 2017 shows the cost of the opioid epidemic was over half a billion dollars.\n\nApproximately 92,000 persons in the U.S. died from drug overdose in 2020, including illicit drugs and prescription opioids, according to National Institute on Drug Abuse figures. The number of overdose deaths has steadily risen since the late 1990s, but the 2020 figure is a sharp rise from the just over 70,600 deaths in 2019.\n\nTo fulfill its mission, Boulder Care is delivering thousands of naloxone doses, a medicine for reversing an opioid overdose, to patients and offering telehealth support alongside the medication, including case management, peer coaching and basic needs support. Boulder works to link together disparate providers along the continuum of care, “rather than facilitating ‘warm handoffs,’ we never let go of a patient’s hand,” Strong told TechCrunch.\n\nIt’s been a hot minute since we checked in with the company, last profiled around the beginning of the global pandemic when its opioid treatment was gaining traction. At that time, Boulder Care picked up $10 million in Series A funding, led by Tusk Venture Partners.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nOver this time, the company went from caring for hundreds of patients to thousands of patients, Strong said. And, as the industry is moving toward value-add potential, it made sense to go after additional funding to accelerate growth.\n\n“We are now working with dozens of plans and want to meet those needs that are required,” she added. “We also plan on going into partnerships and new states methodically.”\n\nBackers of the Series B include Qiming Venture Partners (U.S.), Goodwater Capital, Laerdal Million Lives Fund and existing investors First Round Capital, Greycroft, Tusk Venture Partners and Gaingels. The new investment gives the company over $50 million in total investment.\n\nThe company has seen 100% year-over-year customer renewals since 2017, and 70% of its patients stay with the program for 12 months. Strong also touts its 90% one-month retention rate is a three-time improvement over industry benchmarks.\n\nIt also launched partnerships with 20 enterprise customers, giving millions of people, nationwide, access to the company’s services via health plans and employers, including Regence, Anthem, Comcast and Hewlett Packard through ComPsych EAP.\n\nIn the 2 years since the Series A, Boulder Care has also logged some impressive growth figures: It is serving several thousand patients with opioid and alcohol use disorders and grew its revenue over 10 times.\n\nMuch of its revenue comes from in-network reimbursement from Managed Medicaid arrangements that cover low-income members with complex needs. This means that most of Boulder Care’s patients don’t pay anything out of pocket to be a part of the program.\n\nWith this funding, Strong expects to triple the size of Boulder Care’s medical group, expand and deepen its presence in multiple markets and implement payor contracts that hold the company accountable for clinical and nonclinical outcomes.\n\nThe company is not alone in leveraging technology to solve the problem of substance abuse. Others have also attracted some venture-backed capital in the past couple of years — for example, Path, which offers care as part of an employee benefit; Affect, which focuses on methamphetamine abuse; and Monument and Tempest, both aimed at alcoholism.\n\nStrong says that what sets Boulder Care apart from some of its competitors is the number of health plan contracts it has and that most of its patients pay nothing for the program, or perhaps a $4 co-pay, versus others offering monthly subscription rates that are pricing out folks who can’t afford to sustain that long-term.\n\nNext up, the company will focus on growth into new states “in a thoughtful way,” Strong said. When entering new states, the company aims to forge relationships with local and state programs as a way to bridge the gaps in care with telehealth. It is also working with regulators on what telemedicine can look like as care for substance abuse evolves."}