{"url": "https://techcrunch.com/2017/11/09/apple-has-acquired-imaging-sensor-startup-invisage-technologies/", "title": "Apple has acquired imaging sensor startup InVisage Technologies", "authors": ["Ingrid Lunden", "Europe Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2017-11-09T00:00:00", "text": "As Apple continues to work on ever-smaller but more powerful computing devices, it has acquired a startup focusing on nanotechnology, and specifically as it relates to image sensors. TechCrunch has learned and confirmed that Apple has picked up InVisage Technologies, a startup that develops solutions to improve imaging capabilities on space-constrained devices, like smartphones.\n\nAn Apple spokesperson has confirmed the acquisition to us with its customary statement:\n\n“Apple buys smaller technology companies from time to time, and we generally do not discuss our purpose or plans.”\n\nAnd here we have a slightly less official Animoji relaying the news to those who prefer to hear it coming from a cute animal:\n\nhttps://twitter.com/panzer/status/928653674699669510\n\nThere were some murmurs of an acquisition last month but no confirmation from either company. But as we started to look around we found a number of signs that pointed to a sale:\n\nThere are a handful of InVisage employees that are already noting on LinkedIn that they work for Apple. We were able to determine that several more who have not updated their LinkedIn profiles are also working there. Meanwhile, InVisage erased the section of its web site that detailed some of its senior staff (but you can still find those pages through web archiving services).\n\nInVisage itself went radio silent on social media and other communications channels in November of last year.\n\nInVisage has 27 patents registered to the company, and while none of these have (yet) transferred over to Apple’s ownership, the legal firm representing InVisage changed in September. It’s now using the same firm that Apple uses for all its patent work. (Thanks to patent specialist J. Nicholas Gross for helping us track this detail.)\n\nSeveral people we contacted connected to the company told us they were not at liberty to discuss the acquisition, but in doing so also inadvertently confirmed that it took place.\n\nMore public evidence of a sale (but not to whom) is that multiple InVisage VC backers now list the company as exited on their web sites. Founded in 2006 by Ted Sargent (an academic from Canada who specialises in nanotechnology) and Everett McGinley (who left the company after two years), Invisage had raised $98 million in funding from backers that included InterWest Partners, Nokia Growth Partners, Intel Capital, CRV, GGV and more.\n\nIt’s not clear how Apple will be using InVisage’s technology, but as a rough guide, it’s interesting to look at what the startup had developed.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIts key product is something called QuantumFilm, which brings together both software technology and material science to create smaller imaging technology that is better at taking high quality pictures in a variety of non-optimal lighting conditions.\n\nAs InVisage itself describes it, “QuantumFilm is a photosensitive layer that relies on InVisage’s newly invented class of materials to absorb light; specifically, the new material is made up of quantum dots, nanoparticles that can be dispersed to form a grid once they are synthesized. Just like paint, this dispersion of solid materials can be coated onto a substrate and allowed to dry.”\n\nTraditional image sensors are silicon-based, and InVisage notes that its QuantumFilm is able to absorb the same amount of light as silicon, but in a layer that is ten times thinner and made specifically to absorb the full spectrum of light, allowing for more efficient and complete processing.\n\nInVisage not only developed the technology, but the physical materials to implement the tech, with a dedicated foundry in Taiwan that made the QuantumFilm solution, wafers to overlay on chips, and full image sensor chips.\n\nThere is an obvious benefit here to consumers being able to take better pictures with their smartphones; and, if you consider the ongoing debate about which phone really does have the best camera, it’s clear that this is a deal maker and deal breaker in the smartphone market.\n\nBut having hyper-accurate, high-definition imaging capabilities also opens the door to a number of other applications.\n\nInVisage points out that QuantumFilm’s tech can be used in IoT applications and to help with “authentication, autonomy, and augmented or virtual reality” — all areas that Apple is already doing some interesting work in with innovations like FaceID and ARKit, and will continue to be developing in the future.\n\nThere are also other applications of this tech, in areas that are not directly in Apple’s wheelhouse but very adjacent to it, such as in using these sensors in video cameras for high-definition film making. Before going quiet, InVisage had put up some cute footage for how these films might look and the material works:\n\nWe’ll update this post as we learn more."}