{"url": "https://techcrunch.com/2024/12/10/harpercollins-ceo-touts-spotifys-audiobooks-entry-ais-impact-on-publishing/", "title": "HarperCollins CEO touts Spotify’s audiobooks entry, AI’s impact on publishing", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-12-10T00:00:00", "text": "The future of audiobooks and AI’s impact on the publishing industry were points of discussion for HarperCollins, whose CEO, Brian Murray, spoke at the UBS Global Media and Communications Conference on Tuesday. During the event, the exec praised Spotify’s entry into the audiobooks market and detailed its future growth plans in the space. He also touched on how AI technology could both threaten and hurt publishers in the days ahead.\n\nOf note, Murray said that audiobooks continue to outsell e-books in terms of total revenues and are helping to offset declines from lagging e-book sales. In terms of AI, the CEO declined to discuss specifics of licensing deals, like the one it signed with Microsoft for AI model training, citing NDAs, but stressed that it’s early days for AI licensing, calling it a “fascinating time” in the industry.\n\nHe also specifically praised Spotify’s entry into the audiobooks space, referencing the 15 hours of free listening that’s included with a Spotify Premium subscription in supported markets.\n\n“Spotify entered the market in a very smart way,” Murray explained. “They had several 100 million listeners of music and podcasts … so it was a very small, adjacent shift for them to monetize the audiobook listener.” He also pointed out that while Amazon-owned Audible had been able to monetize the core audiobook listener, Spotify’s model taps into the potential around the more occasional audiobook listener.\n\n“You didn’t have to sign up with a full commitment to so many books per year,” he said. “You could … do it with your 15 hours free. You could sample. And I think that entry strategy — I mean, we now know a year later — that entry strategy has been very successful for Spotify, and as a result, we get a little bit of an incremental growth in our business in total.”\n\nSpotify’s relationship with HarperCollins, similar to Harper’s deal with Audible, involves a wholesale distribution deal, which means that the publisher is paid on a consumption basis — a per-listen sort of model, Murray said. That sort of model is more direct than the streaming music model where a percentage of subscription revenue first goes into a pool and is then paid out to artists. The publisher can tell authors exactly what their royalties will be from audiobooks under this model.\n\nMurray additionally said there’s room for growth with Spotify, as the company is working to adjust a “technical problem” with family plans, which currently limits audiobook streaming to the family plan’s credit card holder. In time, Spotify will open up listening to all plan members, he said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nReached for comment, Spotify said there’s no technical issue, but expanding audiobooks across family plans is something it’s testing in some markets now.\n\n“Echoing Brian Murray’s comments, we have been pleased with the growing interest in audiobooks and the resulting benefit to the publishing industry and authors,” a Spotify spokesperson told TechCrunch via email. “Although we have nothing to announce today, we’re actively exploring ways to enhance the audiobook experience for Spotify plan members and look forward to sharing more in the future.”\n\nSpotify has also been expanding audiobooks to more global markets, which opens it up for further growth.\n\nSwitching gears, Murray then spoke about the potential and concerns around how artificial intelligence will affect publishing.\n\nBeyond the obvious risks associated with IP-based businesses founded on copyright, the publisher is worried about generative AI, which could lead to an explosion of lower-quality content, competing for consumers’ time and attention. Still, Murray said he thinks higher-quality content will ultimately win.\n\nInternally, AI could also help in areas of the business like marketing and selling, and there are already dozens of initiatives across departments at HarperCollins where they’re trying to realize productivity improvements from AI, Murray said.\n\nAI could be useful for audiobooks, too, as it will allow the company to make audiobooks for smaller markets where it couldn’t before justify the expensive. Book translations will also expand, opening up more revenue opportunities.\n\nFurther down the road, HarperCollins foresees how the technology could help turn books into film. “You can imagine taking a manuscript, pouring it in, and having a movie script or television script come out, and then using [OpenAI’s] Sora to storyboard,” Murray said. “In terms of … maybe speed to market or getting concepts — clear concepts — to the professionals in film and television … that’s easier to do now.”"}