{"url": "https://techcrunch.com/2023/10/04/opsera-a-devops-platform-geared-toward-enterprises-raises-12m/", "title": "Opsera, a DevOps platform geared toward enterprises, raises $12M", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-10-04T00:00:00", "text": "Opsera, a DevOps platform geared toward enterprise clients, today announced that it raised $12 million in a funding round — a tranche smaller than Opsera’s previous raise — led by Taiwania Capital with participation from Clear Ventures, Felicis Ventures and others.\n\nBringing the company’s total raised to $31.3 million, the new cash will be put toward product R&D and growing Opsera’s 65-person team by 20% by the end of the year, according to co-founder and CEO Kumar Chivukula.\n\n“Opsera’s mission is to enable and empower enterprises to deliver software faster, better and more securely via a disruptive Unified DevOps platform,” Chivukula said in an email interview. “Despite the challenges, the pandemic has had a net positive impact on the DevOps market. The increased demand for DevOps platforms, tools and services, as well as the shift to remote work, are driving growth in the market.”\n\nChivukula started Opsera alongside Chandra Ranganathan in 2020 after stints at Symantec, where he was a senior systems administrator, and Adobe, where he managed IT. Ranganathan met Chivukula at Symantec, but also spent several years at Uber, where he ran the ride-hailing company’s global infrastructure.\n\nLike other DevOps platforms, Opsera offers a range of tools that enable developers to create, secure and deploy apps from a single pane of glass.\n\nOpsera users can provision and integrate their choice of dev tools through a self-service catalog and utility registry. And they can build dev pipelines, deploying software across public clouds, including AWS, Azure and Google Cloud Platform.\n\nBeyond this, Opsera offers dashboards for tracking KPIs and auditing DevOps processes for compliance and troubleshooting.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“With today’s opaque, fractured, tool-saturated workflows, it’s hard to know where to make the most impact, how to improve the above measures and how to measure success,” Chivukula said. “These are the exact concerns that Opsera addresses at scale.”\n\nWhile Opsera operates in a crowded sector (see startups like Devtron and System Initiative plus platforms built by incumbent such as GitLab), demand for DevOps isn’t slowing down — giving Opsera a fighting chance.\n\nIn a 2023 survey by Loz.io, the cloud observability startup, 45% of respondents reported having fully adopted and embraced DevOps practices, a 7% increase compared to the year before. And according to Allied Market Research, the global market for DevOps software will reach $57.90 billion by 2030, up from $6.78 billion in 2020.\n\nOpsera claims to have 25 enterprise clients in industries, including healthcare, manufacturing, finance, retail and e-commerce. Within the next year or two, the startup plans to go after public sector customers — but Chivukula declined to be more specific than that.\n\n“One of the key challenges that the DevOps platforms market faces is point solution saturation,” Chivukula continued. “There are a ton of commercialized and open source products that focus on one specific problem, environment or part of the software development lifecycle. Basically, there’s a lack of holistic focus — but Opsera zooms out and helps customers see the big picture.”"}