{"url": "https://techcrunch.com/2022/05/26/google-adtech-antitrust-cma-uk/", "title": "UK finally opens antitrust probe of Google adtech practices", "authors": ["Natasha Lomas", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-05-26T00:00:00", "text": "The U.K.’s competition watchdog has just announced another investigation into Google over potential antitrust abuses around adtech.\n\nThis is the Competition and Markets Authority’s (CMA) second probe of Google’s adtech practices — after it said it would investigate an ad deal between Google and Facebook referred to internally as ‘Jedi Blue’, back in March. (That deal also features in a major antitrust complaint against Google’s adtech over the pond, led by the U.S. State of Texas.)\n\nThe CMA did also open a probe of Google’s ad-related Privacy Sandbox plan last year, triggered by complaints over its planned deprecation of tracking cookies to migrate to an alternative stack of ad targeting technologies — a development that remains under external monitoring after a settlement between Google and the regulator which looks, at very least, to have slowed the pace of any switch. (Google also recently revised its approach to push for topic-based ad targeting, rather than cohorts.)\n\nThe latest Google probe by the CMA focuses on what it describes as “strong” positions Google holds in adtech intermediation, aka the adtech tech stack, which the regulator suspects could be distorting competition — since the tech giant owns the largest service provider in three key parts of the chain.\n\nThe parts where it’ll be examining Google’s dominance are: DSPs (aka demand side platforms which enable advertisers and media agencies to buy publishers’ available ad space from many sources); ad exchanges (which provide the tech to automate the sale of publishers’ ad inventory via real-time auctions); and publisher ad servers (which manage publisher inventory and determine which ad to show based on bids received from exchanges and/or direct deals between publishers and advertisers).\n\n“The CMA is assessing whether Google’s practices in these parts of the ad tech stack may distort competition. These include whether Google limited the interoperability of its ad exchange with third-party publisher ad servers and/or contractually tied these services together, making it more difficult for rival ad servers to compete,” the regulator wrote in a press release. “The CMA is also concerned that Google may have used its publisher ad server and its DSPs to illegally favour its own ad exchange services, while taking steps to exclude the services offered by rivals.”\n\nGoogle has a dominant share across key parts of the adtech tech stack, as an earlier CMA market study established (see chart below). But its ad products have evolved and merged over the years, as well as undergoing some rebranding — such as when Google sought to move away from the DoubleClick brand back in 2018 — all of which makes what is already a complex and even opaque market structure even more difficult for outsiders to get a handle on.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAmong a number of concerning characteristics the CMA found were inhibiting competition in the ad market in its 2020 study, was a lack of transparency — which it suggested made it difficult for market participants to “understand or challenge how decisions are made and to exercise choice effectively”.\n\nOther characteristics it suggested were undermining “effective competition” in the digital ad market were network effects and economies of scale; consumer decision making and the power of defaults; unequal access to user data; the importance of ecosystems; and vertical integration, and resultant conflicts of interest.\n\nHowever, despite making a damning assessment of the state of the online ad market almost two full years ago — when it recommended substantial reforms — the CMA has not taken any enforcement action against Google to crack the market open. (Although a 2019 consultation, following publication of its preliminary report, featured breaking up the adtech giant as one of a number of potential remedies.)\n\nInstead, in the final market report the CMA opted to push for new powers so it could make pro-competition interventions to remedy structural problems attached to tech giants with strategic market power.\n\nBut, years on, the CMA is still waiting for the U.K. government to legislation to empower the Digital Markets Unit (DMU) — which started work in shadow form last year. And it looks likely to have years more to wait, as the government has not made rebooting the competition regime an immediate priority.\n\nHence the CMA resorting to flexing its existing powers by opening investigations into specific adtech practices.\n\nThe regulator’s PR also reiterates that while it’s waiting on the government to empower the DMU it will “forge ahead using its existing powers in the tech sector” — so there’s a bit of a shot across Whitehall’s bows to get on with it.\n\nOn the Google probe specifically, Andrea Coscelli, the CMA’s CEO, said today that it’s opening a new investigation as it’s concerned Google is unfairly leveraging its dominant position to favor its own services — harming rivals, customers and consumers.\n\nIn the statement he added:\n\n“Weakening competition in this area could reduce the ad revenues of publishers, who may be forced to compromise the quality of their content to cut costs or put their content behind paywalls. It may also be raising costs for advertisers which are passed on through higher prices for advertised goods and services. “It’s vital that we continue to scrutinise the behaviour of the tech firms which loom large over our lives and ensure the best outcomes for people and businesses throughout the UK.”\n\nThe CMA also makes a point of noting that the investigation of Google’s adtech practices will “further consider” the “significant issues” and “possible solutions” that its 2020 market study had identified for addressing market power in adtech.\n\nGoogle was contacted for comment on the latest CMA probe.\n\nIt told us it hasn’t seen the full CMA complaint yet so can’t respond in detail — but in a statement attributed to a spokesperson it said:\n\nAdvertising tools from Google and many competitors help websites and apps fund their content, and help businesses of all sizes effectively reach their customers. Google’s tools alone have supported an estimated £55 billion in economic activity for over 700,000 businesses in the UK and when publishers choose to use our advertising services, they keep the majority of revenue. We will continue to work with the CMA to answer their questions and share the details on how our systems work.\n\nThe European Union announced its own wide-ranging probe of Google’s adtech practices last summer — and that investigation remains ongoing. But France’s antitrust watchdog has already conducted its own investigation of Google’s self-preferencing in adtech and, last summer, the national authority hit it with a $268 million penalty for a string of abuses.\n\nThe tech giant requested a settlement in France — proposing a series of interoperability commitments that the regulator accepted as part of its binding decision. So the country has been ahead of the pack on the adtech antitrust issue.\n\nAdtech ops are also subject to privacy scrutiny in Europe — where Google’s lead data protection regulator, the Irish Data Protection Commission, has — since 2019 — had an enquiry open into its ad exchange, following complaints about the security of real-time bidding’s processing of personal data.\n\nHowever the DPC is being sued for inaction over complaints that date back to 2018.\n\nOther EU privacy complaints about real-time bidding have focused on the validity of consent/legal basis for the mass processing of web users’ data — and a major decision by Belgium’s data protection authority earlier this year identified a laundry list of problems with an industry standard framework that could force some reform of certain privacy-hostile adtech practices."}