{"url": "https://techcrunch.com/2023/09/12/flolive-series-c/", "title": "FloLive connects with $47M to give its IoT and localized cellular technology a boost", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-09-12T00:00:00", "text": "Carriers and enterprises that rely on cellular networks to connect workers, devices and machines are forever grappling with tricky unit economics: The promise of 5G was that these costs would come down, but the reality is that 5G networks, and device and machine support for them, are just not as ubiquitous as you might think, and that is before considering the cost and difficulty of managing across multiple countries via roaming agreements.\n\nThat is a clear gap in the market asking for tech to fix it. Today, a startup from London called FloLive — which has built a platform to improve how those end users can use existing and new cellular connectivity more effectively — is announcing $47 million in funding, underscoring what it says has been a wave of demand for its services.\n\nFloLive’s pitch is enterprise end users ideally like to manage their cellular connectivity needs in a single contact, but that has largely meant roaming deals for their carrier suppliers, which make up about 98% of the connectivity, estimated Nir Shalom, FloLive’s CEO. The startup’s tech essentially does away with that by managing the provisioning of IoT and other cellular data services regardless of where the end points are located, or what they are. It works across some 220 countries covering any and all kinds of cellular networks as available in each of them.\n\n“It can be water meters, or cars, or cameras or tracking devices,” said Shalom in an interview. “When you look at the market today the vast majority of solutions across more than one country is based on roaming services, or resellers.” But in addition to resellers often being expensive, the other disadvantage, he said, is that they’re more complex to deal with because of different data management regimes, such as GDPR, and “the performance is not as good. Roaming can have delays of 120 milliseconds or more, and companies for some services need much less.”\n\nThe funding, a Series C, is being co-led by Greenfield Partners and 83North, with Qualcomm Ventures, Dell Technologies Capital, Saban Ventures and Hazelnut Partners participating.\n\nThe company previously had raised just over $41 million, primarily in the form of a $37 million round in 2021. That round included one tranche led by Intel, but notably the chip giant is no longer an investor in FloLive: Sharon said Intel Capital sold its stake about 20 months ago as part of a wider reassessment of its strategic priorities.\n\nThat is not the case for others. Alongside enterprises, FloLive’s customers and partners include both carriers and the many companies that provide services to them. In that vein, Qualcomm is working with FloLive to power its own IoT platform, which it was built in part to target the opportunity of providing services to address the vast fragmentation in the world of cellular services when looking for coverage across more than one location.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIt’s not the first example of FloLive working with, and getting funding from, a company that effectively is also somewhat competing with it. Ericsson was using some of FloLive’s tech in its own IoT business; then at the end of 2022 Ericsson announced it would be selling that business — which was loss-making — to Aeris.\n\nThe latter is a more direct competitor to FloLive, and Shalom confirmed that it’s no longer working with the former Ericsson business, nor with Aeris itself. (But to add one more layer of complexity here: Qualcomm also backs Aeris…) But in the fragmented world of telecoms technology, even this might spell opportunity.\n\n“We are now seeing increasing interest from old Ericsson customers, and we’re now engaged with them,” Shalom quipped.\n\nOther big partners for the company include the likes of cloud giants like AWS, which has been itself building out a business working increasingly with cellular carriers to provide both network management services, for example around 5G, and services for carriers to provide to their own enterprise customers. Shalom noted that there is a strong synergy between AWS and how FloLive is architected.\n\n“We have deepened our relationship with AWS,” said Shalom. “We are all-cloud, and that allows them to use what we built. Cloud-native and cloud-centric is a part of what we do.”\n\nThe company is not disclosing its valuation but we understand that it’s flat on its last round. In 2021, it appears that figure was $108 million, according to Dealroom. That speaks to the challenges that still exist in the fundraising environment: You might be able to close your deals, but at what cost at the moment? And given that IoT remains a difficult business to eke out strong margins, that overall still means a lot of pressure on IoT businesses.\n\nStill, investors willing to make a bet for a longer-term outcome are coming.\n\n“We look for highly differentiated infrastructure technologies that can support a robust and modern technology stack on top of them,” said Avery Schwartz, partner at Greenfield Partners, in a statement. “After tracking the company and space for some time, floLIVE’s rapid growth adds to our conviction that the company has developed a unique solution that elegantly solves for the full matrix of pain points traditionally plaguing the IoT connectivity market. This solution lays the foundation for new and innovative services that will dramatically change the IoT space as we know it; we are delighted to join floLIVE’s promising journey.”"}