{"url": "https://techcrunch.com/2025/03/14/arizona-proposes-law-that-would-shift-wildfire-liability-from-utilities-to-insurers/", "title": "Arizona proposes law that would shift wildfire liability from utilities to insurers", "authors": ["Tim De Chant", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-14T00:00:00", "text": "Arizona lawmakers are debating a bill that would protect utilities from wildfire-related lawsuits, a move that would likely send shockwaves through the insurance industry.\n\nThe bill would make it harder to prove that utilities are to blame for wildfires started by faulty or poorly maintained equipment while also limiting damages. In exchange for reduced liability, utilities would need to file plans every two years detailing the steps they’re taking to limit the risk of wildfires.\n\nThe bill, as currently written, doesn’t really require utilities to stick to those plans. If a utility doesn’t follow its plans or is negligent in maintaining its equipment, it is still protected from claims.\n\nThe insurance industry has been reeling from wildfires, and the bill could have the unintended effect of shifting the burden of wildfire claims from utilities onto homeowners’ insurers.\n\n“There’s no free lunch in this,” Marcus Osborn, an insurance company lobbyist, said at a public hearing on the bill. “You’re either going to pay in higher insurance premiums or you’re going to pay in higher utility costs.”\n\nSome homeowners in Arizona have seen their rates triple this year while others have had their coverage dropped.\n\nThat’s largely a result of insurance companies trying to cover their losses as wildfire claims stack up. Hippo, an insurance startup that went public via SPAC in 2021, reported $42 million in losses as a result of the recent Los Angeles wildfires. Lemonade, another startup that went public in 2020, is expecting to lose $45 million from the same disaster.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nCompounding risks from wildfires have given other startups an opening. Kettle, for example, sells reinsurance and models possible wildfire outcomes to help other companies backstop their wildfire risk. Still, the overall trend has been toward higher costs for homeowners.\n\nThe Arizona bill is being mooted as states throughout the Western U.S. grapple with the threat — and fallout — of wildfires made worse by climate change and over a century of fire suppression.\n\nFor decades, fires in the U.S. were stamped out as quickly as possible. Before, low-intensity fires would race through the understory, killing weak saplings and transforming dry leaf litter into rich ash that fertilized the soil. But as fires were suppressed, understories grew thick with brush and years of accumulated leaf litter.\n\nThose conditions created what wildfire experts call “ladder fuels,” which help carry low-intensity fires from the forest floor into the canopy, where they can turn catastrophic.\n\nAgainst that backdrop, climate change has been compounding the risk of high-intensity canopy fires. Rising temperatures have exacerbated droughts, according to a study published in November, by increasing evaporation. In other words, what little precipitation does fall to the ground ends up back in the atmosphere more quickly than before, leading to even drier conditions.\n\nWarmer winters have also been to blame. Lower snowpack leads to drier spring conditions, and insects whose populations were usually kept in check by bitter cold temperatures have been thriving. For example, warmer temperatures and voracious pine beetles killed more than 100 million trees in California between 2014 and 2017. Those dead trees became an ideal fuel that drove wildfires in subsequent years."}