{"url": "https://techcrunch.com/2019/01/04/up-to-818-million-deal-between-jj-and-locus-biosciences-points-to-a-new-path-for-crispr-therapies/", "title": "Up to $818 million deal between J&J and Locus Biosciences points to a new path for CRISPR therapies", "authors": ["Jonathan Shieber", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2019-01-04T00:00:00", "text": "The up to $818 million deal between Locus Biosciences and Janssen Pharmaceuticals (a division of Johnson & Johnson) that was announced yesterday points toward a new path for CRISPR gene editing technologies and (potentially) the whole field of microbiome-targeted therapies.\n\nBased in Research Triangle Park, N.C., Locus is commercializing research initially developed by scientists at North Carolina State University that focused on Cas3 proteins, which devour DNA Pac-Man-style, rather than edit it like the more well-known Cas9-based CRISPR technologies being used by companies like Caribou Biosciences, Editas Medicine, Synthego, Intellia Therapeutics, CRISPR Therapeutics and Beam Therapeutics.\n\nWhile the Cas9 CRISPR technologies can edit targeted DNA — either deleting specific genetic material or replacing it with different genetic code — Cas3 simply removes DNA strains. “Its purpose is the destruction of invading DNA,” says Locus chief executive, Paul Garofolo.\n\nThe exclusive deal between Janssen Pharmaceuticals and Locus gives Janssen the exclusive license to develop, manufacture and commercialize CRISPR-Cas3-enhanced products targeting bacterial pathogens for the potential treatment of respiratory and other organ infections.\n\nUnder the terms of the deal, Locus is getting $20 million in upfront payments and could receive up to $798 million in potential future development and commercial milestone payments and any royalties on potential product sales.\n\nA former executive at Valiant Pharmaceuticals and Paytheon, Garofolo was first introduced to the technology that would form the core of Locus as an executive in residence at North Carolina State University. It was there that he met Dr. Chase Beisel and Rodolphe Barrangou, whose research into Cas3 proteins would eventually be productized by Locus.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe company spun out of NC State in 2015 and raised its first cash from the North Carolina Biotech Center a year later.\n\nLocus is already commercializing a version of its technology with bacteriophages designed to target e coli bacteria to treat urinary tract infections. The company is on target to begin its first clinical trials in the third quarter of the year.\n\nThe focus on bacterial infection and removing harmful bacteria while ensuring that the rest of a patient’s microbiome is intact is a huge step forward for treating diseases that scientists believe could be linked to bacterial health in a body, according to Garofolo.\n\n“Most microbiome companies are about adding probiotics to your body,” says Garofolo, representing a thesis that introducing “good” bacteria to the body can offset any harmful pathogens that have infected it.\n\n“Things you’re exposed to are creating the groundwork for an infection or disease, or exacerbating an existing disease,” says Garofolo. And while he believes that the microbiome is the next big field for scientific discovery, the approach of adding probiotics to a system seems less targeted and effective to him.\n\nAlready, Garofolo has managed to convince investors of his approach. In addition to the initial outside investment from the North Carolina Biotech Center, Locus has attracted $25 million in financing from investors, including Artis Ventures and the venture capital arm of the Chinese internet giant, Tencent.\n\nMeanwhile, investors have spent millions backing alternative approaches to improving human health through the manipulation of the microbiome.\n\nCompanies like Second Genome, Viome and Ubiome are all using approaches that identify bacteria in the human body and try to regulate the production of that bacteria through diet and probiotic pills. It’s an approach that allows these companies to skirt the more stringent requirements the Food and Drug Administration has put in place for drugs.\n\nThat doesn’t mean that extensive amounts of research haven’t gone into the development of these probiotics. Seed, a Los Angeles-based startup that launched last year, has recruited as its chief scientist George Reid, the leading scientist on microbial health and the microbiome.\n\nFounded by Raja Dhir, a graduate from the University of Southern California and a leading researcher on microbiotics in his own right, and Ara Katz, the former chief marketing officer of BeachMint and an MIT Media Lab fellow, Seed focuses on developing probiotic treatments using well-established research.\n\n“Foundational to our approach is that it’s not which microbes are present in your gut… It’s based on looking at what specific microbes can do to a healthy individual to improve that status of health independent of what is already present,” Dhir said in an interview around the company’s launch last June. “It’s a little bit less exciting from a tech perspective, but it’s hardcore grounded in basic science… The question is, does this have changes and effects in validated bio-makers in a controlled and placebo setting?”\n\nDhir said that a basic understanding of how different bacteria can influence health is necessary before getting into the benefits of personalization.\n\n“These things can dance between drugs and nutrition,” Dhir said. “Probacteria are an additional lever that people should pull… like diet and exercise and cessation of smoking… In every correspondence we always have been and need to be clear that this should never be seen as a replacement of therapies.”\n\nBy contrast, the tools that Locus is developing are very much therapies with potentially far-reaching implications for illnesses, from irritable bowel syndrome to gastrointestinal cancers and even neurological disorders.\n\n“The science [around the microbiome] is early, but it is very well-known that a potentially deadly pathogen should be removed from your body,” Garofolo said."}