{"url": "https://techcrunch.com/2021/12/09/tinder-is-partnering-with-spotify-to-launch-a-new-music-mode-feature/", "title": "Tinder is partnering with Spotify to launch a new ‘Music Mode’ feature", "authors": ["Aisha Malik", "Consumer News Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-12-09T00:00:00", "text": "Tinder is partnering with Spotify to launch a new “Music Mode” feature where users will hear a 30-second looped preview of a potential match’s chosen song while checking out their profile. Users who link their Spotify accounts and add a chosen song, called an “Anthem,” to their Tinder profiles will be able to enter Music Mode. It’s worth noting that Tinder and Spotify first partnered in 2016 to launch the Anthem feature, which allows users to add music to their dating profiles. This latest integration is a new way for users to discover their potential matches’ favorite songs.\n\nMusic Mode will be rolling out to Tinder users globally, in all markets where Spotify is available, in the coming weeks. The new feature will be found on Tinder’s interactive “Explore” page. Tinder notes that the new feature builds on the natural ties between music and human connections by allowing users to connect through their tastes in music.\n\n“Now with Music Mode, our members can experience that feeling when you’re at a party and you find out someone else loves the same songs you do,” said Kyle Miller, the vice president of product innovation at Tinder, in a press release. “Songs are deeply personal, and Music Mode is a place to spark something new through music.”\n\nThe company says about 40% of Gen Z Tinder users have already added Anthems to their profiles and when they do, they see nearly a 10% increase in matches.\n\nThis latest launch comes as Tinder has been rolling out new features to allow users to engage with others in new ways. For example, the aforementioned new Explore section features events, as well as new ways to discover matches by interests. It also allows users to dive into quick conversations with others before a match is made. The company also recently launched a new “Plus One” feature. Through the feature, users are able to signal that they are either looking for a date to a wedding or are willing to be one.\n\nLast month, Tinder also brought back “Swipe Night,” its interactive in-app event that allows its users another way to break the ice besides just matching and chatting, this time featuring a “whodunit” murder mystery. The Swipe Night feature is available in the Explore section. Also available in this section is “Hot Takes,” which lets members chat in real time in a sort of speed dating, timed experience, and “Passions,” where users can meet others with similar interests, among other things."}