{"url": "https://techcrunch.com/2025/01/09/powerschool-says-hackers-stole-students-sensitive-data-including-social-security-numbers-in-data-breach/", "title": "PowerSchool says hackers stole students’ sensitive data, including Social Security numbers, in data breach", "authors": ["Carly Page", "Sr. Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-09T00:00:00", "text": "Edtech giant PowerSchool has warned customers that hackers accessed its customers’ highly sensitive information — including student Social Security numbers, grades, and medical information — during a recent data breach, TechCrunch has learned.\n\nIn an FAQ obtained by TechCrunch that was sent to affected customers this week, PowerSchool says that “sensitive personal information” was accessed during its December breach, which was confirmed by PowerSchool on Wednesday.\n\nThe hackers broke into PowerSchool’s internal customer support portal using a stolen credential, the company previously said. The breach affects users of PowerSchool’s school information system, which schools use to manage student records, grades, attendance, and enrollment.\n\nPowerSchool said in its FAQ that while the stolen data primarily includes contact details, such as individuals’ names and addresses, the hackers were also able to access Social Security numbers, some medical and grade information, and other unspecified personally identifiable information belonging to students and teachers.\n\nThe California-based education tech firm, the largest provider of cloud-based education software for K-12 education in the United States, says the personal information of parents and guardians, including names, phone numbers, and email addresses, was also potentially compromised in some school districts. The company said the types of stolen data will vary by customer.\n\nPowerSchool spokesperson Beth Keebler confirmed the legitimacy of the information in the FAQ on Thursday but declined to say how many individuals are affected by the breach. PowerSchool says its software is used by over 18,000 customers to support more than 60 million students across North America.\n\nIn the FAQ, PowerSchool confirmed that the security incident was not ransomware in nature, but noted that it worked with CyberSteward, a Canadian organization that offers cyber-extortion incident response services, to negotiate with the threat actors responsible for the breach.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThis confirms previous reporting that PowerSchool was the target of an extortion-only attack and that it paid a financial sum to prevent the hackers from publishing the stolen data.\n\nPowerSchool declined to say what evidence it had to suggest that the stolen data had been deleted, when asked by TechCrunch on Thursday. CyberSteward did not respond to TechCrunch’s questions.\n\n“PowerSchool has taken all appropriate steps to prevent the data involved from further unauthorized misuse and does not anticipate the data being shared or made public,” Keebler said. “PowerSchool believes the data has been deleted without any further replication or dissemination.”\n\nPowerSchool was acquired by Bain Capital in 2024 in a $5.6 billion deal. When reached by TechCrunch this week, Bain Capital spokesperson Rachel Colson did not provide comment.\n\nDo you have more information about the PowerSchool data breach? We’d love to hear from you. From a non-work device, you can contact Carly Page securely on Signal at +44 1536 853968 or via email at carly.page@techcrunch.com.\n\n"}