{"url": "https://techcrunch.com/2022/08/30/how-gender-affirming-health-care-startups-are-navigating-legal-miasma/", "title": "How gender-affirming healthcare startups are navigating legal miasma", "authors": ["Dominic-Madori Davis", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-08-30T00:00:00", "text": "Kate Anthony started in the Lone Star State.\n\nIt was there, in 2019, that she launched her app Euphoria, seeking to provide information and resources on gender-affirming care. She knew the stakes were going to be high, and as the state passed anti-trans legislation, she and her company were forced to flee.\n\nSettling in Denver, Anthony made a plan on what to do next. She decided to maintain business as usual while the fight for trans rights continues. She’s not alone in that decision. Many apps, if not all, that service the trans community are hyperexposed, under fire and seemingly undeterred.\n\nTechCrunch conducted a vibe check to see how trans entrepreneurs servicing their communities are navigating this moment. The Human Rights Campaign told TechCrunch that legislators in state houses have introduced 344 anti-LGBTQ+ bills this session, with more than 140 specifically targeting the trans community.\n\nThese proposed restrictions range from an Alabama bill that seeks to deny medical care for transitions to Iowa and Alaska bans on trans students participating in sports. Louisiana introduced a bill to bar medical professionals from offering minors translation-related care, and Florida now prohibits gender-affirming care under Medicaid.\n\nAnthony said it’s inevitable that her company will one day be sued by someone or some state. Other founders said they are watching the court systems closely, with some rethinking strategies regarding consumer privacy and employee benefits. And for the startup and venture community, support is better late than never — it’s a critical time to defend trans founders.\n\nBackstage Capital found less than 1% of all venture funds went to openly LGBTQ+ founders. This dearth of capital contributes to a lack of innovation, operation and protection for one of the nation’s more persecuted communities, compounding how difficult it is to be a trans founder and run a startup aimed at the trans community.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“I try to be an eternal optimist, but I also need to be pragmatic,” Anthony said regarding what the next few months will look like for her. “I’m scared as hell.”\n\n“We’re making sure we’re on top of what is happening”\n\nEuphoria stems from personal experience, Anthony said. She launched the app after finding her own transitioning experience to be long and difficult. One of the biggest problems was that information on the process was hard to find, she recalled.\n\n“It was hidden in underground support groups and internet forums, [stocked] with anecdotal information,” she said. “I just thought to myself, ‘There has to be a better way.’”\n\nThe result was Euphoria, which is made up of four different apps and provides services such as transition coaching, daily motivations and a banking service to help people save for their transitions. The company, which Anthony said has 100,000 users, also provides a state-by-state breakdown of how rulings and legislation will impact transition journeys.\n\nAfter the Florida ruling this month, Euphoria alerted its customers that their hormonal medications and surgical procedures are no longer covered under Medicare, resulting in the app sharing resources nearby. Anthony calls this a “real-time” dynamic that the app adopted.\n\n“It adapts and helps our users sift through [information], showing them the end practical results of these legislations or these rulings so they can make an actionable decision as it pertains to their health care,” Anthony said. “And to just how they exist as a member of society.”\n\nThe app is legally exposed in a few states, however. Texas Gov. Gret Abbot, for example, says providing gender-affirming medical care to trans youth is considered child abuse under state law. Aydian Dowling, the founder of the app Trace, which helps trans individuals document their transitioning journey, is also pondering his company’s legal liability.\n\nTrace is headquartered in Wisconsin, a state also attempting to bar transgender children from receiving gender-affirming care. A concern raised after Roe v. Wade was overturned is that the states that banned abortion could utilize the data from tracking and documenting apps, like Trace, to punish those seen as breaking newly implemented laws. As a result, Dowling said his company has started reassessing its approach to consumer privacy.\n\n“We try not to collect a lot of data; we don’t sell any of our data; the only way somebody could potentially get data would be through a subpoena,” Dowling said. “We will not allow these anti-trans people to bully us into giving information.”\n\nRegarding servers, Dowling said the company has started pondering the legal safety of having its information stored in databases hosted in states such as Wisconsin or even Texas.\n\n“If that means we should move servers to a place that we know is more protective, if that means we have to call on lawyers and get people who are well versed in this, then that’s what we will do,” Dowling continued. “We’re making sure we’re on top of what is happening.”\n\nAs previously reported by TechCrunch, Roe’s reversal impacted more than just reproductive rights. Landmark court cases decided the right to exist for minorities and other marginalized groups, and the United States Court of Appeals for the Fifth Circuit, which led to Roe’s downfall, showed these rights could be toppled on a whim.\n\nFor this reason, Anthony is paying close attention to what that particular court decides to take on next. She and Dowling say they already have legal groups on standby.\n\n“If there’s going to be a court that takes a shot at Bostock, Obergefell or Griswold, that’s who it’s going to be,” she said, referencing the cases that protect trans and gay individuals from workplace discrimination, ensure same-sex couples’ right to marry and protect married couples’ ability to purchase and use contraceptives without government interference.\n\nMeanwhile, telemedicine company Folx Health is used to dealing with legislative restrictions, and Rocco Kayiatos, one of the first executives at the company, said all trans-related care will become an even more tenuous political issue come election time.\n\nFolx Health offers virtual doctor visits and works with companies to offer LGBTQ+ employee benefits. It also mails medications such as hormone therapy; a service that’s poised to be a contentious issue.\n\nTelemedicine remains a debated topic, and states like Texas have sought to toughen their ban on the mailing of abortion pills by attaching a jail sentence to the action. Kayiatos said that Folx Health has run into problems mailing, for example, testosterone to transgender men because it’s a hormone also used as a steroid by athletes.\n\n“Rolling back trans people’s rights and access is going to continue to be a focal point of the conservative [political] platform,” Kayiatos told TechCrunch. “It’s all the more important for trans-led companies and businesses to continue to build and exist to service this community.”\n\nAnthony seconded that, saying despite what happens this next few years, the trans community has always had a long, storied history of learning how to survive in the face of hostility and is “uniquely positioned” to respond to patchwork systems and unfairness. She added that if anyone in the venture space is interested in helping, now is the time to cut trans founders a check.\n\n“We’ve always existed and even if things get worse, we’re not going to cease to exist,” Anthony said. “It’d be harder to justify crafting legislation that outlawed specific services and industries as that could create economic fallout.”\n\nThis article was updated to clarify the Gov. Greg Abbott’s statements regarding providing gender-affirming medical care to trans youth."}