{"url": "https://techcrunch.com/2025/04/09/lyst-the-fashion-marketplace-once-valued-at-700m-sells-to-japans-zozo-for-154m/", "title": "Lyst, a fashion marketplace once valued at $700M, sells to Japan’s Zozo for $154M", "authors": ["Ingrid Lunden", "Europe Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-09T00:00:00", "text": "Fashion goes in and out of style, and it turns out, so do fashion startups. Lyst, a high-end fashion marketplace that was once valued at $700 million, has been acquired for just $154 million in cash by Zozo, a Japan-based fashion and e-commerce business.\n\nZozo owns a number of fashion brands that include Wear by Zozo, Zozotown, and Zozosuit, among others. You might have heard of Zozo for another reason, though: Its founder Yusaku Maezawa once had the “most retweeted tweet,” when he promised to give away 100 million yen in cash for retweeting it.\n\nZozo said it will continue to operate U.K.-based Lyst as a stand-alone business, and its current CEO Emma McFerran is staying with the company.\n\nLyst selling for a price tag massively lower than its last valuation is a sign of the times. The world of e-commerce is facing spectacular levels of uncertainty, with Lyst dealing with headwinds from three different directions.\n\nFirst, U.S. tariff hikes are raising questions around the future of global trade, including the impact on smaller companies across the world that sell goods to U.S. consumers. Nearly a third of London-based Lyst’s revenues currently come from sales in the U.S.\n\nSecond, even before those tariffs became an issue, Lyst was facing massive competition in online fashion not just from other specialist outlets, but also behemoths like Amazon and Temu.\n\nThird, technology investors today have overindexed massively on anything to do with artificial intelligence. That has put a lot of pressure on companies that are not in that space to show similar growth trajectories, plus growth stories that incorporate AI in some way.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nLyst and Zozo seem to have gotten the memo. The pair will be “Transforming the Future of Fashion Discovery through AI and Technology,” the companies prominently noted in their announcement. That phrase is mentioned again in the release, but there are no specific details of what that will mean.\n\nIn addition to a foothold in the U.K., the deal also gives Zozo an international business. Lyst said it has customers in 190 markets, with 30% of its business coming from the U.S., 24% from the U.K., and 34% from Europe.\n\nLyst has leaned into the long tail of fashion brand aggregation in a marketplace model: It claims to offer products from 27,000 brands, including both designers and retailers. The list includes Prada, Gucci, Bottega Veneta, Valentino, Miu Miu, Coach, Michael Kors, Hugo Boss, Selfridges, Harvey Nichols, and Harrods.\n\nThe company was one of the winners of the e-commerce boom during and just after the peak of the COVID-19 pandemic. When it raised $85 million in May 2021, Lyst gained a valuation of around $700 million. Fidelity led that round, and other big-name investors in the company include Accel, Balderton, and Molten (formerly Draper Esprit). The company at the time even described the funding as a pre-IPO round.\n\nHowever, not only did the IPO window slam shut a few months later, but a lot of the gains e-commerce companies saw during that period quickly deflated as consumers returned to their pre-pandemic spending habits. And then investors moved on to the next big thing, AI.\n\nThe fashion e-commerce market has remained difficult.\n\nA spokesperson explained that Lyst’s 160 million users are “annual unique users,” but that figure includes active shoppers as well as those just window-shopping. It’s hard to know how successful the company’s conversion strategy (important for e-commerce companies) has been. In 2022, Lyst laid off 25% of its staff. And it has not been alone. Farfetch, another big name in high-fashion e-commerce, has nosedived since the pandemic.\n\nLyst recorded revenue of £50.1 million ($64 million) in the year ended March, 31, 2024, largely the same as its revenue from the year before (£50 million), per its most recent Companies House filings in December 2024.\n\nLyst continued to post a net loss in that time, but it did manage to narrow it drastically over that year to £510,000 from £23.7 million a year before. It also posted an operating profit before taxes of £443,000. A spokesperson noted that Lyst posted $1 million in EBITDA in its last audited accounts.\n\n“This is an exciting moment for Lyst, and a win-win for our fashion ecosystem of shoppers and partners as we move forward as part of ZOZO Group,” McFerran said in a statement.\n\nNow the question will be whether getting better economies of scale with Zozo will give Lyst the lift it needs to turn this around."}