{"url": "https://techcrunch.com/2025/01/14/with-30-million-in-new-funding-seeqc-thinks-chips-are-key-to-building-useful-quantum-computing/", "title": "With $30M in new funding, SEEQC thinks chips are key to building useful quantum computing", "authors": ["Anna Heim", "Freelance Reporter", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "Amanda Silberling", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-14T00:00:00", "text": "Nvidia CEO Jensen Huang may have said that “very useful quantum computers” are probably still 20 years away, but his company is also hedging its bets beyond classical chips with investments and partnerships in that very space.\n\nNow one of the companies that Nvidia partners with in quantum development is announcing funding. SEEQC, a quantum computing startup, has raised $30 million in funding co-led by Booz Allen Ventures and Japanese-European VC firm NordicNinja, with participation from new backer SIP Capital and some existing investors. “It’s a combination of financial, geographic, and strategic strengthening,” SEEQC CEO John Levy said of the Series A extension.\n\nSEEQC is part of an emerging category of startups looking at how to best leverage classical computing to manage quantum processors. This will be essential to manage large numbers of qubits, the fundamental units of quantum computing, while making hardware compatible with data center and enterprise needs.\n\nSEEQC — an acronym for “scalable, energy efficient quantum computing” and pronounced “seek” — believes that the key to reducing the complexity of today’s quantum hardware is to have chips that can power all the core functions of a quantum computer. For instance, this makes it possible to control a lot of qubits with a single cable, as SEEQC believes is sorely needed.\n\nThere’s no denying that current prototypes often look bulky, just like regular computers did in the early days of IT. Levy thought that Google’s announcement on the error correction abilities of its Willow quantum chip was “fantastic” — but he also couldn’t help notice the amount of cables involved.\n\n“We need to see those [types of announcements], but we also need to see from a systems engineering perspective, the ability to resolve cabling issues, speed, latency, cost, etc., the kinds of traditional things that you need to be able to build large scale systems. And unless we do that, we’re not going to be able to actually scale enterprise grade quantum data centers,” Levy said.\n\nThe rapid advancement of AI has already underscored the critical need for more energy-efficient data centers, which quantum could make a reality, while simultaneously unlocking new applications, such as accelerating the development of new materials and new pharmaceuticals.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThis explains why German chemical company BASF recently joined the SEEQC-led and U.K.-supported QuPharma project to explore how quantum computing can accelerate the process of drug discovery, in partnership with Merck. “These companies know that quantum is going to be central to their business,” Levy said.\n\nThis also explains why Merck’s corporate venture capital arm, M Ventures, invested in SEEQC in 2020, followed by other investors, including EQT Ventures and LG Technology Ventures that eventually brought SEEQC’s backing to a total of $22.4 million prior to this latest round.\n\nThat’s alongside SEEQC’s partnership with Nvidia. Announced in 2023, the collaboration aims to build an “all-digital, ultra-low-latency chip-to-chip link between quantum computers and GPUs,” which — when created — would be compatible with all quantum computing technologies.\n\nThe new funding will help the startup accelerate the commercial rollout of its chips and improve their capabilities. But SEEQC is already further along than you may expect from a startup created in 2019, in large part because it is a spinout of chip company Hypres, which was itself established by former employees of IBM’s superconducting electronics division.\n\n“We actually started with a mature technology, our own chip foundry — we operate a very specialized chip foundry for the kinds of chip we build — IP, and a core team of people who had built whole superconducting systems, primarily through U.S. government users,” Levy said.\n\nSince then, the company tripled the size of its team, which is partly based in London, the U.K., and in Naples, Italy, where a pre-spinout, first version of its chip was built; most of the team is in Elmsford, New York, where it now plans to expand its chip foundry.\n\nQuantum promises aside, this also resonates with growing demand for a chip supply chain that is resilient to geopolitical tensions, particularly those involving China.\n\nDifferent companies are attacking this problem from different angles, such as photonics, silicon-based chips, and trapped ion qubits. Which approaches will prevail remains to be seen, but Levy is convinced that it is key to think beyond qubits. “We need to have an overall system architecture that can actually take us to where we need to get to, and chips are going to be at the very center of that.”"}