{"url": "https://techcrunch.com/2024/06/15/subscription-vitamin-company-care-of-is-shutting-down/", "title": "Subscription vitamin company Care/of is shutting down", "authors": ["Anthony Ha", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-06-15T00:00:00", "text": "Care/of, a company offering personalized subscription vitamin packs, says it will be canceling all subscriptions as of Monday, June 17 and will no longer be accepting new orders.\n\nThe news doesn’t come completely out of the blue, as Care/of had previously disclosed in a New York Department of Labor filing that it planned to lay off all 143 employees by July 3 due to a “funding loss.” Now the company is being more specific and definitive about the closure, with a post yesterday on Instagram thanking customers and saying, “We unfortunately no longer have funding to operate in the way we have been.”\n\nThe post doesn’t completely close the door on a revival, claiming, “We are actively exploring options for the brand but do not have anything definitive to communicate at this time. We hope to be in a place to share more soon.”\n\nFounded in 2016 by Craig Elbert and Akash Shah, Care/of asked customers to fill out a quiz about their lifestyle and values, which it used to recommend a personalized mix of vitamins and supplements. Its investors included Juxtapose, Goodwater Capital, Tusk Venture Partners, Bullish, and RRE Ventures; they funded the company to the tune of $46 million altogether.\n\nPharmaceutical giant Bayer acquired a 70% stake in Care/of in 2020 in a transaction that was reportedly valued at $225 million. Earlier this month, Bayer’s director of strategic communications Christin Miller told NutraIngredients that “ceasing further investment in Care/of will allow Bayer to better invest in future innovations at help people manage their personalize health.”"}