{"url": "https://techcrunch.com/2020/02/27/sparklabs-group-launches-connex-an-accelerator-program-for-smart-city-technology/", "title": "SparkLabs Group launches Connex, an accelerator program for smart city technology", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2020-02-27T00:00:00", "text": "SparkLabs Group announced today that it has launched SparkLabs Connex, the latest program in its network of startup accelerators and venture funds. Focused on real estate technology (proptech) and the Internet of Things, SparkLabs Connex will tap into startup ecosystems in Silicon Valley, Seoul, Shenzhen, Taipei and Singapore.\n\nThe program will support startups working with tech — like artificial intelligence, 5G, low-power wide area networks, eSIMS and security — essential to green building and smart city programs. Charles Reed Anderson, the founder of Singapore-based IoT, mobility and smart city advisory firm CRA & Associates, will lead SparkLabs Connex as its managing partner.\n\nThe program’s partners include Nokia, True Digital, Beca and Skyroam, as well as the cities of Taipei, Taiwan, Songdo, South Korea and Darwin, Australia, which will be working with its portfolio startups to test and deploy their technology. SparkLabs Connex is also working with Go Smart, the Taipei City initiative to create a global network of smart cities, and the Urban Technology Alliance, which tests smart city tech in France, Spain, Japan, South Korea and Taiwan.\n\nIn a press statement, Anderson said, “My ambition for SparkLabs Connex is to become the innovation hub for the IoT, smart city and prop tech ecosystems, and I’m excited with the quality and variety of partnerships we have signed at launch-and will sign in the future. SparkLabs Connex is more than an accelerator, it’s an ecosystem play, and we believe it creates a unique value proposition for startups, partners and investors.”"}