{"url": "https://techcrunch.com/2022/12/08/banzai-martech-hyros/", "title": "Banzai, a marketing tech startup, acquires Hyros for $110M, raises $100M and goes public via a $580M SPAC", "authors": ["Ingrid Lunden", "Europe Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-12-08T00:00:00", "text": "The IPO window is all but closed right now, but a few things appear still to be getting through the cracks and there are big sums attached to that. Today, Banzai — an engagement marketing startup that provides tools to source and connect with potential sales leads, and tools to build and run online video events — announced that it is going public, by way of a SPAC. Alongside that, Banzai is acquiring Hyros, a startup that specializes in advertising and marketing attribution.\n\nBanzai is paying $110 million on acquire Hyros, and the combined, listed company said it would have an enterprise value of $380 million — from an equity value of $580 million, minus $207 million in cash and $7 million in debt post-deal. It is also picking up $100 million to fuel future activities. The combined company, called Banzai International, will trade on Nasdaq (specifically its Capital Market tier).\n\nThe SPAC leading the deal is called 7GC & Co Holdings — a partnership between the 7GC technology growth fund and Hennessy Capital and led by Jack Leeney — which describes itself as a $230 million special purpose acquisition company that trades under VII.\n\nThe pair of deals — listing and Hyros acquisition — underscore not just the ongoing consolidation in the market, but the opportunity that some startups and investors are seeing to take an active role in that process.\n\n“Yes, we’re raising some cash, but we’re also putting ourselves in the best position for M&A,” Banzai CEO Joe Davy told TechCrunch in an email-based interview. “We expect there will be a lot of consolidation in the next 48 months in martech, and that’s a big opportunity for us. When it starts raining gold, you want a wheelbarrow, not a thimble, and we’re looking to set ourselves up with a wheelbarrow.”\n\nMarketing tech and the specific area that Banzai works in has seen a lot of activity in the last couple of years.\n\nLeading into COVID-19, there was already a big opportunity for tech to help sales and marketing teams better leverage the internet and big data to do their jobs better. That really took off during the pandemic, when in-person meetings became impossible and leaning on tech platforms and connecting digitally was basically the only way to go. That gave a huge boost to companies like Hopin too, to create and better manage video meetings, and Banzai also jumped on that bandwagon, acquiring a startup called Demio to bring video meetings and webinars onto its platform.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSome of that exuberance has not been sustained, though. Just as e-commerce has dipped from its dizzying pandemic heights, so too have a lot of the biggest expectations for all of those virtual collaboration and productivity tools. Perhaps one of the biggest examples of that has been Hopin itself, which has seen layoffs, a product pivot and other examples of decline after being valued at nearly $8 billion at its peak.\n\nBanzai is a significantly smaller company, one that makes it clear it’s focused on marketing more than video and overall taking a slightly different route.\n\nThe company today has around 7,000 customers and prior to this had raised around $120 million per PitchBook data, with investors including Tribe Capital, Growth Technology Partners and Gaingels, among others. That sum includes $100 million arranged earlier in the year from a firm called Global Emerging Markets, in line with this public listing also being confirmed today. Notably, Banzai notes that it operates with a gross profit of $16.9 million for the 12 months that ended September 30, 2022, with an annual growth rate of 85% in that period and ARR of $22.1 million. However, Banzai is still not overall profitable, posting a net loss of $8.5 million in the same period.\n\nBanzai’s CEO Joe Davy notes that video is just part of what it offers, and the idea here is to build out a bigger suite of tools for marketing and sales.\n\n“We see ourselves as a sales and marketing platform first, and video platform second,” Davy said. “So, we’re more focused on what are the real day-to-day needs of marketers and sales teams and how can we put those things together in a single package that’s really simple and accessible for our customers.”\n\nHe added that just as companies like HubSpot and Marketo made a name by carving out marketing features anchored to email, it’s doing the same for video. Most video products used by sales and marketing teams, he added, were generic and not built for their needs specifically. “We’re building out the marketing features around video, adding data, automation, audience generation, and other things that [sales and marketing teams] need to be successful.”\n\nRaising money as a public company puts Banzai on to a different scale compared to how much it might likely have raised from private investors, especially at the moment. That’s something that likely pushed the company towards the IPO route, too.\n\n“The days of easy money with zero accountability in VC are behind us at least for the foreseeable future. And this is overall a really good thing,” said Davy. “Doing this merger with VII solves several things in one fell swoop. It adds some cash to our balance sheet, gives us a public currency, and allows us to acquire Hyros – which we believe will all be great for our customers and our business long term.”"}