{"url": "https://techcrunch.com/2025/05/09/florida-bill-requiring-encryption-backdoors-for-social-media-accounts-has-failed/", "title": "Florida bill requiring encryption backdoors for social media accounts has failed", "authors": ["Zack Whittaker", "Kyle Wiggers", ".Post-Authors-List__Authors --Font-Size Var", "Align-Items Center Display Flex Gap Var", ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var", "Border Solid Var --Wp--Custom--Color--White", "Border-Radius", "Height -O-Object-Fit Cover Object-Fit Cover Width .Post-Authors-List__Authors .Post-Authors-List__Author-List Display Flex Flex-Wrap Wrap Gap Var", "List-Style-Type None Margin-Bottom Margin-Top Padding .Post-Authors-List__Authors .Post-Authors-List__Author-List Li List-Style None Margin-Top .Post-Authors-List__Authors .Post-Authors-List__Author-List Li Not", "Last-Child"], "publication_date": "2025-05-09T00:00:00", "text": "In Brief\n\nA Florida bill, which would have required social media companies to provide an encryption backdoor for allowing police to access user accounts and private messages, has failed to pass into law.\n\nThe Social Media Use by Minors bill was “indefinitely postponed” and “withdrawn from consideration” in the Florida House of Representatives earlier this week. Lawmakers in the Florida Senate had already voted to advance the legislation, but a bill requires both legislative chambers to pass before it can become law.\n\nThe bill would have required social media firms to “provide a mechanism to decrypt end-to-end encryption when law enforcement obtains a subpoena,” which are typically issued by law enforcement agencies and without judicial oversight.\n\nDigital rights group the Electronic Frontier Foundation called the bill “dangerous and dumb.” Security professionals have long argued that it is impossible to create a secure backdoor that cannot also be maliciously abused, and encryption backdoors put user data at risk of data breaches."}