{"url": "https://techcrunch.com/2022/05/12/eridan-reinvents-a-piece-of-mobile-infrastructure-and-calls-up-42m-in-funding/", "title": "Eridan reinvents a piece of mobile infrastructure and calls up $46M in funding", "authors": ["Devin Coldewey", "Writer", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-05-12T00:00:00", "text": "Most of the time no one has to think about how the mobile networks we all rely on work. But it won’t surprise many to hear that, as is often the case with infrastructure, some pieces are the latest tech and others haven’t changed in decades. Eridan is a well-funded startup aiming to replace one of the latter with fundamentally different hardware approach could make mobile networks an order of magnitude more efficient.\n\nEverywhere you look — or more likely, just above where you look — there are cell towers that connect your phone to the broader internet. You can think of these as being made up of three big pieces: the modem, which exchanges data with the rest of the net; the antenna, which beams out the radio signal in synchrony with dozens or hundreds of devices nearby; and the transceiver, which sits in between and converts the digital data of the modem to the actual RF signal the antenna puts out.\n\nObviously the modem must change with the times and increase capacity, and it has done so. Likewise the antenna must change to reflect new and repurposed slices of spectrum being used for mobile data. But the transceiver is sort of like a digital-to-analog converter in that its job hasn’t really changed much — data in, signal out.\n\nRecently, however, we have begun to probe the limits of that middle bit, which is a dinosaur in technological terms.\n\n“How that transceiver has powered the antenna hasn’t changed in the last 70 years,” said Eridan co-founder Doug Kirkpatrick. “It’s called a linear amplifier, and that device, that circuit architecture approach is literally at the limit with what 5G is today.”\n\nThese amplifiers are essentially analog devices, and due to their fundamental nature, the more power you put into them, the less efficient they are. And over the years the power used has only increased as the number and complexity of signals has grown; 5G transceivers are roughly half as efficient as 4G ones, which were half as efficient as 3G — yet due to spectrum limitations and growing demand, we’ll need far more 5G cells. Even if the difference is only a handful of watts, it adds up very quickly if you plan to cover all populated areas plus highways.\n\n“If you want to get everywhere, it’s like 20 times more radios, and with the efficiency going down too, you’re talking about taking up 50% of the U.S.’s electricity,” Kirkpatrick said. “This dog don’t hunt.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“What we’ve done is something the industry has been after for maybe 30 years, and something every wireless company has pursued, spending billions. If you want everyone to have 5G without melting the planet, we are the absolute only way this happens,” he continued.\n\nAnd just what is it exactly that Eridan has done? I hinted at my skepticism that a startup with limited means could leapfrog decades of research by some of the richest companies on the planet.\n\n“Well, we cheated,” Kirkpatrick admitted. One of the founders of the company, Earl McCune, who sadly passed away two years ago during the development process, was among those doing the research at those big telecoms, where his approach never took off. Not to say he took trade secrets with him, of course — they just found a way to make the theory reality outside of the corporate structure.\n\nAfter meeting during a failed recruitment to do related work for a large company, the founders decided they liked each other enough to pursue the concept independently.\n\n“We did what you’d do, sat down with a bar napkin and a beer,” he recalled, and after filling the think tanks a bit, “It was one of those epiphanies. Everybody’s eyebrows went up and they said, ‘that’s an insane idea … but it might work.’ Then literally the first time we turned it on, it was the most perfect signal you’ve ever seen. We said, ‘how the hell are we going to explain this to anybody?’”\n\nThe advance is in some ways a simple one, like going from vacuum tubes to transistors.\n\n“A linear amplifier is an analog amplifier; since they’re worrying about cost and efficiency, they’ve made the best of a bad bargain: how dirty [i.e., how noisy] can you make the signal and still be efficient? This is fundamental to what linear amplifiers do,” he explained. “We’re a digital switch — we send out an ultra-clean signal. It’s a hundred times smaller and a hundred times cheaper.”\n\n“This type of direct polar architecture, Earl wrote books on it — he was a savant of this kind of approach,” Kirkpatrick said. His other co-founder, Dubravko Babiç, is a materials expert who focuses on gallium nitride, which without delving too far into the details is used in combination with silicon to create high-efficiency chip architectures. The GaN-silicon combo here let them make a jump from around 10% efficiency in installed devices to 50%.\n\nThey first collected a $5 million contract from DARPA, thinking it could be used to shrink military radios, but soon realized the tech reached well beyond the defense category and brought it to telecoms.\n\nThe resulting “Miracle” device (which just looks like a normal PCB, by the way) is so dissimilar to existing infrastructure that they’ve had trouble getting prospective companies to understand its qualities. “But a little over a year ago the doubters got everything they needed — we demoed it on top of a mast. You can doubt the tech all you want, but when you light it up on a mast it’s game over,” Kirkpatrick said.\n\nStill, he admitted, the infrastructure market is conservative. These are companies paying huge sums to build millions of installations to serve hundreds of millions of people — they tend to go with what they know works even if there’s a newcomer out there that’s better and cheaper. But a pilot test at Fort Hood should show off Eridan’s 5G small cell capabilities, which assuming all goes well should lead into commercial deployments around the end of 2023.\n\nWhat likely convinced them, beyond the existential threat of linear amps reaching the theoretical limits of the amount of data they can handle, is the further expandability of Eridan’s tech. It would be enough to make 5G deployments cheaper and better — but what about the next upgrade?\n\nThe latest signal protocols coming from mobile data authorities and standard setters involve 8-bit signals pushing 256 QAM — we won’t get into the technical details here either but you can think of it as equivalent to home internet bandwidth. Essentially the more bits you can fit in a given stretch of signal, the more data you can deliver, though as is always the case with wireless, the more risk there is that this increasingly complex and fragile signal doesn’t arrive intact.\n\nAs you can imagine, going from analog to digital production of that signal has a huge effect on how effective a transmission is. “Which do you think propagates farther, a clean signal or a dirty signal?” asked Kirkpatrick, obviously rhetorically. The use of GaN allows the system to operate at high voltages, removing the need for an amplifier at all, further improving signal because amplifiers amplify “the crud along with the good” in a dirty signal.\n\nEridan had an experimental 10-bit, 1,024-QAM released by 3GPP working within hours of its release and has moved on to showing in a lab setting that they can transmit a 16-bit, 64K (i.e., 65,536)-QAM signal. (Trust that people who like wireless protocols will find that number very impressive.)\n\nThe promise of being a major part of infrastructure that needs to be built out for a decade and more has clearly activated the check-writing portions of investors’ brains. After the $5 million from DARPA, Eridan has raised a total of $46 million between today’s B round announcement and a secret $8 million A round. The latest round was led by Capricorn Investment Group, Monta Vista Capital and Social Capital (which led the A round).\n\nThe money will go toward hiring up and manufacturing — “we’re setting up to make tens or hundreds of millions of these things,” said Kirkpatrick. Though he couldn’t name the prospective customers, it’s not hard to imagine the likes of whom would benefit from this hardware. Basically, if you’ve heard them hollering about 5G at some point in the last five years, they’re probably on the list.\n\nCommercial deployments should start appearing after the official demonstrations at Ft Hood and elsewhere next year. You probably won’t notice anything — but then again, that’s kind of the point."}