{"url": "https://techcrunch.com/2022/06/09/growth-marketing-experts-survey-how-would-you-spend-a-75000-budget-in-summer-2022/", "title": "Growth marketing experts survey: How would you spend a $75,000 budget in summer 2022?", "authors": ["Miranda Halpern", "Data Analyst", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-06-09T00:00:00", "text": "In November, we reached out to marketers to learn how they would spend a $25,000 budget in Q1 2022. The advice ranged from going full force on one channel to investing in a copywriter and making video content.\n\nBut there’s been a lot of belt tightening since then. We followed up with a few marketers from our previous survey, as well as reached out to some more to see how they would spend a $75,000 budget this summer. Amid the economic uncertainty, we also asked how their plan would change if their budget was $10,000.\n\n“For a $75,000 allocation of a budget like this, we’d really focus our efforts on digital performance-based media,” said Ellen Kim, VP of creative at MarketerHire. “We are always iterating on new creative versions and reviewing digital channel spend to ensure that we’re being as efficient as possible.”\n\nHere’s who we talked to:\n\nEllen Kim, VP of Creative, MarketerHire\n\nImagine you have a $75,000 budget going into summer 2022. How would you spend it with the current uncertain state of the economy to accelerate a B2C startup? A B2B startup?\n\nWith knowledge gleaned from experience at a B2B startup — coupled with the uncertain state of the current economy — we have developed an acute understanding of just how crucial it is to constantly monitor advertising results as a barometer for growth. For a $75,000 allocation of a budget like this, we’d really focus our efforts on digital performance-based media.\n\nWe are always iterating on new creative versions and reviewing digital-channel spend to ensure that we’re being as efficient as possible. This has proven successful across digital channels — using iterations not only as a down-funnel tactic, but also to get our message across as a viable growth tool, creating an entire freelance marketing team for startups who are trying to achieve growth quickly and easily.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIf you only had $10,000, how would your recommendations change?\n\nWith a smaller budget, we’d work to focus on the best-performing search to meet our customers when they are actually interested — it’s easier to capture high-intent, low-funnel traffic since you have the intent signal from the search itself. Social can work well as a DR channel (and does for us) but is less certain than search.\n\nAnother way of maximizing a smaller budget is to consider playing where our competitors are not in order to identify new customer types. This hypertargeted approach allows for extreme precision in both messaging and placement to be as successful as possible for this customer.\n\nAre your clients expecting faster ROI than in 2021? How is that impacting where you allocate performance spend?\n\nEveryone wants ROI. To ensure that we are managing expectations — all while meeting demands — we are conducting deeper dives on prospective customers and asking ourselves the important questions. We’re considering which customers are more likely to have a long-term approach to ROI — rather, those that we need to continue to nurture — versus who can be an immediate customer on the fast track to returns.\n\nFrom there, we must take into account what that brand needs for immediate growth, which in turn creates positive results for all — the marketer, our company and the client. The heightened demand for ROI is definitely more prevalent in some sectors than others.\n\nIn terms of impacting where we allocate performance spend, we still see considerable demand for less revenue-driving roles, and, as a result, our performance spend allocation has not changed meaningfully. However, it’s more important than ever that we understand the client’s goals during onboarding and set them up with the right marketers to achieve those goals.\n\nJack Hallam, growth and community lead, Ammo\n\nImagine you have a $75,000 budget going into summer 2022. How would you spend it with the current uncertain state of the economy to accelerate a B2C startup? A B2B startup?\n\nTo start, we’d like to establish that all startups need to constantly balance between bets and foundations when it comes to growth marketing. At Ammo, we know that most of our bets (in line with the Pareto Principle) will fail, so it’s important that we dedicate the first portion of our budget to growth foundations. Growth foundations can be built at all levels of your customer journey. Examples of this include (but are not limited to) updating your brand, website or product.\n\nWe have referred to this in the past as your “growth engine,” but to avoid the onslaught of car analogies, we’ve divided it into three marketing disciplines. The good news is that structuring your marketing and team in this way will ensure that you focus and build first before you throw it all away at the casino on bets.\n\nBuild your growth engine: Of your budget, we recommend at least two-thirds to be allocated to the growth engine. In this case, $50,000 for building solid foundations at each stage of the engine.\n\n1. Brand marketing — $20,000\n\nIn a previous article, we touched on the importance of having a minimum-viable brand before you build any assets that will be visible to the customer. Your brand develops further by being built up by your audience. Today, brands are community driven. They are as much a part of the customer’s identity as they are yours.\n\nWhere you want to build a brand is at the intersection of your values and theirs. Find common ground with customers and test, test, test your messaging. Recently, we’ve come across user testing tools like Askable and video feedback tools like Vouch.\n\nThese are complementary and cheap to implement in conjunction with regular customer interviews. You should be gathering feedback after you fulfill an order or send an invoice for a Google review. If you’re a new product or defining your category, read reviews.\n\nThe next aspect of your brand marketing to nail is positioning. Nobody does positioning quite like April Dunford. For TechCrunch readers, we’d recommend her book “Obviously Awesome.” If you want something more step by step, go with Donald Miller’s “Marketing Made Simple.”\n\nOnce you have customer feedback on your messaging and are confident that you provide something unique and desirable for your audience, invest in a copywriter to tie it all together.\n\n2. Product marketing — $20,000\n\nProduct marketing sits at the intersection of the line of communication. This simply means what your customers see and what they don’t makes them happy, and if you’re doing it right, they will buy more.\n\nMost of the time, product marketing sits internally in the company, with the product marketing manager (PMM) or head of product/product manager on top of building a beautiful product or service that people will love. It’s safe to say that there’s a lot on their shoulders.\n\nThe growth foundations that typically support them at this stage are:\n\nEmails: Education, onboarding, triggered by behavior or customer stage.\n\nWebsite: The directory of information for your users and, at times, your storefront.\n\nApps: Tools that perform value-adding functions for your customer.\n\nCustomer relationship managers (CRM): Customer information and buying stage.\n\nContent marketing: Thought leadership articles, case studies, podcasts or videos.\n\nChoose two of these tactics and execute them well before moving on to the others.\n\n3. Performance marketing — $10,000 and scale with your bets\n\nPerformance marketing activities include items like press, social media, paid media and advertising. We’ve left this foundation for the last because it doesn’t make sense to invest heavily in performance marketing until you have a brand people can trust and a product customers love and want to buy.\n\nNow, we know that there will be some backlash to that statement. Yes, digital or performance marketing can be a great way to introduce a new concept, or bring your product up when someone is comparing products in your category. However, it will not drive sustainable growth. That will come from your customers and word-of-mouth.\n\nOne of the easiest ways to get started with performance marketing is Google Display targeting recent website visitors. Put simply: re-marketing your product to people who have visited your website. You can also do this with major social media platforms like Twitter, Facebook and LinkedIn. Do note the recent changes since iOS 14 and GDPR compliance before you get started.\n\nUnderstand the metrics that influence revenue: We see a lot of marketers and founders get caught up with attribution. Don’t get us wrong, products like Segment and Amplitude are great and help you find leaks in your funnel. The only downside is that they are too expensive or complex to implement in the beginning. Besides, it is only when you get to scale with large volumes of traffic and run more bets that you are going to find more value in these products.\n\nWith smaller datasets, you need to identify areas in your customer journey that are leading indicators of revenue. For our clients, that might be page followers, content views or how many quotes we are sending per month. We also know that higher-quality traffic comes from our podcast and TechCrunch.\n\nIn summary:\n\nStart small: Adjust your budget weekly/monthly.\n\nStart simple: Don’t spread yourself thin across channels.\n\nA/B test: There’s a reason the scientific method exists. Use it.\n\nDon’t obsess over attribution, but understand it enough to allocate the budget effectively.\n\nWith the remaining $25,000, you could buy a food truck, send your mom on a holiday or just put it back in your pocket. Nobody will know.\n\nJokes aside, this is where bets or experiments come in. A process is helpful for this, too. We like to involve the team, collaborate and then vote on allocating the leftover budget. This summer for Ammo, we’ll just use the leftover budget for a party to thank our clients, partners and friends.\n\nIf you only had $10,000, how would your recommendations change?\n\nInvest in your personal brand, network and searchability.\n\nLaunch on Product Hunt. If it flops, launch again.\n\nBrand photography: This can turn a budget website into a great website.\n\nPartnerships: Work with people in your network who have similar or adjacent customers.\n\nList of services and product directories.\n\nWrite, and if you can’t, record a podcast or get someone to refine your thoughts on the subject matter and publish articles.\n\nAre your clients expecting faster ROI than in 2021? How is that impacting where you allocate performance spend?\n\nDefinitely. The pandemic has brought to work another level of anxiety that we haven’t seen before. Our job is to help everyone get back to basics. Focus on what’s important to their customers now and help them deliver it. Everyone craves stability and trust, or just pure pleasure and respite. If you’re selling that right now, you should be doing well.\n\nJonathan Metrick, chief growth officer, Portage Ventures\n\nThe VC perspective: In a turbulent market with increasing customer acquisition costs, you must be extra diligent with your marketing budget. VCs are paying closer attention to payback periods — the amount of time it takes to recoup your customer acquisition costs. Growth marketers should be aiming for less than a 12-month payback.\n\nAlso consider which channels you’re choosing to scale. Expect a lot of questions if your primary acquisition channels are the same ones that everyone else uses — e.g., Google or Facebook.\n\nImagine you have a $75,000 budget going into summer 2022. How would you spend it with the current uncertain state of the economy to accelerate a B2C startup? A B2B startup?\n\nFor B2C businesses, I would throw my entire budget against incentivized customer referrals. The best startups treat customer referrals like any other performance marketing channel — with relentless testing. Multivariant testing will help you determine which offer is the most compelling for your audience.\n\nThe best referral campaigns leverage creative messaging to drive urgency and action. Too few startups allocate the required time or resources to unlock customer referrals, but when you do, it can transform the unit economics of your business. Also, wouldn’t you rather pay your customers to help you grow rather than Facebook or Google?\n\nFor B2B businesses, I would hire an agency to partner with the sales team to interview your top clients and create detailed customer personas. Too few startups have a solid understanding of who their primary customer segments are, why they choose to buy their product versus the competition, and how to effectively reach them. Marketers need this information, which is often buried within the sales organization. A better understanding of your customer personas translates into more effective targeting, messaging and lead generation.\n\nIf you only had $10,000, how would your recommendations change?\n\nI wouldn’t change my strategy but I would change my tactics. B2C: I would start with smaller tests to encourage customer referrals and explore a non-incentivized option to see if folks will refer their friends for free. B2B: I would look to hire a freelancer rather than a full-service agency to build my customer personas.\n\nJonathan Martinez, founder, JMStrategy\n\nImagine you have a $75,000 budget going into summer 2022. How would you spend it with the current uncertain state of the economy to accelerate a B2C startup? A B2B startup?\n\nIf I had $75,000 going into summer 2022, I wouldn’t make any drastic changes due to the current state of the economy. The reality is, overall growth channel mechanics and online media consumption is likely to remain the same. There are industry-specific caveats, however, such as potential softening with investment-related products, which may lead to decreased user activity. It’s imperative to constantly have a pulse on LTV on a rolling basis so that decisions on ramping or pulling back spend can be made accordingly.\n\nIf you only had $10,000, how would your recommendations change?\n\nIf I only had $10,000, I wouldn’t make any drastic changes but would instead be very methodical about tracking market swings. Having a pulse on upper and down-funnel metrics at a granular level will improve the chances of quickly catching any market-driven inefficiencies."}