{"url": "https://techcrunch.com/2022/11/03/port-platform-provides-visibility-into-devops-architecture/", "title": "Port internal development platform gives visibility into DevOps architecture", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-11-03T00:00:00", "text": "In a typical large organization, DevOps tasks have become so complex, and involve navigating so many tools, it has become difficult to understand the current state of affairs, and to add resources when needed. It’s gotten to the point where developers often need to submit a ticket, even for a routine operation, which is adding unnecessary friction and slowing down the entire process.\n\nPort, an early-stage Israeli startup, wants to help by offering a portal of sorts where DevOps engineers can get visibility into the current state of the architecture, while deploying new resources when needed, all from a single window.\n\nTraditionally, this kind of functionality was only available to large engineering organizations like Netflix, Spotify and Lyft. Today, Port announced a $7 million seed investment to bring it to the masses.\n\nThe startup has created what is called an “internal development platform” with the goal of letting both developers and operations get more work done without filing tickets, says Zohar Einy, company co-founder and CEO. “We’ve built this internal development platform that essentially allows engineering to access a single interface that acts as a single pane of glass [for all DevOps information],” Einy said.\n\nThis actually is highly customizable, and Port provides the building blocks to create a portal that makes most sense to the customer and their way of working, a lot like the portal building tools from the past, but geared specifically toward DevOps. “We took a builder-based approach that gives them a very simple tool set to build their internal platform with [low] code components that we provide them,” he said.\n\nUltimately they can do two main things, no matter how they build it. “The first layer is the ability provides engineering with good visibility into DevOps. They can define the software catalog with all the data that engineering cares about regarding microservices, environments, cloud resources, permissions and things like that,” he said.\n\nThe second piece lets them self-provision components, like creating an environment or setting up a microservice. He says all of this is designed with the goal of cutting down the number of help tickets filed between developers and operations to keep development flowing more smoothly.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe company just launched a year ago, but they have paying customers using the product in a proof of concept scenario. With 22 employees already, Einy says that diversity is a big priority for the company.\n\nHe says to that end, they have been working with NGOs, a common method for hiring underrepresented people in Israel where the company is based. Roni Floman, who runs marketing for Port, says the NGOs help the company find people from communities in Israel, who might not otherwise apply at a startup like Port.\n\n“Israel has some NGOs dealing with adding Orthodox, very religious people, or people from Israel’s Arab community and usually those NGOs help place people [from these communities] in companies because in many cases, these people don’t usually just apply for a job [at a company like this],” she explained. “[Our] plan is to connect and proactively reach out to be able to hire those people and create a more diverse workforce.”\n\nToday’s $7 million seed round was led by TLV Partners, with participation from some prominent industry angels."}