{"url": "https://techcrunch.com/2025/05/08/a-timeline-of-south-korean-telco-giant-skts-data-breach/", "title": "A timeline of South Korean telco giant SKT’s data breach", "authors": ["Kate Park", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-05-08T00:00:00", "text": "In April, South Korea’s telco giant SK Telecom (SKT) was hit by a cyberattack that led to the theft of personal data on approximately 23 million customers, equivalent to almost half of the country’s 52 million residents.\n\nAt a National Assembly hearing in Seoul on Thursday, SKT chief executive Young-sang Ryu said about 250,000 users have switched to a different telecom provider following the data breach. He said he expects this number to reach 2.5 million, more than tenfold the current amount, if the company waives cancellation fees.\n\nThe company could lose up to $5 billion (around ₩7 trillion) over the next three years if it decides not to charge cancellation fees for users who want to cancel their contract early, Ryu said at the hearing.\n\n“SK Telecom considers this incident the most severe security breach in the company’s history and is putting forth our utmost effort to minimize any damage to our customers,” a spokesperson at SKT told TechCrunch in an emailed statement. “The number of customers affected and the entity responsible for the hacking is under investigation,” the spokesperson added.\n\nA joint investigation involving both public and private entities is currently underway to identify the specific cause of the incident.\n\nThe Personal Information Protection Committee (PIPC) of South Korea announced on Thursday that 25 different types of personal information, including mobile phone numbers and unique identifiers (IMSI numbers), as well as USIM authentication keys and other USIM data, had been exfiltrated from its central database, known as its home subscriber server. The compromised data can put customers at greater risk of SIM swapping attacks and government surveillance.\n\nAfter its official announcement of the incident on April 22, SKT has been offering SIM card protection and free SIM card replacements to prevent further damage to its customers.\n\n“We detected possible information leakage regarding SIM on April 19,” the spokesperson at SKT told TechCrunch. “Following the identification of the breach, we immediately isolated the affected device while thoroughly investigating the entire system.”\n\n“To further safeguard our customers, we are currently developing a system that can protect users’ information through the SIM protection service while allowing them to use roaming services seamlessly outside of Korea by May 14,” the spokesperson said.\n\nTo date, SKT has not received any reports of secondary damage and no verified instances of customer information being distributed or misused on the dark web or other platforms, the company told TechCrunch.\n\nA timeline of SKT’s data breach\n\nApril 18, 2025\n\nSKT detected abnormal activities on April 18 at 11:20 p.m. local time. SKT found unusual logs and signs of files having been deleted on equipment that the company uses for monitoring and managing billing information for its customers, including data usage and call durations.\n\nApril 19, 2025\n\nThe company identified a data breach on April 19 in its home subscriber server in Seoul, which typically houses subscriber information, including authentication, authorization, location, and mobility details.\n\nApril 20, 2025\n\nSKT reported the cyberattack incident to Korea’s cybersecurity agency.\n\nApril 22, 2025\n\nSKT confirmed on its website that it detected suspicious activity, indicating a “potential” data breach involving some information related to users’ USIMs data.\n\nApril 28, 2025\n\nSKT began replacing mobile SIM cards of 23 million users, but the company has faced shortages in obtaining sufficient USIM cards to fulfill its promise to provide free SIM card replacements.\n\nApril 30, 2025\n\nSouth Korean police began investigating SKT’s suspected cyberattack on April 18.\n\nMay 1, 2025\n\nAccording to local media reports, many South Korean companies, including SKT, use Ivanti VPN equipment, and that the recent data breach may be connected to China-backed hackers.\n\nPer a local media report, SKT said it received a cybersecurity notice from KISA instructing the company to turn off and replace the Ivanti VPN.\n\nTeamT5, a cybersecurity company based in Taiwan, alerted the public to the worldwide threats posed by a government-backed group linked to China, which allegedly took advantage of vulnerabilities in Ivanti’s Connect Secure VPN systems to gain access to multiple organizations globally.\n\nSome 20 industries have been affected, including automotive, chemical, financial institutions, law firms, media, research institutes, and telecommunications, across 12 countries, including Australia, South Korea, Taiwan, and the United States.\n\nMay 6, 2025\n\nA team of public and private investigators discovered an additional eight types of malware in SKT’s hacking case. The team is currently investigating whether the new malware was installed on the same home subscriber server as the original four strains or if they are located on separate server equipment.\n\nMay 7, 2025\n\nTae-won Chey, the chairman of SK Group, which operates SKT, publicly apologized for the first time for the data breach, some three weeks after the breach occurred.\n\nAs of May 7, all eligible users have been signed up for the SIM protection service, except those living abroad using roaming services and temporarily suspended, the spokesperson told TechCrunch, adding that its fraud detection system has already been set up for all customers to prevent unauthorized login attempts using cloned SIM cards.\n\nMay 8, 2028\n\nSKT is currently assessing how to handle the cancellation fees for users affected by the data breach incident. About 250,000 users have switched to another telecom provider following the breach, according to the company’s chief executive at a National Assembly hearing.\n\nSouth Korean authorities, meanwhile, announced that 25 types of personal information were leaked from the company’s databases during the cyberattack."}