{"url": "https://techcrunch.com/2007/03/15/the-futurist-hands-on-with-the-neatest-new-nanotech/", "title": "The Futurist: Hands-On With The Neatest New Nanotech", "authors": ["Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size"], "publication_date": "2007-03-15T00:00:00", "text": "So I’m here in Scotland with Audiofile Mike. It turns out that this home of The Highlander and hooliganism not only takes credit for bringing the world television, penicillin, and cloned sheep, but is now a steaming hotbed of new nanotechnology research. We spent the past week checking out bleeding edge nano, including ways of using OLED lights to smooth out skin cancer, microscopic machines that defy gravity, and digestible pills capable of making Innerspace-like trips through your bowels.\n\nAs Ottilia Saxl, founder of the Institute of Nanotechnology here put it, “I call nanotechnology science faction — like science fiction, but factual.”\n\nThis week we’re taking a look at the next wave of nanotech research that should change how we do just about everything.\n\nFrom our firsthand look at about a dozen Scottish nanotech facilities, I’ve cherry picked a few items that the Futurist believes hold the most promise for changing the world. And people—this stuff is crazy. Some of these things are ripped straight from comic books and old sci-fi movies. And we’re not just talking about flesh-eating nanobots (an idea none of the on-site experts seemed too interested in discussing), we’re talking spray-on skin and cures for cancer.\n\nSPRAY-ON SKIN:\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe Institute of Nanotechnology here gave me the scoop on research being done by a researcher named Andreas Greiner at the University of Marburg in Germany. Seems Dr. Marburg has developed an “electrospinning” technique that essentially allows you to spray an invisible web over open wounds that would act like anti-bacterial spray-on skin. The applications for this are obvious: no more battlefield infections, and the painful rip of removing a Band-aid could become a thing of the past.\n\nA SWALLOWABLE BODY METER:\n\nRemember that movie Innerspace where Dennis Quaid goes shooting through Martin Short’s insides using a miniaturized vessel? This may lack the star power of that comedy classic, but scientists at Kelvin Nanotechnology, an off-shoot of Glasgow University, let us in on what’s being called a “Lab-on-a-pill.” The idea: A patient swallows a wireless transmitter, and as it goes through your system, it wirelessly transmits your vital stats to a doctor. Readings that once took invasive surgery are now as simple as a big gulp of water suppressing your gag reflex. Although the possibilities are extensive, the doctors here seemed most excited about the device’s ability to combat bowel cancer.\n\nMICROMACHINES THAT DEFY GRAVITY:\n\nUndoubtedly, one of the neatest things we saw were nanomachines that would make Newton shrug. David Leigh, PhD, a professor of organic chemistry (along with his ragtag team of scientists) at the University of Edinburgh has developed a way to use light-powered microscopic machines to literally cause water to run up an incline. Although moving a few drops of liquid uphill isn’t going to do much beyond make those crazy giant straws more efficient, the future possibilities are X-men-esque. “At the moment, we can move tiny droplets of liquid,” Dr. Leigh says. “But some day it may be possible to move solid objects. If I want my cup of tea I can zap a laser and it comes to me. It sounds like science-fiction, but there’s no reason it can’t be true.” And schoolyard pranks should get a whole lot more hilarious.\n\nA NEW WAY TO TREAT SKIN CANCER:\n\nI had no idea, but apparently about 40 percent of Brits and 75 percent of Australians get some form of skin cancer at some point in their lives. That’s just insane. Currently, most treatments are painful, expensive, and require repeat hospital visits. So when we saw a way of rubbing out this worst of rashes using little more than lotion and an OLED light (not unlike the one that may illuminate your digital audio player), I was blown away.\n\nPhotodynamic Therapy for treating skin cancer has been around for some time. That is, a patient applies a light-sensitive lotion to the bad area and goes in for a few treatments in which bright lights interact with the cancer cells. The problem with PDT, as it’s called, is that it’s extraordinarily painful, very expensive, and requires repeat hospital visits. The big breakthrough here is the invention of a wearable OLED bandage (see the above picture) that literally wraps around the cancerous region. Like traditional PDT, you apply a lotion, only now you can simply wear a bandage as you go around your day, with a power source clipped to your belt next to your BlackBerry. The advantage here is that not only is OLED a far more consistent light source (meaning even treatment all around), but it’s far cheaper, far less painful, doesn’t require going to a hospital (it’s light and portable), and is flexible enough to be worn just about everywhere. As Andrew McNeil, PhD, of Lumicare Ltd., the company behind the tech, put it: “Sunlight is a major cause of skin cancer, but light used in the right way can treat skin cancer.”\n\nAnd for kicks, below is some science porn from various nano labs around Scotland:\n\n\n\nThese guys are showing off a new microdisplay printer that uses inkjet printer heads to print out microscopic sequences.\n\n\n\nInside the lab of David Leigh, PhD — mastermind of the gravity-defying uphill water.\n\nSeth Porges writes on future technology and its role in personal electronics for his column, The Futurist. It appears every Thursday and an archive of past columns is available here."}