{"url": "https://techcrunch.com/2025/01/28/alicebob-raises-104m-says-quantum-computers-based-on-cat-qubits-will-be-ready-by-2030/", "title": "Alice & Bob raises $104M, says quantum computers based on cat qubits will be ready by 2030", "authors": ["Ingrid Lunden", "Europe Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-28T00:00:00", "text": "Quantum computing remains something of a holy grail in the world of technology: It promises a huge leap in computing power, but only if someone can figure out how to square away the fault rates that prevent any scaling of the tech.\n\nNow, one of the more promising quantum startups in Europe is announcing a big round of funding to help it work toward a solution.\n\nAlice & Bob, a Paris-based startup that is a pioneer in the area of cat qubit quantum architecture, has raised €100 million ($104 million). It plans to use this Series B to continue working toward building a “fault tolerant” quantum computer (accepting errors and working around them) based on cat qubits. Alice & Bob believes its first “useful” quantum computer will be available by 2030.\n\n“From the get go, Alice & Bob had a very clear vision of how quantum computers should be made [and] it was all about fault tolerance,” said CEO and co-founder Théau Peronnin in an interview. “What we’ve seen in the whole industry over the last 12 to 18 months is really a complete shift to align with our vision.”\n\nThe appetite for more computing power is at the highest it has ever been — a belief underscored by major projects like the $500 billion Stargate AI data center commitment in the U.S., and the huge boost that computing chip makers like Nvidia have seen in recent times.\n\nAs Peronnin sees it, the traditional computing architecture race is untenable in the longer run, and that will drive more investment in quantum computing as it promises more efficiency than traditional processors.\n\n“Computing is becoming the core resource for productivity, and quantum is a potential game changer here,” he said. “The game is on.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe investment is co-led by Qatari-backed Future French Champions (FFC), AVP (AXA Venture Partners), and Bpifrance, which also co-led its Series A of $30 million in 2022. While the startup is not disclosing its valuation, for some guidance, Riverlane (a partner of Alice & Bob’s) was valued last year at around $400 million. We understand from multiple sources that Alice & Bob is at a comparable valuation, more likely between $300 million and $400 million.\n\nThe deal represents one of the larger rounds for a quantum computing startup in Europe. But notably for the quantum industry, it’s not happening in a vacuum.\n\nSome of the more notable fundraises in the space include Riverlane, which also builds technology to correct quantum errors, raising $75 million; quantum chip maker SEEQC, which raised $30 million earlier this month; and Quantum Machines, which is reportedly also in the process of raising $100 million. Perhaps the biggest of all, last year, Quantinuum raised $300 million at a $5 billion valuation. There is now talk of it listing at a $10 billion valuation.\n\nMeanwhile, Google had a breakthrough in the fault-removal race in November 2024 with AlphaQubit, an AI system that it said could automatically identify errors in quantum computations. And, Microsoft and Atom Computing promised they would release a commercial quantum computer sometime this year.\n\nThe startup’s name and the cat qubit are both key to what it is building. “Alice & Bob” is a reference to the two fictional characters that are often used as archetypes for hypothetical thought experiments in areas like cryptography and quantum physics.\n\nThe building block of Alice & Bob’s system also has a theoretical reference in it. Rather than pursuing ways to reduce faults by throwing more qubits at the problem (qubits are the typical building blocks of a quantum computing system), Alice & Bob devised an architecture that it calls a “cat qubit.” This is a reference to Schrödinger’s cat and the idea of something being in “two states” at once. Effectively, it accepts some faults (hence “fault tolerant”) while fixing others.\n\nAs Peronnin describes it, “cat qubit is a special design of qubit that is meant to correct errors directly at the hardware level — not all of them, half of them, to be precise — but that is really the result of the cat qubit. It’s to have this first layer of built-in error correction. And the reason why we went for that is because we believed it would dramatically simplify the total machine.”\n\nAlice & Bob’s investors believe this could be the key to making quantum a commercial reality.\n\n“Reality is at the core of our debate about quantum in the investment industry,” François Robinet, a partner at AVP, said in an interview. He said that while he has been watching Alice & Bob for years, AVP hadn’t wanted to invest before “because it was just R&D” like so many others. But now, he said, with quantum chip architecture appearing to be capable of supporting 48 qubits, “we believe the R&D phase is over.”\n\nFrançois Charbonnier, a partner at Bpifrance, seconds this. “Getting rid one of two major errors,” as Alice & Bob is doing, is the game changer for scaling, he said. “Of course, it’s still a long-term marathon, but we are convinced that Alice & Bob will be in the race.”"}