{"url": "https://techcrunch.com/2022/10/04/humaans-raises-15m-to-simplify-hr-tasks-like-onboarding/", "title": "Humaans raises $15M to simplify HR tasks like onboarding", "authors": ["Kyle Wiggers", "Ai Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-10-04T00:00:00", "text": "The role of HR professionals grew in scope during the pandemic as companies were forced to navigate major workplace changes, like working from home. Unsurprisingly, those professionals have had some of the highest burnout rates over the past two years, particularly as HR departments remain under-resourced. According to an August survey from Workvivo, an employee collaboration app, 95% of HR workers say that they’ve felt overwhelmed in the last six months while 73% felt under-valued by their employers.\n\nPart of the reason HR work today is so demanding is the lack of effective tools to help accomplish aspects of the job, according to Giovanni Luperti. He’s the CEO of Humaans, an HR tech startup that lets organizations build a customizable HR stack that manages employee documents, data, payroll, contracts and other components of “people ops.” Luperti has a product to pitch. And it’s true that other HR tech vendors offer similar — if not comparable — solutions, like Darwinbox, iBob, BambooHR and Personio. But Luperti asserts that Humaans takes a fundamentally different approach to unifying disparate HR tools.\n\n“Our goal is to allow companies to operate with the flexibility, connectivity and tools that work best for them instead of forcing a one-size-fits-all approach to people operations and company building processes that are evolving every day,” he told TechCrunch in an email interview. “HR teams need more effective processes and integrated systems to proactively help modern organizations support their workforce. We built Humaans to … bring the full HR stack together and automate processes such as onboarding, offboarding, and more to streamline workflows.”\n\nPreviously a director of product design at Quibit, Luperti co-founded Humaans in 2020 with Karolis Narkevicius, who’s also a Quibit veteran. The two set out to “build something meaningful” in a very large market, Luperti said, after realizing that HR tools have historically been clunky, slow and not designed to provide a great user experience.\n\nIn 2021, London-based Humaans raised $5 million in seed funding from Y Combinator and angels including former LinkedIn CEO Jeff Weiner. More recently — today, to be exact — the startup closed a $15 million Series A round led by Lachy Groom with participation from notable individual investors Tobias Lutke (a Shopify co-founder) and Slack CEO Stewart Butterfield.\n\nHumaans is designed to capture employee details by storing personal and company docs (e.g., identification, emergency contacts and basic profiles), ostensibly making it easier to spot missing data points. The platform monitors things like probation periods and which employees are joining and leaving, as well as birthdays and work anniversaries, expiring IDs and time away and vacation hours. Beyond this, Humaans can show headcount changes by department, tenure and salary spend and trends like when employees have typically taken PTO.\n\n“[W]e’ve observed that IT and Tech stakeholders want to avoid duplication in work and automate the flow of employee data that is stored across the multiple platforms in their technology stack. This is where our unique model can support them,” Luperti said. “Our current focus is around faster and more efficient data access at scale, and are investing into new capabilities that will support organizations to better collaborate cross-functionally.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nTo that end, Humaans over the past year has added connectors for platforms like Slack, DocuSign, Okta, Greenhouse, Google Workspace, Pento, Contractbook and Workable. With a customer base that spans brands including Pleo, Fidel API, Manyone, Pento and Birdie, Luperti says that Humaans will double down on “consolidating” its U.K. presence and expansion into the broader EU market over the next few months while further investing in product development and hiring.\n\n“We hit important milestones and experienced meaningful growth in the past 12 months. There is clarity around what we want to accomplish next to better serve growing small to medium sized enterprises and mid-market companies, and we felt the time was right to accelerate further,” he added — declining to answer specific questions about revenue and headcount. “Our goal is to build a resilient business that can support customers and their employees for the long term.”\n\nNo doubt, Humaans is benefiting from the general investor enthusiasm around HR tech startups. In 2021, venture investors funneled more than $12.3 billion into HR tech startups, roughly 3.6 times the amount invested in 2020, according to PitchBook data. That trend continued in 2022, with megadeals ensuring more than $1.4 billion was invested in the sector in the first two months alone.\n\nMacroeconomic conditions may put an end to the boom eventually. But for now, Humaans — and startups like it — appear to have healthy runway."}