{"url": "https://techcrunch.com/2024/09/24/sequoias-first-space-investment-since-spacex-is-sunlight-seller-reflect-orbital/", "title": "Sequoia’s first space investment since SpaceX is in sunlight-seller Reflect Orbital", "authors": ["Aria Alamalhodaei", "Reporter", "Space", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-09-24T00:00:00", "text": "Imagine a future where the diurnal cycle, at least in some parts of the world, is adjustable. Where humans are no longer beholden to the 24-hour pattern of daylight and darkness. Instead of being constrained by the physical reality that constrains the sun to its daily cycle, imagine a future where the sun can be turned on and off like a flashlight.\n\nThis is the future that Reflect Orbital imagines is possible. The startup is developing satellites that would deploy large mirrors to precisely reflect sunlight onto specific points on the ground. Rings of satellites in sun-synchronous orbit would follow the terminator, or the line that separates night and day, providing additional sunlight before dawn and after dusk.\n\nAccording to Reflect’s two co-founders, CEO Ben Nowack and CTO Tristan Semmelhack, this extra sunlight could increase the amount of solar power delivered to the electricity grid. Instead of building more solar farms, the pair thinks we can simply increase the amount of power generated at the ones that already exist.\n\nThe startup went viral earlier this year when Nowack posted a video showcasing its plans, and then again when they posted a splashy demo showcasing the concept, though it did not mention they were using a drone to simulate the reflected sunlight. A slew of responses followed — many voicing fundamental objections to the entire concept of operations, like the very premise that we could beam down enough sunlight, despite atmospheric scattering and energy loss, in a cost-effective way.\n\nBut Nowack and Semmelhack are not cowed by the skeptics: “There’s more solar in the queue to be built in the U.S. then there is solar already built,” Nowack said in a recent interview. “Here’s this way to make it even better. Here’s this way where solar can actually stand on its own and power us entirely. A sunlight-powered future is the future that we want to be living in.”\n\n“We would solve it on Earth if there was a better way to do it on Earth. But the best way to do it is by going to space,” he added.\n\nIt’s going to take a lot of time and a lot of money. But in a twist of fate, it turns out that their video — the very one that caused so much ire — attracted the attention of someone else: Sequoia Capital investor Shaun Maguire. Fortunately for Nowack and Semmelhack, he thinks their idea just might work.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSunlight for sale\n\nIn some ways, Reflect’s origin story starts with YouTube. Semmelhack first became familiar with Nowack by watching Nowack’s YouTube channel, BenNBuilds, when he was still in high school. On the channel, Nowack posted short, straightforward videos of him DIY’ing machines that are not for the faint of heart, like a turbo jet engine or iron furnace. Semmelhack later recognized Nowack’s name when the latter applied for a job at Zipline, where Semmelhack was interning at the time.\n\nThe pair bonded over late-night discussions about crazy ideas, Semmelhack says. Over time, Nowack started thinking more and more about solar energy; he came to believe that one could increase the share of solar power in the grid not by increasing the efficiency of solar cells, or building expensive transmission lines, or by storing it via batteries, but by simply providing more sunlight at more hours of the day.\n\nNowack left Zipline to start Reflect in October 2021; after a year at Stanford, Semmelhack took a leave of absence to join him as co-founder and CTO. Two years later, the company is preparing to contract its first orbital mission, which would launch next year.\n\nThe pair say they are still playing with the final configuration for its production-scale vehicles, like the exact size of the reflective array or the final number of satellites that will make up the constellation. But they are starting small, and the first orbital mission will fly a subscale prototype with a reflector that’s 10 by 10 meters.\n\nMany of the debunking videos cite the 10 by 10 meter figure, which is too small to reflect an economically meaningful amount of sunlight on the ground. A news article from earlier this year also said that the constellation will be just 57 satellites.\n\nBut Semmelhack said these figures are inaccurate; 57 satellites ringing Earth will guarantee a half hour of service twice per day, once in the morning and once in the evening, the minimum to achieve the plans to “extend the day.” The pair also say that 10 by 10 meters is “just a starting point”: Full-scale production vehicles will deploy arrays that are much larger, around 50 by 50 meters or bigger, with the planned constellation growing to “thousands to tens of thousands” of satellites.\n\n“The 10 by 10 is our demonstration that will be brighter than a full moon, roughly 400,000 times less bright than the sun at noon,” Nowack explained over email. “Our production service is targeting 1/5 noon sunlight brightness and will use 100’s – 1000’s of larger vehicles focused at one spot. A 50 by 50 satellite is actually on the small end.”\n\nSome of the calculations are straightforward: The amount of reflector area correlates almost linearly with the amount of power each array will be able to reflect to the ground per satellite, Semmelhack said. But at some point, he claimed it makes more economic sense to just deploy more satellites than build bigger reflectors, especially since the company is planning to increase the luminosity of a given area on the ground by combining beams from multiple satellites.\n\nBut even given these additional details, the satellites would still need to be capable of maintaining highly precise control over their mirrors on orbit, and do this across many thousands of satellites. It will be a huge challenge.\n\nIf the viral videos on X generated backlash from skeptics, there was one very, very big upside: catching the attention of Maguire, who led his firm’s initial investment in SpaceX in 2019. (Reflect also got 182,000 applications to reserve sunshine from their first prototype satellite after they posted one of the videos, though the light will be very dim and last around 4 minutes.)\n\nMaguire watched the video en route to a recent test flight of SpaceX’s massive Starship rocket, Nowack said. He was sitting next to SpaceX’s CFO on the plane, and the two were just talking about possible use cases or markets that could take advantage of the massive payload capacity of Starship.\n\nSharing a bit more about Reflect Orbital today. @4TristanS and I are developing a constellation of revolutionary satellites to sell sunlight to thousands of solar farms after dark.\n\n\n\nWe think sunlight is the new oil and space is ready to support energy infrastructure. This… pic.twitter.com/5WRb8etAv0 — Ben Nowack (@bennbuilds) March 13, 2024\n\nReflect is one such business, Nowack said. Reflect is planning a constellation that will rival Starlink’s in size. At least by this metric, it seems like an application perfectly suited to roomy heavy-lift rockets like Starship or Blue Origin’s New Glenn. It appears that Maguire agrees: Sequoia is leading Reflect’s previously undisclosed $6.5 million seed round, which includes participation from Starship Ventures and Winklevoss Capital. That funding will help fuel the company through its first orbital launch in the June-October 2025 timeframe, and hopefully see its satellite reflect sunlight onto the ground before the end of next year.\n\n“Next year is going to space and then preparing for mass production. Eventually we’re going to be a factory. So we’ve got to get to that point as soon as possible, and start launching tons of them as soon as possible,” Nowack said.\n\nThere is much to do before then. The company is currently operating out of a 10,000-square-foot office in Hawthorne, the city that is also home to SpaceX’s headquarters, but to achieve mass scale, Reflect will need many more square feet and many more employees than the seven currently at the startup.\n\nIf the team manages to pull it off, the possibilities are fairly wide open. After satellites in low Earth orbit are deployed, the company could send satellites to even higher orbits and higher altitudes to serve people even later at night. That means the company could start off selling a service that essentially “extends the day” at dawn and dusk, and then eventually move to all-night service in certain areas. Another possibility is that they could theoretically control the density in an area by using multiple mirrors, such that there is a very bright spot in a tightly concentrated place with dimmer light surrounding it.\n\nThere are a handful of concerns that immediately jump out when learning about these plans: Will this ruin astronomy? Will people pay to have a spotlight over their hated neighbor’s home? But the pair said these concerns were misconceptions about the business. The mirrors are very specifically targeted, and the company is incentivized to sell every bit of light that hits the mirror; paradoxically, that means Reflect is aiming to make them hard to see at night, from anywhere except where the light should hit. Nowack said it simply didn’t make business sense to cater to the kind of use cases like revenge. (Still, thousands of 50-meter-wide mirrors will disrupt astronomy wherever they are pointed.)\n\nThe pair don’t think their constellation will replace technology like batteries, which are increasingly being co-located with solar and wind farms, or other forms of clean energy, like nuclear. But they do think they will be able to drive the price of electricity lower using mirrors, which would increase the base energy production of any given solar farm, versus batteries, which make money by banking on the fact that electricity is higher at night.\n\n“We’re raising venture capital right now, but we see the future of space and energy to be funded in the same way that oil and gas rigs are funded,” Nowack said. “We want to be able to fund satellites in the same way: We can take huge conviction bets, pre-book dozens or thousands of rockets, and just launch all that to space right now.”"}