{"url": "https://techcrunch.com/podcast/a-new-web3-network-is-being-built-right-now-that-wants-to-end-big-techs-control-of-your-data/", "title": "A new web3 network is being built right now that wants to end Big Tech’s control of your data", "authors": ["Jacquelyn Melinek", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": null, "text": "Many of the people building web3 feel like the traditional web ecosystem has taken advantage of users and their data. While it benefits a number of businesses, data miners and even AI models, some see it as an overreach.\n\nSome of the problems with the web that exists today, which some web3-focused people call Web 2.0, is it’s centralized, Tegan Kline, CEO and co-founder of Edge & Node said on TechCrunch’s Chain Reaction podcast.\n\n“A handful of large companies own and control everything that we see online, they own our data and our digital footprint and they can de-platform us and so many want to keep our attention and they’re monetizing that attention,” Kline said. “It’s not the internet we had high hopes for back in the early days of the web.”\n\nShe and others are trying to change that through web3 — and AI integrations. “We’re trying to realize that decentralized internet and give power back to the users.”\n\nEdge & Node is a company focused on creating and supporting decentralized applications (dApps) and protocols. It’s the initial team supporting The Graph, a decentralized network that indexes, queries and organizes data. It has been called the “Google of web3” and aims to organize open blockchain data and make open data a public good.\n\nThe Graph has “subgraphs,” which are like open APIs that serve queries. So anytime a user uses an application that was built on The Graph, the indexers in the background organize the data and serve the information.\n\n“Web3 is still being built, we’re still working on building this decentralized internet that is censorship resistant. So, the innovation is happening today and I believe that this is where the internet will go, this will be the next evolution of the internet. It’s a growing industry as opposed to a shrinking one.”\n\nThe Graph launched a roadmap for its “New Era” in November, to plan out how it would use its $50 million raise from last year.\n\nThe objectives included expanding its data services to reach a bigger market, supporting developers, boosting network performance and creating tools for data, in simple terms. It also included plans to help enable large language models, or LLMs, which are one of the most popular methods for building AI chat programs, thanks to OpenAI, Kline noted.\n\n“The one thing that’s really important about AI is that it’s all about data,” Kline said. “There’s a saying that who rules the data rules the world, and so it really is important that data is not owned and controlled by any one company, especially in the AI space.”\n\nThe Graph is working to allow users to take data from its network and other blockchains to train AIs with that content. “Since we started The Graph, the use cases and data needs have exploded,” Kline said. “There are so many different data needs and The Graph network will be there to serve all those needs in a decentralized way for entrepreneurs and builders in the ecosystem and the users of their applications and projects.”\n\nAnd for AI, it’s important that they’re trained in a fully open source way, Kline thinks. “And if you look at even the open source AIs today, they are open source in some ways, but the data that they are trained with is not open source.”\n\nAs it stands today, the majority of AI is not on the blockchain-train, so to speak, yet. “If you go to a traditional AI conference, they do not care,” Kline said. “I think the blockchain space is a little bit more interested in AI than AI is interested in the blockchain space.”\n\nThere needs to be a bit more acceptance in the AI community, but over time, Kline thinks that the AI and blockchain relationship will evolve and shift. “Using new business models and new incentive structures that have emerged via tokens and token economies and decentralized infrastructure, that’s where things will get really interesting for AI.”\n\nThis story was inspired by an episode of TechCrunch’s podcast Chain Reaction. Subscribe to Chain Reaction on Apple Podcasts, Spotify or your favorite pod platform to hear more stories and tips from the entrepreneurs building today’s most innovative companies.\n\nConnect with us:"}