{"url": "https://techcrunch.com/2025/02/24/researchers-accuse-north-korea-of-1-4-billion-bybit-crypto-heist/", "title": "Researchers accuse North Korea of $1.4 billion Bybit crypto heist", "authors": ["Lorenzo Franceschi-Bicchierai", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-02-24T00:00:00", "text": "On Friday, hackers stole around $1.4 billion in Ethereum cryptocurrency from crypto exchange Bybit, in what is the largest crypto heist of all time.\n\nAfter the hack, several blockchain monitoring firms, as well as the well-known crypto investigator ZachXBT, have all pointed to the North Korean government hacking group known as Lazarus Group as the culprit.\n\nZachXBT was the first to point the finger of blame, just a few hours after he himself noticed the first signs of the hack. The researcher said he was able to track the stolen cryptocurrency from Bybit to wallets used in previous hacks against Phemex, BingX, and Poloniex, which have all been linked to North Korea.\n\nWhen TechCrunch asked how confident he was of North Korea being behind the Bybit hack ZachXBT said: “100%,” and pointed to those previous hacks. “Law enforcement is also treating it that way,” said ZachXBT.\n\nBlockchain monitoring firm Elliptic also reached the same conclusion. “Beginning minutes after the theft from Bybit, the Elliptic team have been working around the clock with Bybit, our customers and fellow investigators, to trace these funds and prevent the North Korean regime from benefitting from them,” Elliptic wrote in a blog post.\n\nElliptic said it believes North Korean hackers were responsible, “based on various factors, including our analysis of the laundering of the stolen cryptoassets.” The company added that Lazarus Group follows a “characteristic pattern” to launder the crypto it steals.\n\nContact Us Do you have more information about the Bybit hack, or other crypto heists? From a non-work device and network, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram and Keybase @lorenzofb, or Do you have more information about the Bybit hack, or other crypto heists? From a non-work device and network, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram and Keybase @lorenzofb, or email . You also can contact TechCrunch via SecureDrop\n\nNorth Korea is a prolific crypto stealer. The regime’s hackers have been linked to at least 58 crypto heists, according to a United Nations panel. The United States, Japan, and South Korea governments say Kim Jong-Un’s government stole more than $650 million in multiple crypto hacks and heists during 2024.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nTom Robinson, Elliptic’s co-founder and chief scientist, told TechCrunch that the company is basing the attribution on the fact that “funds stolen from Bybit are being commingled with funds from multiple DPRK-attributed thefts,” referring to the North Korean regime.\n\n“Also, the laundering methods being used are very similar to those previously seen with DPRK,” said Robinson. “Plus a couple of other factors that I can’t share.”\n\nBlockchain intelligence firm TRM Labs also concluded “with high confidence” that North Korea was behind the Bybit hack, the company said in a blog post on Friday.\n\nBybit’s spokesperson Tony Au declined to comment on the North Korea link, saying “our team is still investigating at this moment.”\n\nNorth Korea’s Permanent Mission to the United Nations did not respond to TechCrunch’s request for comment."}