{"url": "https://techcrunch.com/2025/03/23/former-cruise-ceo-kyle-vogts-new-robotics-startup-reportedly-raises-another-150m/", "title": "Former Cruise CEO Kyle Vogt’s new robotics startup reportedly raises another $150M", "authors": ["Kirsten Korosec", "Julie Bort", "Kyle Wiggers", "Marina Temkin", ".Post-Authors-List__Authors --Font-Size Var", "Align-Items Center Display Flex Gap Var", ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var", "Border Solid Var --Wp--Custom--Color--White", "Border-Radius", "Height -O-Object-Fit Cover Object-Fit Cover Width .Post-Authors-List__Authors .Post-Authors-List__Author-List Display Flex Flex-Wrap Wrap Gap Var"], "publication_date": "2025-03-23T00:00:00", "text": "In Brief\n\nThe Bot Company, the robotics startup founded by former Cruise co-founder and CEO Kyle Vogt, has raised $150 million in a round led by Greenoaks, according to Reuters, citing unnamed sources.\n\n\n\nVogt founded the startup with Paril Jain, who led the AI tech team at Tesla, and former Cruise software engineer Luke Holoubek. Vogt did not respond to a request for comment.\n\nThe fresh round of funding comes less than a year since Vogt launched The Bot Company, which is aiming to produce a robot focused on household chores. The company launched in May with $150 million from former GitHub CEO and investor Nat Friedman, Pioneer founder and investor Daniel Gross, Spark Capital general partner Nabeel Hyatt, Stripe CEO Patrick Collison, Stripe co-founder John Collison, and Quiet Capital.\n\nThe new startup was launched about five months after Vogt resigned as CEO of Cruise, the autonomous vehicle startup that he founded in 2013 and was later acquired by General Motors. His resignation followed an October 2 incident that saw a Cruise vehicle run over and drag a pedestrian 20 feet, after the pedestrian had been hit by a human-driven car."}