{"url": "https://techcrunch.com/2024/02/12/ilara-health-gets-4-2m-funding/", "title": "Kenya’s Ilara Health gets $4.2M backing to expand clinic-support services", "authors": ["Annie Njanja", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-02-12T00:00:00", "text": "Ilara Health, a Kenya-based health tech enabling private clinics to access diagnostic devices and pharmaceutical products, has secured $4.2 million debt-equity in a pre-Series A round. The funds will be used to scale operations in the East African country, and to deepen healthcare access to the masses through the rollout of a B2B health and occupational service that will enable uninsured workers access to care at its network of partner clinics for a fixed monthly fee.\n\nThe $2.5 million equity round was led by DOB Equity, with the participation of the Philips Foundation and existing investors like AAIC Investment, Angaza Capital, Black Pearl Investments and Perivoli Innovations. Debt investment came from Alphamundi, Kiva Capital and Boehringer Ingelheim. The new round brings the total debt, equity and grant funding secured by the startup to $11.7 million.\n\nIlara Health started off by leasing diagnostic devices to clinics in 2019, but has since evolved to enable health centers to acquire pharmaceutical products and other items like hospital furniture, on credit. Emilian Popa, Ilara co-founder and CEO, told TechCrunch that this strategic move has enabled private healthcare operators to run well-equipped clinics capable of providing quality primary healthcare to patients.\n\n“In Kenya, quality of care, not access, is the issue, and our goal since launch has been to improve the standards of care; these clinics could not provide some services because of lack of diagnostic devices or do small procedures because they lacked the furniture. That is how, over time, we have become a provider or financier of all clinic needs,” said Popa, who co-founded Ilara with Maximilian Mancini (co-CEO) and Sameer Afzal Farooqi (COO).\n\nIlara Health is tapping the private healthcare sector in Kenya, which has become the preferred alternative for those with medical coverage or those that can afford to pay out of pocket. This is against government-run facilities that continue to ail from underinvestment. The country’s current leadership hopes to improve its healthcare offering facilitated by a new healthcare financing program that promises to change how public healthcare is accessed and delivered. However, it may take some time before enough and well-equipped facilities are established to deal with the soaring demand.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPopa said Ilara serves 3,000 clinics across Kenya, out of the 15,000 he estimates are operational in the country. These clinics are often set up within residential areas making them easily accessible, and a better, but expensive, alternative to public facilities, where occasional equipment breakdown paralyzes service delivery, and immediate care is never guaranteed.\n\nTo equip the clinics, the startup has partnered with various manufacturers, including the American company Butterfly Network, to provide devices like the low-cost portable ultrasound tool, which Popa says helps bring scanning services within the reach of target clientele.\n\nThe startup also equips the clinics with a monthly subscription-based practice management software (KSh.1000 [$6.25 per today’s exchange rate]), to digitize their operations and improve the management of their businesses.\n\n“They can view their balance sheet, record patient data and get a view of a patient’s journey. They can also report to the Ministry of Health with a touch of a button. The software also gives us a view inside the clinic,” he said, adding that they will use the data for credit rating to support plans to lend out up to $15,000 in working capital.\n\nIn Ilara Health’s next phase of growth, they plan to double down on reaching the patients through the B2B health and occupational service, through which they will partner with employers to give employees access to various outpatient services at partner clinics.\n\n“We live in a place where only 2.7% of Kenyans are insured privately and even NHIF (state-run health coverage) does not properly cover outpatient care. We have been building a provider model, and we are now reaching the patients to complete the cycle,” said Popa, who co-founded Ilara Health after working in management consulting, then tech and startup ecosystem in Africa for years. Before launching Ilara Health, Popa worked as an investor at DiGame, a now fully invested Africa-focused fund and a subsidiary of U.K. private equity firm Zouk Capital."}