{"url": "https://techcrunch.com/2025/05/12/congressman-is-investigating-fintech-ramps-attempt-to-win-25m-federal-contract/", "title": "Congressman is investigating fintech Ramp’s attempt to win $25M federal contract", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-05-12T00:00:00", "text": "Rep. Gerald Connolly, ranking member of the U.S. House Oversight Committee, has initiated an investigation into whether expense management startup Ramp is receiving preferential treatment in its bid for a $25 million government contract.\n\nConnolly sent a letter to General Services Administration (GSA) Acting Administrator Stephen Ehikian demanding information and documents related to the GSA’s reported plans to award a contract for a pilot program to Ramp. News of the probe was first reported by ProPublica.\n\nAmong Connolly’s biggest concerns are that Ramp allegedly has “zero federal contracting experience” and its investors include a number of Trump allies and supporters. Those investors include Peter Thiel’s Founders Fund, Keith Rabois of Khosla Ventures, Thrive Capital (founded by Josh Kushner, brother of Trump’s son-in-law Jared), vocal Trump supporter 8VC’s Joe Lonsdale, and Jeb Bush, former governor of Florida and brother of former Republican President George W. Bush. Rabois, according to Connolly’s letter, raised more than $1 million for Donald Trump’s 2024 campaign.\n\nConnolly is requesting several things from the GSA, including a detailed list of all meetings between any GSA official and any Ramp representative, and all communications between any GSA official, contractor, or subcontractor and any Ramp representative.\n\nThe government’s internal expense card program, dubbed SmartPay, is a $700 billion program. Currently, Citibank and US Bank, two of the nation’s largest suppliers of credit cards, are the official banks of the current SmartPay contract.\n\nIn April, Ramp’s head of communications, Lindsay McKinley, confirmed to TechCrunch that the startup was “competing in a standard procurement process for a SmartPay pilot program based on the strength of our solution.”\n\nShe claimed that the startup Ramp saw a public post on X shared by the Department of Government Efficiency, better known as DOGE, on February 18 that said “the US government currently has ~4.6M active credit cards/accounts, which processed ~90M unique transactions for ~$40B of spend in FY24.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nA former customer, Ramp claims, introduced Ramp to GSA a few days later.\n\nHowever, Connolly alleges that Ramp reportedly began contacting entities in the payment industry about special bank identification numbers required to process government payments before a request for information (RFI) related to the contract was publicly announced.\n\nHe also claimed that a GSA employee recently stated that Ramp was the “favorite” to win this business.\n\nRamp did not have any comment on Connolly’s investigation.\n\nIn March, Ramp doubled its valuation to $13 billion after a $150 million secondary share sale. Since its inception in 2019, the startup has raised over $1 billion in equity financing and $700 million in committed debt funding."}