{"url": "https://techcrunch.com/2019/03/21/how-to-save-the-third-wave-of-technology-from-itself-regtech/", "title": "How to save the third wave of technology from itself", "authors": ["Daniel Wu", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2019-03-21T00:00:00", "text": "As The New York Times recently profiled, new startups are arising to solve the housing crisis. These startups disrupt what ex-AOL CEO Steve Case calls the “Third Wave,” industries with large social impact. Think: housing, healthcare and finance.\n\nTo survive, these companies need to ensure compliance with regulations early on, because mistakes here can have large social consequences. To help new entrants survive in these industries, two closely related technologies — legal technology (“legaltech”) and regulation technology (“regtech”) — help companies navigate rules embedded in text, such as contracts or regulations. Without them, incumbents, who have the most resources to hire lawyers to navigate these rules, are set up to dominate in the Third Wave.\n\nThird Wave startups must tread carefully. Unaudited prefabricated housing designs might mean the use of subpar safety measures and tenant deaths during an earthquake. Oversights in financial transactions, for instance, may unintentionally facilitate money laundering. Privacy violations in healthcare data could lead to an unfair increase in insurance premiums for affected individuals.\n\nTo mitigate these social harms, regulations can be complex. In finance, for instance, the new Markets in Financial Instruments Directive has 30,000 pages. To comply, banks can spend $1 billion a year (often 20 percent of their operational budget). Citigroup reportedly hired 30,000 lawyers, auditors and compliance officers in 2014.\n\nFor startups, ignorance is no longer a viable strategy. In just the past three years, fintech startups have suffered more than $200 million (almost 5 percent of the total venture dollars invested over that same period) in regulatory fines: 50 percent involving consumer mistreatment and 25 percent involving privacy violations. Zenefits fired 17 percent of its staff, including its CEO, after violating insurance brokerage laws. LendingClub paused operations and cut 10 percent of its workforce after violating state usury and unfair dealing laws.\n\nCompanies cannot — and should not — avoid their regulatory and social responsibilities.\n\nUber — once infamous for its “do first, ask for forgiveness later” strategies — now engages with regulators directly, by building partnerships and applying for permits. VCs, such as Evan Burfield in Regulatory Hacking, argue that these strategies are critical for the next wave of startups.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThis work requires not only perseverance but also tremendous resources. Large companies, such as J.P. Morgan or even Uber, have the most money and staff to navigate an increasingly complex regulatory landscape. Because of this, they are in the best position to shape the future and the Third Wave.\n\nLegaltech and regtech can change this trend. These technologies use anything from data analytics to decision trees to help companies navigate rules embedded in text, such as regulations and contracts. Since technology is scalable in ways that hiring 30,000 lawyers is not, small innovators can better compete in a big company’s game.\n\nIn one example, Fenergo transformed a highly manual document review for Know Your Customer (KYC) regulations using text analysis and rule logic, speeding up the process by 37 percent.\n\nOther related startups are reducing the costs associated with complying with corporate contracts (such as Ironclad), bankruptcy (such as UpSolve), zoning requirements generally (such as Envelope and Symbium) and for accessory dwelling units (such as Cover), permitting processes (such as Camino.ai) and energy standards (such as Cove Tool).\n\nBecause of this environment, analysts are bullish about these technologies. In 2018, nearly $1 billion has been invested in legaltech. Spend on regtech in finance alone is estimated to rise from $10 billion in 2017 to $76 billion in 2022 (a 700 percent increase in five years). For comparison, spend on the sharing economy is estimated to rise from $18 billion in 2017 to $40 billion in 2022.\n\nIn the Third Wave, companies cannot — and should not — avoid their regulatory and social responsibilities. If the scandals of Uber and Facebook are any indication, when a company violates laws or loses its integrity, the public and the stock market respond in kind. Journalistic coverage of breaches and unethical data practices has captured public attention. Waves of data regulation have passed across major jurisdictions, such as China, California and Brazil.\n\nEmbracing legaltech and regtech can plant long-term competitive advantages. Adopting technology that automates data protection, for instance, can create better customer experiences. By safely analyzing more data, even smaller companies can quickly generate insights and build programs that provide value to their customers.\n\nTechnology can empower companies both large and small to embrace the mitigation of social harms and the promotion of positive impact.\n\nStartup executives should take notice."}