{"url": "https://techcrunch.com/2022/08/09/egyptian-startup-convertedin-raises-3m-caters-to-e-commerce-brands-in-mena-and-latin-america/", "title": "Egyptian martech startup Convertedin gets $3M for its platform", "authors": ["Tage Kene-Okafor", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-08-09T00:00:00", "text": "Convertedin, an Egyptian startup that operates a marketing operating system for e-commerce brands, has raised $3 million in a seed round led by Saudi Arabia-headquartered Merak Capital.\n\nOther participating investors include 500 Global and MSAS. The company, in a statement, said it plans to utilize the funds for strategic hiring and further development of its platform.\n\nWhen brands shift to e-commerce sales, they operate with vast amounts of fragmented data that need to be unified to drive informed decisions and growth. As such, platforms like Convertedin become essential because it caters to brands and businesses with one, some, or all of these objectives: drive personalized and scalable campaigns, convert customers, achieve measurable results and grow revenue.\n\nCEO Mohamed Fergany founded the company with Mohamed Atef and Mustafa Raslan in 2019 after working with several brands in companies such as Speakol Ads and Vodafone. His time as an employee opened his eyes to the opportunity of helping offline stores retarget and retain their customers online while finding new ones to shop at their stores offline.\n\n“If you walk into IKEA and they take your phone number down. After that, our engine works to find a similar product you might buy and we retarget you online. If you went back to IKEA for that product, we can calculate the cost of online conversion,” the chief executive said in the interview. “This was the main idea at this time as we saw a huge problem where there was no analytics platform for the offline store or a retargeting mechanism.”\n\nAs the pandemic hit and offline stores were forced to close their doors, many of these brands turned to e-commerce, and as a result, Convertedin took its business online too.\n\nFergany argues that though online brands use CRM software to gather data, they do not utilize most of it. So Convertedin offers a solution where they can use their data best. It plugs into more than 10 major e-commerce platforms and ad networks — and brands, once connected, can place customers into different segments such as high- and low-value and categories like those looking for specific products and use these insights to create personalized multi-channel marketing and drive various campaigns on social media, SMS, email, search and other channels while having the ability to track and attribute revenue conversion.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nConvertedin says SMB e-commerce marketers that use its platform increase their return on ad spend (ROAS) by 2x and reduce customer acquisition costs (CAC) by 40%. So far, the company partners with media buying and advertising agencies and works with over 100 local and multinational brands across Africa, the Middle East and South America in the automotive, healthcare and technology industries. Convertedin’s revenues from these businesses have been growing in “double-digits” month-over-month, Fergany said.\n\nThe three-year-old Egypt-headquartered company also has offices in Saudi Arabia and Brazil; it just recently opened one in the latter. The South American market is enormous, with e-commerce revenues reaching $160 billion by 2025 from over 200 million users. As a result, Convertedin plans to make its services available in Portuguese — in addition to English and Arabic — for brands in Brazil and also Mexico, another South American market. Fergany also said Convertedin is eyeing South Africa and India too.\n\n“We focus on emerging markets and if you look at it from healthy unit economics, we can sell easily in those countries because there is low competition there,” said the CEO on the expansion to five new markets, including Saudi Arabia. “And customer acquisition cost is low compared to the U.S. or Europe markets.” The new investment will help Convertedin with this expansion in addition to R&D and hiring.\n\nIn a statement, Ahmed Aljibreen, partner at lead investor Merak Capital, addressing his firm’s investment, said the ever-changing landscape of digital marketing platforms adds a new layer of challenges for e-commerce companies — and that Convertedin solves that. Hence, the reason why Merak Capital backed the firm. “We are excited to back Convertedin, a martech company that has built a state-of-the-art platform to simplify digital marketing, improve customer acquisition and drive growth for its clients. Convertedin is led by a world-class team in which we have tremendous confidence as the company embarks on its next stage of growth in MENA and Latin America.”"}