{"url": "https://techcrunch.com/2024/04/09/kiki-world-a-beauty-brand-that-uses-web3-for-customer-co-creation-and-ownership-raises-7m-from-a16z/", "title": "Kiki World, a beauty brand that uses web3 for customer co-creation and ownership, raises $7M from a16z", "authors": ["Marina Temkin", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-04-09T00:00:00", "text": "If you think that choosing a nail polish color or which ingredients go into your face cream can’t have anything to do with blockchain, think again.\n\nKiki World, a beauty startup launched last year, wants consumers to co-create products and co-own the company with the help of web3 technology.\n\nOn Tuesday, LA-based Kiki announced that it raised a $7 million seed round from the Andreessen Horowitz crypto fund and The Estée Lauder Companies’ New Incubation Ventures, along with other backers such as Orange DAO and 2 Punks Capital.\n\nKiki co-founder Jana Bobosikova said she believes that being a loyal user of a brand in the Web 2.0 world can be a net negative experience. “You probably have watched a lot of creators on TikTok recommend it to you. You probably recommended it to all your friends. And what do you get for that? Just more retargeted ads,” she said.\n\nKiki is flipping that model by allowing its community members to vote on the features they want before the beauty products are made. As a reward, voters earn points toward free products and receive digital tokens in the company.\n\n“It’s a dynamic that the internet and your bathroom have not seen yet,” Bobosikova said. (She may be right about the bathroom, though of course, the internet has seen plenty of customers vote on products and earn digital tokens for their participation.)\n\nSince it’s not uncommon for cosmetics companies to find themselves with large piles of inventory they can’t sell, another benefit of Kiki’s on-demand approach is that it uses less capital and resources.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAlthough members’ product votes are recorded on Ethereum, Bobosikova said some participants don’t need to know they are taking action on blockchain. Users can sign in with an email, and voila, Kiki has created an on-chain account that will store the members’ votes into perpetuity.\n\na16z decided to back Kiki after the startup completed its 10-week crypto startup accelerator program. “Jana is a force of nature. She was one of the things that most drew us to the company,” said Arianna Simpson, a general partner at the firm. “She has incredible expertise in the beauty space, but also a unique understanding of web3, which is not always something we see if we have a founder coming out of a more traditional industry.”\n\nPrior to founding Kiki, the Czech-born Bobosikova was the CEO of Epic Future Labs, a product development and brand innovations agency.\n\nSimpson noted that Kiki is not the firm’s only bet on a company that rewards customers using blockchain technology. Last year, a16z led a $24 million Series A of Blackbird Labs, a hospitality tech company that developed a loyalty program that incentivizes guests to dine in independent restaurants.\n\nFor now, Kiki has launched five product collections, including a nail polish pen, for which consumers can choose the next color Kiki will manufacture.\n\nBut, as Simpson pointed out, Kiki has plans to eventually expand beyond the world of beauty.\n\nHow long will it be until it’s possible to vote on jeans styles or purse sizes? Perhaps a while.\n\n“We have faced insane challenges on the physical side of things,” Bobosikova said, adding that some products take much longer to manufacture than others. “The power of asking people what they want and giving it to them, it’s very, very simple. It’s just very hard to do.”"}