{"url": "https://techcrunch.com/2022/04/19/nue-life-health-raises-23m-series-a-led-by-obvious-ventures-for-psychedelics-platform/", "title": "Nue Life Health raises $23M Series A Led by Obvious Ventures for psychedelics platform", "authors": ["Mike Butcher", "Editor At Large", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-04-19T00:00:00", "text": "Last year we covered the $3.3 million seed round for NUE Life Health, a US-based telemedicine startup in the US, which was building out a mental wellness platform that combined psychedelic-assisted therapies and a graph database-driven app. This at-home ketamine therapy – considered a radically new way to treat depression – also combines music therapies and a data-led, ‘quantified self’ approach.\n\nIt’s now raised a $23 million Series A equity financing led by Obvious Ventures (co-founded by Ev Williams, Co-founder of Twitter), which also includes additional venture debt financing from Western Technology Investment. TechCrunch understands the lion share for the round was in equity.\n\nThe financing follows Nue Life’s November 2021 Nue.App and Nue.Portal launch, the company’s proprietary technologies serving patients and providers.\n\nNUE Life competes with Mindbloom, as well as Field Trip Health, which also has actual treatment centers.\n\nThe new round of funding will support its new services in service in New York, as well as the existing locations of Florida, Texas, California, Colorado, and Washington State. In April, the service will expand to Georgia and Massachusetts, and twenty additional states are planned by the end of the year.\n\nJuan Pablo Cappello, Nue Life co-founder and CEO said in a statement: “650 million people struggle with mental health worldwide, and there is a vital need for helping women, veterans, and other folks experiencing symptoms of anxiety, depression, and PTSD that have not been helped by traditional treatments.”\n\n“We’re thrilled to be a part of Nue Life’s efforts to create a new paradigm for mental health— one focused on healing the root cause of suffering,” added James Joaquin, co-founder and Managing Director of Obvious Ventures.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe equity financing also included a number of existing and new investors including Magic Venture Capital, Myelin VC, Palm Drive Capital, some Getty family investors, Jon Oringer, founder and executive chairman of Shutterstock, Brent L. Saunders, chairman of Vesper Healthcare and former chairman and president of Allergan, and Andrey Ostrovsky, MD, who also joins Nue Life’s advisory board.\n\nPhil Wolfson, MD, has also joined the company’s advisory board to develop its care programme. Dr. Wolfson is the CEO of the non-profit Ketamine Research Foundation and the author of The Ketamine Papers, and the principal investigator of the MAPS (Multidisciplinary Association for Psychedelic Studies) study on MDMA treatment for patients with life-threatening illnesses."}