{"url": "https://techcrunch.com/podcast/weve-entered-an-era-of-fintech-maximalism-according-to-mark-goldberg/", "title": "We’ve entered an era of fintech maximalism according to Mark Goldberg", "authors": ["Theresa Loconsolo", "Mary Ann Azevedo", "Audio Producer", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff"], "publication_date": null, "text": "“We are in a period of what I’ll call fintech maximalism,” says Chemistry founder and GP Mark Goldberg. “By that, I mean the companies that grew up in the last five to 10 years in fintech, those that quietly executed through the winter of the 2021 to 2024 period, have emerged as compounders in a way that has really taken my breath away.”\n\nAfter nearly a decade at Index Ventures, where he backed standout fintech companies like Plaid, Persona, Lithic, and Pilot, Goldberg left in 2024 to launch Chemistry, an early-stage venture firm. Founded alongside Kristina Shen and Ethan Kurzweil, the $350 million fund is part of a growing trend in venture capital: seasoned investors breaking out from large platforms to build more focused, boutique outfits.\n\nToday on Equity, Mary Ann Azevedo caught up with Goldberg about what led him to make the move, what Chemistry is all about, and how the venture landscape has evolved over the past few years.\n\nListen to the full episode to hear more about:\n\nThe state of fintech, a sector Goldberg has long had his eye on — and why he sees “a lot more tech-fin than fintech” these days\n\nWhy those waiting for a wave of fintech IPOs might be in for a long hold\n\nWhat he’s watching for in 2025 and beyond, from the impact of AI on fraud to shifting deal activity, including a pickup in M&A and secondaries\n\nEquity will be back with our weekly news roundup on Friday, so don’t miss it!\n\nEquity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday.\n\nSubscribe to us on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod. For the full episode transcript, for those who prefer reading over listening, check out our full archive of episodes here."}