{"url": "https://techcrunch.com/2024/06/28/feather-raises-e6-million-to-go-pan-european-with-its-insurance-platform-for-expats/", "title": "Feather raises €6M to go Pan-European with its insurance platform for expats", "authors": ["Anna Heim", "Freelance Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-06-28T00:00:00", "text": "As a foreigner, navigating health insurance systems can often be difficult. German startup Feather thinks it has a solution and raised €6 million to help some of the 40-plus million expats working and living in Europe.\n\nIt is not that there are no options for foreign nationals to get insurance; there are plenty. But it is precisely because the offer is fragmented and hard to match with individual needs that Feather thinks it can carve a space for itself despite heavy competition from incumbents.\n\nWith expats often having access to the public health system of their host country, a big part of the question is where they fall into, especially during the transition periods that are increasingly common with the rise of remote work.\n\nIt is this level of detail that the startup wants to get right, Feather CEO Rob Schumacher told TechCrunch. For instance, it provides a recommendation tool to help individuals understand what kind of coverage they might need, starting with health insurance, but also including additional options such as life, pet, automotive and personal liability insurance.\n\nFeather’s quick assessment tool. Image Credits:Feather\n\n“The funny thing is, everyone who’s an expat immediately gets it,” Schumacher said. That helped Feather get angel checks from former founders who gained knowledge of the issue through their startups, such as GoCardless, Monzo and N26, where Feather CTO Vincent Audoire was an early employee.\n\nWise co-founder Taavet Hinrikus also invested in Feather through the VC fund he co-founded, called Plural. Feather’s lead investor, Keen Venture Partners, even came inbound: It was associate Abdul Afridi, an expat himself, who approached the startup, and not the other way around, Schumacher said.\n\nHowever, fundraising has been anything but painless for insurtech startups in the post-2021 hype, and Schumacher is wary of making the process sound easier than it was.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWith French neoinsurer Luko coming undone in the background, and other very public insurtech woes, getting past due diligence was no easy feat. With conversations dragging on, Feather’s founders considered simply going back to pursuing profitability. “And I think that was the key thing that made us really interesting again,” Schumacher said.\n\nInternational expansion\n\nFeather went along because its new backers brought expertise on a wide range of topics, including branding, but mostly because the capital will help boost its internal expansion. The startup currently serves expats in Germany, France and Spain, with three more countries set to launch by the end of 2024.\n\nIt wouldn’t have done this without additional funding, Schumacher said. “We would have just done more incremental stuff.” That would probably have been a wasted opportunity: The startup says it achieved more in its six months post-launch in Spain than in its first 18 months in Germany.\n\nDespite the international audience it serves, an expansion roadmap wasn’t obvious for Feather, whose founders thought they might go for a broader audience in Germany first. However, they soon realized that the expat niche was particularly interesting for a digital-first offering like theirs.\n\nCompared to the same age cohort of locals, expats are much more likely to prefer not dealing with a broker. But they do still need help; as a French national, Audoire knows this firsthand, and so does Schumacher, who relocated to Germany after spending most of his life abroad.\n\nWhile they are scratching their own itch, the duo is aware that the market they are going after is very large, and growing. Whether you call them expats or immigrants, the fact is that Europe’s economies seem set on hiring more foreign workers to compensate for their aging population.\n\nFinding balance\n\nTo its end users, Feather promises a better experience consisting of transparent policies, unbiased recommendations, and simple digital claims processes, all in English. With its new funding, it is also taking a “big bet” on employee benefit insurance that companies hiring lots of expats may want to provide.\n\nWhile it is as bullish on tech as any insurtech player, Feather is also keen not to badmouth legacy players, which it partners with, and has a couple senior insurance executives on its cap table.\n\nThis, and its measured approach to fundraising and spending, could pay off, or at least help the companies avoid the scrutiny new insurtech partnerships are facing. “For the last six years we’ve been doing healthy, sustainable business, and this allows you to unlock new things, even with incumbents,” Schumacher said."}