{"url": "https://techcrunch.com/2024/12/16/irobot-co-founders-new-home-robot-startup-hopes-to-raise-30m/", "title": "iRobot co-founder’s new home robot startup hopes to raise $30M", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-12-16T00:00:00", "text": "Colin Angle, one of the co-founders of Roomba maker iRobot, is raising cash for a home robotics venture.\n\nA filing with the U.S. Securities and Exchange Commission reveals that Angle’s new company, Familiar Machines & Magic, is trying to raise $30 million. So far, it has raised $15 million from a group of eight investors.\n\nThe filing, known as a Form D, doesn’t identify backers by name. However, Data Point Capital lists Familiar Machines on its website as one of the VC firm’s portfolio companies.\n\nFamiliar Machines has a domain name and trademark application but not a functional website. Angle didn’t respond to a request for comment via LinkedIn message.\n\nIn a recent interview with The Boston Globe, Angle said that Familiar Machines, which is based in Boston with plans for a presence in Los Angeles, will develop a new kind of home robot focused on health and wellness. In addition to Angle, the co-founders include former iRobot CTO Chris Jones and iRobot alumnus Ira Renfrew. Renfrew, notably, also helped create Amazon’s now-defunct Scout delivery bot.\n\nAccording to The Globe, citing an investor, Familiar Machines is exploring robots as companions — potentially including AI-powered “furry pets.” The company is hiring AI researchers and software engineers, among other roles.\n\n“We are pioneering an exciting new category of home robot in the health and wellness space with a significant focus on human-robot interaction,” a Familiar Machines job description on LinkedIn reads. “Embodied and agentic AI are central to our product vision.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAngle stepped down from iRobot in January, after Amazon’s bid to acquire the company collapsed in the face of opposition from EU antitrust regulators. iRobot was forced to lay off 31% of its staff, and Gary Cohen, an ex-Procter & Gamble general manager, was appointed the company’s new CEO.\n\nAngle has dabbled in home robots before. In the early 2000s, iRobot created a prototype home companion robot called Grommet, per The Globe’s reporting.\n\nBut the home robotics market has proven to be a tough nut to crack.\n\nIn 2018, Bosch-backed Mayfield Robotics ceased production of its Kuri robot companion amid a questionable future. That same year, tabletop robot creator Jibo wound down operations. Anki, the company behind the viral robot Cozmo, shut down in 2019. And Moxie, which made an AI-powered robot for kids, abruptly shuttered last week.\n\nBut the failures aren’t dissuading tech titans. Amazon continues to try to find a fit for its Astro home robot, and Apple is reportedly working on home robotics in some form.\n\nAccording to Markets and Markets, the segment for household robots could be worth $24.5 billion by 2028. About 1,500 robotics startups have raised roughly $90 billion since 2019, per F-Prime, the venture capital arm of Fidelity Investments."}