{"url": "https://techcrunch.com/2021/10/21/netflix-employees-stage-a-trans-solidarity-walkout-pose-list-of-demands/", "title": "Netflix employees stage a trans solidarity walkout, pose list of demands", "authors": ["Amanda Silberling", "Senior Writer", "Zack Whittaker", "Rebecca Bellan", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-10-21T00:00:00", "text": "Netflix employees staged a walkout yesterday in response to the company’s handling of a Dave Chappelle special that premiered on October 5. At the same time, Los Angeles-based trans activist Ashlee Marie Preston hosted a rally in solidarity with Netflix workers participating in the walkout. Netflix stars like Jonathan Van Ness of “Queer Eye” and Mason Alexander Park of “Cowboy Bebop” and “The Sandman” expressed their solidarity in a video made for the rally, alongside other Hollywood stars and trans advocates like Angelica Ross, Jameela Jamil, Kate Bornstein, Our Lady J, Sara Ramirez, Peppermint and Colton Haynes.\n\n“We value our trans colleagues and allies, and understand the deep hurt that’s been caused. We respect the decision of any employee who chooses to walk out, and recognize we have much more work to do both within Netflix and in our content,” a Netflix spokesperson said in a statement provided to TechCrunch. The exact turnouts of the employee walkout and solidarity rally are unclear, but there was enough hype around the event that Preston preemptively moved it to a location with more space.\n\nThe employees who participated in the walkout want Netflix to “adopt measures to avoid future instances of platforming transphobia and hate speech,” they wrote in a letter. They want Netflix to address a list of demands in the categories of content investment, employee relations and safety, and harm reduction.\n\nWhen it comes to content, the group wants Netflix to increase its funding of trans and non-binary talent, bring employee resource groups into conversations about potentially harmful content, hire more trans and non-binary content executives and revise internal procedures around commissioning and releasing sensitive works. In terms of employee relations and safety, they want Netflix to recruit trans people, especially BIPOC, for leadership roles, allow employees to remove themselves from previous promotional content like allyship and diversity videos, and eliminate references and imagery of transphobic titles and talent in the workplace. For harm reduction, they want Netflix to acknowledge the company’s harm in platforming transphobic content, add a disclaimer before transphobic titles, boost promotion for trans-affirming titles on the platform and suggest trans-affirming content alongside those flagged as anti-trans.\n\nThe demands do not include removing the controversial Dave Chappelle special from Netflix, which sparked backlash from some employees and Netflix subscribers concerned with the company’s platforming of transphobic speech.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhen asked in an interview with The Hollywood Reporter, co-CEO Ted Sarandos didn’t say whether he would meet the group’s demands.\n\n“For the last couple of days, it’s been just listening to folks and hearing out how they’re feeling and what they’d like. I want to say that we are deeply committed to inclusion on screen and behind the camera and in our workplace,” Sarandos told the Hollywood Reporter.\n\nbrb walking out — Most (@Most) October 20, 2021\n\nHe seemed doubtful that he would meet their demand to add a disclaimer about transphobia before Chapelle’s special.\n\n“The content is age-restricted already for language, and Dave himself gives a very explicit warning at the beginning of the show, so I don’t think it would be appropriate in this case,” he said.\n\nBefore Netflix released the Chappelle special, employees raised concerns about potentially harmful anti-trans jokes in the show — Chapelle declared that he’s “Team TERF,” referring to trans-exclusionary radical feminists, who oppose the movement for transgender rights. But Sarandos doubled down on his defense of the special, writing an internal email that “content on screen doesn’t directly translate to real-world harm.” After receiving backlash, he later told The Hollywood Reporter, “I 100% believe that content on screen can have impact in the real world, positive and negative.”\n\nNetflix Senior Software Engineer Terra Field, who is transgender, tweeted a viral thread about the Chappelle special.\n\n“We aren’t complaining about ‘being offended,’ and we don’t have ‘thin skin,’” she wrote. “What we object to is the harm of that content like this does to the trans community (especially trans people of color) and VERY specifically Black trans women.”\n\nField was later suspended, along with two other employees, for attempting to attend an online meeting of top executives, according to reports. But she was reinstated after Netflix found that a director had shared a link to the meeting with her, implying that it was okay to attend.\n\nSeveral things can be true. Netflix is an incredible, life changing company. And Netflix fucked up majorly. But this is a watershed moment — as Netflix employees we have both the privilege and responsibility to create change on and off the platform. #NetflixWalkout — Dana Herlihey (@danaherlihey) October 20, 2021\n\nSoon after, Netflix’s trans employee resource group began organizing a walkout. But B. Pagels-Minor, the organizer of the walkout and global lead of both the Black and Trans employee resource groups, was fired on Friday. Their termination sparked more backlash against Netflix.\n\n“We have let go of an employee for sharing confidential, commercially sensitive information outside the company,” a Netflix representative told TechCrunch last week. “We understand this employee may have been motivated by disappointment and hurt with Netflix, but maintaining a culture of trust and transparency is core to our company.”\n\nTechCrunch was able to reach B. Pagels-Minor, but they did not offer a comment.\n\nThe leaked information in question appears to be some internal metrics on “The Closer” that appeared in a story by Bloomberg, which reported that Netflix spent $24.1 million for the one-off special. Meanwhile, the company spent $3.9 million on Bo Burnham’s recent comedy special “Inside” and $21.4 million on the buzzy, nine-episode “Squid Game,” Netflix’s best-ever debut.\n\nNetflix told TechCrunch that the employee admitted to sharing the content externally. But Pagels-Minor’s lawyer told The New York Times this week that “B. categorically denies leaking sensitive information to the press.” A former Netflix employee with knowledge of the situation told TechCrunch that they highly doubt that Pagels-Minor leaked these documents, as they had both been critical of the leaks in public company chats.\n\nNetflix told TechCrunch that its internal access logs showed that only one person viewed sensitive data about the titles mentioned in the Bloomberg article."}