{"url": "https://techcrunch.com/2020/10/13/edge-computing-startup-edgify-secures-6-5m-seed-from-octopus-mangrove-and-semiconductor/", "title": "Edge computing startup Edgify secures $6.5M seed from Octopus, Mangrove and semiconductor", "authors": ["Mike Butcher", "Editor At Large", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2020-10-13T00:00:00", "text": "Edgify, which builds AI for edge computing, has secured a $6.5 million seed funding round backed by Octopus Ventures, Mangrove Capital Partners and an unnamed semiconductor giant. The name was not released but TechCrunch understands it may be Intel Corp. or Qualcomm Inc.\n\nEdgify’s technology allows “edge devices” (devices at the edge of the internet) to interpret vast amounts of data, train an AI model locally and then share that learning across its network of similar devices. This then trains all the other devices in anything from computer vision, NLP, voice recognition or any other form of AI.\n\nThe technology can be applied to anything from MRI machines, connected cars, checkout lanes, mobile devices and anything that has a CPU, GPU or NPU. Edgify’s technology is already being used in supermarkets, for instance.\n\nOfri Ben-Porat, CEO and co-founder of Edgify, commented in a statement: “Edgify allows companies, from any industry, to train complete deep learning and machine learning models, directly on their own edge devices. This mitigates the need for any data transfer to the Cloud and also grants them close to perfect accuracy every time, and without the need to retrain centrally.”\n\nMangrove partner Hans-Jürgen Schmitz, who will join Edgify’s Board comments: “We expect a surge in AI adoption across multiple industries with significant long-term potential for Edgify in medical and manufacturing, just to name a few.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSimon King, partner and Deep Tech Investor at Octopus Ventures added: “As the interconnected world we live in produces more and more data, AI at the edge is becoming increasingly important to process large volumes of information.”\n\nSo-called “edge computing” is seen as being one of the forefronts of deep tech right now."}