{"url": "https://techcrunch.com/2024/04/09/dysons-new-ar-feature-shows-where-you-have-and-havent-vacuumed/", "title": "Dyson’s new AR feature shows where you have (and haven’t) vacuumed", "authors": ["Brian Heater", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-04-09T00:00:00", "text": "If this had been announced exactly a week prior, it would have been easy to mistake for some corporate April Foolery. Dyson, however, assures us that augmented reality vacuuming is real and coming in June — slightly belated for spring cleaning, sadly.\n\nWhen it launches over the summer, CleanTrace will be available for the Dyson Gen5detect system. The press photos bely the technology a bit, as it will be geared at phones, rather than, say, an Apple Vision Pro or Meta Quest headset. While it seems like that sort of heads-up AR would be possible, one ultimately questions how many people are going to want to vacuum with a computer on their heads.\n\nThe system is a bit silly and wildly unnecessary, but that’s sort of the fun of it, no? It’s not going to tip over anyone who’s on the fence about a $700 ultra-premium vacuum, but this is hardly the most ridiculous thing Dyson has shown the world.\n\nThe company says the feature was influenced by its own robot vacuum mapping. “We realized that we could all learn a thing or two from the methodical cleaning approach of our robot vacuums,” Dyson VP of engineering Charlie Park notes. “Unlike most humans doing the cleaning, Dyson robots know where they are in the room, where they have been, and where they have yet to go.”\n\nIn the demos, the system creates a purple (Dyson’s color) overlay, showing the path the vacuum has taken up to that point. The objective is to turn the entire room that color, to ensure that you’ve hit all the spots, rather than simply relying on your technologically out of date eyeballs.\n\nAs someone who vacuums nearly every morning I tend to believe Dyson when it notes, “Our research shows that consumers regularly overestimate the amount of time they clean – data shows that around 80% of cleaning sessions last less than 10 minutes, yet people claim they vacuum for an average of 24 minutes per session.”\n\nWhat that statement ultimately comes down to is that most people hate vacuuming, because most people hate housework. As such, we tend to dramatically overestimate the amount of time we spend doing it each day. And hey, if CleanTrace can save a little time and make the process more efficient, good on it. Should it ultimately prove popular with users, can vacuum gamification be that far off?"}