{"url": "https://techcrunch.com/2024/08/15/lockheed-martin-to-buy-satellite-maker-terran-orbital-in-450m-deal/", "title": "Lockheed Martin to buy satellite maker Terran Orbital in $450M deal", "authors": ["Aria Alamalhodaei", "Reporter", "Space", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-08-15T00:00:00", "text": "Lockheed Martin is sweeping in to save satellite manufacturer Terran Orbital from its dwindling cash reserves and mounting debt, in a $450 million take-private deal that’s expected to close before the end of the year.\n\nThe defense giant will buy Terran for $0.25 per share and retire its existing debt. Lockheed, which holds a 28.3% stake in Terran Orbital, strategically invested in Terran Orbital through its Lockheed Martin Ventures investing arm in 2017, 2020 and 2022. This will be the first LMV portfolio company that Lockheed Martin will acquire since the fund was founded in 2007. Satellite bus contracts for Lockheed represent around 70% of the company’s revenue and 91% of the company’s backlog.\n\nTerran Orbital got a major boost at the beginning of 2023, when it announced a $2.4 billion, 300-satellite deal for Rivada Space Networks, a company that wants to build a satellite communications constellation. However, Rivada delayed its incremental payments toward the order, and in its recent earnings report Terran Orbital said it was removing the Rivada deal from its backlog.\n\nLockheed first proposed acquiring the company for more than $500 million in March. Terran Orbital responded by introducing a limited-duration stockholder rights plan, or a “poison pill,” to prevent the buy-out. Lockheed dropped its bid in May.\n\nTerran Orbital reported cash reserves of $14.6 million as of July 31, down from $30.6 million as of the end of June. It told regulators on August 12 that it was pursuing “a range of strategic options” to address its need for cash. As of market close on Wednesday, Terran Orbital stock was trading at $0.40 per share.\n\nTerran Orbital is now the second space company to leave the public markets after entering them at billion-dollar-plus valuations. Terran Orbital made its public debut at a $1.8 billion valuation; Astra Space, the other space company that finalized its take-private deal over the summer, went public at a valuation of $2.1 billion. At the time of their private deals, both companies were worth just a fraction of those amounts."}