{"url": "https://techcrunch.com/2025/01/08/livestream-shopping-app-whatnot-raises-265m-pinning-valuation-at-nearly-5b/", "title": "Livestream shopping app Whatnot raises $265M, pinning valuation at nearly $5B", "authors": ["Lauren Forristal", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-01-08T00:00:00", "text": "Whatnot, the platform that allows users to sell items such as trading cards, comics, and sneakers through live videos, announced on Wednesday that it has secured $265 million in a Series E funding round, a significant investment for a livestream shopping platform. This round puts Whatnot’s valuation at $4.97 billion.\n\nThe investment marks an important milestone for Whatnot and highlights the potential for livestream shopping to grow in the U.S. The considerable amount raised reflects investors’ belief that Whatnot can innovate further in the space, particularly in collectibles and niche items, which is Whatnot’s focus area.\n\nThe new capital will be allocated to expanding into more categories, including art, golf, and vinyl. Whatnot is also working on new seller tools designed to assist sellers in growing their businesses. One of these tools aims to simplify the management of inventory and orders for sellers.\n\nWhatnot also plans to launch in Australia next month as well as other markets in Europe later this year. It’s currently available in the U.S., the U.K., Canada, France, Germany, Austria, The Netherlands, and Belgium.\n\nFounded by Grant LaFontaine and Logan Head in 2019, Whatnot’s platform is today designed for collectors, differentiating itself from competitors focused on fashion and beauty products. Initially centered on sports trading cards, action figures, comic books, and memorabilia, it has expanded over time to include accessories, clothing, electronics, live plants, and more.\n\nA key feature of the platform is its “sudden death” auctions, where the last bidder wins the item. Recently, Whatnot introduced a new selling method called flash sales, which allows sellers to offer customizable, time-sensitive discounts on products. During livestreams, a countdown clock creates a sense of urgency among buyers. Last year, the platform launched a new rewards tool that allows buyers to redeem rewards from sellers after completing certain achievements and leveling up.\n\nAlongside the funding announcement, Whatnot said it plans to launch its first-ever tender offer to buy back up to $72 million worth of shares. The company told us that this move reflects its commitment to investing in its 600 full-time employees. Share buybacks often suggest that a company is performing well and can afford to invest in its workforce, whether through salaries, benefits, or other investments.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe round was co-led by Avra, DST Global, and Greycroft, with participation from Andreessen Horowitz (a16z), CapitalG, BOND, Durable Capital Partners, and Y Combinator. To date, Whatnot has raised approximately $746 million.\n\nWhatnot also revealed that its annual gross merchandise value (GMV) for livestream sales surpassed $3 billion after recently reporting an annual GMV of over $2 billion."}