{"url": "https://techcrunch.com/2023/12/10/deal-dive-clean-energy-transition/", "title": "Deal Dive: Making the clean energy transition, well, cleaner", "authors": ["Rebecca Szkutak", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-12-10T00:00:00", "text": "People in many parts of the world are trying to lower their impact on the climate. From companies to countries, a lot of groups have goals to reduce their environmental impact. With innovation in areas like electric vehicles, wastewater treatment and battery recycling, among many others, those goals seem easier to attain than ever before.\n\nBut could it really be that easy?\n\nWhile much of this progress sets countries and organizations up for a cleaner future in the long run, the actual transition to cleaner tech isn’t very, well, clean. Many of these cleaner options require batteries, which are composed of rare metals that have to be mined and smelted in carbon-heavy processes. There also isn’t a great solution yet to recycle said batteries en masse.\n\nMany startups have piled into clean tech in recent years, and while they’re doing the good work of bringing new technologies and cleaner processes to the table, few are fixing the clean tech industry’s carbon-heavy supply chain issues. But Nth Cycle is trying to help.\n\nNth Cycle has built technology that lets its customers refine and recycle rare metals on-site. This cuts out the cost and environmental impact of shipping these metals overseas to be refined or recycled, especially since about 85% of rare metal processing currently happens in China, according to the U.S. Department of Commerce. Nth Cycle also doesn’t use carbon-heavy smelting to process the materials.\n\nThe company’s co-founder and CEO, Megan O’Connor, feels speeding up this process and making it cheaper is critical for the transition to clean energy. With the current overseas supply chain, there is no way countries like the U.S. will hit their climate goals in time. The rare metals needed to do so are ample enough, but they aren’t going to be put into use quickly enough. Nth Cycle hopes its ability to cut out a very timely part of the supply chain will help.\n\n“We have enough metal in the ground; we just can’t get it out of the ground fast enough or in an efficient way, not just for electric vehicles, [but also] for all of these clean technologies to meet our climate goals,” O’Connor said. “If we dig down into how we can get more materials faster, it’s either we mine more material out of the ground or we pull them out of end-of-life stuff.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe former TechCrunch Battlefield startup just announced a $44 million Series B round. The round comprises a $37 million equity funding round led by VoLo Earth Ventures, with participation from MM Catalyst Fund I, and construction and mining equipment maker Caterpillar’s venture arm. The company has also raised $7 million in nondilutive funding through government grants.\n\nO’Connor said this funding round, particularly Caterpillar’s involvement, shows that while many may think Nth Cycle’s tech is just for the electric vehicle industry, it has many other use cases within energy, defense and other industries.\n\nThis is a company worth getting excited about. We talk a lot in the venture and startup circles about infrastructure companies and how they are crucial to so many industries. Fintech wouldn’t be able to exist without payment infrastructure, nor could crypto meet its potential — whatever that may be — without blockchain infrastructure. But clean tech doesn’t have a lot of infra to build on. Innovations like electric vehicles only can make so much of a positive impact if they are built on existing supply chains that operate in opposition to climate goals.\n\nThere are other startups trying to tackle this, too. Many of these target battery recycling, which will become an increasingly carbon-heavy part of the clean tech industry if there isn’t a proper solution.\n\nThankfully, making clean tech cleaner is an important piece of the puzzle that VCs seem more than eager to help solve: Ascend Elements recently raised a $542 million Series D round for its battery recycling tech, Redwood Materials raised a whopping $1 billion in August, and Green Li-ion raised $20.5 million in March.\n\nThe problem seems large enough to warrant multiple solutions, so there’s hope we will see more startups entering this space."}