{"url": "https://techcrunch.com/2023/10/25/google-launches-ar-beauty-ads-for-lip-and-eye-products/", "title": "Google launches AR beauty ads for lip and eye products", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-10-25T00:00:00", "text": "Google sees augmented reality (AR) as a new, potentially quite effective advertising medium.\n\nToday, the search giant announced the launch of AR Beauty ads, a new smartphone ad type that allows brands to promote lip and eye products (and soon foundation) through “virtual try-on” experiences.\n\nIn place of a product image in a standard Google Shopping ad, AR Beauty ads offer a tool that lets consumers preview what different products might look like on themselves or a model that “resonates” with them. The tool is paired with a product description and pricing information, along with a simplified checkout flow designed to streamline the purchasing process.\n\nAR Beauty ads will show up in the mobile-specific channels Google Shopping ads typically do, including the Shopping tab on Google.com, Search and Google Images.\n\n“AR Beauty ads help our beauty brand partners showcase their products in a more interactive way to capture demand,” reads a press release attributed to Lilian Rincon, senior director of consumer shopping at Google, shared with TechCrunch yesterday. “When a new tool is helpful for shoppers, it can be helpful for the entire industry.”\n\nThe rollout of AR Beauty ads — which comes as Google debuts virtual try-on tools for hair color and foundation in Search, including a tool that lets users virtually try foundation on themselves — reflects the tech and ad industry’s growing belief in AR as a powerful force for marketing.\n\nIn May, Meta announced that it would roll out AR ads to Instagram Reels and Facebook Stories later this year. (Meta first tested AR ads in the Facebook News Feed in July 2018.) Pokémon GO developer Niantic piloted AR ad experiences during the Cannes Lions festival in early spring. And Snapchat has long offered AR ads through its Lens technology and platform.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAR Beauty ads are something of a follow-up for Google, which way back in 2019 brought AR to YouTube display ads as a part of an experiment with makeup influencers. Powered by FameBit, Google’s in-house branded content platform, viewers could virtually try on makeup while following along with YouTube creators to get tips and product reviews.\n\nThe mad rush isn’t fueled by hype alone — or so brands say.\n\nAccording to Shopify data, AR ads often perform better than display ads, with the average 3D AR ad generating 94% higher conversion rates than its static, 2D counterpart. Meanwhile, Snap and Deloitte find that brands offering AR experiences are 41% more likely to be considered by customers, and that nearly three in four shoppers are were willing to pay more for a product that they can explore with AR.\n\nGoogle, for its part, said that its 2019 YouTube experiment with VR ads resulted in just under a third of viewers spending over 80 seconds trying on lipstick on average. And the company claims that, after interacting with the virtual try-on tools on Google Search, shoppers are “measurably” more likely to spend time on a brand’s site, research a product or make a purchase.\n\nAll those metrics are perhaps why, by 2025, global AR ad revenue is projected to grow to $6.68 billion — a steep increase from 2020, when it totaled $1.36 billion."}