{"url": "https://techcrunch.com/2023/03/28/amazon-opens-its-low-bandwidth-long-range-sidewalk-network-to-developers/", "title": "Amazon opens its low-bandwidth, long-range Sidewalk network to developers", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-03-28T00:00:00", "text": "Back in 2019, Amazon announced Sidewalk, its low-bandwidth, long-range wireless network that uses the 900 MHz spectrum to connect Internet of Things (IoT) devices. It does this by connecting these devices to Amazon’s own Echo and Ring devices, who share a small part of their owner’s bandwidth. Ideally, this means Sidewalk will be able to connect devices that sit beyond the reach of a Bluetooth or Wi-Fi signal. Until now, though, only a select number of developers were able to build applications for the network. But that’s changing today. The company is now shipping software and hardware development kits, as well as an easy-to-use test kit to test the available Sidewalk connectivity in your neighborhood.\n\nUsing the new test kit, developers will be able to check their local signal strength on a map to get a better sense of whether their devices will be able to connect to the network before they start working on a product.\n\nAmazon sent me one of these Ring-branded devices to try. Getting started with it involves little more than powering it up (it does have a battery for mobile usage) and logging into Amazon’s web-based Sidewalk coverage service. From there, you can quickly see all of the raw data from the GPS-enabled test kit and get access to Amazon’s U.S.-wide coverage map.\n\nTo ensure user privacy, the coverage maps only show coverage within a 900m-by-900m square area. You will be able to see the exact location of your own device, but not other devices that report into the coverage map.\n\n“We’ve rapidly built out a long-range, low-bandwidth network that now covers more than 90% of the U.S. population, and this is an open invitation for developers to put it to the test,” said Dave Limp, senior vice president of Amazon Devices & Services. “Many types of connected devices have been limited by the range of Wi-Fi and the cost of cellular technology, which has hindered the ability to connect devices like environmental sensors, leak detectors and smart locks. Sidewalk is designed to provide a secure, low-cost way to invent and connect a whole new range of devices, and we can’t wait to see what developers build.”\n\nFor the software development kits, Amazon partnered with Nordic Semiconductor, Silicon Labs, Texas Instruments and module vendor Quectel. These companies will also offer hardware development kits, with Quectel launching a Sidewalk connectivity module that will allow developers to quickly take Sidewalk-enabled devices into production. Amazon is also launching mobile SDKs for iOS and Android to help developers build Sidewalk into their mobile apps. The company is also launching an app that will help developers debug and troubleshoot their devices in the field.\n\nIt’s worth noting that Sidewalk is also natively integrated with AWS’ IoT Core service, which allows businesses to connect and manage their fleets of IoT devices. “The integration of AWS IoT Core and Amazon Sidewalk marks a significant milestone for developers, manufacturers and customers, streamlining the design, connection and deployment of Amazon Sidewalk based IoT solutions,” said Yasser Alsaied, vice president of IoT at Amazon Web Services. “Now, with AWS IoT Core for Amazon Sidewalk, developers can access 200+ AWS services to build scalable solutions on top of a highly reliable, secure and free-to-connect wireless network.”"}