{"url": "https://techcrunch.com/2025/01/31/meta-turns-to-solar-again-in-its-data-center-building-boom/", "title": "Meta turns to solar — again — in its data center-building boom", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-01-31T00:00:00", "text": "Tech companies may be vocal about their love of advanced nuclear power — the flashy trend that’s been sweeping the energy sector — but they continue to add renewable capacity.\n\nMeta recently signed a deal with Spanish renewable developer Zelestra for 595 megawatts of solar power in Texas, just two weeks after signing a separate solar deal with utility company Engie. It’s a significant purchase for the tech company, representing a nearly 5% bump to the 12-plus gigawatts of renewable capacity it currently has under contract.\n\nThe announcement comes as Meta CEO Mark Zuckerberg maintains the company’s ambitious AI strategy — which will require hefty capital investments in data centers.\n\nMeta is racing to make its open source Llama 4 model a rival to closed-source competitors like OpenAI and Anthropic. And while DeepSeek showed that models could be developed more efficiently, its approach doesn’t necessarily apply to leading-edge models like Llama 4.\n\nMeta plans to spend $60 billion this year on capital investments, most of which would go toward data center infrastructure, calling it a “strategic advantage” for the company, Zuckerberg said during a Wednesday earnings call.\n\nLike many of its peers, Meta is betting that nuclear reactors can provide stable power for its future compute needs, soliciting proposals for 1 to 4 gigawatts of capacity to come online in the early 2030s. One gigawatt is enough to power about 750,000 homes.\n\nBut the company can’t wait until then to add to its data center footprint. Meta and others are deploying enormous sums of capital to build data centers, which need correspondingly large amounts of power. The chokepoint has some experts predicting that half of all new AI data centers will be underpowered by 2027.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nNuclear power plants take years to build, and the latest crop of advanced reactors have yet to be commercially proven. Natural gas power plants are slightly faster.\n\nNeither can compete with the speed of renewable deployment.\n\nA solar farm can be brought online in as few as 18 months, and because the technology is modular, portions of the power plant can start delivering power before the last panel is connected.\n\nThat speed has allowed renewables like wind, solar, and grid-scale battery storage to continue racking up new contracts from tech companies. In addition to this week’s deal, Meta announced earlier this month it bought 200 megawatts of solar from Engie, which will come online later this year. Elsewhere, Microsoft is helping to deploy $9 billion worth of renewables with Acadia Infrastructure Capital, while Google is anchoring a $20 billion renewable fund with Intersect Power and TPG Rise."}