{"url": "https://techcrunch.com/2024/11/20/snowflake-snaps-up-data-management-company-datavolo/", "title": "Snowflake snaps up data management company Datavolo", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-11-20T00:00:00", "text": "Cloud giant Snowflake has agreed to acquire Datavolo, a data pipeline management company, for an undisclosed sum.\n\nSnowflake unveiled the deal at the close of the market bell on Wednesday, when it also announced its Q3 2025 earnings. The purchase hasn’t yet closed, and it’s subject to customary closing conditions, Snowflake noted in a release.\n\nJoseph Witt and Luke Roquet, who met while working together at Hortonworks, founded Datavolo in 2023. Witt was previously CVP at Cloudera, while Roquet was Cloudera’s CMO and, before that, a business development executive at AWS.\n\nDatavolo uses Apache NiFi, an open source project for data processing developed by the NSA, to power a platform for automating data flows between various enterprise data sources. Data “processors” extract, clean, transform, and enrich data, including for generative AI use cases.\n\nWith Datavolo, which managed to raise $21 million in venture capital from investors including Citi Ventures and General Catalyst prior to the acquisition, Snowflake CEO Sridhar Ramaswamy envisions creating more versatile data processing pipelines for Snowflake customers. For example, he says, Datavolo might enable users to replace single-use data connectors with flexible pipelines that let them move data from cloud and on-premise sources to Snowflake’s data cloud.\n\n“By bringing Datavolo into the Snowflake fold, we are expanding how much of the data lifecycle Snowflake captures — unlocking both simplicity and cost savings for our customers, without any sacrifice to data extensibility,” Ramaswamy said in a statement. “We are excited to have the Datavolo team join Snowflake as we accelerate what is the best platform for enterprise data — unstructured and structured, batch and streaming — and dedicated to the success of the open source community.”\n\nWitt says that Snowflake will support and help to manage the Apache NiFi project following the close of the acquisition. “Data engineering at scale can be incredibly costly and complex, and our aim has always been to simplify experiences for our customers so they can achieve value faster,” he added in a press release. “By joining forces with Snowflake, we can empower our customers with the immense scale and radical simplicity of Snowflake’s platform, ultimately unlocking data engineering for more users.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThanks in part to AI, the demand for data management technologies has surged. Fortune Business Insights estimates that the market for global enterprise data management could be worth $224.87 billion by 2032.\n\nData management was a challenge for enterprises long before the AI boom, though. According to a 2022 survey from Great Expectations, a platform for data quality, 91% of organizations said that data quality issues were impacting their performance.\n\nAgainst that backdrop, it’s not surprising to see firms like Datavolo rise to prominence.\n\nToday was a newsy day for Snowflake, which reported better-than-expected earnings that sent its stock climbing 19%. In addition to buying Snowflake, the company announced a multi-year partnership with Anthropic to integrate the AI startup’s models in its Snowflake Cortex AI, Snowflake Intelligence, and Cortex Analyst products."}