{"url": "https://techcrunch.com/2024/08/06/jumia-plans-to-raise-more-than-100-million-in-secondary-shares-to-drive-stalled-user-growth/", "title": "Jumia plans to raise more than $100 million in secondary shares to drive stalled user growth", "authors": ["Tage Kene-Okafor", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-08-06T00:00:00", "text": "African e-commerce company Jumia is selling 20 million American depositary shares over the next couple of weeks, TechCrunch has learned. The at-the-market transaction is to take advantage of strong results despite a volatile market.\n\nGiven Jumia’s share price of around $5.70 when the stock market opened on Tuesday, the e-commerce company could potentially raise approximately $100 million through its new share offering. However, the final amount will depend on the share price, which has since dropped to $4.90. This decline, from around $11 as of Monday following a 200% rally in the last three months, may be attributed to shareholders reacting unfavorably to news of dilution, the impact of global carry trades, or both.\n\nIt’s not the first time Jumia has taken this approach. Between 2020 and 2021, the e-tailer raised almost $600 million through the sale of secondary shares.\n\nCEO Francis Dufay, who is undertaking his first secondary share sale, said on a call with TechCrunch that this time, Jumia is raising this money to accelerate its business after making significant progress on cost management and efficiency.\n\n“The new funding will be used to expand our supply chain network, particularly by enhancing logistics to reach smaller cities and broadening our overall network,” Dufay remarked. “We also plan to invest in technology, focusing on marketing and vendor technology, which we believe will significantly impact growth. Bottom line, after deep, fundamental, hard work on cost and efficiency, we believe the time is right to shift the cursor towards growing and invest some extra money so we can scale the company faster and break even faster.”\n\nBreaking past the 2 million mark\n\nSpecifically, the funds will improve Jumia’s cash position, which currently stands at $92.8 million (comprising $45.1 million in cash and cash equivalents and $47.7 million in term deposits and other financial assets) from its Q2 2024, its most recent financial report. That’s compared to the platform’s liquidity position of $120.6 million in Q4 2023 and $101.5 million in Q1 2024.\n\nThe funds raised will also be used for other purposes, including customer acquisition, product assortment, supply retention and adding more vendors to its marketplace.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nJumia’s active customer base has hovered around two million for several quarters. The number represents a 6.0% quarter-over-quarter compared to Q1 2024 and flat year-over-year growth between Q2 2023 and Q2 2024. “Our customer base is still relatively small, around two million active consumers per quarter, while we work in markets with over 600 million people. So we can do much more on the customer base,” said Dufay.\n\nSubsequently, orders increased 7% year over year to 4.8 million. Jumia ascribes the growth to the diversification of its product assortment, another area it intends to double down on with the new capital raised.\n\nHowever, despite the increase in orders, Jumia’s GMV and revenue declined 5% and 17% year-over-year to $170.1 million and $36.5 million, respectively. As with most of Jumia’s financial reports, since new management took over in Q4 2022, a recurring theme has been that these numbers typically highlight a year-over-year improvement on a constant currency basis but fluctuate in dollar terms due to devaluation. For instance, Jumia’s GMV in constant currency grew 35.0% year-over-year while revenue increased 15%.\n\n“The devaluation that happened both in our two biggest potential markets, Egypt and Nigeria, at the end of Q1 had a significant impact on our revenues quarter over quarter,” Dufay said. “However, we have seen some signs of stabilization and a sharp reduction of the spread between the official and parallel market rates. More importantly, our ability to drive GMV growth in constant currency illustrates that our value proposition is working.”\n\nTurning to profitability, Jumia’s adjusted EBITDA loss, which excludes finance costs, decreased 10% to $16.3 million — in line with the reduction in operating loss, down 8% year-over-year to $20.2 million — and driven primarily by cost-savings initiatives.\n\nWhile Jumia has long used both adjusted EBITDA and operating loss to measure its losses and path to profitability for years, Dufay insisted on the call that the 12-year-old e-commerce platform is keener to report loss before income tax from continuing operations, which includes finance costs, such as the impact of FX and the cost of cash repatriation. Loss before income tax from continuing operations was $22.5 million, down 27% year-over-year.\n\n“We’ve emphasized this KPI more over the past quarters due to the currency volatility and the associated costs it creates. Reporting the full picture is essential for companies exposed to such volatility. For instance, Mercado Libre in Latin America also prefers to look at the loss before income tax rather than EBITDA,” said the CEO. “During their recent results announcement, they highlighted how currency volatility in Argentina impacts finance costs. Therefore, focusing on loss before income tax offers a more comprehensive view when operating across multiple markets with currency fluctuations.”"}