{"url": "https://techcrunch.com/2022/11/09/akamai-leads-38m-round-in-macrometa-as-the-two-strike-partnership/", "title": "Akamai invests in Macrometa as the two strike partnership", "authors": ["Catherine Shu", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-11-09T00:00:00", "text": "Edge computing cloud and global data network Macrometa has struck a new partnership and product integrations with Akamai Technologies. Akamai also led a new funding round in Macrometa that included participation from Shasta Ventures and 60 Degree Capital. Akamai Labs CTO Andy Champagne will join Macrometa’s board.\n\nMacrometa founder and CEO Chetan Venkatesh told TechCrunch that its GDN enables cloud developers to run backend services closer to mobile phones, browsers, smart appliances, connected cars and users in edge regions, or points of presence (PoP). That reduces outages because if one edge region goes down, another one can take over instantly. Akamai’s edge network, meanwhile, covers 4,200 regions around the world.\n\nThe partnership between Macrometa and Akamai means the two are combining three infrastructure pieces into one platform for cloud developers: Akamai’s edge network, cloud hosting service Linode (which Akamai bought earlier this year) and Macrometa’s Global Data Network (GDN) and edge cloud. Akamai Edge Workers tech is now available through Macrometa’s GDN console, API and SDK, so developers can build a cloud app or API in Macrometa, and then quickly deploy it to Akamai’s edge locations.\n\nVenkatesh gave some examples of how clients can use the integration between Macrometa and Akamai.\n\nFor SaaS customers, the integration means they can see speed increases and latency improvements of between 25x to 100x for their products, resulting in less user churn and better conversion rates for freemium models. Enterprise customers using the joint solution can improve the performance of streaming data pipelines and real-time data analytics. They also can deal with data residency and sovereignty issues by vaulting and tokenizing data in geo-fenced data vaults for compliance.\n\nVideo streaming clients, meanwhile, can use the integration to move their platforms to the edge, including authentication, content catalog rendering, personalization and content recommendations. Likewise, gaming companies can move servers closer to players and use the Akamai-Macrometa integration for features like player matching, leaderboards, multiplayer game lobbies and anti-cheating features. For e-commerce players competing against Amazon, the joint solution can be used to connect and stream data from local stores and fulfillment centers, enabling faster delivery times.\n\nMacrometa will use the funding for developer education, community development, enterprise event marketing and joint customer sales with Akamai (Macrometa’s products are now available through Akamai’s sales team).\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIn a statement about the funding and partnership, Akamai EVP and CTO Robert Blumofe said, “Developers are fundamentally changing the way they build, deploy and run enterprise applications. Velocity and scale are more important than ever, while flexibility in where to place workloads is now paramount. By partnering with and investing in Macrometa, Akamai is helping to form and foster a single platform that meets evolving needs of developers and the apps they’re creating.”\n\nEdit: Inaccurate funding figure removed."}