{"url": "https://techcrunch.com/2025/04/03/djamo-raises-17m-and-has-1m-users-across-francophone-africa/", "title": "Y Combinator neobank Djamo raises $17M with 1M users across Francophone Africa", "authors": ["Tage Kene-Okafor", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-03T00:00:00", "text": "Djamo is one of several digital banking startups targeting Africa’s underbanked. But unlike many that focus on large markets like Nigeria, Egypt, or South Africa, Djamo has carved out a niche in Francophone West Africa, specifically the Ivory Coast and, more recently, Senegal. It now serves over 1 million customers across both countries.\n\nThe Y Combinator-backed fintech just raised $17 million to expand its product suite for these retail customers and the thousands of small businesses it has onboarded in the last two years.\n\nThe equity round, the largest ever for an Ivorian startup, surpasses Djamo’s $14 million Series A in 2022 and reflects continued investor confidence in its mission to make banking accessible and affordable.\n\nCo-founder and CEO Hassan Bourgi declined to share the new valuation but said it has doubled since the last raise.\n\nBourgi founded Djamo with chief product and technical officer Régis Bamba in 2020 to close the financial access gap in French-speaking African countries, where few adults have bank accounts. Traditional banks in the region often cater to the affluent, leaving most of the population reliant on mobile money, a cheaper method that includes using phone numbers to make financial transactions.\n\nMobile money has been instrumental in expanding financial access across Africa. As of 2022, only 28% of adults in sub-Saharan Africa had a mobile money account, per the World Bank, and the region holds more than half of the world’s total. But that progress has also created a ceiling.\n\nMost mobile money platforms offer basic services: cash-in, cash-out, P2P transfers, and bill payments. While useful, they don’t unlock more advanced financial tools like credit, investments, or long-term savings.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nDjamo is positioning itself between mobile money and traditional banking. The startup offers the accessibility of mobile money with the financial depth of a bank account, a similar playbook that SoftBank-backed Opay and Transsion-owned PalmPay have used to scale to tens of millions of customers in Nigeria.\n\nIts target is a growing segment of users, mostly younger customers, who’ve outgrown mobile money wallets but still find traditional banks expensive, outdated, or inaccessible, the founders say.\n\n“These users are evolving,” said Bourgi. “But they don’t want to go where their parents went, into institutions with predatory pricing and aren’t adapted to the new generation of customers. And this is what we are building, trying to become the go-to bank for this huge cohort of customers that is evolving now to more complex, wealth-building financing opportunities.”\n\nExpanding product suite to suit demand\n\nSince our last coverage, Djamo has expanded beyond cards and peer-to-peer transfers. The Ivorian fintech now offers savings vaults, investment products — thanks to the region’s first fintech-issued brokerage license — and salary-linked bank accounts, which Bourgi sees as important to boosting customer engagement.\n\nLike many neobanks, Djamo attracts banked users who treat it as a secondary account for smoother bill payments and mobile money integration. But it’s the unbanked, who are more difficult to activate, who show greater long-term potential. These users, who make up over 55% of Djamo’s base, often treat the app as their primary financial service.\n\nBourgi says nine in 10 users who rely on Djamo as their main account come from this segment. To reach more of them, Djamo has adopted a hybrid approach, combining its app with offline agents who meet customers in person to facilitate transactions, similar to the mobile money model now more broadly adopted by fintechs across the continent.\n\nCurrently, only 5% to 10% of Djamo users receive salaries through the app. “The next phase for us,” Bourgi said, “is figuring out how to move from 10% to 50% of our users getting their salaries paid directly into Djamo.”\n\nMeanwhile, Djamo is also ramping up services for small businesses — about 10,000 of them, many of whom started as retail users. According to CTO Bamba, the startup now provides bulk payments, payment links, and QR code tools to help merchants accept and manage payments directly within the app.\n\nThe fintech generates revenue from merchant fees on online card purchases and a premium tier plan, which 25% of users pay for. Bamba adds that the company is exploring additional revenue streams, including lending and earning interest on customer deposits. It is in the process of securing licenses that will allow it to offer interest-bearing savings accounts and credit products.\n\nDjamo’s founders say the company has grown revenue 5x since 2022 and processed more than $4.5 billion in transactions since launch.\n\nWith its recent expansion into Senegal, Djamo has entered a market dominated by Wave, one of Africa’s largest fintechs known for low-cost mobile money transfers. But rather than compete directly, Djamo positions itself as a complementary service, offering a digital banking experience where users can store funds and access more advanced tools like savings, investments, and credit.\n\nNow a 250-person team, Djamo is betting that its new round of funding, led by Pan-African, gender-focused VC Janngo Capital, will help it scale those services across French-speaking Africa.\n\n“We are thrilled to lead the largest VC round in Ivory Coast and double down on Djamo, a mission-driven fintech transforming access to financial services across Francophone West Africa,” said Fatoumata Bâ, founder and executive chair of Janngo Capital.\n\n“In a region where fewer than 25% of adults have access to formal financial services, and where women are twice as likely to be excluded, this is a vital mission. With women making up a third of its users, Djamo is not only closing the gender gap but unlocking economic opportunity at scale.”\n\nOther investors participating in the round include SANAD Fund for MSMEs (micro, small, and medium enterprises), managed by Finance in Motion; Partech; Oikocredit; Enza Capital; and Y Combinator."}