{"url": "https://techcrunch.com/2024/05/16/poshmark-promoted-closet-marketing-tool/", "title": "Poshmark’s ‘Promoted Closet’ tool lets sellers boost all their listings at once", "authors": ["Lauren Forristal", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-05-16T00:00:00", "text": "Poshmark, the social commerce site that lets people buy and sell new and used items to each other, launched a paid marketing tool on Thursday, giving sellers the ability to promote their entire shop at once.\n\nPoshmark’s new feature, called “Promoted Closet,” uses machine learning to automatically promote individual product listings from a seller’s entire inventory, identifying shoppers’ search terms and matching them with promoted items.\n\nPromoted Closet works like “cost per click” models on Etsy, Amazon and Google Ads. Sellers can set a weekly budget they want to pay and only get charged when a shopper selects the promoted listing. There’s an option to set the budget manually or to get a recommendation from Poshmark, which looks at the size of the closet, the type of listings and the value of brands featured to determine the demand and competition for those items.\n\nThere’s also an analytics dashboard where sellers can see the number of impressions, clicks, sales, return on ad spend, cost per click and clickthrough rate. The company recently expanded the amount of historical data, up from 30 days, so sellers can now view a year’s worth of sold listing data.\n\nImage Credits:Poshmark\n\nPoshmark’s new feature has been in beta with tens of thousands of sellers since early 2023 and has helped testers see a 43% increase in sales, according to the company. Starting today, it’s officially available for all users in the U.S. on both desktop and mobile. For a limited time, Poshmark is offering a seven-day free trial.\n\nPoshmark didn’t say when the feature will roll out to Canada, which is the only other market where the platform is available. (It used to exist in other markets, but the company shut down its international business in October.)\n\nImage Credits:Poshmark\n\nSince being acquired by Naver last year, Poshmark has made several enhancements to its resale marketplace. For instance, “Posh Shows,” a feature for hosting live auctions, and “Share Shows,” where users collaborate with other sellers to bring their audiences together. There’s also “Posh Lens,” an AI-powered visual search tool where buyers can take a picture of a specific item and find relevant listings.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPoshmark also has other marketing services, such as “Bulk Listing Actions,” where sellers can list multiple products for sale with one click, and “My Shoppers,” a data-driven tool that allows sellers to make offers to multiple shoppers at once.\n\n“There is a lot more work we are doing both on the social and community side but also on generative AI,” co-founder and CEO Manish Chandra told TechCrunch. “A lot of announcements you’ll see from us over the next six to eight months are going to be tied to [generative AI.]”\n\nPoshmark has over 130 million users in the U.S. and Canada. Sellers have earned more than $7 billion on the platform."}