{"url": "https://techcrunch.com/2022/09/22/saas-startup-remofirst-raises-14-1m-to-make-it-cheaper-and-easier-for-businesses-to-hire-remote-workers-globally/", "title": "Remofirst raises $14.1M to make it cheaper and easier for businesses to hire remote workers globally", "authors": ["Mary Ann Azevedo", "Sr. Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-09-22T00:00:00", "text": "Remote work has never been as accepted, or mainstream, as it is today.\n\nYet some businesses hesitate to explore the option of hiring people in other countries because the prospect can be daunting and costly.\n\nNurasyl Serik and Volodymyr Fedoriv started Remofirst in 2021 to open up that option to more businesses with a SaaS offering they say is more cost-efficient, quicker and comprehensive than what currently exists.\n\nSpecifically, the startup allows companies to hire people in more than 150 countries without having to set up their own entities. By serving as an Employer of Record, Remofirst operates that entity to hire workers on behalf of businesses and handle “everything to do with hiring a person in a company,” said Serik. That includes managing payroll, taxes, employment, compliance and providing work equipment as well as helping businesses come up with competitive compensation plans and offering health, dental and vision insurance.\n\nOn paper, an employee signs an employment contract with Remofirst’s local entity versus with the actual hire. That makes up about 90% of the startup’s business. It does offer contractor solutions, which makes up the remainder of its business and currently is free of charge, although that may change soon.\n\nRemofirst charges businesses a monthly fee starting at $199 and up based on the number of, and which, countries. Every country, Serik points out, has a different cost of operation.\n\n“It costs anywhere from $20,000 to $80,00 to set up an entity, and then companies still need to hire accountants, lawyers and HR professionals to maintain the relationships,” he told TechCrunch. “You need to have x amount of money in a particular country, and comply with all the local rules and regulations. That complexity adds to the time it takes.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIn January of 2021, the pair raised a pre-seed round of $275,000 from angel investors and then managed to grow the company to more than seven figures in revenue while becoming cash-flow positive — with no customer churn — in less than 12 months of operation. While Remofirst is mostly focused on SMBs, the company also works with enterprises and includes some Fortune 500 companies among its customers as well.\n\n“More and more companies are going remote and some can’t afford it,” Serik said. “We believe we are increasing TAM by allowing more companies to go remote.”\n\nRemofirst differentiates itself from outsourcing, saying that it rather than being responsible for finding and managing employees and all the admin work associated with it, the startup provides an infrastructure that allows companies to hire globally.\n\nLate last year, the startup began the process of raising its seed round of funding. It had five employees at the time, and had spent zero dollars on marketing.\n\nThe process to raise that seed round brought in $14.1 million in capital in a round that closed in February. Mouro Capital and QED Investors co-led the financing, which included participation from Counterpart Ventures.\n\nSince then, Remofirst — operating in stealth — has swelled to 40 employees. As it’s focused on growth, it is no longer currently cash-flow positive. However, Serik says that the company’s revenue has climbed 11x year-over-year.\n\nRemofirst operates in an increasingly crowded space that includes the likes of Deel and Atlas — both of which have raised hundreds of millions in capital. Deel, for example, started out with a focus on contractors and was most recently valued at $12 billion. Atlas last week raised $200 million in its latest round of funding. Another large player in the space, Remote, recently laid off 100 workers after being valued at $3 billion in April. But Remofirst is not deterred by its larger competitors, including legacy providers and newer startups.\n\n“Incumbent providers are not very tech savvy and are super expensive,” Serik told TechCrunch. “And when we started out some of our competitors had raised a bunch of money. So it was quite tough for us, because there were these very well-funded companies operating in the space.”\n\nTo differentiate itself, the company spoke with potential customers and kept hearing that cost was a barrier — that there were “good solutions out there but they were cost prohibitive.”\n\n“So we started with the idea of making sure that we can make this service more affordable,” Serik said. “We set out to make sure that it is a viable business and that the unit economics are healthy, but at the same time, be able to offer pricing that is 2x to 3x better than anyone else in the market.” It plans to offer a product later this year that Serik claims will make its offering even more affordable.\n\nRemofirst also aims to offer dedicated account managers to all its customers. “Going global is a daunting experience,” Serik said. “Having that point of contact from day one is very important.”\n\nNaturally, Remofirst’s investors are bullish on the company’s potential. Manuel Silva Martínez, general partner at Mouro Capital, told TechCrunch that “the clarity of [Remofirst’s] competitive assessment and speed of execution stood out in a growing, yet crowded, space.”\n\nHe added: “Remofirst stands out for their ability to apply a digital overlay to real-world problems in an asset-light way.”\n\nQED Investors partner Yusuf Özdalga said his firm was drawn to Remofirst after learning of how much it had been able to accomplish with “very little” external capital.\n\n“We love that in founders,” he told TechCrunch. “They built their product, ramped to more than seven figures in revenue, achieved breakeven, all with very minimal levels of funding. Very few companies can accomplish this, and the ones that do usually have great product-market fit, great founders, or both.”\n\nMy weekly fintech newsletter, The Interchange, launched on May 1! Sign up here to get it in your inbox."}