{"url": "https://techcrunch.com/2025/01/06/online-spending-grew-3-to-a-record-1-2t-over-holiday-period-says-salesforce/", "title": "Online spending grew 3% to a record $1.2T over holiday period, says Salesforce", "authors": ["Paul Sawers", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-06T00:00:00", "text": "Online spending rose 3% to a record $1.2 trillion globally over the holiday period, with U.S.-sales, specifically, growing 4% to $282 billion.\n\nThat’s according to a new report from Salesforce, which aggregated data from across its various cloud services, including Agentforce, Commerce Cloud, Marketing Cloud, and Service Cloud, to garner insights into spending activity spanning 1.5 billion shoppers across dozens of countries from November 1 through December 31, 2024.\n\nOverall, the figures fall slightly short of Salesforce’s forecast: It had predicted holiday period online sales growth of 2% ($1.19 trillion). Despite that shortfall, marquee dates saw standout performances: Black Friday transactions increased 5% to a record $74.4 billion, while Cyber Monday sales grew 3% to $49.7 billion. And Thanksgiving generated $33.6 billion in sales globally, up 6%.\n\nThere is another current that could undercut these numbers though: a higher-than-normal rate of returns. Salesforce said that consumers have already recouped $122 billion from merchandize returned to retailers. That’s up by 28% on last year, a figure that could eventually rise to $133 billion, according to the report.\n\nThis is “a cause for concern,” Salesforce director of consumer insights Caila Schwartz says, though she adds that other forces could help offset those drags. Indeed, Salesforce is one of many in the market building AI solutions for retailers — the pitch being that AI investments retailers make will lead to lower operational costs, and more personalized and engaging sales channels for customers. Salesforce says that AI and agents “influenced” holiday spending to the tune of $229 billion through targeted offers, personalized support, and product recommendations, up 6% year-on-year. AI-powered customer service uptake, specifically, rose 42%.\n\n“Retailers who have embraced AI and agents are already seeing the benefits, but these tools will be even more critical in the new year, as retailers aim to minimize revenue losses on returns and reengage with shoppers,” Schwartz said."}