{"url": "https://techcrunch.com/2023/09/11/meta-quest-software-update-avatar-customization-unsend-message-v57/", "title": "Meta Quest adds new avatar customization options, an unsend message feature and more", "authors": ["Lauren Forristal", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-09-11T00:00:00", "text": "As part of the v57 software update for Meta Quest headsets, the company announced Monday a bevy of new features — including more avatar customization options, an unsend message feature, group links, free-form locomotion ability in Horizon Home and a rebranded Explore feed. Meta also made improvements to video recording, multitasking and more.\n\nStarting today, the v57 update is gradually rolling out to Meta Quest Pro and Meta Quest 2 headsets. Meta will likely reveal more features at its Connect event later this month.\n\nAlongside today’s announcement, Meta wrote in its v57 release notes that it’s removing a casting feature from the iOS app, which allowed users to capture the VR experience on their iPhone.\n\nWith the new update, the avatar creator now has color sliders so users can better customize their skin tone, hair and eyebrow color. This is a notable addition as users can specify the exact shade they want, allowing them to more accurately represent what they look like in real life. Meta also added new makeup and face paint options.\n\nMeta introduced several enhancements to its avatar creator recently, such as new body shapes and improved hair and clothing textures. The most exciting update, however, was when avatars were given legs — a feature that is currently in beta.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAdditionally, users can unsend image messages while in VR and the Meta Quest mobile app. To unsend a message, hover over it and select “unsend message.” The sender and recipient will receive a notification that the message was unsent. The feature is available in the U.S., Australia, Canada, Iceland, New Zealand, South Korea, Switzerland and Taiwan.\n\nMoving on to the minor updates, Meta is launching group links, which means users can easily invite friends to join their group by generating a link and sharing it either in VR or pasting it into any messaging platform like Instagram or Facebook.\n\nSimilarly, virtually meeting up with friends is easier because users can now invite a group to an app from the People tab. The invite will be displayed in the group chat so everyone can see it and join. Also, instead of the contacts list hiding in the People tab, it will automatically open when the headset is turned on.\n\nHorizon Home, which is where people visit each other in virtual homes, is also getting an important capability. In addition to being able to teleport in VR apps, users can now freely teleport within Home, allowing them to “explore every nook and cranny of their Home environment,” Meta wrote. Users can enable free-form locomotion by pressing the controller thumbstick forward and aiming at a spot in the Home to teleport.\n\nThe Explore feed, the landing surface that suggests apps, will now be called “Horizon Feed,” likely to be consistent with the Horizon Worlds branding.\n\nOther small updates include a new default option for users to turn off microphone audio when recording video and the ability to use multiple apps simultaneously and switch between views. Meta also turned off a boundary warning in some apps with mixed reality experiences, so users aren’t interrupted."}