{"url": "https://techcrunch.com/2022/02/17/daily-crunch-salesforce-aws-collaborate-to-offer-bundled-services-for-streaming-content-providers/", "title": "Daily Crunch: Salesforce, AWS collaborate to offer bundled services for streaming content providers", "authors": ["Alex Wilhelm", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-02-17T00:00:00", "text": "To get a roundup of TechCrunch’s biggest and most important stories delivered to your inbox every day at 3 p.m. PST, subscribe here.\n\nHello and welcome to Daily Crunch for Thursday, February 17, 2022! Heading into a long weekend here in the United States, you might think that the news is slowing down but, nope. It’s not. So we have major crypto-football news, European startup analysis, and even some notes on platform dynamics. It’s a busy day, so let’s dive in! – Alex\n\nThe TechCrunch Top 3\n\nFree money is popular : Alternatively, advertising works. TechCrunch reports that data indicates that the crypto trading ad push during the big American football game led to a spike in downloads for the pertinent companies. Surprised? We’re not, as some of the ads had giveaways attached. Still, a bunch of new folks just got into the crypto game – we’ll be able to see more in Q1 earnings.\n\n: Alternatively, advertising works. TechCrunch reports that data indicates that the crypto trading ad push during the big American football game led to a spike in downloads for the pertinent companies. Surprised? We’re not, as some of the ads had giveaways attached. Still, a bunch of new folks just got into the crypto game – we’ll be able to see more in Q1 earnings. Europe’s deep tech boom : Diving more deeply into the 2021 startup boom is proving to be good fun, especially as we dial in our focus on key cohorts. Today TechCrunch dug into Europe and the deep tech market, a particular segment of the tech landscape that is often pitched as a U.S.-versus-China battle but could have a third hub, or series of hubs, in the mix.\n\n: Diving more deeply into the 2021 startup boom is proving to be good fun, especially as we dial in our focus on key cohorts. Today TechCrunch dug into Europe and the deep tech market, a particular segment of the tech landscape that is often pitched as a U.S.-versus-China battle but could have a third hub, or series of hubs, in the mix. See, not all SPACs are falling apart: The deal to take crypto-focused startup Circle public via a SPAC has dissolved. But wait! It has also been reforged at a far higher price. It’s rare these days to hear positive SPAC news, so the Circle update caught our attention. Read on for more, but stablecoins are proving to be a lucrative way to accrete reserves, it appears.\n\nStartups/VC\n\nBefore we dive into the day’s startup news digest, a bunch of academics wrote an op-ed for TechCrunch about Spotify, platform dynamics and clarity. It’s worth your time if you are building something that will depend on third-party content, and doubly so if you plan on blending first- and third-party material.\n\nNow, the news:\n\nStill want more? How about Dealshare’s $45 million round led by the Abu Dhabi Investment Authority, or the fact that Thrive Capital just closed an eighth fund worth $3 billion?\n\n3 keys that unlock data-driven fundraising\n\nIt’s an opportune moment to launch a new company, but rising interest rates, inflation and any other number of unknown factors could lead investors to become more judicious when it comes to placing bets.\n\nData-driven founders who can tell a sweet story with the right metrics are much more likely to get an investor’s attention, according to Blair Silverberg, co-founder and CEO of Hum Capital.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Unfortunately, many companies lack an efficient way to gather, synthesize and interpret data into real-time insights, resulting in the default reliance on static, Excel-based samplings that may not capture the full picture of your company’s potential,” he says.\n\n(TechCrunch+ is our membership program, which helps founders and startup teams get ahead. You can sign up here.)\n\nhttps://techcrunch.com/2022/02/17/3-keys-that-unlock-data-driven-fundraising/\n\nBig Tech Inc.\n\nThis will save Peloton : The at-home exercise company is getting into games. No, you can’t play Doom on your bike – not officially, though we suspect that someone, somewhere has done this already – but the bike shop has built an interactive title to spice up your cycling. I am already in tears in anticipation of it kicking my butt.\n\n: The at-home exercise company is getting into games. No, you can’t play Doom on your bike – not officially, though we suspect that someone, somewhere has done this already – but the bike shop has built an interactive title to spice up your cycling. I am already in tears in anticipation of it kicking my butt. Ford and Volvo sign up for Redwood’s battery recycling tech : Electric cars are very cool and mostly good but not entirely. Making them requires mining all sorts of yucky stuff from the planet, and when that material is used, it needs to be disposed of safely. That’s what Redwood wants to work on, and it just landed some key partners.\n\n: Electric cars are very cool and mostly good but not entirely. Making them requires mining all sorts of yucky stuff from the planet, and when that material is used, it needs to be disposed of safely. That’s what Redwood wants to work on, and it just landed some key partners. And to close, you can now change your name on Snapchat.\n\nTechCrunch Experts\n\nTechCrunch is recruiting recruiters for TechCrunch Experts, an ongoing project where we ask top professionals about problems and challenges that are common in early-stage startups. If that’s you or someone you know, you can let us know here."}