{"url": "https://techcrunch.com/2021/03/15/curran-biotechs-new-nanocoating-could-prevent-indoor-transmission-of-covid-19/", "title": "Curran Biotech’s new nanocoating could prevent indoor transmission of COVID-19", "authors": ["Sophie Burkholder", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-03-15T00:00:00", "text": "A new nanocoating from Curran Biotech could dramatically improve air filtration to prevent the spread of COVID-19 indoors.\n\nTheir Capture Coating technology acts as a supplement to any household or commercial HVAC system by bonding to the filter fibers, giving them greater hydrophobic properties. This combined effect prevents virus-carrying droplets from traveling through the filter fibers, which, without the treatment, only prevent some viral transmission.\n\n“ ‘Capture Coating’ is designed to mitigate and significantly decrease viral transmission of COVID-19 through specified air filtration media by forming a breathable, flexible, non-leaching, water-repellent barrier against aqueous respiratory droplets that act as virion carriers that can potentially be recirculated through conventional air-filters,” wrote Curran Biotech founder and University of Houston physics professor Shay Curran in an email. Despite the molecular complexity of the coating, the product itself can simply be sprayed onto an HVAC system’s filter.\n\nThis new droplet-targeting coating is an improvement over current filtration methods, which typically only target dry molecules. Not only do those methods often have at least some potential of viral droplet transmission, but current solutions to improve them aren’t always energy efficient.\n\n“In the world where energy management is very important, that means recycling the same air in the building with the risk of cross contamination,” wrote Curran. “Taking outside air is one way to dilute the air, but that means we also lose a huge amount in terms of energy, and still don’t solve the problem of taking the virus away from places where people congregate.”\n\nIndoor air ventilation remains an important tool in mitigating the spread of COVID-19 across schools, small businesses and other public buildings, but updating old HVAC systems to the recommended CDC standards can be costly. Curran hopes that his company’s approach can help address this issue, as the Capture Coating requires only a simple spray, rather than a completely new system of filters. “That really means for a few dollars when used on a standard issue MERV8, you can have huge indoor protection and stop its spread throughout the building,” he wrote.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBecause of the nature of the nanocoating, Curran’s technology can help prevent viral droplet transmission long after the end of the COVID-19 pandemic. The hydrophobic qualities of the coating prevent respiratory droplets from actions like sneezing or coughing from passing through the filter, while the HVAC system itself retains its normal capabilities for dry molecule filtration. With the Capture Coating, common droplet-transmitting viruses like the flu or cold will also be filtered out of circulation.\n\nSimilarly, the nanocoating would work in preventing transmission of any variant of the COVID-19 virus, as all of those variants also undergo droplet transmission. “It does not mean we get away from taking precautions such as hand washing, wearing masks etc, but it does mean we can work indoors far more safely,” wrote Curran.\n\nSo far, Curran Biotech’s Capture Coating technology is in use in 11 states, and will soon be announcing partnerships with distributors and filter companies to directly provide consumers with coated filters. Curran wrote that the company has also had successful trials of the technology in New York City, and hopes to expand use of the product even further across businesses and institutions around the country.\n\nEarly Stage is the premier “how-to” event for startup entrepreneurs and investors. You’ll hear firsthand how some of the most successful founders and VCs build their businesses, raise money and manage their portfolios. We’ll cover every aspect of company building: Fundraising, recruiting, sales, product-market fit, PR, marketing and brand building. Each session also has audience participation built-in — there’s ample time included for audience questions and discussion. Use code “TCARTICLE at checkout to get 20% off tickets right here."}