{"url": "https://techcrunch.com/2021/10/12/google-goes-all-in-on-hybrid-cloud-with-new-portfolio-of-edge-and-managed-on-prem-solutions/", "title": "Google goes all in on hybrid cloud with new portfolio of edge and managed on-prem solutions", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-10-12T00:00:00", "text": "Today at Google Cloud Next, the company’s annual customer conference, Google announced a broad portfolio of hybrid cloud services designed to deliver computing at the edge of Google’s network of data centers, in a partner facility or in a customer’s private data center — all managed by Anthos, the company’s cloud native management console.\n\nThere’s a lot to unpack here, but Sachin Gupta, Google’s GM and VP of Product for IaaS, says the strategy behind the announcement was to bring customers along who might have specialized workloads that aren’t necessarily well suited to the public cloud — a need that he says they were continually hearing about from potential customers.\n\nThat means providing them with some reasonable alternatives. “What we find is that there are various factors that prevent customers from moving to the public cloud right away,” Gupta said. For instance, they might have low latency requirements or large amounts of data that they need to process and moving this data to the public cloud and back again may not be efficient. They also may have security, privacy, data residency or other compliance requirements.\n\nAll of this led Google to design a set of solutions that work in a variety of situations that might not involve the pure public cloud. A solution could be installed on the edge in one of Google’s worldwide data centers, in a partner data center like a telco or a colo facility like Equinix, or as part of a managed server inside a company’s own data center.\n\nWith that latter component, it’s important to note that these are servers from partner companies like Dell and HPE, as opposed to a server manufactured and managed by Google as Amazon does with its Outposts product. It’s also interesting to note that these machines won’t be connected directly to the Google cloud in any way, but Google will manage all of the software and provide a way for IT to manage cloud and on-prem resources in a single way. More on that in a moment.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe goal with a hosted solution is a consistent and modern approach to computing using either containers and Kubernetes or virtual machines. Google provides updates via a secure download site and customers can check these themselves or let a third party vendor handle all of that for them.\n\nThe glue here that really holds this approach together is Anthos, the control software the company introduced a couple of years ago. With Anthos, customers can control and manage software wherever it lives, whether that’s on premise, in a data center or on public clouds, even from competitors like Microsoft and Amazon.\n\nThe whole approach signals that Google is attempting to carve out its own share of the cloud by taking advantage of a hybrid market opening. While this is an area that both Microsoft and IBM are also trying to exploit, taking this comprehensive platform approach while using Anthos to stitch everything together could give Google some traction, especially in companies that have specific requirements that prevent them from moving certain workloads to the cloud.\n\nGoogle reached 10% market share in the cloud infrastructure market for the first time in the most recent quarterly report from August with a brisk growth rate of 54%, showing that they are starting to gain a bit of momentum, even though they remain far behind Amazon with 33% and Microsoft with 20% market share."}