{"url": "https://techcrunch.com/2024/12/06/google-photos-launches-a-2024-recap-for-a-look-back-at-this-years-memories/", "title": "Google Photos launches a ‘2024 Recap’ for a look back at this year’s memories", "authors": ["Sarah Perez", "Consumer News Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-12-06T00:00:00", "text": "Spotify Wrapped isn’t the only service offering a year-end recap these days. In addition to the year-end reviews from other streamers and social apps, Google Photos is among the apps providing users with a look back at key moments throughout the past year. The feature, “2024 Recap,” introduces a collection of memories, insights, and photos, which can also be augmented with AI captions.\n\nThe latter feature is available to select users in the U.S., Google says. Users who have opted in to using AI in Photos will be able to add personalized captions to their photos, generated by Google’s Gemini AI model. The captions will highlight the two biggest moments from your year, like big events, trips, celebrations, and other milestones.\n\nThe recap will also include a look at other memories and insights designed to be shared outside the Photos app and onto other social media platforms. This includes personalized metrics about how many photos you took this past year, as well as how many videos and how many hours of footage that equates to.\n\nImage Credits:Google\n\nThe challenge with annual recaps of photos is that we don’t always take photos of the good things we want to remember and relive. Sometimes, we’re documenting life’s harder moments, too. In my case, Google Photos reminded me that my house burned down in March, for instance. I would have preferred to skip those memories, though Google is correct that this was a key moment for me in 2024.\n\nSome people also have to encounter other difficult memories — like those showing them with a loved one who has since passed away, happier times with an ex, and more. And unfortunately, AI isn’t yet at the point of understanding us well enough to know which photos we’d rather avoid.\n\nHowever, if you had a largely positive year, the new Recap can be a fun way to reshare your favorite moments with friends and family.\n\nThe 2024 Recap is rolling out now to Google Photos. Users will receive a notification when their recap is ready. To access the AI captions feature, Google says to make sure you’ve opted into using Gemini in Photos."}