{"url": "https://techcrunch.com/2024/09/19/amazon-releases-a-video-generator-but-only-for-ads/", "title": "Amazon releases a video generator — but only for ads", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-09-19T00:00:00", "text": "Like its rival, Google, Amazon has launched an AI-powered video generator — but it’s only for advertisers at the moment, and somewhat limited in what it can do.\n\nToday at its Accelerate conference, Amazon unveiled Video Generator, which turns a single product image into video showcases of that product after some amount of processing. The company says that the tool can curate “custom,” AI-generated videos that “showcase a product’s features” at no additional cost.\n\n“[Videos from Video Generator] leverage Amazon’s unique retail insights to vividly bring a product story to life in ways that are relevant to customers,” Amazon writes in a blog post.\n\nIn a statement, Amazon Ads VP Jay Richman said that Video Generator, which is currently in beta for select U.S. advertisers (and specifically for Sponsored Brands campaigns), will be fine-tuned over the next several months ahead of a wider release.\n\n“Video Generator is another meaningful innovation that leverages generative AI to inspire creativity and deliver more value for both advertisers and shoppers,” Richman said. “We are hard at work delivering generative AI applications that empower advertisers to craft visually stunning, high-performing ads.”\n\nA related new capability announced today, live image, generates few-seconds-long, animated GIFs from a still frame. Also in limited beta, it’s a part of Image generator, Amazon’s AI-powered image generation suite for marketers.\n\nAmazon didn’t provide sample footage from Video Generator, and it initially revealed very few technical details about the tool and live image.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nLate this afternoon, an Amazon spokesperson answered a few of TechCrunch’s Video Generator-related questions via email.\n\nClips from Video Generator are 6-9 seconds in length at a 720p resolution (24 frames per second). They’re automatically generated “around” a seed product image — “inspired by the product and its details,” the spokesperson said — and take up to five minutes to create. Users get four variations to choose from.\n\nVideo Generator outputs seem to follow the same basic formula: Two scenes with headlines (e.g. “Nourishing Lavender Moisturizer”), background music, and a call to action. The font and soundtrack can be customized, as well as the brand logo that appears in the upper-right-hand corner of the frame.\n\nAmazon’s expansion into generative video comes as other players release their own video-generating tech. Startups Runway and Luma launched generative video APIs this month, and Google says that it’s beginning to integrate its flagship video model, Veo, into YouTube Shorts. Elsewhere, Adobe promised that video generation would come to its Creative Suite platform by the end of the year, and OpenAI is expected to roll out its technology, Sora, in some capacity this fall.\n\nAs with all generative AI systems, there are risks to using these tools.\n\nVideo-generating models are trained on a vast number of examples of videos to “learn” the patterns in these videos to generate new clips. Some vendors train models on copyrighted videos without obtaining permission from the owners or creators, and, when these models “regurgitate” copyrighted stills, it exposes users of the models to IP lawsuits.\n\nAmazon is one of several companies that has said it’ll protect customers accused of violating copyright with media generated by its models, in keeping with its indemnification policy. We’ve asked the company if Video Generator and live image are also covered under that policy.\n\nHowever the legal battles shake out, one thing’s becoming clear: Generative AI threatens to upend the film and television industry as we know it. A 2024 study commissioned by the Animation Guild, a union representing Hollywood animators and cartoonists, estimates that by 2026, more than 100,000 U.S.-based entertainment jobs will be disrupted by generative AI.\n\nUpdated 9/19 at 4 p.m. Pacific: Added technical details about Video Generator.\n\n\n\n"}