{"url": "https://techcrunch.com/2025/05/15/threads-now-lets-creators-add-up-to-5-links-to-profiles-track-clicks/", "title": "Threads now lets creators add up to 5 links to profiles, track clicks", "authors": ["Sarah Perez", "Consumer News Editor", "Maxwell Zeff", "Sean O'Kane", "Tim De Chant", "Rebecca Bellan", "Kyle Wiggers", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-05-15T00:00:00", "text": "Instagram Threads is taking on Linktree and other “link-in-bio” solutions by introducing a way for creators to use their Threads profile to share links to their other interests and online presences. At launch, the feature will support adding up to five links to a bio, which can connect visitors to the creator’s blog, newsletter, website, or other social profiles, for example. In addition, creators will be able to access new tools to see how well those links perform.\n\nImage Credits:Threads\n\nThe Meta-owned social app, which now has over 350 million monthly active users, is positioning the feature as an alternative to its competitor X.\n\nHowever, Threads’ ability to point users to a host of other social and web profiles from links easily accessed from within a creator’s bio is something that could eat into the business of services like Linktree, Beacons, Linkin.bio, Koji, and others that offer tools that allow creators to build a landing page for multiple links. These services initially emerged because social media apps only offered one place to add a URL to a bio, and creators needed a way to direct their fans to everything else they published online, including their posts on other social networks as well as their own websites or storefronts.\n\nWith the update, Threads will provide creators with insights that allow them to see how many people have visited the links in their profile as well as any links shared in their posts.\n\nImage Credits:Threads\n\nThe company explained that the idea is to make Threads a place where creators can grow their reach, even if that means helping creators promote a presence that’s outside Meta’s app.\n\nIn addition, Meta says it will soon launch a weekly recap feature for Insights that offers a summarized snapshot of the past week, including a week-over-week comparison of the number of posts they’ve shared, total views, new follower counts, and replies on their posts. These recaps will also include other personalized tips to help creators learn how to better engage their community."}