{"url": "https://techcrunch.com/2024/03/29/nine-crypto-vcs-weigh-in-on-why-q1-investments-were-so-hot-and-how-it-compares-to-the-previous-bull-market/", "title": "Nine crypto VCs on why Q1 investments were so hot and how it compares to previous bull market", "authors": ["Jacquelyn Melinek", "Senior Reporter", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block"], "publication_date": "2024-03-29T00:00:00", "text": "If the 2023 crypto venture landscape was an ice-cold pot of water, the first quarter of 2024 is the part where the bubbles start to form right before water boils, Tom Schmidt, a partner at Dragonfly Capital, said to TechCrunch.\n\nAnd he’s not wrong: $2.52 billion in total capital has been raised across the crypto and blockchain sectors in Q1 2024, according to PitchBook data. That’s about 25% higher than $2.02 billion in the fourth quarter of 2023.\n\n“It’s been an extraordinarily busy time. It has 2021 feels to it,” said David Nage, portfolio manager at Arca. “Deals in 2021 felt like you had a gun to the back of your head; that feeling has kind of returned to the market a bit.” Nage said his firm has tracked over 690 deals across stages that have transpired during Q1, about 30 to 40% more than the lows in 2023.\n\n“In Q1, the crypto venture capital funding landscape was cautiously optimistic, rebounding from a challenging two-year period of fundraising difficulties for both companies and managers,” said Alex Felix, co-founder and chief investment officer at CoinFund.\n\nDespite a significant year-over-year decrease in both VC and crypto funding in 2023, around 65%, there is a noticeable uptick in deal-making activity, Felix added.\n\nBut why now?\n\nThe crypto VC landscape has heated up in part because of positive effects from legal wins last year from Ripple and Grayscale, as well as positive sentiments around decentralized finance (DeFi) on Solana. There’s also demand increasing for the biggest cryptocurrency post SEC spot bitcoin ETF approvals in the U.S.\n\n“Another thing that affected the market is we didn’t die,” Nage said. “I know it’s funny to say this, but after the [collapse of] LUNA, BlockFi, FTX, the banking crisis, the thought was that we would die and we didn’t.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAnd it may not stop anytime soon, thanks to macro validation from crypto. “Crypto venture will continue to heat up on the back of a bullish macro backdrop fueled by the launch of crypto ETF products, the BTC halving, projected rate cuts in the U.S. ahead of the upcoming presidential election,” said Mike Giampapa, general partner at Galaxy Ventures. “We’re also seeing institutional interest start to convert into real budgets and products.”\n\nFor example, BlackRock is launching its tokenized money market fund on the Ethereum blockchain, which could lead to heightened competitive pressure from traditional financial institutions and more adoptions.\n\nWhere deals are flowin’ in\n\nIn general, the crypto startup deal flow has picked up in areas ranging from DeFi to SocialFi to Bitcoin layer-2 growth. “We see 30 to 40 deals on a weekly basis, that’s increased 10% to 20% over the last quarter. It’s getting harder to keep up with the pace of that,” Nage said.\n\nThere has been an uptick in both new companies coming to market and existing companies that remained lean throughout the bear market that are revisiting fundraising, Giampapa said. “The market in 2024 will be a tale of the ‘haves’ and ‘have nots,’ with newer companies building along popular narratives getting funded at rich valuations and many other companies going out of business,” he added.\n\nRight now, SocialFi, which in web3 world refers mainly to decentralized social media, is very hot. Bi.social recently closed a $3 million round and decentralized social network protocol Mask Network hit $100 million for its fund to further support other similar applications. Some success in this sector can be thanks to decentralized social app networks like Farcaster, which is using Web 2.0 techniques to adopt new audiences. Web3 gaming is also rapidly expanding, with hundreds of new games expected to go to market later this year.\n\nCrypto and AI, blockchains and anything zero-knowledge related are “red-hot right now,” Schmidt said.\n\n“Given the grandiose expectations for AI’s potential to impact the global economy, we expect this trend to continue for the foreseeable future,” Tekin Salimi, founder of dao5, said.\n\nFor example, modular and AI-integrated blockchains, like 0G labs, which launched with a $35 million pre-seed round, are also attracting the attention of venture capitalists.\n\nFounder-friendly market is spiking valuations\n\nCompetitiveness among VCs is creating an environment in which founders have greater leverage in fundraising, Salimi said. There’s “no shortage of hungry money as of recently,” said Michael Anderson, co-founder of Framework Ventures.\n\n“This is founder-friendly in the sense that, in oversubscribed rounds, investors are now reverse-pitching their value,” said Marthe Naudts, associate at White Star Capital’s Digital Asset Fund, meaning that some investors have to show founders why they should choose them. “Founders now have optionality and the ability to set terms, with competitive rounds filling out before investors have time for intensive due diligence.”\n\nBut Felix says that the power hasn’t really shifted from investors to founders but is “perfectly balanced” for both parties. “Founders are benefiting from rounds catalyzed with more urgency and valuations ticking up slightly from their recent trough, and VCs are winning more protective and advantageous deal structures.”\n\nIt’s worth noting that there’s a massive dispersion based on the quality of the team and sector, Schmidt said. Some startups that previously raised during the last market cycle are working through a re-pricing through a down round or extension, while others are fresh faces.\n\nWith pre-seed rounds, there are under $10 million valuations in crypto consumer, but there are also $300 million or higher valuations for sectors like crypto and AI, Schmidt noted. For instance, PredX, an AI-enabled prediction market, raised $500,000 and was valued at $20 million post-money valuation, according to Messari data. Separately, CharacterX, a web3 AI social network, raised $2.8 million in a seed round at a $30 million post-money valuation.\n\nFor seed rounds, Nage is seeing $25 million to $40 million pre-money valuations, with several startups pricing in at the $80 million market on seed rounds. Schmidt said the average seed round is in a similar range of $30 million to $60 million post-valuation.\n\n“Valuations are up significantly, and even when larger, more established firms pass on a deal, founders still have plenty of options with others,” Anderson said. “Some of the valuation we’re seeing are already a bit outlandish given how early we are in this cycle.”\n\nBecause fundraise announcements are often delayed by many months to a year after the actual raise, there are misperceptions around where the private market is if participants are basing their expectations purely off headlines, Schmidt said.\n\n“Raises that would have taken months or not happened at all last year, even for high-quality teams, are now happening in weeks or less with better terms for founders,” Schmidt said. “Teams that squandered time and money during the bear market are still raising bridge rounds, but new teams are able to come out of the gate strong with larger raises and higher valuations.”\n\nThe valuation shift is also driven by sentiment around cryptocurrency prices, so bitcoin reaching all-time highs, Solana surpassing $200 and ether near $4,000 is a “massive sentiment shift,” Nage said.\n\nFor founders, seed rounds remain easiest to raise, as many small funds and angel investors are willing to write the first check at the lowest entry points, Felix said. “However, I do not anticipate an immediate improvement in the Series A graduation rate, which has declined from the upper 20% range to the mid-teens. Raising a round of more than $10 million will continue to be appropriately challenging.”\n\nMany venture capitalists are still trying to be mindful of not getting trapped into higher valuations by FOMO’ing into the hype, while also realizing that they can’t just sit on their hands and knees and wait it out. “It is common to see rounds get oversubscribed within days of coming to market and allocations being denied or shifted to subsequent rounds at higher valuations,” said Thomas Tang, VP of investments at Ryze Labs.\n\nThe tokenomic come back\n\nSince the end of 2023, Nage said he’s been hearing from companies and peers that they’re looking at tokenomic designs for 2024. So there’s a new rise of token issuance and there’s a number of Arca’s portfolio companies that are working through building that out for this year. This is a shift from the mid-2022 post-Terra/LUNA collapse era, when most seed deals were funded with Simple Agreement for Future Equity (SAFE) or warrants, he added.\n\n“This new issuance phase we’re entering into is that valuations have shifted violently,” Nage said.\n\nThis dynamic has driven VCs to accept “lofty valuations in private rounds since they expect that the tokens will be traded publicly at a significant markup,” Tang said.\n\nThat’s not to say there aren’t SAFE rounds still happening, but Schmidt said the market has congealed around those alongside priced equity rounds and token structures “as a way to give investors protection, but also give teams flexibility.”\n\nAnd it’s tougher for teams raising around traditional business models, said Clay Robbins, co-founder of accelerator and venture capital fund Colosseum. Crypto-native VCs see token trades and early liquidity behind it, so they’re heavily biased that way, while generalist investors don’t quite believe in that market yet, he added.\n\nOn that point, Naudts said the long-term performance of these tokens is yet to be seen. Her firm, White Star, is cautious of tokens intended both as a speculative asset and a means of payment. “But we’re seeing lots more experimentation with tokenomics models here and it’s certainly a space where we are excited by the innovation at play.”\n\nLooking to the rest of 2024\n\nThe early-stage funding space will continue to heat up throughout the remainder of the year, Robbins said. Given the “relatively anemic IPO market, lack of fundamentals-based underwriting of growth-stage crypto companies and a (now confirmed) trial between the SEC and Coinbase, I anticipate it will be inconsistent at the growth stage.”\n\nAnd April will be a big month for crypto market sentiment. As the Bitcoin Halving is coming up, which only occurs once every four years, there’s a lot of uncertainty on how that will affect the industry. Past halving events have propelled the price of bitcoin, but historical data doesn’t always predict the future.\n\n“While short-term market corrections may be on the horizon, we expect the next three quarters of 2024 to be very bullish,” Salimi said. “Historically, financial markets make positive gains during election years. Additionally, we anticipate the macro environment to begin improving later this year, manifesting first in interest rate cuts.”\n\nAnd relative to last year, many venture capitalists are certain — if there aren’t any massive fraud cases, lawsuits or negative regulatory effects — that the market will continue to see hyper VC activity in the coming quarters that it saw in Q1. “Regulation continues to be the wild card here and could serve as a catalyst for either another leg higher or a brake on growth,” Giampapa said.\n\nIf there’s positive progress on the regulatory front, real on-chain momentum, more institutional-based products being launched and continued overall improved macroenvironment, there could be “frenzy levels of deployment,” Robbins said.\n\n“There will be more activity, more deal flow and one thing above everything else is funds are raising capital,” Nage said. Many firms weren’t able to raise from LPs last year because the industry “was a death knell and no interest was out there from LPs.”\n\nAs the industry moves on from FTX, LPs are also warming back up to the space, but some are also beginning to differentiate between “crypto” and “crypto venture,” which may lead to some choosing to just allocate to Bitcoin and leave it at that for their crypto exposure, Schmidt said.\n\nHowever, traditional VCs or crossover funds haven’t “plunged head-first back into crypto, but they’re slowly dipping their toes into a few more deals,” Schmidt said. “I would not be surprised if things get frothier as those bigger market participants come back, crypto funds go back out to the market to reload on capital from LPs, and the space overall becomes more institutionally attractive again.”\n\nRegardless, the sentiment has shifted dramatically over the last quarter, so as that continues to improve, it should also create positive effects on the venture market, Nage added. “If [firms] can raise funds in the next two to three quarters, they won’t hold on to their past dry powder as aggressively as they did the past year. As that eases, you’ll see more checks.”\n\nLast year, most funds were doing about one to two deals a month, or a few a quarter, Nage said. “That has dramatically changed. In December alone, we’ve done half a dozen, if not more.” All the deals Nage is in talks with this most recent quarter were time constrained.\n\nBy comparison, Felix shared that CoinFund closed 17 deals in 2023 and four deals in the first quarter of 2024.\n\nLast year, a total of $10.18 billion in capital was raised across the crypto and blockchain industry, PitchBook data showed. I asked each firm how much capital they expect to be raised by the end of 2024 and most estimated above that $10 billion range, but some went as high as the $20 billion range.\n\nFelix believes that VC funding to web3 could be more than 10% of global dollars raised so that could be as much as $16.2 billion at year end based on PitchBook’s 2023 fundraising figures. Either way, it’s expected to be short of the nearly $30 billion that crypto startups raised in 2022, and the more than $33 billion they raised back in 2021.\n\n“This market falls somewhere between the mania of 2021, 2022 and the muted market of last year,” Robbins said.\n\nWhile Giampapa also thinks many managers will accelerate deployments and go out to fundraise in the next six to 12 months, there’s a caveat. In the previous bull market, some of the large deployers of capital were firms like FTX and Three Arrows Capital, which are no longer in business. “Without these pools of capital, I struggle to see how dollars deployed into crypto VC get back to the 2021 to 2022 levels.”"}