{"url": "https://techcrunch.com/2025/04/10/how-chef-robotics-found-success-by-turning-away-its-original-customers/", "title": "How Chef Robotics found success by turning away its original customers", "authors": ["Julie Bort", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-04-10T00:00:00", "text": "A few years ago, Chef Robotics was facing potential death.\n\n“There were a lot of dark periods where I was thinking of giving up,” founder Rajat Bhageria tells TechCrunch of his six-year-old company. But friends and investors encouraged him, so he persevered.\n\nToday, Chef Robotics has not only survived, it’s one of the few food tech robotic companies that is thriving. The startup, which recently raised a $20.6 million Series A, has 40 employees and marquee customers like Amy’s Kitchen and Chef Bombay. Dozens of robots installed across the U.S. have made 45 million meals to date, Bhageria says.\n\nThis compares to a graveyard of failed food tech robotics companies, including Chowbotics with its salad-making robot Sally; pizza delivery robot Zume; food kiosk robot Karakuri, and, more recently, agtech Small Robot Company.\n\nBhageria says he saved his company by doing something that early-stage founders fear to do: turning away signed customers and millions of dollars in revenue.\n\nThe grasping problem\n\nIt all began when Bhageria did his master’s degree in robotics at UPenn’s famed GRASP Lab. He dreamed of the sci-fi promised world where robots did our housework, mowed our lawns, and cooked us five-star dinners.\n\nSuch a world doesn’t exist yet because engineers have yet to fully solve the robotic grasping problem. Training the same robot to wash a wine glass without crushing it and a cast iron pan without dropping it is a difficult task.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhen it comes to robotic chefs, “Nobody’s built a dataset of how do you pick up a blueberry and not squish it, or, how do you pick up cheese and not have it clump up?” he describes.\n\nHis original idea with Chef Robotics was similar to the long-list of the robotics startups that died: a robotic line for fast casual restaurants. That’s an enormous industry with a chronic employee shortage.\n\n“We actually had signed contracts. Like we had multimillion-dollar signed contracts. Obviously, we’re not doing this anymore. So what happened?” he said. “We essentially could not solve the technical problem.”\n\nIn those types of businesses, an employee completes an order by assembling all the varied ingredients necessary for each meal. These restaurants want robots to replicate that process because the alternative is to have dozens of robots dedicated to, and calibrated for, a single ingredient, some of which may only be used occasionally (we’re looking at you, anchovies).\n\nBut Bhageria and team couldn’t build a successful pick-up-anything robot because the training data doesn’t exist. He asked his potential customers to let him install robots for one or two ingredients, gathering training data and building from there. They said no.\n\nThen Bhageria had an epiphany.\n\nInstead of going bust trying to give existing customers what they wanted, maybe he needed different customers. “It honestly sucked, because I spent the last year and a half of my life trying to convince these people, these fast casual companies, to work up with us,” he recalled.\n\nChef Robotics founder Rajat Bhageria Image Credits:Chef Robotics\n\nSaying no leads to yes\n\nIt didn’t help that fundraising after 2021 was brutal. VCs were also looking at the graveyard. “We talked to dozens of different funds,” Bhageria said. “We just got rejected over and over.”\n\nBhageria was thinking of giving up. “You come home and are like, what am I doing in my life? Am I doing the wrong thing? Should I quit?” he remembered.\n\nBut he dug in and in March, 2023, raised an $11.2 million seed round led by Construct Capital, while also landing checks from Promus Ventures, Kleiner Perkins, and Gaingels.\n\nBhageria and team also found their perfect market, a part of the food industry known as “high mix manufacturing.”\n\nThese are food makers that have many, many recipes, and make thousands of servings, but typically as meals or meal trays. For instance; salads and sandwiches or main courses and side dishes. These are meals used by airlines and hospitals, etc., or are frozen food meals for consumers.\n\nRather than one employee grabbing all the ingredients for each meal, “high mix” employees form an assembly line. Each person adds their individual ingredient to the tray repeatedly until the order is complete. Then they assemble the next recipe.\n\n“It’s actually hundreds of humans who are standing in a 34 Fahrenheit room, and they’re essentially scooping food for eight hours a day,” he describes. “So it’s just a terrible job.”\n\nConsequently, this industry has chronic labor shortages as well.\n\nRobotics wasn’t economically feasible for them in the past because of the variety of ingredients involved. But a startup building a flexible-ingredient bot, where the robots are built in partnership with the food maker, works.\n\nBetter still, “as we learn how to do this chorizo, or we learn peas, or this sauce, or these zucchinis,” the bots get the real-world training data they need to eventually serve fast-casual restaurants. Bhageria says this is still on his roadmap.\n\nBest of all, thanks to VC’s reborn interest in all things AI, fundraising this time was “weirdly” easy, Bhageria says.\n\nAvataar Venture Partners, co-founded by former Norwest VC Mohan Kumar, was specifically looking to fund “AI in the physical world” startups and actually pursued Chef Robotics, Bhageria says. He closed this round in less than a month. Avataar led, with existing investors Construct Capital, Bloomberg Beta, and Promus Ventures piling in, among others.\n\nThe new funding brings Chef’s total raised to $38.8 million. He also signed a new $22.5 million loan from Silicon Valley Bank for equipment financing, bringing Chef’s total debt raised to $26.76 million.\n\nAnd the process this time was “exhilarating,” he said.\n\nNote: This story was updated to reflect updated equity and debt totals."}