{"url": "https://techcrunch.com/2022/11/25/meet-5-startups-working-to-harness-the-earths-heat-to-save-the-planet/", "title": "Meet 5 startups working to harness the Earth’s heat to save the planet", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-11-25T00:00:00", "text": "There are a few sources of power that are “free” here on Earth, namely wind, solar, hydro and geothermal. Humans have been tapping hydro and wind for millennia, and we’re getting pretty good at harnessing the power of the sun. But with geothermal, we’re still not expertly exploiting the heat that’s generated deep within the planet.\n\nMost commercial-scale geothermal installations are in geologic hotspots like Northern California and Iceland. At a smaller scale, many homeowners have drilled shallow wells or buried loops in their yards for heating and cooling. But to truly unlock geothermal’s potential around the globe, and do so profitably, we’ll need new ways to drill deep down and draw the Earth’s heat up.\n\nAs the world lurches through an energy transition, plenty of energy wonks talk at great lengths about dispatchable baseload power. That’s a lot of jargon. “Dispatchable” means that grid operators can ask for a plant to produce power on a moment’s notice and it’ll deliver. And “baseload” means power that can always be on, no matter the weather. Renewables like solar and wind are, on their own, not baseload power. It’s a different story if they’re paired with batteries to store power for use when the wind is calm or the sun isn’t shining. The renewables-plus-batteries combo is happening with increasing frequency, but batteries remain expensive, and why not have more options than just that?\n\nGeothermal is often pitched as a carbon-free source of dispatchable baseload power, which is why energy wonks are warming to it. In a geothermal plant, a working fluid, frequently water, is injected underground, where it’s heated before being pulled up again to run through a heat exchanger or drive a turbine.\n\nThe source of heat is nearly limitless. The Earth continuously generates about 44 terawatts worth of heat, about half of which comes from naturally occurring radioactivity. That’s about 385,000 terawatt-hours of energy released every year, far more than global energy use, which in 2019 was just shy of 23,000 terawatt-hours. If we could tap into a fraction of the Earth’s heat, well, we’d have a lot of energy at our disposal.\n\nGeothermal’s potential is coinciding with the looming decline of the fossil fuel industry, which has many engineers rethinking their careers. It just so happens that many of the drilling techniques developed for the oil and gas industry dovetail nicely with what’s required to bring geothermal mainstream.\n\nThere are a number of startups attempting to transform geothermal from a niche power source to one that could be widely deployed. Here are five that I’ve been watching.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nQuaise Energy\n\nIf there was an award for the sexiest geothermal technology, Quaise Energy would probably be the winner.\n\nThe company’s key technology is based on research by MIT plasma physicist Paul Woskov. Where most drilling companies use something hard to grind or batter the rock out of the way, Woskov developed a method using extremely high-frequency electromagnetic radiation to vaporize it inside of boreholes.\n\nQuaise says this setup can theoretically drill boreholes up to 20 km deep, allowing the startup to access consistent 500-degree Celsius heat. That’s hot enough to not only generate a lot of electricity but potentially provide low- and medium-temperature industrial heat, which is the bulk of industrial demand.\n\nThe company closed a Series A in June, and it has raised $70 million to date, according to data from PitchBook. Its leadership is heavy on ex-oil-and-gas executives, no surprise given the industry’s experience with drilling. Investors include The Engine, drilling company Nabors Industries and Vinod Khosla as an angel investor.\n\nFervo Energy\n\nHouston-based Fervo Energy’s leadership is also heavy on oil-and-gas experience, and they’re banking on that experience, coupled with the company’s advanced well-monitoring technology, to give them an edge. In each geothermal well hole, the startup threads fiber optic cables laced with sensors to give it a deep picture of what’s happening inside. That data is then fed into a series of models to determine other prime drilling sites.\n\nGiven the team’s history with oil and gas, it’s no surprise that they also lean heavily on drilling techniques developed for that sector, including multizone stimulation, which breaks up the rock near the borehole to make it more permeable, and horizontal drilling.\n\nFervo has raised $177 million so far, according to PitchBook, most recently in a $138 million Series C that closed in July. Investors include Breakthrough Energy Ventures, Baruch Future Ventures, Capricorn Investment Group, DCVC and a handful of oil-and-gas and oilfield services companies.\n\nSage Geosystems\n\nAnother Houston-based geothermal startup, Sage Geosystems is also led by a number of former oil-and-gas engineers. The company’s drilling approach, a combination of horizontal drilling and fracking, is widely used within the energy industry. But instead of using it to draw up oil or gas, the company injects the wells with supercritical carbon dioxide, or carbon dioxide that’s been heated and compressed to the point that it’s dense enough to be a liquid but behaves like a gas.\n\nSage says that using supercritical carbon dioxide doubles the efficiency of its heat-to-electricity system relative to steam, allowing it to use smaller turbines. The startup also differs from some competitors by using a single well to inject and withdraw the working fluid, saving money on drilling costs.\n\nThe company has a test site in South Texas, and it has raised two early corporate rounds, one for an unspecified amount and another for $12 million from Nabors Industries and TED head Chris Anderson’s impact fund.\n\nEavor\n\nEavor, headquartered in Calgary, is another startup filled with oil-and-gas veterans. (Sensing a pattern?) The company’s system is essentially an underground radiator formed by drilling two holes down and then horizontally until they connect. It then connects the two via a pipeline running on the surface.\n\nThe heat drawn from the rock causes the working fluid to heat thermal oil to drive a generator on the surface. A siphon effect keeps the fluid moving without pumps. Eavor’s full-scale installation would be 3.5 km deep with 5 km between boreholes. The company hasn’t disclosed the generating capacity of a loop, but it says it would produce enough heat for 16,000 homes, presumably in a district heating scenario where heat is pumped from a central location to each home through a series of pipes.\n\nEavor has raised $104 million to date, including a $22 million corporate round that closed last month from Japan’s Chubu Electric Power.\n\nQHeat\n\nWhere most enhanced geothermal startups are drilling to reach hot rock several kilometers deep, Espoo, Finland-based QHeat is focused on so-called medium heat wells that are only 1.5 km deep. Instead of generating electricity, the company is hoping to make geothermal the go-to choice for heating and cooling in dense urban areas.\n\nMost geothermal heating and cooling is done in relatively shallow boreholes or in loops that run a few meters below the surface. That’s fine for suburban purposes, but it’s insufficient for apartment and office buildings. In temperate climates, heat is either withdrawn from underground or deposited depending on season. By drilling deeper, QHeat is allowing more rock to be heated or cooled.\n\nQHeat’s geothermal system would plug directly into a building or a district heating setup, which are common in Finland, Sweden and Denmark. In the U.S. and elsewhere, district heating is used mostly in big cities or large campuses. But those systems are typically powered by fossil fuels, either via boilers or waste heat drawn off generators.\n\nThe startup has a series of test sites in Finland, and after it’s proven its approach, the company says it plans to transition from implementation to patent licensing. It’s still in its early phases, having raised $6.5 million across a mix of equity and debt, according to PitchBook.\n\nHot technology?\n\nGeothermal’s future is still largely unsettled. Though the basic technology is over 100 years old, it’s limited to literal geologic hotspots like California, Iceland and New Zealand, where the heat is close to the surface.\n\nMuch of the risk in enhanced geothermal revolves around drilling, which is why you see so many oil and gas veterans leading these companies. If geothermal is going to spread beyond those places, engineers are going to need to drill deeper and cheaper than ever before."}