{"url": "https://techcrunch.com/2025/05/14/pinterest-finally-admits-mass-bans-were-a-mistake-caused-by-an-internal-error/", "title": "Pinterest finally admits mass bans were a mistake caused by an ‘internal error’", "authors": ["Sarah Perez", "Consumer News Editor", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-05-14T00:00:00", "text": "Pinterest has now publicly apologized for the wave of moderation issues that have swept across the social network over the past few weeks, leading to account bans and Pin removals that users said were unwarranted. In posts published to social media on Tuesday, the company took responsibility for the issue, saying that an “internal error” led to some users’ accounts mistakenly being deactivated.\n\nThe company didn’t share more details about what caused the error, though many have wondered if the bans were driven by an overreliance on AI-powered moderation. Reached for comment, Pinterest said the error was not due to AI moderation and that it has now resinstated the accounts that were mistakenly deactivated.\n\nThe problems have led to unrest and anger among Pinterest’s user community. People complained that the company ignored their concerns and said it wasn’t being transparent about the problem or how it was being addressed.\n\nFor weeks, Pinterest users have been reporting the mass bans in the comment sections of Pinterest’s social media posts, on the Pinterest subreddit, and elsewhere. Reddit users, for instance, regularly complained the deactivations and removals made no sense, as their actions and posts didn’t violate Pinterest’s policies. In a pinned megathread on Reddit, users lamented the sudden loss of their Pins and Boards without reason, while others responded more in anger and frustration.\n\nOne group of users even threatened legal action over the mass bans. Some suggested targeting Pinterest CEO Bill Ready and other execs on LinkedIn with their complaints.\n\nAll the while, Pinterest didn’t officially comment on the matter until May 1, when it posted on X that “we hear your concerns about the recent account deactivations.” However, the company also stated it monitors its platform regularly for content that violates its Community Guidelines. In other words, it refused to admit the problem was real.\n\nInstead, Pinterest requested users send a DM if they believed their account was deactivated in error, as if the bans were so few and far between that they could be handled as one-offs.\n\nThings have now changed with Pinterest’s new statement, though many users complain it’s “too little, too late.”\n\nOn May 13, Pinterest posted on X and in Instagram’s comments that some users’ accounts were deactivated by mistake.\n\nThe statement read:\n\nWe’re committed to making Pinterest the safest, most positive place on the internet, which means setting a high bar for content safety and continually striving to meet it. We recently took action on violations of our content policies, but an internal error led to over-enforcement and some accounts were mistakenly deactivated. We’re sorry for the frustration this caused. We’ve reinstated many impacted accounts and are making improvements to respond faster when mistakes happen going forward. Thanks for your patience as we work to make this right for all our users.\n\nPinterest users responded to the statement in anger, listing their numerous complaints. Some users said they appealed their bans over email and received no help. Others believed Pinterest’s AI had misidentified their posts. Many users said they had done nothing that should have led to a ban and were never given a clear reason for their account deactivation.\n\nUpdated after publication to note Pinterest’s comment around AI."}