{"url": "https://techcrunch.com/2023/09/05/fednow-impact-on-fintech-regulatory-compliance/", "title": "FedNow will expose fintech’s gaps: Compliance-by-design can help banks avoid risk", "authors": ["Chris Zingo", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-09-05T00:00:00", "text": "Digital innovation across our financial industry is evolving at the pace of Moore’s law on steroids — reshaping the structure of our markets, transitioning buying power to the consumer, and dislocating segments of the customer value chain once dominated by traditional banks.\n\nFintechs have been busy pushing legacy banks toward product innovation of payments, settlements/clearing, online loans, and more, rewriting the standards for customer experience and highlighting the volume of waste and inefficiency associated with the fixed cost structure of traditional banks.\n\nDespite the challenges faced by fintechs last year, the reality is the pace of innovation in financial services shows no signs of deceleration. This is especially true for the United States. Digital transformation of the industry will only increase, and the U.S. is very clearly working to catch up with the progress seen in the rest of the world.\n\nAt last, we now possess the capability for contactless and peer-to-peer payments, a feature that has been accessible in other regions for many years. Now the U.S. Federal Reserve launched FedNow, a new instant payment infrastructure, joining nations like Mexico, India, Brazil, Singapore, and the EU, in fostering momentum toward facilitating immediate payments and transactions.\n\nYet, with greater innovation does indeed come greater responsibility. While banks strive to maintain innovation for catering to customer demands and enhancing their competitive advantage, they will discover that achieving this becomes challenging unless they adapt their approach to assessing and integrating new technological solutions.\n\nThis adaptation is crucial to address the ever-evolving compliance requirements. Instances of increasing fraud cases and the potential for heightened financial crime risks have already been noted in relation to new initiatives like FedNow.\n\nTherefore, the best technologies will be those created through the lens of regulatory limitations — a compliance by design approach — utilizing these regulations as the foundation for future digital solutions. It’s only in this way that banks can ensure they come out on top in the financial services industry’s race toward complete digital transformation, and do it well.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe shifting regulatory perimeter\n\nLet’s first discuss why such a shift in mindset for fintech innovation is needed. Currently, Tradeshift and HSBC are working to revolutionize the world of working capital management. Citi and IntraFi are helping their clients to unlock trapped cash, and Amazon and JPMorgan are redefining the payment ecosystem.\n\nFintech companies stand out by tapping into unregulated parts of finance, owning fewer assets, and working flexibly on a larger scale. This is quite different from banks weighed down by rules, owning lots of assets, and struggling to innovate quickly.\n\nThis growing difference in how they follow regulations is introducing compliance gaps between banks and fintechs, which, as rules change, must avoid missing risks that could turn into reputation, security, or operational problems when releasing new products.\n\nNew financial system plumbing comes with a cost — and a conundrum\n\nThe latest major industry disruption is happening now as financial institutions (FIs) are deliberating about whether, when, and how to adopt FedNow for their customers to execute instant payments and other transactions without any waiting period.\n\nIn a diverse payments environment undergoing significant transformations, the dynamics of the industry are rapidly changing. These shifts include developments in ESG (environmental, social, and corporate governance) and crypto regulations, recent Russian sanctions, emerging generative AI tools, and new SEC rules concerning broker-dealers and beneficial ownership information.\n\nIn its 2023 banking regulatory outlook report, Deloitte suggests that “continuous change, delays, and additions can make it tough for financial services organizations to navigate the regulatory landscape.”\n\nIn addition, banks are striving to manage the increasing expenses linked to regulatory compliance, which also encompass the costs associated with adopting FedNow. For example, Know Your Customer (KYC) regulations for customer onboarding now represent 30% of the cost of customer acquisition for FIs, a 28% increase over the last 24 months. Adding to the rising expenses of adhering to regulations is the continuous need for financial institutions to make adjustments to their already disjointed technology and isolated operations.\n\nCompliance constraints can propel innovation\n\nSo, how can banks and fintechs forge ahead with an ambitious product development pipeline if hindered by potential regulatory compliance gaps and their associated costs? According to findings from a report on innovation by Harvard Business Review, “when there are no constraints on the creative process . . . they go for the most intuitive idea that comes to mind rather than investing in the development of better ideas. Constraints, in contrast, provide focus and a creative challenge that motivates people to search for and connect information from different sources to generate novel ideas.”\n\nWhile counterintuitive at first glance, this approach leverages regulatory compliance constraints as catalysts for enhanced innovation. By channeling creativity within these boundaries, novel solutions can be devised that not only meet legal requirements but also spark ingenuity and drive progress.\n\nCompliance-by-design for innovation\n\nBanking leaders who intend to introduce fresh services via FedNow have a few integration options. They can either establish a direct connection to the platform, have their service providers connect on their behalf, or collaborate with fintech providers to onboard these services. This initiative requires their compliance officers and product managers to navigate the Federal Reserve’s security standards, anti-money laundering (AML) rules, and reporting obligations. It’s also worth noting that the blockchain industry’s SEC-necessitated slowdown on pushing forth digital asset payment offerings and tokenized clearing and settlement products may not last forever; for instance, PayPal has introduced stablecoins for peer-to-peer payments.\n\nConsidering the ever-evolving regulatory landscape, FIs cannot afford to rush into any new product or service launches without considering current and emerging rules first. To alleviate this complexity, we are seeing a new market construct for regulatory compliance emerge — compliance-by-design.\n\nConnecting compliance with product strategy\n\nIncorporating compliance as a foundational aspect of the innovation strategy compels FIs to shape their processes with an external perspective. This approach propels innovation by focusing on the customer’s viewpoint and promoting a more efficient and straightforward method. Instead of viewing compliance as a defensive measure, it’s about delivering strategic thinking from the top down in an organization through collaboration and communication. Deloitte found that “while every organization may want to dynamically adapt to change and succeed, those acting proactively now by linking their strategic goals with regulatory expectations will likely lead.”\n\nIntegrating compliance into product development within the cloud solution strategy is crucial. This proactive approach helps mitigate potential challenges and pitfalls that could otherwise arise. By addressing compliance from the outset, a stronger foundation for successful and sustainable solutions can be built.\n\nFaulty models of regulatory compliance\n\nThere are three models rife with compliance pitfalls associated with introducing new digitally transformed products that result in increased manual workload, prolonged customer onboarding, and increased costs.\n\nBuy-to-build\n\nSome are turning to low-code tooling platforms around their existing stovepipe technology stacks to develop, implement, and support financial crime regulation requirements from scratch. Instead of sourcing a purpose-built solution for a problem, this cobbled together approach using configurable solutions in an unconfigured way or in an inappropriately configured way most often results in high capitalization on the balance sheet and a cannibalization of discretionary spend on revenue-driven investments. If the tissues already exist, why would you create new ones when you can just focus on building the banking products that matter to your client base? The main risk of this approach is the inability to achieve the desired outcome due to complexity, unanticipated costs, and time.\n\nFrankenstein Bankenstein systems\n\nSome try a “buy-to-break” approach of taking a core system to solve an immediate problem and then dismantling it for a noncore capability. This point-solution-style approach is not extensible, so FIs cannot easily add new capabilities to keep up with fast-paced innovation. This approach becomes costly to support because it uses tools to do things that they were never intended to accomplish, creating broken systems that fail to achieve the desired objective efficiently.\n\nCompliance policy “over-clubbing”\n\nLike a golfer who chooses the wrong club and over-hits beyond the green, major banks using legacy systems will sometimes over-club from a compliance standpoint by layering in different types of compliance policies until it becomes a convoluted mess of legacy issues. They layer regulatory policies over time, creating a massive volume of tasks and processes that become ever more divergent from the true underlying risk of that entity. The net result is that the costs will continue to increase, the processes will become more manual to operate, and the risk profile increases unnecessarily.\n\nThe compliance-CX connection to lead the future of finance\n\nOnly by using regulatory constraints as a framework for true innovation can FIs survive and thrive as pioneers in an already competitive, customer-driven ecosystem. FIs with a compliance-by-design innovation mindset will expose these build-to-buy, Bankenstein, and compliance over-clubbing pitfalls before they can cause damage. They can prevent compliance from harming the North Star of customer experience that the new offerings are designed to enrich. Through this construct, the institution is no longer viewing compliance as an outcome in isolation, but as a core operating principle of innovation, driving the customer experience.\n\nThe fusion of fintech and traditional banking through strategic partnerships and software is proving to be the key catalyst for future growth, allowing FIs to harness the power of digital innovation while retaining their stronghold on intermediation and distribution. As this formidable alliance continues to redefine the end-user experience and revolutionize markets, the future belongs to FIs that envision compliance as the stepping-stone to progress, enabling them to confidently forge ahead and carve their path to sustained success in the financial world of tomorrow."}