{"url": "https://techcrunch.com/2024/08/29/meta-now-allows-preteens-to-explore-horizon-worlds/", "title": "Meta now allows preteens to explore Horizon Worlds with parent’s permission", "authors": ["Lauren Forristal", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-08-29T00:00:00", "text": "Meta is now letting preteens with parent-managed accounts explore different experiences in its online virtual reality (VR) platform, Horizon Worlds, with certain restrictions in place.\n\nThe company announced that parents will soon be able to approve age-appropriate worlds they’d like their preteens (aged 10 to 12) to experience, including hanging out in The Space Station, exploring The Aquarium and playing the Spy School racing game. Preteens can either request which world they’d like to access, or parents can go through the list and select specific ones to grant permission.\n\nMeta has also implemented additional safety measures that aim to ensure kids are protected. For instance, there is a new rating system — 10+, 13+ or 18+ — that signals which VR world is appropriate for younger users. This allows parents to approve all 10+ rated worlds at once, making 18+ worlds no longer visible to preteens. Also, there are no follower suggestions, and the preteens’ status and visibility settings are set to show as “offline” to others by default — unless parents manually enable them.\n\nAdditionally, the “Personal Boundary” setting is permanently on, which gives avatars a bubble with a radius of two virtual feet, preventing people from coming too close to them.\n\nThe announcement follows Meta adding the ability for parents to individually approve contacts that their child can chat with and invite to join them in VR experiences. Another recent update prompts anyone with a Meta Quest 2 or 3 headset to re-enter their birthday before using the device.\n\nParent-managed accounts for preteens have been available since June 2023.\n\nDespite these new safety measures, some parents and guardians will likely still have doubts that Meta will protect their children, given the numerous accusations that the company fails to keep the age group safe on its platforms.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nEarlier this year, Meta was caught purposely promoting its messaging platforms to underage users even though it was aware of the inappropriate content exchanged between adults and kids, as per internal documents used in a lawsuit filed by the New Mexico Department of Justice. Another lawsuit filed by 42 U.S. state attorneys accuses Meta of intentionally designing its products to attract children, which negatively impacts their mental well-being."}