{"url": "https://techcrunch.com/2025/04/22/social-media-is-not-wholly-terrible-for-teen-mental-health-study-says/", "title": "Social media is not wholly terrible for teen mental health, study says", "authors": ["Amanda Silberling", "Senior Writer", "Cindy Zackney", "Theresa Loconsolo", "Anthony Ha", "Maxwell Zeff", "Kirsten Korosec", "Sarah Perez", "Sean O'Kane", "Tim De Chant"], "publication_date": "2025-04-22T00:00:00", "text": "We know that social media can be harmful to teens. Meta has found in its own research that Instagram makes body image worse for one in three teen girls, and Snapchat has been sued several times for not doing enough to mitigate cyberbullying. Even the former U.S. Surgeon General issued an advisory on the risk of youth social media use. But a new report shows how social media can sometimes have positive impacts on teenagers, despite its harms.\n\nAccording to a study conducted by the Pew Research Center, 74% of U.S. teens said social media makes them feel more connected to their friends, with 63% saying that online platforms give them a place to express their creativity.\n\nAs the U.S. government tries to pass legislation targeted at changing teens’ experience online, this data shows how some teens find social media to be a positive influence.\n\nA possible explanation for this data could be that teens feel more free to express themselves online than they may in school or at home.\n\nOne study conducted by the Trevor Project showed that 53% of young LGBTQ people of color felt safe and understood on TikTok, followed by Discord (43%) and Instagram (41%). These online communities contribute to positive mental health outcomes. The same respondents were 20% less likely to have attempted suicide in the previous year if they had reported feeling safe in an online space.\n\nIn Pew’s own study, 34% of teens reported that they sometimes get information about mental health on social media, with 63% saying that it’s an important way that they find such information.\n\nThese statistics don’t tell us if the information teens are finding about mental health is accurate or helpful, but it’s useful data in a time when only 52% of teens said they felt extremely or very comfortable talking to their parents about their own mental health, per Pew.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThis doesn’t mean that social media comes without its drawbacks, and Pew’s study also documents these pitfalls. Yet teens are more concerned with social media’s negative impact on their peers than on themselves. While 48% of teens said social media had a negative impact on people their age, only 14% think that social media has a negative effect on them personally.\n\nThen again, these self-reported statistics don’t always tell the whole story. Though teens say social media is more likely to help their friendships than hurt them, social media hurts their sleep (45%) and productivity (40%)."}