{"url": "https://techcrunch.com/2023/04/03/tencent-horizon-quantum-computing/", "title": "Tencent backs Singapore’s Horizon Quantum Computing in $18M round", "authors": ["Rita Liao", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-04-03T00:00:00", "text": "Quantum computers have the potential to carry out highly complicated calculations in minutes that would have taken classical computers thousands of years to work out. But much of the industry is still in its infancy, partly because of a lack of domain experts and software tools that match the progress of quantum hardware.\n\nNow, companies are working to simplify the process of developing quantum software applications so programmers don’t actually need to understand the underlying quantum mechanics. One of the early-stage startups making such an effort is Singapore-based Horizon Quantum Computing, whose tools can automatically construct quantum algorithms based on programs written in classical programming languages.\n\nThe company recently picked up $18.1 million in a Series A round from Tencent along with other investors, boosting its equity financing to around $21.3 million. Other investors in the Series A round included Sequoia Capital India, SGInnovate, Pappas Capital and Expeditions Fund.\n\nThe money will be used to fund product development and its expansion in Europe, where the company is planning to open an office in Dublin, Ireland. The startup is also scheduled to launch the early access program of its developer tools later this year.\n\nWhile Singapore is more widely known as a financial hub, it has also been one of the most proactive governments in supporting quantum technologies. The Center for Quantum Technologies, where Horizon Quantum Computing’s founder and CEO Joe Fitzsimons used to be a professor, was set up under the city-state’s Research Centres of Excellence program to advance research in the cutting-edge field.\n\n“When I made the jump from academia, Singapore already had the right talent [for quantum computing] and there was access to capital,” said Fitzsimons, who earned a PhD from University of Oxford.\n\nFriendly ground\n\nSingapore is also less likely to impose export restrictions on technologies, reckoned the founder, who said he doesn’t want his company to be barred from selling in other markets like the European Union.\n\nBeing in a politically neutral country like Singapore is increasingly important in a world where businesses become caught in the tech war between the U.S. and China and lose access to supply chains. Launching from a neutral home base is now seen as a prerequisite for many tech firms, including quantum computer builders, who rely on components sourced from around the world.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nTencent’s investment in Horizon Quantum Computing is purely financial, so it won’t entail any transfer of sensitive data, the founder noted. The startup took Tencent’s investment because the giant is an “expert” in the area, he said.\n\nIndeed, the social networking and gaming giant showed a keen interest in the field when it opened its quantum research lab in 2018. Ling Ge, Tencent’s chief representative in Europe and the person who oversaw the deal with Horizon Quantum Computing, has known Fitzsimons since her years in Oxford, where she studied quantum computing.\n\n“At Tencent, we take a long-term perspective on quantum. In our own quantum lab, we are focused on fundamental research, first-principles simulations and quantum algorithms, and how these might serve enterprise customers,” said Ge at an industry event last year.\n\n“In terms of investments, we take a science-driven approach. One of the challenges in investing in quantum is what we call the ‘black box’ paradox. The challenge of evaluating early-stage deep tech companies in areas like quantum, nuclear fusion or biotech is difficult because the core technology is in its early proof-of-concept phase. It is hard to evaluate and understand at what stage of maturity it really is.\n\n“Therefore, we take appropriate steps to mitigate the risks of this black box paradox depending on the investment stage. This is primarily achieved through our deep technical expertise, which allows us to really understand what is being developed and its maturity,” she said.\n\nThe story was updated on April 3, 2023 to clarify the founder’s view on export controls."}