{"url": "https://techcrunch.com/2021/10/11/south-africas-telkom-ditches-netflix/", "title": "South Africa’s Telkom ditches Netflix", "authors": ["Annie Njanja", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-10-11T00:00:00", "text": "South Africa’s telecommunication provider Telkom SA SOC Ltd has since October discontinued Netflix Inc. from its phone and internet set-top box, said a Bloomberg report.\n\nTelkom’s Content Executive Wanda Mkhize said in a statement that the partnership between the two firms would not be renewed and declined to provide further details, Bloomberg reported.\n\nEfforts to get a comment from Telkom were unsuccessful but in a separate interview, Mkhize said that Telkom is exploring other ways, like a separate set-top box, its customers can access the Netflix streaming service.\n\nNetflix has been exploring growth opportunities across Africa over the last few years in the hope of growing its subscriber base and revenues. It’s not clear whether it has plans to build a different route to consumers and existing subscribers in South Africa now that its relationship with Telkom has ended.\n\nLast month, the company announced a free plan, available on Android mobile phones, in Kenya to attract new subscribers — who have access to “about one-quarter of its TV shows and movies”.\n\nNetflix, in a bid to win and retain subscribers across Africa, now features content produced in various markets across the continent, including South Africa’s “Queen Sono”, Kenya’s “Sincerely Daisy” and Nigeria’s “Two weeks in Lagos”.\n\nThe video streaming service is looking to tap 303 million people, about 28% of the population in sub-Saharan Africa, connected to mobile internet according to the 2021 GSMA mobile economy report. The number of people connected to mobile internet is expected to grow to about 40% of this population by 2025, offering a bigger market to internet-based businesses like Netflix.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nCheaper and faster internet across the continent has provided a space for video streaming services like Netflix and Amazon.inc to gain a foothold across the continent.\n\nNetflix still has another partner in the country. MultiChoice Group Limited, the continent’s largest pay-TV provider, now offers Netflix and Amazon.Inc as part of its paid video services in South Africa after signing deals with the two firms mid last year. The move aims to retain MultiChoice’s subscriber numbers, creating more of a moat around its own budget streaming service, Showmax, introduced in 2015."}