{"url": "https://techcrunch.com/2024/07/17/shaped-raises-8m-series-a-and-launches-its-self-serve-recommendations-and-search-service/", "title": "Shaped raises $8M Series A and launches its self-serve recommendations and search service", "authors": ["Frederic Lardinois", "Kirsten Korosec", "Tim De Chant", "Kyle Wiggers", "Cindy Zackney", "Amanda Silberling", "Theresa Loconsolo", "Anthony Ha", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-07-17T00:00:00", "text": "Whether it’s an online marketplace, store or social media platform, virtually every site today uses some kind of recommendation service to personalize its offerings. Shaped, which is announcing an $8 million Series A funding round today, wants to make it easier for businesses of all sizes to combine the data they already have with large language models and other recommendation systems to offer a personalized user experience.\n\nIt’s worth noting that Shaped is a developer-first platform. With that, its customers gain a high level of flexibility. This includes choosing data sources, integration methods, language models (e.g. Llama, CLIP, BERT) and scoring mechanisms for recommendations and search results.\n\nImage Credits:Shaped\n\nThe company was founded by CEO Tullie Murrell, CPO Daniel Camilleri and Shai Bruhis (who has since moved on to another venture). Murrell previously worked at Meta/Facebook, where he created the PyTorchVideo project and worked on other video-centric AI projects at Facebook AI Research. Camilleri previously worked at Uber and Afterpay. The two first met about 10 years ago, while participating in a hackathon during their student days in Australia.\n\n“How do we help small businesses build the same kind of hyper-personalized experiences that you’d see in a big tech company? Any of these businesses should be able to do this without having to have thousands of machine learning engineers,” Murrell explained when I asked him about the team’s original vision for Shaped.\n\nToday, Shaped’s customers include brands like the outdoor travel marketplace Outdoorsy, Brazilian grocery delivery app Trela and QVC, which uses it for real-time video recommendations in its mobile app.\n\nDespite launching before the generative AI boom, Shaped was already leveraging many of these cutting-edge techniques due to Murrell’s background in AI research.\n\nImage Credits:Shaped\n\nEarly on, Shaped mostly focused on video personalization, but after going through the Y Combinator program in 2022, the team decided to expand into other areas as well. “Going through [YC], talking to customers and looking at the market size, we realized, ‘hey, it’s not the video personalization that really matters here. Why don’t we sell a horizontal personalization platform that can work for all different kinds of media: language, video and audio,’” Murrell said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nCurrently, the service can pull in data from a wide variety of sources, ranging from data warehouses like Databricks, Google’s BigQuery and Snowflake, to PostgreSQL, MySQL and MongoDB databases, as well as services like Amplitude, Segment, Google Analytics and Mixpanel. Having all of this data — and critically a lot of user interaction data — is what allows developers to build their custom recommendation systems.\n\nImage Credits:Shaped\n\nThe team stressed that its focus is on the developer experience. Shaped doesn’t necessarily cater to a marketing persona but instead aims to give developers the tools and data to build and test these systems. And while the service is mostly code-first, this includes a dashboard that allows them to test their models and examine why the system is giving certain recommendations.\n\nMore recently, Shaped also expanded more deeply into search. “We have all this semantic understanding about the users and content, so it’s actually quite easy for us to add on the search packaging. That’s actually a big part of our focus over the next year, becoming this full discovery platform,” Murrell said.\n\nShaped’s Series A round was led by Madrona Ventures, with participation from Y Combinator and executives and founders from Clickhouse, Docusign, Okta, Rippling and StitchFix.\n\n“We first met Shaped CEO and Co-Founder Tullie Murrell over a year ago and were extremely impressed with his understanding of recommendation systems, having built and researched many of these systems while at Meta,” Madrona’s Karan Mehandru and Sabrina Wu wrote in a blog post today. “He has perfect founder-market fit, deep empathy for the customer, and a nuanced understanding of the market and the opportunities. We’ve also had the pleasure of getting to know Dan, Ben, and the rest of the Shaped team, who bring a wealth of experience from Uber, Apple, and other iconic companies.”"}