{"url": "https://techcrunch.com/2023/10/19/cosmosinnovation/", "title": "Temasek’s Xora backs Cosmos Innovation’s next-generation solar cell technology", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-10-19T00:00:00", "text": "Perovskite silicon tandem solar cell technology is a mouthful, but it’s basically perovskite crystals layered on top of silicon cells. The combination captures energy from the sun more efficiently than traditional silicon cells, creating powerful solar panels. That sounds simple enough, but designing an efficient perovskite silicon tandem solar cell isn’t easy because of its multi-layer architecture. A Singapore-based company called Cosmos Innovation is making the process more efficient by using AI to optimize the design of perovskite silicon tandem solar cells and is using its tech to build a self-learning fab.\n\nCosmos exited stealth today with $19.7 million in total funding, including a seed round of $2.88 million raised in 2020 and a Series A of $16.8 million from earlier this year. Its Series A was led by Xora Innovation, the early-stage deep tech investment platform of Temasek. Participants included Innovation Endeavors, the venture firm co-founded by Eric Schmidt; Two Sigma Ventures; DeepMind CEO Demis Hassabis; MIT professor Tomaso Poggio; natural language processing researcher, You.com CEO and AIX Ventures managing partner Richard Socher; and Western Technology Investments.\n\nCosmos relies on Mobius, its AI recipe optimization platform, to accelerate the development of its solar cells. Created by Cosmos, Mobius has been used in sectors including solar, silicon carbide, advanced data center chips and advanced packaging. It is key to Cosmos’ ambition to create the world’s first self-learning fab in the solar and semiconductor space. Instead of manual, trial-and-error based processes, Mobius uses AI to speed the experimental design, test and iteration loop of semiconductors.\n\nThe startup was founded in 2020 by CEO Vijay Chandrasekhar and CTO Joel Li. Before Cosmos, Chandrasekhar led an AI effort at the Institute for Infocomm Research, part of the Agency of Science, Technology and Research (A*STAR), where he oversaw 150 people and managed a portfolio of AI projects with a focus on semiconductors. Li was former group head at the Solar Energy Research Institute of Singapore and served as an AI team lead at A*STAR, leading the development of AI solutions for manufacturers and R&D institutes. The two met while at A*STAR.\n\nWhen asked to explain perovskite silicon tandem solar cell technology in layperson’s terms, Chandrasekhar and Li said that it replaces conventional solar cells currently on the market. Conventional solar cells use silicon to absorb light. When layered on top of silicon, perovskite, a crystal that occurs in nature or is manmade, captures different parts of the solar spectrum. That makes it more efficient than conventional solar cells.\n\n“The big, big, big market opportunity is because silicon technology is reaching its fundamental limits,” said Chandrasekhar. “There’s a big trillion-dollar opportunity going into the 2030s and we wanted to drive the next S curve in solar, which is perovskite silicon tandem.”\n\nSome of the challenges researchers have to solve before perovskite silicon tandem solar cell tech can be commercialized include stability and scaling up the technology, says Li.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThere are three main market segments for perovskite silicon tandem solar cell tech. The first are residential rooftop panels. Then there’s commercial and industrial, or panels placed on top of facilities and warehouses. The third one is power plants that generate electricity and feed it into the grid. Cosmos’ founders say one of the advantages of perovskite silicon tandem solar cell tech is that it takes less space, since it is more efficient.\n\n“Every bit of efficiency is going to move the needle massively on the amount of electricity you can generate,” said Chandrasekhar. “Perovskite silicon tandem is disruptive to silicon in these area-constrained applications.”\n\nPerovskite silicon tandem tech’s multi-layer architecture means it is more difficult to design, with many different variations. As a result, researchers need to spend a lot of time figuring out the best recipe for peak cell efficiency and stability. Mobius is meant to take a lot of the guesswork out of this process and make it less labor-intensive to create cost-effective and high-efficiency solar cells by figuring out the right combination of materials, processes and architecture.\n\nThe company claims it has already seen a 10x acceleration in process recipes, along with improvements in target performance with top semiconductor companies. Cosmos worked on 10 different problems with leading semiconductor and solar companies (their names can’t be disclosed) and Li says “we’ve shown time and time again our AI technology can accelerate process optimization.” It’s been used on applications like solar silicone carbide, front-end transistors and chiplets.\n\nChandrasekhar says Mobius is Cosmos’ key to setting itself apart from competitors in the perovskite silicon tandem space, like Oxford PV and CubicPV, which is backed by Bill Gates’ Breakthrough Energy Ventures.\n\n“At this point, there is an arms race to build this technology. This is the single most disruptive shift in solar since the first silicon solar cell was invented in Bell Labs 50 years ago,” he says. “There’s an arms race and big platform shift, which enables new startups like us to enter the race. There’s a group of perovskite silicon tandem startups and of course the big incumbents are also looking into it.” But Chandrasekhar added that Cosmos’ advantage is that the company began as an AI company and then decided to build next-generation semiconductors.\n\nCosmos’ funding is being used to accelerate its R&D process. Its go-to-market strategy focuses on its initial pilot customers and the premium end of the market, including area-constrained applications. It is currently building early prototypes. Cosmos is also working on its self-learning fab, which Chandrasekhar describes as Mobius layered on top of hardware, and is already running in Singapore.\n\nIn a quote about the investment, Xora Innovation managing director Phil Inagaki said, “Cosmos Innovation has assembled some of the world’s leading minds in AI, semiconductor manufacturing and solar to create Mobius — the first AI platform that enables self-learning fabrication of complex silicon devices. The application of Mobius to perovskite silicon tandem solar cells promises to deliver more cost-effective, reliable and efficient modules on an accelerated timeline.”"}