{"url": "https://techcrunch.com/2025/03/25/quoras-poe-now-offers-an-affordable-subscription-plan-for-5-month/", "title": "Quora’s Poe launches its most affordable subscription plan for $5/month", "authors": ["Lauren Forristal", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-03-25T00:00:00", "text": "Poe, Quora’s chatbot app, launched one of its most affordable subscription options on Tuesday, priced at just $5 per month.\n\nIn addition, the company introduced its highest-priced plan at $250 per month, designed for users who need to send a large volume of messages on Poe.\n\nPoe allows users to utilize several AI-powered bots — including DeepSeek-R1, GPT-4o, Claude 3.7 Sonnet, o3-mini, ElevenLabs, and more — in one place. It operates on a point system, enabling users to spend points across different models, with each bot having its own point cost per message.\n\nUnder the new $5/month plan, users can spend up to 10,000 points per day. In contrast, the $250/month tier offers 12.5 million points, which the company says is better for more “expensive” models, such as GPT-4.5, OpenAI’s o1-pro, and Google DeepMind’s Veo 2.\n\nBy popular demand, we are introducing two new subscription options today, at $5/month and $250/month. These align Poe with two simultaneous trends in AI: normal models are getting cheaper and the most advanced models are getting more expensive. (1/5) pic.twitter.com/1sUqOMdWfs — Poe (@poe_platform) March 25, 2025\n\nWith the introduction of these two new subscription plans, users now have a wider variety of options, which the company says was highly requested.\n\nPreviously, the least expensive tier was $20 per month, which provided 1 million points. A free plan is also available, but users can only ask a limited number of questions each day.\n\nPoe is available on iOS, Android, Mac, and Windows."}