{"url": "https://techcrunch.com/2025/04/09/nuros-106m-raise-backs-its-shift-from-delivery-robots-to-licensing-autonomy-tech/", "title": "Nuro’s $106M raise backs its shift from delivery robots to licensing autonomy tech", "authors": ["Rebecca Bellan", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-04-09T00:00:00", "text": "After months of hearty marketing efforts and large-scale technology demos across the U.S., Nuro has secured $106 million in fresh funding to help scale its autonomous driving technology and advance commercial partnerships.\n\nThe Series E round brings Nuro’s total funding raised to $2.2 billion and its valuation to $6 billion. That’s a drop from the $8.6 billion post-money valuation Nuro secured after its $600 million Series D in 2021, but most startup valuations have come down from the highs seen during the era of easy money.\n\nUsually, a down round can be cause for concern, as it might reflect diminished investor confidence among slower-than-expected progress. That said, it’s a tough funding environment out there. It’s also possible that in Nuro’s case, the company may need less capital as it pursues a recent business pivot that now focuses on licensing its self-driving technology to automotive OEMs, commercial delivery fleets, and ride-hail companies.\n\n“Our last round was at the end of 2021, at the peak of the market. We feel very good about this valuation and the conviction it shows in our new go-to-market strategy,” Dave Ferguson, co-founder and president of Nuro, told TechCrunch. “We’ve been operating efficiently for the past several years and are now on a capital-efficient path forward, building a strong and durable business alongside our partners.”\n\nTechCrunch reported on Nuro’s shift in strategy in the fall of last year.\n\nNuro’s previous go-to-market plan revolved around building and operating cute on-road delivery robots that could carry only goods, not passengers, for partners like Domino’s. But building vehicles is expensive work, and Nuro was burning cash fast.\n\nAfter several rounds of layoffs and putting its manufacturing plans on hold, Nuro decided to focus instead on beefing out its self-driving technology, which it had been continuously testing in California and Texas. In May 2023, Nuro’s founders said in a blog post that advancements in AI would accelerate the company’s autonomy progress, which would extend its runway from 1.5 years to 3.5 years.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThis new round seems to extend that runway a little further. A Nuro spokesperson told TechCrunch the round will support commercial expansion plans through 2027.\n\nDespite the down round, it’s a good sign for Nuro that its backers are mostly existing institutional investors — like T. Rowe Price Associates, Fidelity Management & Research Company, Tiger Global Management, Greylock Partners, and XN LP — as well as strategic partners.\n\n“We’re excited to see strong investor enthusiasm for our Series E,” said Jiajun Zhu, co-founder and CEO of Nuro, in a statement. “Our technology, years of experience with driver-out Level 4 deployments, and focus on licensing uniquely position us to help automakers, mobility platforms, and commercial fleets accelerate their autonomy roadmaps.”\n\nWhile Nuro still isn’t sharing which strategic investors have joined the round, the company has existing relationships with Uber and Toyota through its investor Woven Capital, the venture arm of Toyota.\n\nNuro’s new business model puts it in direct competition with startups like U.K.-based Wayve, which also hopes to see its technology powering everything from personal autonomous vehicles to robotaxi fleets.\n\nThis article has been updated with more information about Nuro’s runway and a statement from Nuro’s president and co-founder Dave Ferguson.\n\nCorrection: A previous version of this article incorrectly attributed Nuro’s projected runway. We regret the error."}