{"url": "https://techcrunch.com/2025/03/26/a-new-social-app-is-fighting-rage-bait/", "title": "A new social app is fighting rage-bait", "authors": ["Amanda Silberling", "Sarah Perez", "Rebecca Bellan", "Kyle Wiggers", "Aisha Malik", ".Post-Authors-List__Authors --Font-Size Var", "Align-Items Center Display Flex Gap Var", ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var", "Border Solid Var --Wp--Custom--Color--White", "Border-Radius"], "publication_date": "2025-03-26T00:00:00", "text": "In Brief\n\nSez Us, a social app founded by Democratic strategist Joe Trippi, is trying to build a platform without rage-bait.\n\nRage-bait refers to any posts that are intended to stoke controversy. This might be an intentionally controversial political take, or it can be a wholly fabricated scenario designed to farm engagement (e.g., a satirical creator got 1.5 million views on a TikTok where she claims to file for divorce after her husband booed Taylor Swift).\n\nMost existing social networking apps incentivize rage-bait, including Instagram, X, TikTok, and YouTube. These platforms have programs for creators that pay them based on how many views they get, and enraging content tends to draw more attention.\n\nSez Us wants to break this cycle by allowing users to rate other users’ posts for approval, influence, insightfulness, relevance, and politeness. The hope is that users will think twice before inciting an argument or making inflammatory statements; instead, the idea is to encourage civil discourse.\n\nChanging the nature of the social internet is easier said than done, and Sez Us may be more of a feature than a product. But that doesn’t mean other platforms can’t learn from these experiments in community-driven moderation."}