{"url": "https://techcrunch.com/2019/11/15/youve-heard-of-crispr-now-meet-its-newer-savvier-cousin-crispr-prime/", "title": "You’ve heard of CRISPR, now meet its newer, savvier cousin CRISPR Prime", "authors": ["Sarah Buhr", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2019-11-15T00:00:00", "text": "CRISPR, the revolutionary ability to snip out and alter genes with scissor-like precision, has exploded in popularity over the last few years and is generally seen as the standalone wizard of modern gene-editing. However, it’s not a perfect system, sometimes cutting at the wrong place, not working as intended and leaving scientists scratching their heads. Well, now there’s a new, more exacting upgrade to CRISPR called Prime, with the ability to, in theory, snip out more than 90 percent of all genetic diseases.\n\nJust what is this new method and how does it work? We turned to IEEE fellow, biomedical researcher and dean of graduate education at Tuft University’s school of engineering Karen Panetta for an explanation.\n\nHow does CRISPR Prime editing work?\n\nCRISPR is a powerful genome editor. It utilizes an enzyme called Cas9 that uses an RNA molecule as a guide to navigate to its target DNA. It then edits or modifies the DNA, which can deactivate genes or insert a desired sequence to achieve a behavior. Currently, we are most familiar with the application of genetically modified crops that are resistant to disease.\n\nHowever, its most promising application is to genetically modify cells to overcome genetic defects or its potential to conquer diseases like cancer.\n\nSome applications of genome editing technology include:\n\nGenetically modified mosquitos that can’t carry malaria.\n\nIn humans, “turning on” a gene that can create fetal type behaving cells that can overcome sickle-cell anemia.\n\nOf course, as with every technology, CRISPR isn’t perfect. It works by cutting the double-stranded DNA at precise locations in the genome. When the cell’s natural repair process takes over, it can cause damage or, in the case where the modified DNA is inserted at the cut site, it can create unwanted off-target mutations.\n\nSome genetic disorders are known to mutate specific DNA bases, so having the ability to edit these bases would be enormously beneficial in terms of overcoming many genetic disorders. However, CRISPR is not well suited for intentionally introducing specific DNA bases, the As, Cs, Ts, and Gs that make up the double helix.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPrime editing was intended to overcome this disadvantage, as well as other limitations of CRISPR.\n\nPrime editing can do multi-letter base-editing, which could tackle fatal genetic disorders such as Tay-Sachs, which is caused by a mutation of four DNA letters.\n\nIt’s also more precise. I view this as analogous to the precision lasers brought to surgery versus using a hand-held scalpel. It minimized damage, so the healing process was more efficient.\n\nPrime editing can insert, modify or delete individual DNA letters; it can also insert a sequence of multiple letters into a genome with minimal damage to DNA strands.\n\nHow effective might Prime editing be?\n\nImagine being able to prevent cancer and/or hereditary diseases, like breast cancer, from ever occurring by editing out the genes that are makers for cancer. Cancer treatments are usually long, debilitating processes that physically and emotionally drain patients. It also devastates patients’ loved ones who must endure watching helpless on the sidelines as the patient battles to survive.\n\n“Editing out” genetic disorders and/or hereditary diseases to prevent them from ever coming to fruition could also have an enormous impact on reducing the costs of healthcare, effectively helping redefine methods of medical treatment.\n\nIt could change lives so that long-term disability care for diseases like Alzheimer’s and special needs education costs could be significantly reduced or never needed.\n\nWhere did CRISPR/prime editing “come from?”\n\nScientists recognized CRISPR’s ability to prevent bacteria from infecting more cells and the natural repair mechanism that it initiates after damage occurs, thus having the capacity to halt bacterial infections via genome editing. Essentially, it showed adaptive immunity capabilities.\n\nWhen might we see CRISPR Prime editing “out in the wild?”\n\nIt’s already out there! It has been used for treating sickle-cell anemia and in human embryos to prevent HIV infections from being transmitted to offspring of HIV parents.\n\nSo, what’s next?\n\nIEEE Engineers, like myself, are always seeking to take the fundamental science and expand it beyond the petri dish to benefit humanity.\n\nIn the short term, I think that Prime editing will help generate the type of fetal like cells that are needed to help patients recover and heal as well as developing new vaccines against deadly diseases. It will also allow researchers new lower cost alternatives and access to Alzheimer’s like cells without obtaining them post-mortem.\n\nAlso, AI and deep learning is modeled after human neural networks, so the process of genome editing could potentially help inform and influence new computer algorithms for self-diagnosis and repair, which will become an important aspect of future autonomous systems."}