{"url": "https://techcrunch.com/2022/07/17/gambling-on-the-future-of-loot-boxes/", "title": "As regulation heats up, will gaming studios’ gamble on loot boxes pay off?", "authors": ["Karan Bhasin", "Project Manager", "Tc", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2022-07-17T00:00:00", "text": "You’d be hard pressed to find a game that doesn’t include some form of microtransactions these days, especially in mobile games. It just makes sense for gaming companies — an immensely lucrative source of revenue, the microtransactions market was worth at $60 billion in 2021, and projected to hit $106 billion by 2026.\n\nTypically offered as in-game collectibles, currencies or chance-based loot boxes, microtransactions are now better received than they were a few years ago. Loot boxes, which are a way for players to receive random in-game rewards in exchange for real money, have been disparaged for a while now, and they’re now increasingly subject to government scrutiny.\n\nLoot boxes have become an issue because they encourage spending real money for a miniscule chance at obtaining valuable in-game items, more often than not leaving players with nothing to show, except a desire to continue gambling for better items. Companies have been known to employ predatory sales tactics to sell loot boxes, and in the process, introduce to minors an avenue to gambling. Despite Electronic Arts’ (EA) insistence that loot boxes are not gambling, and are, in fact, “surprise mechanics,” several studies have shown there is a link between loot boxes and gambling addiction.\n\nRed tape redemption\n\nWhen Belgium banned loot boxes in 2018, it looked like the first domino had fallen, and further regulation from other countries would follow soon. The ensuing response was sluggish, though, despite countries like the U.K. agreeing that loot boxes are an issue that needs to be addressed.\n\nOne of the biggest hurdles faced by countries attempting to regulate loot boxes is that they do not fit their present definitions of what constitutes gambling, allowing companies to offer them and continue operating outside traditional gambling regulations.\n\nThe Netherlands, following in the footsteps of Belgium’s ban, tried to get the gears moving as well by fining Electronic Arts in 2019 over the inclusion of loot boxes in its popular FIFA franchise. This fine was overturned earlier this year after an appeal.\n\nEA couldn’t celebrate its win for long, though, as the Netherlands has now pushed to update its legal definition of gambling to ensure better regulation of loot boxes. It remains to be seen if this results in an outright ban, or leads to EA requiring a gambling license and all the regulation that goes with it. When it does happen, it’s likely that EA will simply remove the offending loot boxes from the games sold in the Netherlands, similar to its response to the ban in Belgium.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nActivision Blizzard opted for a different route with its new mobile game Diablo Immortal, by simply not releasing the game in Belgium and the Netherlands. The company’s decision has been vindicated, as the game made nearly $50 million in its first month. It will be interesting to see how companies will respond to similar regulations in bigger markets.\n\nShould similar bans and regulations be enforced globally, the video game industry won’t likely be affected very much. However, it will severely impact the earnings of companies that have bet heavily on loot boxes.\n\nTo EA or not to EA\n\nGiven the controversy around loot boxes, a lot of developers and publishers have moved towards allowing players to buy exactly what they want instead of leaving it to chance.\n\nThe mobile gaming market, which relies heavily on microtransactions, has enough diversity in microtransaction offerings to remain relatively unscathed if loot boxes are regulated globally. Measures like China’s decision to implement a maximum monthly spending limit on microtransactions for minors is more likely to wreak havoc on the mobile gaming industry, if other markets adopt a similar approach.\n\nEA has fought tooth and nail against any attempted regulation of loot boxes, and it looks like it will continue to do so. After all, loot boxes drew in a cool $1.6 billion from FIFA alone in 2021 — for context, EA’s net revenue for that period was $5.6 billion. It isn’t difficult to see why the company is so adamant on keeping its golden goose going as long as it can.\n\nSmaller studios, who develop their games without the support of big name publishers, have generally adopted a different approach. They typically implement a free-to-play (F2P) model for mobile games that encourages users to purchase microtransactions. Of the top 10 most downloaded mobile games of 2021, half were made by smaller studios, and all included some form of microtransactions. Interestingly, most games from such studios do not include loot boxes.\n\nPaid loot boxes aren’t common in games made by smaller studios for traditional platforms like video game consoles and PC. And the majority of games that include microtransactions tend to stick to value-adds, like cosmetics and in-game currency. Successful indie games like Stardew Valley and Hollow Knight eschew all forms of microtransactions entirely.\n\nDespite their allure, a lot of the smaller studios have forgone loot boxes, as they are often wary of having their games delisted in specific regions due to the prospect of regulations. Other studios, though, may want to avoid the controversy around loot boxes altogether.\n\nLeveling up regulation\n\nEthically speaking, it’s clear that there’s a problem here. But given the money that loot boxes bring in, it’s difficult to trust the industry to self-regulate.\n\nIt’s unlikely that other countries will follow Belgium and the Netherlands’ outright bans, but they might be more open to regulation that bars loot box sales to minors, as proposed by Australia.\n\nOf course, such regulations are difficult to enforce, and slapping an 18+ sticker on a game and calling it a day won’t do much to deter parents from buying a sports game for their children. Once the game has been bought, there’s little that can be done to prevent children from engaging with loot boxes, barring invasive age verification at multiple steps. While an 18+ rating on games that feature loot boxes may raise some awareness, it’s unlikely that anyone following these trends isn’t already aware of the pros and cons of the model.\n\nThere’s hope, though. The wheels are turning slowly, but they certainly are in motion. The topic keeps popping up in legislative discussions across the globe, and it’s likely that we will see some form of regulation in most countries in the coming years.\n\nWhile regulation will certainly slow down the earnings from loot boxes, they will likely continue to remain a lucrative offering, especially since any regulation regarding it (barring an outright ban) will be difficult to enforce."}