{"url": "https://techcrunch.com/2025/01/10/us-government-charges-operators-of-crypto-mixing-service-used-by-north-korea-and-ransomware-gangs/", "title": "US government charges operators of crypto mixing service used by North Korea and ransomware gangs", "authors": ["Lorenzo Franceschi-Bicchierai", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-01-10T00:00:00", "text": "On Friday, the U.S. Department of Justice announced the indictments of Russian citizens Roman Vitalyevich Ostapenko, Alexander Evgenievich Oleynik, and Anton Vyachlavovich Tarasov, accusing them of operating services that helped criminals launder cryptocurrency.\n\nThe three were allegedly involved in operating Bender.io and Sinbad.io, two cryptocurrency mixers “that served as safe havens for laundering criminally derived funds, including the proceeds of ransomware and wire fraud,” principal deputy assistant attorney general Brent Wible, the head of the Justice Department’s Criminal Division, was quoted as saying in a press release.\n\nBlender.io and Sinbad.io were seized in an international law enforcement operation in 2023, and suspected to have been used by North Korean hackers, who have become proficient at stealing and laundering millions of dollars in crypto, as well as ransomware gangs, who profit from extorting financial ransoms from hacked companies..\n\nOstapenko and Oleynik were arrested on December 1, 2024, while Tarasov is still at large, according to the DOJ press release.\n\nThe three “made it easier for state-sponsored hacking groups and other cybercriminals to profit from offenses that jeopardized both public safety and national security,” according to Wible.\n\nOstapenko is accused of money laundering and operating an unlicensed money-transmitting business, while Oleynik, 44, and Tarasov are accused of conspiracy to commit money laundering and one count of operating an unlicensed money-transmitting business — all charges that could lead to a sentence of 30 years in prison."}