{"url": "https://techcrunch.com/2023/05/31/low-code-ml-platform-predibase-raises-another-12-2m/", "title": "Low-code ML platform Predibase raises another $12.2M", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-05-31T00:00:00", "text": "End-to-end machine learning platform Predibase today announced a $12.2 million expansion (led by Felicis) to its $16.25 million Series A funding round from last year. The company also announced that its low-code, declarative ML platform for developers is now generally available.\n\nDuring the beta period, which launched when the company came out of stealth last year, users have trained over 250 models on the platform. Now that the service is generally available, these users can also use Predibase to deploy their own large language models (LLMs) instead of using an API from the likes of OpenAI. Users will also get access to Predibase’s own LudwigGPT LLM — named after the suite of machine learning tools Predibase co-founder Piero Molino launched in 2019 (and not the tragic 19th-century Bavarian king).\n\n“Every enterprise wants to gain a competitive edge by embedding ML into their internal and customer-facing applications. Unfortunately, today’s ML tools are too complex for engineering teams, and data science resources are stretched too thin, leaving the developers working on these projects holding the bag,” said Piero Molino, co-founder and CEO of Predibase. “Our mission is to make it dead simple for novices and experts alike to build ML applications and get them into production with just a few lines of code. And now we’re extending those capabilities to support building and deploying custom LLMs.”\n\nTo do this, the company also today announced its Data Science Copilot, a system that can give developers recommendations on how to improve the performance of their models. Predibase is also launching a free two-week trial version of its platform.\n\nCurrent customers include the likes of Paradigm (which does something with crypto) and Koble.ai (a tool that uses AI to help investors find early-stage investments).\n\nLike most startups at this stage, Predibase plans to use the new funding to expand its go-to-market functions and build out its platform.\n\nBetween low-code/no-code ML platforms from the likes of AWS, Google and Microsoft and plenty of startups in this space, Predibase is operating in an increasingly crowded market. The company argues that its focus on developers and its ability to provide them with easy escape hatches from the low-code environment allows it to stand out."}