{"url": "https://techcrunch.com/2025/04/28/citizen-lab-says-exiled-uyghur-leaders-targeted-with-windows-spyware/", "title": "Citizen Lab says exiled Uyghur leaders targeted with Windows spyware", "authors": ["Lorenzo Franceschi-Bicchierai", "Aisha Malik", "Kyle Wiggers", "Zack Whittaker", ".Post-Authors-List__Authors --Font-Size Var", "Align-Items Center Display Flex Gap Var", ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var", "Border Solid Var --Wp--Custom--Color--White", "Border-Radius", "Height -O-Object-Fit Cover Object-Fit Cover Width .Post-Authors-List__Authors .Post-Authors-List__Author-List Display Flex Flex-Wrap Wrap Gap Var"], "publication_date": "2025-04-28T00:00:00", "text": "In Brief\n\nUnknown hackers last month targeted leaders of the exiled Uyghur community in a campaign involving Windows spyware, researchers revealed Monday.\n\nCitizen Lab, a digital rights research group based at the University of Toronto, detailed an espionage campaign against members of the World Uyghur Congress (WUC), an organization that represents the Muslim-minority group, which has for years faced repression, discrimination, surveillance, and hacking from China’s government.\n\nGoogle alerted some WUC members to the hacking campaign in mid-March, prompting the members to contact journalists and Citizen Lab’s researchers, the report said.\n\nCitizen Lab investigated and found a targeted phishing email sent to members of WUC, impersonating a trusted contact who sent a Google Drive link for a password-protected compressed file containing a malicious version of a Uyghur language text editor.\n\nThe researchers said the campaign wasn’t particularly sophisticated and didn’t involve zero-day exploits or mercenary spyware, but noted that “the delivery of the malware showed a high level of social engineering, revealing the attackers’ deep understanding of the target community.”"}