{"url": "https://techcrunch.com/2025/05/06/meet-posha-a-countertop-robot-that-cooks-your-meals-for-you/", "title": "Meet Posha, a countertop robot that cooks your meals for you", "authors": ["Rebecca Szkutak", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-05-06T00:00:00", "text": "In 2017, Raghav Gupta set out to solve a personal problem: He wanted easy access to the home-cooked meals he grew up eating without having to spend time cooking or spend money on takeout or hiring a private chef. He turned to robotics, which led him to found the startup Posha.\n\nPosha, a former TechCrunch Startup Battlefield company, builds countertop robots that make meals using computer vision. Users scroll through a list of recipes, select the one they want, add the proper amounts of the requested ingredients, and the machine makes the meal from there.\n\nThe process is designed to be customizable and forgiving, Gupta told TechCrunch, so the machine allows people to make substitutions, and Posha still works if a user doesn’t measure their ingredients perfectly.\n\n“It’s like a coffee machine for food,” Gupta said. “So when you want to drink a cup of coffee, you choose a brew of coffee on your coffee machine. You put beans, sugar, and milk in different containers. You tap brew, and out comes a cup of coffee. Posha does something similar, but for food.”\n\nA coffee machine is a good, but not perfect, comparison to Posha, as Posha requires a bit more labor than a coffee maker.\n\nWhile Posha does a substantial amount of the work by cooking these meals, consumers still play an active role in shopping for ingredients and prepping everything that goes into the device. Chopping, especially, can take up a fair amount of a recipe’s cook time.\n\nGupta agreed that some people are just not going to go for a solution that still requires them to do some of the cooking. He said that Posha has found the most success thus far with customers who like to cook two to six times a week anyway and are looking to lighten the load a few of those evenings.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“These people are already spending an hour in the kitchen every single day, deciding what to eat, shopping for ingredients, cooking a meal, [and] cleaning up afterwards,” Gupta said. “We help them shave off at least 70% of this time, so they now end up spending only about 10 to 20 minutes every single day.”\n\nPosha, formerly known as Nymble, originally started out as a robotic arm, Gupta said, but the company’s time in Bosch’s accelerator program prompted them to change course. They learned consumers didn’t want something that moved around their kitchen or that would be hard to clean. The company has kept in close contact with its early customers ever since.\n\n“We have been super focused and super obsessed with customers from day one,” Gupta said. “We don’t use Zendesk to chat with them; we have WhatsApp conversations with over 100 of our customers. Most customers know me personally. I moved to the U.S. in the middle of the pandemic, just to be close to my customers.” That system can’t scale, but clearly works for Posha for now.\n\nGupta said that, so far, Posha has mainly relied on word-of-mouth marketing for the $1,750 direct-to-consumer countertop device. Posha recently raised an $8 million Series A round led by Accel with participation from existing investors, including Xeed Ventures; Waterbridge Ventures; and Binny Bansal, the co-founder of Flipkart; among others.\n\nGupta said that Posha will use the funding to continue to develop the product. In particular, the company wants to add more recipe options and the ability for people to suggest recipe ideas and have generative AI turn those ideas into instructions and add them into the device quickly.\n\nThe company launched its Posha robots in January 2025 and has since sold out of its first batch — and is taking preorders for its second.\n\n“If you look at your microwave, your dishwasher, your refrigerator, at some point in time, these devices were countertop devices,” Gupta said. “They became so indispensable over time in consumer homes that builders started installing these devices in your homes. We feel Posha will have the same fate very soon.”"}