{"url": "https://techcrunch.com/podcast/teslas-bot-non-disclosure-and-why-humanoid-robots-are-taking-off/", "title": "Tesla’s bot non-disclosure and why humanoid robots are taking off", "authors": ["Rebecca Bellan", "Brian Heater", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "Theresa Loconsolo", "Anthony Ha"], "publication_date": null, "text": "At Tesla’s robotaxi reveal event last week, several Optimus humanoid robots mingled with guests, pouring drinks and cracking jokes. Impressive technology, but the vocals and some of the gesticulations appear to have been remotely controlled by humans, something Tesla did not disclose.\n\nOn today’s episode of Equity, Rebecca Bellan chatted with TechCrunch’s hardware editor Brian Heater about Tesla’s Optimus bots, the market opportunity for humanoid robots, and other companies that are leading the charge in this industry.\n\nBrian noted that Tesla was sharing what are essentially advertisements for what the automaker’s tech might be able to do in the future, rather than what it’s capable of doing flawlessly today. He contrasted this with Boston Dynamics, a robotics leader that has taken to showing outtakes of its demo videos to be transparent.\n\nThe two also discussed the increased investment in the humanoid robotics space, and whether that hype cycle will die out in the future as investors realize the path to market is long and expensive.\n\nA March CBInsights report found that funding in 2024 already reached new highs for humanoid robots at $775 million, up from $262 million last year, with just three deals versus 11 last year. PitchBook data suggests funding into humanoid robot companies has reached close to $1 billion as of October.\n\nBrian said humanoid robots are most likely to see applications on factory floors in the coming years. Automakers like BMW plan to deploy startup Figure’s robots at their plants, and Amazon, which has been a huge proponent of robotics for over a decade now, has tested Agility’s digit robot at its warehouses.\n\nThe biggest benefit of humanoid technologies is that “we built the world for ourselves,” Brian said.\n\n“You walk into a factory, and it’s a factory that’s built for a human to work in. And the idea is that you can effectively just slot one of these pieces of technology in there. It’s what they call a brownfield factory…which means you don’t have to start from scratch with the automation aspect of things.”\n\nDown the line, humanoid robots could eventually enter homes, in particular to help older folks with household tasks, which is the mission of Kind Humanoid. But there are more safety concerns involved when robots are interacting on that level with humans. In addition, the technology is much harder to solve when you talk about generalized robotics, rather than a robot performing specific tasks on a production line.\n\nWe talked about all this as well as potential timelines for commercial launch and the growth opportunity investors expect to see in the humanoid robot industry. Have a listen, and let us know what you think!\n\nEquity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday.\n\nSubscribe to us on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod. For the full episode transcript, for those who prefer reading over listening, check out our full archive of episodes over at Simplecast."}