{"url": "https://techcrunch.com/2024/07/25/intron-health-raises-1-6m-pre-seed/", "title": "Intron Health gets backing for its speech-recognition tool that recognizes African accents", "authors": ["Annie Njanja", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-07-25T00:00:00", "text": "Voice recognition is getting integrated in nearly all facets of modern living, but there remains a big gap: Speakers of minority languages and those with thick accents or speech disorders like stuttering are typically less able to use speech-recognition tools that control applications, transcribe or automate tasks, among other functions.\n\nTobi Olatunji, founder and CEO of clinical speech-recognition startup Intron Health, wants to bridge this gap. He claims that Intron is Africa’s largest clinical speech database, with its algorithm trained on 3.5 million audio clips (16,000 hours) from over 18,000 contributors, mainly healthcare practitioners, representing 29 countries and 288 accents. Olatunji says that drawing most of its contributors from the healthcare sector ensures that medical terms are pronounced and captured correctly for his target markets.\n\n“Because we’ve already trained on many African accents, it’s very likely that the baseline performance of their access will be much better than any other service they use,” he said, adding that data from Ghana, Uganda and South Africa is growing and that the startup is confident about deploying the model there.\n\nOlatunji’s interest in health tech stems from two strands of his experience. First, he received training and practiced as a medical doctor in Nigeria, where he saw firsthand the inefficiencies of the systems in that market, including how much paperwork needed to be filled out and how hard it was to track all of it.\n\n“When I was a doctor in Nigeria a couple years ago, even during medical school and even now, I get irritated easily doing a repetitive task that is not deserving of human efforts,” he said. “An easy example is we had to write a patient’s name on every lab order you do. And just something that’s simple, let’s say I’m seeing the patients, and they need to get some prescriptions, they need to get some labs. I have to manually write out every order for them. It’s just frustrating for me to have to repeat the patient name over and over on each form, the age, the date, and all that. … I’m always asking, how can we do things better? How can we make life easier for doctors? Can we take some tasks away and offload them to another system so that the doctor can spend their time doing things that are very valuable?”\n\nThose questions propelled him to the next phase of his life. Olatunji moved to the U.S. to pursue a master’s degree in medical informatics from the University of San Francisco and then another in computer science at Georgia Tech.\n\nHe then cut his teeth at a number of tech companies. As a clinical natural language programming (NLP) scientist and researcher at Enlitic, a San Francisco Bay Area company, he built models to automate the extraction of information from radiology text reports. He also served Amazon Web Services as a machine learning scientist. At both Enlitic and Amazon, he focused on natural language processing for healthcare, shaping systems that enable hospitals to run better.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThroughout those experiences, he started to form ideas around how what was being developed and used in the U.S. could be used to improve healthcare in Nigeria and other emerging markets like it.\n\nThe original aim of Intron Health, launched in 2020, was to digitize hospital operations in Africa through an electronic medical record (EMR) system. But take-up was challenging: It turned out physicians preferred writing to typing, said Olatunji.\n\nThat led him to explore how to improve that more basic problem: how to make physicians’ basic data entry, writing, work better. At first the company looked at third-party solutions for automating tasks such as note-taking and embedding existing speech to text technologies into his EMR program.\n\nThere were a lot of issues, however, because of constant mis-transcription. It became clear to Olatunji that thick African accents and the pronunciation of complicated medical terms and names made the adoption of existing foreign transcription tools impractical.\n\nThis marked the genesis of Intron Health’s speech-recognition technology, which can recognize African accents and can be integrated with existing EMRs. The tool has to date been adopted in 30 hospitals across five markets, including Kenya and Nigeria.\n\nThere have been some immediate positive outcomes. In one case, Olatunji said, Intron Health has helped reduce the waiting time for radiology results at one of West Africa’s largest hospitals from 48 hours to 20 minutes. Such efficiencies are critical in healthcare provision, especially in Africa, where the doctor-to-patient ratio remains one of the lowest in the world.\n\n“Hospitals have already spent so much on equipment and technology … Ensuring that they apply these tech is important. We’re able to provide value to help them improve the adoption of the EMR system,” he said.\n\nLooking ahead, the startup is exploring new growth frontiers backed by a $1.6 million pre-seed round, led by Microtraction, with participation from Plug and Play Ventures, Jaza Rift Ventures, Octopus Ventures, Africa Health Ventures, OpenseedVC, Pi Campus, Alumni Angel, BakerBridge Capital and several angel investors.\n\nIn terms of technology, Intron Health is working to perfect noise cancelation, as well as ensuring that the platform works well even in low bandwidths. This is in addition to enabling the transcription of multi-speaker conversations and integrating text-to-speech capabilities.\n\nThe plan, Olatunji says, is to add intelligence systems or decision support tools for tasks such as prescription or lab tests. These tools, he adds, can help reduce doctor errors, ensure adequate patient care and speed up their work.\n\nIntron Health is among the growing number of generative AI startups in the medical space, including Microsoft’s DAX Express, which are reducing administrative tasks for clinicians by generating notes within seconds. The emergence and adoption of these technologies come as the global speech- and voice-recognition market is projected to be valued at $84.97 billion by 2032, following a CAGR of 23.7% from 2024, according to Fortune Business Insights.\n\nBeyond building voice technologies, Intron is also playing a pivotal role in speech research in Africa, having recently partnered with Google Research, the Bill & Melinda Gates Foundation, and Digital Square at PATH to evaluate popular large language models (LLMs) such as OpenAI’s GPT-4o, Google’s Gemini, and Anthropic’s Claude across 15 countries, to identify strengths, weaknesses, and risks of bias or harm in LLMs. This is all in a bid to ensure that culturally attuned models are available for African clinics and hospitals."}