{"url": "https://techcrunch.com/2025/01/15/loft-orbital-lands-a-fresh-170-million-after-logging-over-500-million-of-bookings/", "title": "Loft Orbital lands a fresh $170M after logging over $500M of bookings", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-15T00:00:00", "text": "Space infrastructure company Loft Orbital has raised $170 million in Series C funding co-led by Tikehau Capital and Axial Partners. Notably, the amount of the Series C financing is greater than the combined $160 million the company has raised since its 2017 inception.\n\nLoft Orbital declined to reveal its valuation. According to PitchBook, its post-money valuation at the time of its last raise in 2021 — a $130 million Series B round — was $550 million.\n\nBpifrance, Foundation Capital, Temasek, and Uncork Capital also participated, which brings the company’s total raised over its lifetime to $330 million.\n\nLoft also declined to reveal hard revenue figures but co-founder and COO Alex Greenberg told TechCrunch that the company has grown revenue by 100% two years in a row.\n\n“We’ve achieved over $500 million of bookings on only $160 million of capital raised prior to this Series C. In an industry known for its capital intensity, we are proud of our capital efficiency,” he added. “Right now we’re really focused on profitability and getting the business to sustainability.”\n\nThe company has sold over 30 satellites and its customers include NASA, Microsoft, Anduril, and BAE Systems, among others. In total, it says it has deployed over 25 customer missions across its five satellites launched to date.\n\nWhen it started in January 2017, the company’s self-described mission was to “make it simple for organizations to deploy and operate missions in space.” In a nutshell, Loft aims to handle the process of deploying and operating customer missions as a service.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIt buys standard satellites from vendors like Airbus and LeoStella and outfits them with payloads from customers, saving them the hassle of purchasing, operating, and managing their own hardware and ground segment network.\n\n“Unlike others in the industry, we’re not designing satellites for specific missions — we’re configuring existing components of our satellite platform,” Greenberg said. “Think of it like Lego building blocks.”\n\nIt also offers “virtual missions,” allowing its customers to deploy their software apps onto a Loft satellite to leverage on-board sensors and compute nodes, analyze data as it is being collected, and run a whole range of use cases.\n\nLoft has been busy as of late. The startup last August announced a joint venture with Abu Dhabi-based Marlan Space that raised over $100 million from a holding company affiliated with an Emirati royal family to grow the region’s domestic satellite manufacturing capabilities.\n\nIt also says it has launched YAM-6, a satellite dedicated to running AI in space.\n\nGreenberg said Loft will use its new capital in two ways. It plans to scale from launching a handful of satellites per year to ten-plus annually. It also wants to expand its virtual missions, expand its AI business where customers can create an AI system in their own cloud (wildfire detection for instance), and deploy it onto a Loft satellite. And he hopes to grow an ecosystem of AI application partners."}