{"url": "https://techcrunch.com/2023/11/16/eqs-thoma-bravo-compliance-tech/", "title": "Maybe compliance tech really is a good startup bet", "authors": ["Alex Wilhelm", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-11-16T00:00:00", "text": "German software company EQS Group is being taken private by Thoma Bravo for about €400 million ($435.1 million) in a deal that represents a massive 53% premium over its pre-announcement value. Shares of EQS are up just under 52% today, implying that the market expects the deal to complete, and at the listed price.\n\nThe Exchange explores startups, markets and money.\n\nRead it every morning on TechCrunch+ or get The Exchange newsletter every Saturday.\n\nWe care about a relatively small PE take-private of a software company that —be honest — you had not heard of until this deal was announced because of the why behind the transaction, and what it could mean for quite a number of startups operating in the regulatory technology (regtech) market.\n\nBriefly, EQS Group is a public company that sells compliance and investor relations software. In the third quarter of 2023, EQS reported 14% revenue growth (year-over-year) to €16.88 million, the addition of €3.00 million worth of new ARR (+50%), and adjusted EBITDA of €2.32 million (+49%). EQS is therefore not massive. In fact, it’s a relatively small company compared to most public software concerns.\n\nSo why is Thoma Bravo splashing out $435 million for it? Because the PE group expects the company to grow lots in the coming years.\n\nFor context, here’s how EQS described its Q3 2023 segment results (emphasis added):\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nRevenue in the Compliance segment increased by 18% in the first nine months of 2023. In the Investor Relations segment, revenue increased slightly by 1%. Annual recurring revenue at Group level amounted to 89% after nine months (previous year: 88%). Achim Weick, founder and CEO of EQS Group AG: “After the whistleblower protection laws came into force in our core markets at the beginning of the third quarter, the number of new customers rose strongly as expected. Our marketing and sales channel is filling up just as strongly. Our focus is therefore now primarily on conversion, the conclusion of contracts with interested parties. In addition, the development of our large partner network is already paying off. We are expecting strong growth in new customers toward the end of the year and over the next few quarters. We are very optimistic that we will achieve our targets for the year.”\n\nCompliance-software revenue is growing far more quickly than the rest of EQS’s business, and legal changes appear to have provided the company with lots of new business pipeline.\n\nThe new whistleblower law it’s referring to is the German Whistleblower Protection Act, which took effect in July. It requires companies with 50 or more workers to establish internal methods for workers to report legal transgressions. That means software, and guess which German software company whose name is a collection of three letters sells just such hosted code? EQS!\n\nThoma Bravo agrees (emphasis added):\n\nAs new regulations like the EU Whistleblowing Directive continue to drive demand for innovative compliance software solutions, EQS will benefit from Thoma Bravo’s software and operational expertise to accelerate product innovation and fully seize the long-term growth opportunities in Europe. To jointly win the European compliance software market, Thoma Bravo’s investment will provide EQS with additional funding for future growth initiatives and capital for potential add-on acquisitions.\n\nThoma Bravo is paying a fat premium to take EQS private ahead of what it anticipates to be a lucrative time for the company’s market segment. Thus, the PE shop can likely relist the company in the future at a higher price.\n\nYeah, but what about startups?\n\nChanges to German law and PE shops trying to get ahead of a buying wave is cool enough, but you don’t read TechCrunch for that stuff. You want to know what this means for startups. I feel the same way.\n\nMy takeaway from the deal is that regtech startups are probably better positioned than I thought. And the startup category is more than a little bit busy. Here are some recent TechCrunch headlines:\n\nHell, back in February we wrote about the matter of compliance and startups for this very column. I am sure that the above list is shockingly partial, but I had seen enough of those headlines and reports for them to resurface when I read the EQS news.\n\nNow, a legal change in the German market is not a global change in regulatory posture. But if you look at the larger world of technology regulation on a national and super-national level (the EU, etc.), are we moving toward or away from more regulation, whether or not you think that that is the right approach? The answer is toward, and we all know it.\n\nSo, if EQS can become suddenly far more valuable thanks to a single legal change, and the regulatory marketplace, imagine the total value in the demand for regulatory software over the next 10 years. Huge, right?\n\nI guess we need to add regulatory news to our regular fare so that we can stay ahead of this particular trend. And given the number of venture rounds that have already piled up in regtech at least, I am already late to it."}