{"url": "https://techcrunch.com/2025/05/08/bosch-ventures-new-270m-fund-is-turning-its-attention-to-north-america/", "title": "Bosch Ventures is turning its attention to North America with new $270M fund", "authors": ["Kirsten Korosec", "Transportation Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-05-08T00:00:00", "text": "The venture arm of Bosch has a new $270 million fund that will continue its tradition of investing in deep-tech startups. This time, however, Bosch Ventures plans to put more of its money into North American startups.\n\nLaunched in 2007, Bosch Ventures is now on its sixth fund. And while the corporate VC is technically a global firm, its focus today is weighted more heavily toward North America.\n\nThe strategy may seem contradictory given this is a region affected by a U.S. administration policy that has led to a U.S. trade war with China, a volatile stock market, and fears of a recession. But Bosch Ventures’ managing director, Ingo Ramesohl, told TechCrunch the deal flow in North America is stronger than ever.\n\n“I see a lot of positive energy,” Ramesohl said. “People are not stopping to innovate and not stopping to disrupt. So for me, it’s really a great time for new investments.”\n\nThe firm, which has offices in Silicon Valley, Boston, Germany, Tel Aviv, and China, typically makes investments between $5 million and $10 million. Ramesohl said the firm will likely make 20 to 25 investments from this fund.\n\n“This is basically a continuation of the success stories of the last funds,” Ramesohl said, when asked which tech sectors he is most interested in.\n\nThe firm is still investing in automotive, climate tech, cybersecurity, semiconductor manufacturing, energy efficiency, and enterprise software. Generative AI, more specifically, applying AI tools to the physical world like manufacturing, is also high on the list.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We are not entirely focusing on GenAI,” Ramesohl said.\n\nStill, AI has been a centerpiece of the manufacturing company since at least 2017, when it established the Bosch Center for Artificial Intelligence. The company has said — and Ramesohl confirmed — that all Bosch products are now developed or produced using AI, a milestone it hit at the end of 2023.\n\n“GenAI is changing a lot, and at the same time, it’s enabling a lot of new businesses, a lot of new innovations,” he said, noting that, in his view, the most promising applications of AI are in operations."}