{"url": "https://techcrunch.com/2024/05/07/honeycomb-insurance-36m-series-b-from-solo-vc-zeev-ventures/", "title": "Honeycomb Insurance grabs $36M Series B from solo VC-led Zeev Ventures", "authors": ["Marina Temkin", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-05-07T00:00:00", "text": "When Itai Ben-Zaken’s first startup failed in 2018, the former BCG consultant and Wharton MBA spent months trying to understand what he could have done differently during the five years he ran the company.\n\nAfter analyzing most of his major decisions, he concluded that while Comprendi, a digital ad recommendation business, was an interesting offering, its biggest mistake was trying to operate in a market with two dominant players: Google and Facebook.\n\nSo when Ben-Zaken started exploring founding his second startup, he vowed not to repeat the same mistake. He looked to start a business in a market divided among many competitors, eventually settling on building a company that offers property and casualty insurance for landlords and condo associations.\n\nThe largest carrier in landlord insurance — Travelers — represented only about 7% of the market, and the rest of the competitive landscape was distributed among 100 smaller providers, Ben-Zaken told TechCrunch.\n\nBen-Zaken wasn’t a stranger to insurance. Before starting Comprendi, he spent four years running Insurance.com at QuinStreet, an operator of white-labeled financial services marketplaces.\n\nHe launched Honeycomb Insurance in 2019, and after spending two years building the company’s computer vision and AI-driven property “inspection” technology, the company sold its first policy in 2021. Ben-Zaken says that Honeycomb’s AI relies on aerial photographs of building roofs, often eliminating the need for costly physical inspections.\n\nThe company raised a $15 million Series A in early 2022 and is currently on track to sell $130 million of insurance premiums in 2024, a threefold increase from last year.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhen Honeycomb was gearing up to raise its Series B earlier this year, one of the first calls Ben-Zaken made was to solo venture capitalist Oren Zeev, who’s known for being one of the largest shareholders in Navan, Houzz, Next Insurance and Tipalti.\n\n“I was blown away by what I saw,” Zeev said about Honeycomb. He agreed to back Honeycomb, but only if Ben-Zaken would agree not to market the deal to other investors.\n\nBen-Zaken didn’t think twice about Zeev’s proposal: He dreamed of having the solo VC as his backer and on Honeycomb’s board since he founded the company.\n\nZeev wrote a $30 million check to Honeycomb, making him the company’s largest shareholder. Other participants in the $36 million Series B that the Chicago-based startup is announcing on Tuesday include new investors Arkin Holdings and Launchbay Capital and returning backers Ibex Investors, Phoenix Insurance, and IT-Farm.\n\nZeev, too, is not a stranger to the insurtech space — he holds a large stake in Next Insurance and was a backer of Hippo Insurance before it went public via a SPAC in 2021 — but he said he is not generally “a fan” of the sector.\n\n“I was not looking for another investment in insurance,” he told TechCrunch. “The bar is very high because I am aware of the challenges.”\n\nBesides the company’s fast growth, what attracted Zeev to Honeycomb is that landlord insurance is a “sleepy” industry ready for innovation, but also the sector is not large enough for insurance giants to want to tackle it. In other words, Zeev isn’t worried that major players will encroach on Honeycomb’s territory, as they did on Ben-Zaken’s first startup.\n\nAccording to Ben-Zaken, the landlord and condo association insurance market continues to be highly fragmented. He says there are two startups in the space: Steadily, which raised a $28.5 million Series B last July, and Obie, which closed on a $25.5 million Series B from Battery Ventures a year ago.\n\nHoneycomb will use its new funding to double its headcount from 90 to 180 employees over the next 18 months, introduce new products, and expand its offerings to new markets.\n\n“We are planning to go beyond landlord insurance,” Ben Zaken said, adding that his company’s goal is to be a one-stop shop for commercial real estate insurance."}