{"url": "https://techcrunch.com/2022/08/22/csi-a-decades-old-fintech-solutions-vendor-agrees-to-be-acquired-for-1-6b/", "title": "Fintech solutions vendor CSI agrees to be acquired for $1.6B", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-08-22T00:00:00", "text": "Showing that the regtech industry remains robust to economic headwinds, private equity firms Centerbridge Partners and Bridgeport Partners today announced plans to acquire publicly traded Computer Services, Inc. (CSI), a provider of payments processing and regulatory compliance services, for $1.6 billion in an all-cash deal. CSI CEO David Culbertson said that the transaction — which works out to $58 per share of CSI’s common stock — will enable the company to execute “strategic plans” to “expand and diversify” CSI’s various product offerings.\n\nCSI might not be a household name. But according to the Paducah, Kentucky-based company’s website, it’s been around in some form or another since 1965, shortly before it began operating a databank processing center in Madisonville. Throughout the 1980s, CSI built a network of data centers, began selling its first PC software and developed what it claims was one of the first online ATM systems. More recent years saw CSI launch a mobile banking solution and products germane to business intelligence and enterprise risk management.\n\nToday, CSI claims to have nearly 2,600 customers and more than 1,100 employees worldwide.\n\n“For more than 57 years, CSI has been known as a leader in innovation and customer service. Centerbridge and Bridgeport have deep experience in technology and financial services as owners and operators,” Culbertson said in a press release.\n\nCenterbridge and Bridgeport note that the deal, if approved by shareholders and regulators as they expect in Q4 2022, will net CSI shareholders a 53% premium over CSI’s closing stock price as of August 19. CSI’s board unanimously approved the plan to take the company private; post-acquisition, its stock will no longer be listed on the public market.\n\n“I am pleased to have this opportunity to partner with Centerbridge on the acquisition of CSI, a company that I have followed closely for decades and have respected as a real leader in financial services and technology,” Bridgeport founder Frank Martire said in a statement. “CSI has always been known for its commitment to its customers, employees, partners and the communities it serves — a reputation that Centerbridge and Bridgeport are committed to maintaining while we work together with David and his team to implement the company’s growth initiatives.”\n\nCompliance angle aside, fintechs continue to attract a large portion of investors’ dollars. Venture capital firms invested $28.8 billion into fintech and crypto companies in Q1 2022, amounting to $1 out of every $5 invested, according to CB Insights. Last year, VCs pumped $132.5 billion into the sector — over double the amount compared to 2020 ($49 billion).\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThere are signs of some turbulence on the horizon, however. A more recent CB Insights report found that fintech and regtech investments declined year-over-year in Q2 2022, reflecting fears of a recession — as well as of rising interest rates and inflation — and the implications for the financial services industry."}