{"url": "https://techcrunch.com/2023/05/24/dataops-live-gets-17-5m-from-snowflake-others-for-devops-style-tools-aimed-at-data-experts/", "title": "DataOps.live gets $17.5M from Snowflake, others for DevOps-style tools aimed at data experts", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-05-24T00:00:00", "text": "DevOps has changed the game for how developers build, deploy, update and monitor applications across their network. Now, an eponymous startup called DataOps.live — which has built a DataOps platform based on the learnings of DevOps, but targeted at the world of data science — is announcing a round of funding on the heels of big demand for its services.\n\nThe London startup has picked up $17.5 million from new backer Notion Capital, as well as previous investors Anthos Capital and Snowflake, the data cloud computing giant.\n\nSnowflake is very much a strategic investor here: DataOps.live was built to work specifically with data housed with Snowflake. The plan is to use some of this latest funding to continue developing enhancements to that service, but also to invest in working unstructured data and with other data warehousing providers, too, according to Nick Halsey, the startup’s U.S.-based COO.\n\n“This is a hot market segment right now. We power the AI apps that everyone is striving to deploy,” Halsey said. “Snowflake are the best at what it does. Right now we only work with structured data, but we will be expanding to other cloud data platforms.”\n\nAt a time when funding cycles are getting longer for a lot of startups — due in part to the current challenges of raising money at favored valuations, and in some cases raising any money at all — it’s notable that it’s only been 15 months since the DataOps.live team raised their seed round of $10 million.\n\nThe interest in the company, and the need for more funding, are in part because of how it’s been growing. DataOps.live’s revenue run rate is up 400% in the last fiscal year. And the startup says that the last year saw more than 1 million pipelines run, over 10 million jobs orchestrated and 50 million data tests performed. It projects exceeding all of those figures this year.\n\nThe problems that DataOps.live is addressing are commonplace in the world of data analytics: working with data across multiple containers and other locations can lead to slower development times, work backlog and problems with version control — all issues that get compounded and more complex as data pipelines grow (and they are all growing). The pitch that DataOps.live makes is that its platform can help reduce the costs of managing and working with data by 30% by automating repetitive tasks, and by providing more insight into how data is moving to improve efficiency and security.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nCo-founders Justin Mullen and Guy Adams can lay some claim to being early movers and even pioneers in the field of DataOps. Software developers by training, they built an early version of the startup’s platform when they were working at a professional services company called Datalytyx, to create better structure around how they managed these issues for their clients.\n\nThe work they did was part coding — of the platform itself — and part formalizing the methodology, inspired by the work in DevOps. They went on to establish a community called TrueDataOps, they co-wrote a book (with others) called “DataOps for Dummies” and they founded the startup announcing funding today. (Datalytyx was eventually acquired by Mphasis and the closing of that deal looks like it coincided with the launch of DataOps.live.)\n\nEnterprise startups have continued to see a lot of business traction at a time when funding for consumer-driven startups still feels tricky. Notion’s interest in the company comes in part from that but also because of the growing need for better tools for those working with data. The DataOps Platform market is estimated to be worth some $3.9 billion currently, growing to $10.9 billion by 2028, and it’s growing as a competitive field, too, with AWS, Alteryx, dbt and many others also in the same space.\n\n“Today, data is the lifeblood of business, but managing and scaling data operations can be a daunting task. Data needs can grow faster than operations teams can process, leading to either slow or one-off development efforts,” said Stephanie Opdam, a principal at Notion Capital, in a statement. “DataOps.live is at the forefront of a movement that enables companies to improve data quality, streamline many data processes simultaneously and accelerate product development. DataOps.live has a fantastic and growing team, a great product, and impressive traction. We believe it has the potential to become the next category leader.”\n\nAnd given how competitive the data warehousing market is, Snowflake’s interest is most likely to give it a closer relationship with a player in the DataOps space that has already proven to be tightly integrated with its platform.\n\n“DataOps.live enables organizations to build, test and deploy Snowflake products and applications, the same way they do software applications. They increase speed of development and accelerate adoption, while maintaining governance and security,” Stefan Williams, head of corporate development and Snowflake Ventures, said when the startup was announcing its seed. “By expanding our partnership with DataOps.live, we offer joint customers the ability to collaborate with confidence inside their organizations and beyond. We look forward to supporting the DataOps.live team through the next stages of their growth.”"}