{"url": "https://techcrunch.com/2024/04/25/its-a-sunny-day-for-google-cloud/", "title": "It’s a sunny day for Google Cloud", "authors": ["Kyle Wiggers", "Ai Editor", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "Amanda Silberling", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-04-25T00:00:00", "text": "Google Cloud, Google’s cloud computing division, had a blockbuster fiscal quarter, blowing past analysts’ expectations and sending Google parent company Alphabet’s stock soaring 13%+ in after-hours trading.\n\nGoogle Cloud revenue jumped 28% to $9.57 billion in Q1 2024, bolstered by the demand for generative AI tools that rely on cloud infrastructure, services and apps. That continues a positive trend for the division, which in the previous quarter (Q4 2023) notched year-on-year growth of 25.66%.\n\nGoogle Cloud’s operating income grew nearly 5x to $900 million, up from $191 million. No doubt investors were pleased about this tidbit, along with Alphabet’s first-ever dividend (of 20 cents per share) and a $70 billion share repurchase program.\n\nElsewhere across Alphabet, Google Search and other revenue climbed 14.4% to $46.15 billion in the first fiscal quarter. YouTube revenue was up 20% year-over-year to $8.09 billion (a slight dip from Q4 2023 revenue of $9.2 billion), and Google’s overall advertising business gained 13% year-on-year to reach $61.6 billion.\n\nAlphabet’s Other Bets category, which includes the company’s self-driving vehicle subsidiary Waymo, was the notable loser. Revenue grew 72% to $495 million in Q1, but Other Bets lost $1.02 billion — about the same as it lost in Q4 2023. (Other Bets typically isn’t profitable.)\n\nAlphabet’s whole-org revenue stands at $80.5 billion, an increase of 15% year-over-year, with net income coming in at $23.7 billion (up 57%). Beyond Google Cloud’s performance, a reduced headcount might’ve contributed to the winning quarter; Alphabet reported a 5% drop in workforce to 180,895 employees.\n\nOn a call with investors, Alphabet CEO Sundar Pichai said that YouTube’s and Google’s cloud businesses are projected to reach a combined annual run rate of over $100 billion by the end of 2024. Last year, the divisions’ combined revenue was $64.59 billion, with Google Cloud raking in $33.08 billion and YouTube generating $31.51 billion.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Taking a step back, it took Google more than 15 years to reach $100 billion in annual revenue,” Pichai said. “In just the last six years, we’ve gone from $100 billion to more than $300 billion in annual revenue. … This shows our track record of investing in and building successful new growing businesses.”"}