{"url": "https://techcrunch.com/2024/04/02/autism-impact-fund/", "title": "Autism Impact Fund closes $60M first fund and broadens its scope", "authors": ["Anna Heim", "Freelance Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-04-02T00:00:00", "text": "Millions of people around the world are affected by autism spectrum disorder (ASD). Both as kids and later in life, these individuals and their families need better detection, treatment and support solutions that will help them live with autism. But until recently, that wasn’t a space that startups and investors ventured into.\n\nAutism Impact Fund (AIF) was a pioneer when it emerged in 2021, three years after the son of its co-founder and managing partner, Chris Male, was diagnosed with ASD. A joint effort of Male and others, AIF strove to become “the investment and innovation arm of the autism community,” Male told TechCrunch.\n\nSince then, startups in the neurodiversity space gathered momentum, and so did AIF, which recently closed its first fund at $60 million. As a first-of-its-kind fund, exceeding its target is no small feat, especially in an incredibly difficult environment. (The original target was $50 million.)\n\nAIF is a VC fund, not a charity, and Male is also vocal about it. “We’ve got great collaborations with the nonprofits, with the foundations, and we are very intentional in our regard to drive returns. … We aim to deliver really strong returns while revolutionizing the status quo for autism and everything in the space through the venture capital model.”\n\nAIF’s limited partners include Uber CEO Dara Khosrowshahi; Brian Jacobs from Emergence Capital Partners; and Bob Nelsen, a co-founder and managing director of Arch Venture Partners, who also sit on its advisory board. Male didn’t want to tell their personal stories for them, but AIF’s individual backers often have personal connections to autism.\n\nHowever, institutional LPs such as investment firms Fairfield-Maxwell and Ferd also support AIF, “which obviously was very helpful to get us to that scale,” Male said. It is also one more sign of change. “The operators that are entering the space are no longer just family members wanting to help; it’s really sophisticated business operators that are seeing an opportunity to affect wholesale change, and it’s really cool.”\n\nA broad portfolio\n\nSome VC funds wait for a full close to start deploying capital, but not AIF. Because it needed to prove itself and its thesis, it started investing since its first close. With 12 startups in its portfolio, it will start raising its second fund in the next six to nine months, and Male already reports inbound interest.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThat companies in AIF’s portfolio raised follow-on rounds from other investors is a strong validation signal. For instance, CVS Health Ventures led a $40 million Series D extension round of investment into healthcare startup Cortica in October. Other signals are harder to measure but are still important. Male told TechCrunch that AIF has strong access even to oversubscribed deals, and even when its check is not the largest, there’s a sense that it’s “a stamp of approval to the market and to the community that this is a validated, well-run entity.”\n\nAIF still has resources in its first fund to do a “handful” more deals as well as follow-on investments. After several “strong bets,” its portfolio is giving it motive to double down. And, Male added, “there is a very high likelihood of us having exits within the next six months; so, soon, because we [starting deploying] in 2021.”\n\nAIF’s portfolio is already quite diverse, although its website groups companies in two categories: life sciences and data- and tech-enabled services. It also goes beyond the U.S. with Germany-based consulting firm Auticon, which describes itself as an “autism-majority company,” and British telehealth platform Healios. But it will now diversify it further, and not because there isn’t enough deal flow or issues to address with autism alone.\n\nAIF’s decision to broaden its scope has to do with autism itself, Male said.\n\nThe definition of autism is so vague and so broad that there’s really no [biologically precise] understanding of exactly what’s happening, so in order for us to help the individuals as well as the families, we have to broaden that aperture. And it’s behavioral and mental health, it’s all of those but it’s also a broader healthcare issue at lens. The societal cost is in the trillions of dollars right now, and if the rise of incidence increases at the rate it is, it’s $15 trillion societal costs. Lack of employment and being [un]able to work is factored into that. But it’s as if society is sleepwalking into this incredible crisis, for which there is no current plan.\n\nRising awareness\n\nThe fund will now allow itself to invest in “behavioral health data-driven platforms, innovative healthcare solutions, as well as value-based care frameworks,” and AI is “impossible to ignore,” Male said. It will also keep on investing in addressing autism comorbidities, for instance gastrointestinal issues. And then there’s the “independence bucket,” whether that’s employment, financial independence or housing.\n\nThat independence is on the list is a reminder that autism is a spectrum that needs to be addressed as such and that there is a business opportunity for startups that don’t solely focus on kids.\n\nOne startup focusing on adults, neurodiversity employment network Mentra, is backed by Sam Altman and others but not by AIF. No beef there: Mentra partnered with AIF-backed Auticon, and Male called the work they are doing “incredible.”\n\nIt’s arguably a good sign that AIF isn’t one of Mentra’s investors: The space is getting too big to find the same VC on all cap tables. It’s also global, with health tech Genial Care raising $10 million to help kids with autism and their families in Brazil.\n\nWhen asked if there wasn’t some momentum about company creation in this space recently, Male laughed. Compared to five years ago, he explained, “it’s just fun to see the momentum and the shift.” As the investment side gets busier, too, there will likely be more to come."}