{"url": "https://techcrunch.com/2022/11/17/sample-series-a-pitch-deck-sateliot/", "title": "Pitch Deck Teardown: Sateliot’s $11.4M Series A deck", "authors": ["Haje Jan Kamps", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-11-17T00:00:00", "text": "You know what really sucks? Your IoT devices not being able to phone home. Rarely a problem when you’re in the center of a well-populated urban center with oodles of cell towers, but think of that water temperature buoy floating around in the Atlantic, an autonomous drone flying above the rain forest or a glacier-creep measuring sonde high up in the mountains. The fact is that about 90% of the planet has no cell coverage at all, and Sateliot raised a €10 million ($11.4 million) round of funding to change that.\n\nThe company shared its pitch deck with us to take a deeper look, and so we will! Here’s the good and the bad of this high-flying space deck.\n\nWe’re looking for more unique pitch decks to tear down, so if you want to submit your own, here’s how you can do that.\n\nSlides in this deck\n\nSateliot’s deck consists of 18 slides and is almost as pitched; the company redacted some of the info that goes into depth about how its tech works.\n\nCover slide “90% of the world has no cellular coverage” — problem slide Team slide “To connect all NB-IOT devices from space under 5G standard” — solution slide “Near real-time connectivity” — value proposition slide “Standard protocol” — product slide “Sateliot is the #1 satellite operator” — “why us?” slide Market size slide Competition slide Business model slide “MNOs engaged and technical integrations ongoing” — traction slide “Early adopters program” — go-to-market slide Interstitial slide Benefit slide Progress slide NGO program slide Slogan slide Closing slide\n\nThree things to love\n\nIt’s always interesting to see companies that are trying to have an enormous impact on the space they operate in. Sateliot is making space for an incredible opportunity, essentially removing the need for infrastructure to make IoT solutions work from pretty much anywhere in the world with a clear view of the sky. It’s a story that could be told in so many ways, and I was excited to see how the company launched into things.\n\nClear vision of the opportunity\n\n[Slide 2] Crisp and easy. Image Credits: Sateliot\n\nI love a deck that very clearly states the problem it is solving, especially if it’s also able to highlight the advantage of solving that problem. Sateliot does that fantastically on its second slide — 90% of the world has no cell coverage, and this company is promising to change that. There’s not an investor in the world that won’t be able to see the benefit and financial potential of that.\n\nAs a startup, if you can distill your problem, solution and opportunity this elegantly, you’ve got yourself a great launchpad to start weaving your narrative for your pitch.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Why us?” This is why…\n\n[Slide 7] Being the right team for the job is a crucial aspect of pitching. This is hella compelling. Image Credits: Sateliot\n\nOne of the big questions an investor will be asking themselves is whether a particular company is well positioned to take charge of a market. In other words: Is there something about this team or company that gives them an unfair advantage over the competitors? This slide is labeled as “value proposition,” which is a little confusing. The slide doesn’t describe a value prop but a competitive advantage. It describes the “number of contributions to the 3GPP Standard,” but it doesn’t say what that means. Wikipedia has an answer that seems to indicate that this is very relevant, but I’d love for the company to have contextualized it on this slide.\n\nThose caveats aside: If it turns out that contributions to the standard are directly relevant to the company’s success and show that it’s particularly well positioned to corner this market, this absolute design disaster and word soup of a slide might actually be a powerful storytelling device.\n\nScanning down the lists of companies that have made more and fewer contributions, there are a lot of big-name vendors. Seeing Sateliot in the top 25 or so — ahead of many other well-known companies — could suggest that there’s a significant moat in place.\n\nI wish the company had connected the dots for me, but if this slide means what I suspect it means, it makes up for the distinctly subpar “team” slide (which we’ll discuss in a bit).\n\nAs a startup, what you can learn here is that if you have a moat, or some reason why nobody else can truly solve the problem at hand as well as you can, shout about it loudly — it makes you a far more tempting investment target.\n\nStrong social mission\n\n[Slide 14] Having a social mission component can help give investors the warm-and-fuzzies. Image Credits: Sateliot\n\nSome investors have a social responsibility mandate as part of their investment theses. That could go in your favor if your company is in alignment with doing good in addition to doing well. But what is also true is that all investors are human beings, and it can never harm to have a heart-forward aspect to your story. Sateliot explains that once its satellites are up and running, there is almost no marginal cost to being able to offer its services to certain customer groups. In other words: If you want to GPS-track rhinos, you can do so for almost no money.\n\nAs I said, that doesn’t matter to all investors, but in this case, you’re creating a win-win. Zero marginal cost means that there’s no real downside to offering the company’s services to causes that improve the planet and plenty of potential upsides. In addition to making the world a better place, there are PR opportunities, ESG advantages and secondary benefits to the company. Sateliot could very easily not have included this in its story, but it makes me happier that they did.\n\nThe lesson here is to think about whether you can tell your story in ways that appeal to audiences in multiple ways. Giving an investor the chance to brag about a company they invested in that’s doing some good in the world can never harm, so if that’s true for you (and it is a natural, logical part of the story), then why not throw it into the mix?\n\nIn the rest of this teardown, we’ll take a look at three things Sateliot could have improved or done differently, along with its full pitch deck!\n\nThree things that could be improved\n\nThe deck is good, and it raised €10 million, so it was successful. But it also leaves a few things to be desired. Let’s dig in.\n\nIs this the right team? Who knows?\n\n[Slide 3] That’s … a team slide. Just not a very good one. Image Credits: Sateliot\n\nOne of the most important things about a startup is whether the team is the right team to solve this particular problem. Sateliot knows that or it would not have put its team slide front and center. Unfortunately, as a slide, this isn’t very good. Photos and job titles make a framework for telling the story, but they don’t tell the story itself. This slide, in other words, cannot stand alone. It doesn’t even have last names, so I can’t quickly and easily look these folks up on LinkedIn to get a better impression of who they are.\n\nYes, three exits is impressive. Being industry veterans is helpful. Having experience with working together in the past further de-risks the team. But I would have preferred to learn more about how good these exits were, how being industry veterans is a benefit in this particular company and what the track record of this team is. In a way, this slide is just the dramatis personae of the startup — it doesn’t start to explain what the character development is. It’s like looking at the IMDb listing of a movie. Sure, you may recognize one or two of the actors, and it may even convince you to watch the film if you’re a fan. With all respect to the Sateliot founders, they aren’t Scarlett Johansson, Robert Downey Jr. or Samuel L. Jackson — as potential investors, we need a little bit more context and a synopsis of the movie we are about to watch, as it were.\n\nIt’s important to help investors connect the dots; show your team, for sure, but also explain why this team is unbeatable in this market, with this product, at this time.\n\nTo Sateliot’s credit, I expect that they probably tell that part of the story when they pitch the deck, so this criticism is only of the slide itself, not necessarily of the founders or whether they are the right people for the job.\n\nWait, what’s a model?\n\n[Slide 12] Erm, that’s not a business model. Image Credits: Sateliot\n\nSateliot’s slide deck has four slides marked “value proposition,” none of which describe a value proposition. It also has three slides marked “business model,” but none of them actually describe a business model. That’s a little embarrassing but serves as a good reminder to check in with yourself to see if the slides are actually answering the question you are trying to explicate.\n\nA business model is some combination of, “Where will our customers come from and how do we attract them?” along with “How will we make money?” and “How will we retain our customers in the long run?” Slide 12, at best, is an early customer acquisition mechanism (and ironically gets pretty close to showing the value proposition for the company), but even then it doesn’t say anything about how much it will cost to acquire customers.\n\nThe company gets a little hand-wavey about numbers in general, and I’m not a fan of that: If you have customers or revenue, show them on a graph. If you don’t, tell us how you’re going to get them and how you’re going to turn those customers into revenue. I suspect that for Sateliot, the business model will be something like “attract customers through partnerships and charge them a certain amount per device or per megabyte.” If that’s true, then just say that, and if the business model is something a little more exotic, definitely explore that: Investors will want to know.\n\n“We can’t give our product away for free”\n\n[Slide 15] I think this is an accidental joke. But I’m not sure. Image Credits: Sateliot\n\nThis slide made me laugh out loud. What I saw here was a company that is saying that they are getting closer to agreements with nonprofits — which means they haven’t gotten to an agreement yet. Then it says that it is planning to give these products away for free for climate and social projects.\n\nI get how they got to this slide, but what I read as a potential investor is that they’re trying to give the product away for free and haven’t been successful so far. That’s not something worth bragging about, and I’m a little befuddled about what part of the story this slide is meant to tell.\n\nI always recommend that my pitch coaching clients read their own slides with as much cynicism as they can muster. It isn’t about what you are trying to say, it’s about what you are actually saying and whether the slide in question is in service of your ultimate goal: Will you be more or less likely to raise money after someone sees this slide? If the answer is “more,” keep it. If the answer is “less” or “the same,” perhaps it’s best to get rid of the slide altogether or update it until it does some more of the heavy lifting.\n\nThe full pitch deck\n\nIf you want your own pitch deck teardown featured on TC+, here’s more information. Also, check out all our Pitch Deck Teardowns and other pitching advice, collected in one handy place for you!"}