{"url": "https://techcrunch.com/2023/10/31/wirepas-nabs-22m-to-expand-a-iot-business-based-on-distributed-mesh-technology/", "title": "Wirepas nabs $22M to expand IoT business based on distributed, mesh technology", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-10-31T00:00:00", "text": "Wirepas, a startup out of Finland that is building out an Internet of Things business based on a novel approach — using mesh networking, rather than cellular or Wi-Fi to connect thousands of objects — has raised some funding to give its efforts some oxygen. The company has picked up $22 million, at a valuation we understand to be in the region of between $100 million and $200 million.\n\nThe list of investors contains some interesting names that speak to strategic potential for Wirepas and its technology. Highland Europe is leading the round, with new backers Amalfi IQT (In-Q-Tel, the investment business connected to the CIA in the U.S.) and previous backers ETF Partners, KPN Ventures (the investment arm of the telecoms giant), Vito Ventures and Vesa Laisi also participating.\n\nThe funding is coming on the heels of some decent traction. Wirepas now has some 160 customers (which it calls “partners”) and there are 7 million devices connected using its tech. Markets where it operates currently include Australia, Germany, Finland, France, India and the U.S.\n\nSome of the customers include the NHS, which is tracking equipment with its tech and RFID tags; D4 Industry in Turkey using it to track supply chains for steel coils and metal sheets; manufacturer Schaeffler in Finland using the tech to monitor the performance of its machines; and a number of energy utilities using it for smart meters.\n\nThis is, apparently, the tip of the iceberg for what the company’s technology can connect. Mesh, put simply, is a decentralized architecture that essentially treats each device or node on a network as another connectivity access point. So on a wireless network, rather than needing many base stations to be deployed across a space to connect devices, far fewer are required, and unlike the traditional hub and spoke model, it also means better connectivity for the nodes overall.\n\nWirepas says that its system can run as many as 16 million networks, able to handle up to 4 billion devices each. A spinout from the university in Tampere (well known for its contributions to the field of wireless technology), Wirepas says that it has some 100 patents already filed for its approach.\n\nYou might ask yourself the question: Who would need this, and why?\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nTypically, IoT deployments in the enterprise are focused around industrial environments where an organization might use IoT networks to monitor continuous diagnostics in factories, remote locations or wide areas where people may not be working to monitor those devices continually.\n\nConsumers also have an increasing number of touchpoints into the world of IoT: Connected home electronics can be linked up and managed by way of apps, and utility, security and other providers are also installing connected devices in homes to improve their service levels.\n\nAll of this today comprises some 15 billion+ IoT connections, and yet, for providers of IoT, it works out as a very low margin because with cellular connectivity, deploying base stations and resources on those base stations represents costs that machines connected for small incremental uses of data just do not offset. And, it should be noted, connected devices in total does not not directly translate to how many of those IoT nodes are actually being used.\n\nTeppo Hemiä, the CEO of Wirepas, said that the company’s big breakthrough was in creating better unit economics by applying mesh architecture and doing away with the need for base stations at all, no matter how advanced they’ve become in 5G or even one day 6G services.\n\n“What cellular companies tried to do [in reducing the costs] through smaller cells, we fixed using software,” he said. “It means you can connect everything to this technology.”\n\nHe believes that the startup has not only figured out a more efficient route, but it’s also worked out a better business model for itself that also changes up and improves IoT unit economics. For starters, the company sells hubs that companies can in turn use to build their own networks as and when they are growing them. That means the costs to provide services are greatly reduced, both for the customer, and for Wirepas itself. The startup in turn provides the inbound connectivity and analytics on the network for measuring usage, security and anything else that the customer is looking to monitor.\n\n“Wirepas isn’t just an incremental improvement over existing technologies – this technology is setting a new standard for what’s possible. By offering a solution that is cost-effective and scalable, Wirepas addresses the two most significant barriers to IoT adoption,” said Laurence Garrett, a partner at Highland Europe, in a statement."}