{"url": "https://techcrunch.com/2022/10/11/india-5g-smartphones-software-update/", "title": "India to push Apple, Samsung to enable 5G support on their phones", "authors": ["Jagmeet Singh", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-10-11T00:00:00", "text": "India’s government is set to push handset makers, including Apple and Samsung, to expedite software upgrades on their phones to make them compatible with local 5G airwaves in the country — just days after kicking off the next-generation cellular network by the nation’s two leading telcos with all pomp and show.\n\nTop bureaucrats from the country’s telecom and IT departments will jointly chair a meeting on Wednesday to discuss the software upgrade requirements for enabling 5G on compatible phones. The primary agenda of the closed-door meeting is to push smartphone companies to prioritize software upgrades for all 5G phones in the country, sources familiar with the development told TechCrunch.\n\nGlobal companies, including Apple, Samsung, Vivo and Xiaomi, and local manufacturers, such as Lava and Micromax, are invited to the meeting that will take place in the capital city on Wednesday morning. Telecom operators Reliance Jio, Airtel and Vodafone Idea have also been called. Reuters first reported about the meeting on Tuesday afternoon.\n\nAfter much anticipation, Reliance Jio and Airtel launched their 5G services in select cities earlier this month. Vodafone Idea — the third private player in the country’s telecom sector — has, however, not yet revealed any concrete plans for its 5G rollout. Similarly, state-owned Bharat Sanchar Nigam Limited (BSNL) is also not ready to roll out its 5G service in the country and, in fact, is yet to bring pan-India coverage of its 4G network.\n\nDespite the initial rollout by Reliance Jio and Airtel, most Indian smartphone users are yet to experience faster connectivity as a number of handsets from companies, including Apple and Samsung, are yet to support 5G networks in the country. A software fix should immediately enable tens of millions of handsets in the country to support 5G, analysts say. India’s 5G smartphone installed base, though, crossed 50 million units in late July, according to analyst firm Hong Kong-based Counterpoint.\n\nA report on Tuesday also showed that Reliance Jio recorded almost 600 Mbps median download speed on its 5G network in Delhi, while India’s overall 5G speed hit 500 Mbps as the country rolled out 5G services.\n\nSome phones already support 5G in India. Select handsets from Chinese companies including Oppo, Vivo and Xiaomi support local 5G networks, according to carrier Airtel. India’s telecom and IT departments did not share any specifics about the meeting at the time of filing this article. Apple and Samsung did not immediately respond to queries about their plans to release software updates."}