{"url": "https://techcrunch.com/2025/03/25/a-world-without-caesars-how-the-atproto-community-is-rebuilding-the-web-to-return-power-to-the-people/", "title": "A world without Caesars: How the ATProto community is rebuilding the web to return power to the people", "authors": ["Sarah Perez", "Consumer News Editor", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block"], "publication_date": "2025-03-25T00:00:00", "text": "Don’t call it a Bluesky conference.\n\nOver the weekend, the first in-person gathering devoted to those building with the AT Protocol, or ATProto — the technology that powers Bluesky’s growing social network of 33 million-plus users — was held in Seattle. At the event, developers, engineers, founders, and even members of the Bluesky team, including CEO Jay Graber, were in attendance. Many in the community were meeting each other for the first time after having only ever communicated online.\n\nBut although Bluesky is the largest app built on ATProto at this time, the social network itself was not the ATmosphere Conference’s focus. Here, Bluesky was just another developer — albeit a prominent one, given its stewardship of ATProto, the social networking protocol that offers a framework for building a decentralized social network.\n\nImage Credits:TechCrunch\n\nInstead, the conference was dedicated to the protocol itself and its many possibilities, which include building not only other types of social apps, but also communities and giving people a way to sign in across apps and web services with an open social identity via the authentication standard OAuth, and more.\n\nThe conference was about putting users back in control over their data, as well as their algorithms and their overall online experience.\n\nIn short, the 150+ people in attendance, alongside others in the community who attended virtually, are working to rebuild the web by putting the power back in the hands of the people who actually use the web.\n\nThat also means, to some extent, taking the power away from the billionaire tech oligarchs — the “Caesars,” as Graber’s viral T-shirt mocking Mark Zuckerberg recently alluded to; these tech CEOs now control the majority of our online experience, from search to social connection, to communication to productivity, and beyond.\n\nIt’s no surprise, then, that self-described anarchists, mutual aid devotees, and open source advocates could be found among the ATProto conference’s attendees.\n\nBut for some in attendance, longtime idealism has been tempered by the reality of what they’ve already built and watched fail, including public products like Twitter and earlier efforts at decentralized apps.\n\nThis time around, they aim to learn from those mistakes.\n\nKicking off the event, Blaine Cook, the co-author of the OAuth standard and protocol WebFinger, and former lead developer at Twitter, spoke of his time at the social network that’s now called X. While there, he coined the word “tweet” and designed replies before watching Twitter become “corrupted by capital and a lack of imagination,” he said. Yet he still thinks of Twitter as the “most visceral representation of public human communication and ideas that anyone has ever created.”\n\nImage Credits:TechCrunch\n\nCook, who was pushed out of Twitter for trying to decentralize it, compared today’s decentralized social web, which includes Bluesky, as more akin to a jungle — something that makes sense for the individual creatures within it but is seemingly chaotic to outside observers.\n\nThat’s especially true in these early days where multiple protocols are in use, including not only ATProto, but also ActivityPub (which underpins apps like Mastodon and Threads), Nostr, Farcaster, and others. Even the web’s inventor, Tim Berners-Lee, is working on decentralized technologies designed to give the power back to the users.\n\n“I’ve known in my bones for almost decades now that a more free social system was both possible and inevitable,” Cook told the audience, “and it’s always a revolution that’s really stuck with me.”\n\nCook’s speech set the tone for the event: one that acknowledges the missteps of the past but also holds hope for the future.\n\nLater, Bluesky CEO Jay Graber spoke of the promise that the web once held, and how she later grew pessimistic as it turned into a tool to surveil and control instead of liberate and create.\n\nImage Credits:TechCrunch\n\n“We have built a civilization of the mind in cyberspace, but we’ve ended up giving over our lives to large, centralized platforms whose CEOs have styled themselves as self-made monarchs of the kingdoms that we’ve built for them with our data and our time,” said Graber.\n\n“We have to remember where the power really lies because we gave them that power and we can take it back.”\n\nAt her speech’s conclusion, the audience erupted with applause and hoots that lasted a good half a minute. This was no mere developers’ conference. This was a movement.\n\nOther presenters showed off their projects, detailed various aspects of the ATProto technology, and spoke about what’s ahead. Some proposed solutions to current issues.\n\nSpeakers at the event contributed their specific expertise, whether that was addressing the challenges around online communication, finding pathways to funding, or even experimenting with wild ideas, like running Bluesky on a Raspberry Pi single-board computer.\n\nBlackSky founder Rudy Fraser hit an emotional note on Saturday when talking about using ATProto to build communities. His project today offers moderation and support that makes social media a safer place for Black users, including those migrating from the online community known as Black Twitter. Eventually, BlackSky may run on all of its own ATProto-based infrastructure and offer its own consumer-facing client.\n\nHowever, conference attendees were reminded that new technologies alone aren’t the answer — there’s a need for a whole ecosystem of support and funding for these efforts, too.\n\nImage Credits:TechCrunch\n\nFor instance, technologist and feed builder Ændra Rininsland spoke up on Sunday about the struggles the trans community has faced — and continues to face — even on open social platforms.\n\nOne part of the challenge is that the people who run moderation services like Bluesky labelers (who flag or auto-hide posts you don’t want to see) are often personally and financially burdened by their efforts. They can burn out and break down, as Rininsland said she had — twice.\n\nBut despite this, she still expressed optimism, pointing to projects like Northsky Social, which is building on the ideas put forth by BlackSky to use ATProto to create a safer social media experience for the LGBTQIA+ community.\n\n“They’re ambitious goals, but we’re trying,” Rininsland said. “Trans people won’t be silenced by this or any other administration. And if it means we have set up an entire parallel infrastructure, our entire damn social network, then you bet your asses we’ll do that.”\n\nUnlike the “Careless People” who built Facebook, the ATProto community aims to mitigate the harm that introducing new technologies can bring, and they’re looking to experts who can help guide them as they build.\n\nOn Sunday, Erin Kissane, a content and editorial strategist who once wrote a 40,000-word essay on how Facebook contributed to the genocide in Myanmar, joined remotely (while under the weather, no less!) to share with attendees her deep understanding of how to build safer online communities.\n\nImage Credits:TechCrunch\n\nAt a time when much of tech is unwinding its diversity, equity, and inclusion (DEI) initiatives in the interest of catering to the Trump administration’s policies, Kissane’s advice went in the opposite direction. She advised builders to actively seek out “the intelligent and informed perspectives of the most vulnerable people in groups that you’re building for before and during rollouts and changes.”\n\n“If you can keep the most vulnerable people safe, you can keep everyone safe,” said Kissane.\n\nThese are not radical ideas but have become politically charged issues.\n\nAs the event concluded, some attendees left to immediately begin hacking on projects with connections they formed over the weekend. Promises to continue talking and connecting were made, and an active Discord chat filled with people who have now met in person.\n\n“I go to a lot of events in [San Franscico],” Tessa Brown, the co-founder of secure chat app Germ Network, told TechCrunch. “And it’s like … everything started today, and everything is just the future. There’s no lessons from the past.”\n\nBy comparison, Brown added, “Everyone here is just so thoughtful about how we got to this moment … It feels very different.”\n\nTechCrunch reported from the ATmosphere Conference in Seattle, Washington."}