{"url": "https://techcrunch.com/2022/07/26/cordial-which-personalizes-and-automates-cross-channel-messaging-campaigns-raises-50m/", "title": "Cordial, a cross-channel marketing platform, raises $50M", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-07-26T00:00:00", "text": "Cordial, a cross-channel marketing and data management platform, today announced that it closed a $50 million Series C funding round led by NewSpring, with participation from new investor ABS Capital. Jeremy Swift, Cordial’s CEO and co-founder, said that the fresh capital will be used to expand the company’s global footprint, launch new platform features and nearly double headcount by the end of the year.\n\nIn Swift’s view, customers today expect highly personalized messaging in exchange for the first-party data they share. McKinsey agrees — according to a 2021 survey by the firm, 71% of consumers expect companies to deliver personalized interactions and 76% get frustrated when this doesn’t happen. To meet expectations, marketers must be able to go beyond simply aggregating data to power messaging that wins and keeps customers, Swift says.\n\nAnother challenge is striking the right balance between thorough outreach and giving customers some breathing room. It’s not easy. In a 2017 survey from Campaigner, nearly half (49%) of consumers said they receive too many emails from business owners and marketers and three in 10 said they wanted to hear from a brand once a month or less.\n\n“Consumers aren’t tuning into the same old, cyclical outbound messages from brands, nor are they buying in the same way they used to … Having all of your customer data available in real-time when sending a message — via email, SMS, mobile, social, and more — has never been more important,” Swift told TechCrunch in an email interview. “Legacy email service providers (ESPs) are trying to acquire businesses to shore up their lack of messaging and data capabilities, but they’re just accumulating point solutions that end up providing a clunky user experience without the capability of truly real-time marketing execution.”\n\nSeeing an opportunity to “inspire more thoughtful communication” between brands and consumers, Swift co-founded Cordial in 2014 with Adam Gillespie, Chris McGreal and David Baker. Gillespie and McGreal had previously worked together with Swift to build BlueHornet, an ESP that was later acquired by Digital River.\n\n“Our hindsight within the ESP market has paid huge dividends to anticipate what marketers would need and want for the future, far ahead of the competition,” Swift said. “We believed that there had to be a better solution for marketers to engage their customers in personal, relevant ways.”\n\nCordial is the fruit of their labor, offering tools for orchestrating marketing across channels, including email, SMS and mobile apps. The platform brings together data from multiple sources (e.g., cloud storage, rest APIs) to create AI models that automate campaigns, letting marketers connect customers to known profiles for an improved customer experience.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nCordial supports A/B experiments, automatically updating messages to include better-performing content aligned with KPIs like revenue, gross margin and clicks. Out-of-the-box models attempt to predict everything from churn propensity (i.e., the likelihood of a customer to leave) to product affinity (i.e., a customer’s liking for a product), or users can build custom models and automation triggers based on their business needs, rules and inputs.\n\n“Cordial has extensively emphasized and invested in machine learning throughout the platform, using customizable models for each client,” Swift said. “Clients can view or set the top predictors in each model to ensure they have a clear understanding of how Cordial’s machine learning is working … We believe that clients should have full access and be able to easily understand how our models work to ensure a trusting relationship and to avoid the “black-box” approach of most broad-based, generic AI.”\n\nWhen asked who he sees as Cordial’s closest rivals, Swift named Braze and Iterable — both of which deliver personalized, targeted marketing messages via channels, including email and in-app notifications. But Swift also competes to a degree with vendors like Segment, which offers a product that pulls, cleans and reconciles customer data to create profiles that are then made available to other marketing systems.\n\nSwift asserts Cordial is carving out a niche for itself in the sprawling martech space, nabbing over 600 brands, including Revolve, Backcountry and Purple. He pegs the total addressable market at around $8 billion, and says that the latest cash infusion will enable Cordial to capture a larger portion of it by “building a new horizon of customer engagement.”\n\n“Most technology leaders expect long, painful technology migrations and adoption cycles, which is why they often become Cordial’s biggest advocates in the sales process, when they see the platform’s flexibility,” Swift said. “Built with the power of a CDP at its core, the Cordial platform can collect customer insights and business data from anywhere in their tech stack via real-time data feeds, integrating with any data source exactly as it is, without changing schemas or structure. This data informs marketers’ campaign approaches, empowering them to use native messaging tools for segmenting audiences, testing, and optimizing content.”\n\nCordial currently has 130 employees and plans to grow to around 200 by the end of the year, Swift said. The startup has raised $85 million in venture capital to date, benefiting in part from the recent boom in the martech and adtech industries."}