{"url": "https://techcrunch.com/2024/03/26/metyos-pre-seed/", "title": "Metyos is building a biowearable to monitor chronic kidney disease", "authors": ["Natasha Lomas", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-03-26T00:00:00", "text": "Alexandre Boulanger is better known for building self-balancing exoskeletons at Wandercraft. For his next trick, the Paris-based robotics entrepreneur is fronting work on a far lighter kind of wearable: An arm-worn patch for monitoring chronic kidney disease (CKD). The medtech startup Metyos, where Boulanger is CEO, is a joint effort: Co-founded with CTO Olga Chashchina, who holds a PhD in biomedical engineering where she gained particular expertise with biosensors that are critical to what the pair are cooking up here.\n\nIn recent years there’s been an explosion of interest in biowearables driven by developments like the commercialization of continuous glucose monitors (CGMs) for diabetes management. At the same time, rising costs of healthcare provision has increased pressure on services to find smarter ways to tackle expensive issues like chronic disease management, without compromising quality of service. Biowearables offer a potential route to help square this circle for a range of chronic health conditions.\n\nMetyos’ goal is to build similar arm-worn (semi-invasive), real-time sensing tech, as is already established for diabetes management that can also detect chemical changes in fluids just under the skin, but that is focused on tracking biomarkers linked to chronic kidney conditions. It wants its biowearables to be prescribed by doctors as part of a remote treatment management package for patients — suggesting the approach could help doctors remotely spot warning signs linked to renal failure and hyperkalemia.\n\nFor patients, the goal is to empower them to become a more active participant in their own care — by offering recommendations (such as diet) and better understanding of CKD via the app. So the startup is taking a dual-sided approach that aims to bring data-driven insights to doctors and patients. If mobile tech has done anything, it’s given consumers an expectation of having access to information and being kept informed.\n\nThe startup says its biowearable will monitor ions and minerals that can build up in the bloodstream when kidney function is affected, sending data to an app on the user’s smartphone, via Bluetooth. From there the tech will be designed to relay user data to Metyos’ secure server in the cloud, where health professionals monitoring the patient’s condition can access it and remotely track disease progression.\n\nThe team started work on Metyos back in 2021, with the help of “some love money” and a public grant, as Boulanger tells it. So far they’ve built a prototype of the biowearable and conducted some bench tests.\n\nThey’ve just closed a pre-seed round of €2.3 million (~$2.5 million) to fund the next stage of development, which will entail running clinical trials to further evaluate and refine the technology. Lead investors in the round include Cenitz, Bpifrance and KIMA Ventures.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBeing a medtech startup, Boulanger confirms Metyos won’t bring its tech to market without regulatory approval — which he says it’s targeting by the end of 2025. In terms of target markets, the team is focusing on Europe (especially their home market of France) and the U.S. Generally, the focus is markets where remote patient monitoring reimbursements exist and/or are being developed, per Boulanger.\n\n\n\nHow did the serial entrepreneur come up with the idea for this startup? “I had gained a lot of weight so I became interested in nutrition tracking and by extension, in biochemistry tracking,” he tells TechCrunch.\n\nAt the same time, Boulanger’s co-founder, Chashchina, was dealing with a chronic health condition. So when the pair met, their interests aligned on the idea of building a biowearable. “She has to do a lot of blood draws and wanted a tool to help her with the daily management of her condition,” he notes. “So we started with the user/patient point of view on biowearables and we partnered early with doctors to refine the clinical needs.”\n\nThe startup’s goal is to develop a sensing wearable that can improve health outcomes for CKD patients and financial outcomes for the healthcare system by enabling remote biological monitoring of patients with the chronic condition.\n\nMetyos cites statistics that suggest there are more than 800 million CKD patients globally.\n\n“CKD is one of the major chronic diseases in terms of prevalence, mortality and cost. It is a progressive disease with no cure (but many treatments for the associated conditions), so it can be crucial for patients to slow down or stop the progression of the disease,” says Boulanger. “We think remote monitoring allows us to anticipate adverse events, enabling clinicians to make timely clinical decisions and patients to be more involved day to day in their own care.”\n\n“We will start with end-stage patients with hyperkalemia issues and extend our scope down to earlier stage patients,” he adds.\n\nMetyos is at an early stage but there’s burgeoning interest in biowearables, so competition in the space is growing. But its focus on CKD sets its apart from a number of wearable rivals. Boulanger lists five startups as its main competitors: Biolinq, Alio, Protonintel, Kalium Health and Renalyse — the latter two also focus on kidney conditions but in their case patient tracking is based on at-home blood draws, rather than real-time data being pulled from a biowearable."}