{"url": "https://techcrunch.com/podcast/building-trust-in-crypto-with-jonathan-levin-of-chainalysis/", "title": "Building trust in crypto with Jonathan Levin of Chainalysis", "authors": ["Rebecca Bellan", "Theresa Loconsolo", "Senior Reporter", "Audio Producer", "Kyle Wiggers", "Amanda Silberling", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "Anthony Ha"], "publication_date": null, "text": "Late last week, U.S. Securities and Exchange Commission chair Gary Gensler said that he was “proud to serve” the agency, which some are taking as a hint at an upcoming resignation. Gensler has faced heavy criticism for his crackdown on crypto, including a recent lawsuit from 18 states, and is likely to be replaced under President-elect Donald Trump, who has vowed to oust Gensler.\n\nOn Tuesday, The Wall Street Journal reported that Trump is meeting with Brian Armstrong, the CEO of crypto exchange Coinbase, to discuss potential personnel appointments. That same day, Trump said he wants Cantor Fitzgerald CEO Howard Lutnick to serve as his Commerce Secretary. Lutnick is a vocal crypto enthusiast who’s been stablecoin giant Tether’s Wall Street banker for years.\n\nThis is all to say, crypto is having a moment.\n\nThat’s why on today’s episode of Equity, we’re bringing you a conversation between Rebecca Bellan and Jonathan Levin, the co-founder and CSO of blockchain analysis firm Chainalysis. The pair caught up at our Strictly VC event in New York last week, shortly before the Gary Gensler news dropped, to discuss:\n\nThe imminent change for crypto in the wake of the U.S. election\n\nTrends in crypto crime\n\nChainalysis’ choice to run its operations in the U.S.\n\nHow to build trust in crypto and blockchain\n\nEquity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday.\n\nSubscribe to us on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod. For the full episode transcript, for those who prefer reading over listening, check out our full archive of episodes over at Simplecast."}