{"url": "https://techcrunch.com/2025/03/30/data-centers-love-solar-heres-a-comprehensive-guide-to-deals-over-100-megawatts/", "title": "Data centers love solar: Here’s a comprehensive guide to deals over 100 megawatts", "authors": ["Tim De Chant", "Senior Reporter", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-03-30T00:00:00", "text": "The rush to capitalize on the buzz around AI has led tech companies to dramatically expand their data center footprints. That’s been good news for companies like Nvidia, but it has also led to unprecedented growth in the power industry.\n\nNew and expanded data centers are expected to double the sector’s power demand by 2029, according to JLL. As a result, developers and tech companies have been working overtime to lock in capacity. Nuclear and natural gas have gotten boosts from the forecasted demand, but few technologies have benefited in the near term like solar.\n\nThough solar power suffers from what experts call intermittency — it won’t produce if the sun isn’t shining — the upsides have been so significant that companies have been inking large deals at a rapid pace.\n\nUnlike advanced nuclear reactors, which have yet to be deployed at commercial scale, solar power is proven technology. And unlike new natural gas power plants, which take years to plan and construct, the average completion time for a new solar farm is about 18 months. Plus, it’s one of the lowest-cost sources of new generating capacity.\n\nSince the start of 2025, tech companies and data center operators have backed 12 solar deals, each adding more than 100 megawatts of capacity to the grid.\n\nJanuary\n\nMeta kicked off the year with a 200-megawatt solar deal with multinational electric utility Engie. The purchase went toward a solar farm near one of the company’s existing data centers in Texas. At the time of the deal, Meta already had over 12 gigawatts of generating capacity in its renewable portfolio.\n\nLater in January, the Stargate AI partnership between OpenAI, Oracle, and SoftBank Group was reported by Bloomberg to be powered, at least in part, by solar. SB Energy, which is part of SoftBank’s portfolio, is expected to develop solar installations backed by grid-scale batteries.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMeta closed out the month with another massive solar deal, this one with Spanish renewable developer Zelestra. The contract was for 595 megawatts of capacity.\n\nFebruary\n\nMeta continued its streak in February, investing in a 505-megawatt solar project with Cypress Creek Renewables, which is developing the massive installation in Coleman County, Texas — about 150 miles northwest of Austin.\n\nMicrosoft entered the fray in February, too. The company has long been a buyer of renewable energy to power its operations, and added another 389 megawatts of solar in a deal with EDP Renewables North America. The contract covers three different solar farms, two in Illinois and one in Texas. The purchases have helped Microsoft stay on top of its pledge to power its operations using zero carbon power.\n\nAmazon also made a big purchase, backing a hybrid project on the Iberian Peninsula that includes wind, solar, and pumped-hydroelectric storage. The deal included 476 megawatts total, of which 212 megawatts are solar.\n\nOutside of the U.S., data center operators have also been investing in solar. In India, CtrlS built its own 125-megawatt facility in two phases, the first half of which was finished in June 2024 with the second completed in early February. In South America, Telecom Argentina agreed to buy electricity from a 130-megawatt solar farm developed by MSU Green Energy.\n\nMarch\n\nMicrosoft added another three solar developments in March, again focusing on the Midwest. The projects span Illinois, Michigan, and Missouri, and they’re being developed by AES. Together, they will provide Microsoft with 475 megawatts of capacity, adding to its considerable 34-gigawatt portfolio.\n\nCisco got in the game with a 100-megawatt deal with X-Elio, a solar developer owned by Brookfield, an asset manager that has bet big on renewables. The power purchase agreements see Cisco buying capacity from two different Texas solar projects.\n\nMeta added another 200 megawatts of solar to its portfolio in March in a deal with RWE. The solar farm will be built just southeast of Austin.\n\nIn Italy, data center operator Data4 signed a 10-year deal with utility Edison Energia to buy power from a 148-megawatt solar farm northwest of Rome.\n\nMore deals likely\n\nAs tech companies race to add AI to seemingly every product and possible market, data centers have been expanding to keep pace. That growth requires power, and few technologies are as well positioned as solar power.\n\nUtility-scale solar is already one of the cheapest forms of new generating capacity without counting subsidies, undercutting everything except onshore wind. It’s also quick to deploy and can be commissioned in phases, allowing data centers to draw power before the entire project is finished.\n\nThose qualities have combined to give solar a near-term advantage, racking up deals with Big Tech companies and data center developers. It’s a trend that’s likely to continue."}