{"url": "https://techcrunch.com/2023/07/20/vr-is-dead/", "title": "VR is dead", "authors": ["Haje Jan Kamps", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block", "Margin-Top Flex Font-Size Var"], "publication_date": "2023-07-20T00:00:00", "text": "It’s hard to believe that it was only 11 years ago that VR captured the zeitgeist. In April 2012, Oculus hit Kickstarter with the Oculus Rift developer kit, and the tech world whipped itself into a “this is the future” frenzy. Facebook slapped a $2 billion check on the table and acquired the company in 2014.\n\nBut today, as it stands, VR is all but dead.\n\nVR — as in, a system for being exclusively in virtual reality — barely exists as a concept anymore. Even the cheapest mainstream headset out there, the Meta Quest 2, has a passthrough feature, meaning it’s got AR capabilities. The Quest 3 adds higher-definition passthrough in full color. And, $3,500 price tag aside, Apple’s Vision Pro takes the concept so far that it doesn’t even really use the VR nomenclature anymore.\n\nThat’s because VR is missing the one crucial thing that could’ve taken it from “cool toy” to “must-have device”: a killer app. Even as the market has matured, VR is still struggling to find a reason to exist.\n\nIn 2015, TechCrunch published an article that speculated that the market could hit $150 billion of revenue by 2020. Here we are, nearing 2024, and it looks like the market sits at around $32 billion — a fifth of what the breathless analysts were guessing.\n\nSo what happened? Well, not enough, and that’s the problem. Even the newest headsets aren’t that comfortable to wear for long stretches of time, so perhaps it’s a good thing there’s rarely a good reason to use them for long stretches of time.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe industry is shifting away from pure VR and toward augmented reality. A lot of Apple’s demo material for its new headset focuses on making the experience in a headset more integrated with the out-of-headset experience. It appears that most of the equipment manufacturers agree that if mainstream users don’t like being isolated in a dive mask with a screen welded to the inside, you have to rethink how the platform works.\n\nCanon tried to make VR calling a thing. I tried it out. It’s neat, and I was impressed by what the company did. But it wasn’t enough. There are some use cases for mixed and augmented reality — very basic heads-up displays and involved games and productivity apps, to name a few — but a solution doesn’t just have to be as good as the existing solutions. They have to be sufficiently better — so much so that people are willing to learn a whole new interaction paradigm.\n\nSo far, that’s where we’ve come up short. I still believe that Apple bursting through the wall like Kool-Aid Man with a “Hey, look what we built!” will completely shift the industry: A new generation of startups will see the market as mature enough to start building applications. I think it’s time we write off VR altogether. I’m curious whether AR has what it takes to take the baton and run with it. Even with the tailwind generated by the world’s most valuable company joining the fray, I’m still struggling to come up with ways that AR can be more than a novelty. But I would be foolish to bet against Apple, and most of the other VR companies have shown their hand as well: They are all on the AR train, and the tech world may just have enough curiosity to try again.\n\nThe VR king is dead. Long live the AR king."}