{"url": "https://techcrunch.com/2021/03/08/white-label-voice-assistants-will-win-the-battle-for-podcast-discovery/", "title": "White-label voice assistants will win the battle for podcast discovery", "authors": ["Amir Hirsh", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-03-08T00:00:00", "text": "Americans are bored, housebound and screened out. This has created a golden opportunity for audio as consumers turn to podcasts, voice assistants and smart speakers — often at the same time.\n\nRoughly 128 million Americans use a voice assistant at least once a month. Smartphones account for most voice assistants, but there are also nearly 160 million smart speakers in American homes.\n\nOne of the hottest forms of audio content is, of course, podcasts. Listeners have never had so many choices for smart and compelling podcast content, with new exciting shows emerging daily. On the consumption side, monthly podcast listeners topped 100 million for the first time in 2020, a 40% increase in just two years.\n\nListeners get their podcasts from dedicated podcast apps (such as Stitcher), publisher apps (like NPR’s), music apps (such as Spotify), or their default phone app or voice assistant. With more than 1.7 million podcasts being produced today, even the most dedicated podcast listeners can’t listen to every episode in their queue.\n\nThis is where voice assistants come in.\n\nThe major voice assistants — Amazon, Apple, Google, Microsoft and Samsung — dominate, but they face increasing competition for users from white-label voice assistants. This has become a battle that will be decided by whichever company can provide the best quality of service.\n\nThat’s why the voice assistant that can personalize podcasts and help listeners search, sample and discover content through shareable bite-sized pieces will win the voice wars.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nA familiar battle over users\n\nEarly consumer electronics battles for users were waged over the operating system — Windows vs. Mac. Voice is another form of operating system and the battle over voice is no less fierce.\n\nApple’s Siri was the first modern virtual assistant to reach the masses. Amazon and Google have also heavily invested — often at a loss — to own voice activation for users, grab market share and protect their turf (e-commerce for Amazon and search for Google).\n\nAmazon took 24% of the virtual assistant market in 2018, followed by Apple (22%), Google (20%), Microsoft’s Cortana (10%) (largely confined to desktop) and Samsung’s Bixby (6%).\n\nThese five major brands were early pioneers, but the next phase of the voice wars will be white-labeled, with voice assistants incorporated into all devices and brands.\n\nThe rise of white-label voice assistants\n\nUnable to develop their own voice assistants, hundreds of device manufacturers must resort to Google or Alexa if they want to add voice functionality to their products. But in a way, this is a Trojan horse: Adding Google or Alexa voice enhances products but undermines user relationships.\n\nSuch was the case with mobile phone manufacturers. Rather than developing their own operating systems, many used Android and lost their connection with customers, who began caring more about the operating system than the phone brand.\n\nIt’s the same with voice assistants: With every “Hey, Alexa” uttered to initiate a command, users forget the brand.\n\nBeyond branding, the device makers lose on other fronts, too: The user data is housed in the cloud. Amazon and Google also get to decide the redirection of actions and skills (the equivalent of “apps”). And the many business opportunities tied to skills and content services benefit the “operating system,” not the device maker.\n\nThat’s why hundreds of hardware and software makers are not easily ceding control of their users to the tech giants, and instead are seeking to introduce their own solutions. Luckily for them, things are changing. IBM introduced a white-label voice application in 2018. Companies can use their custom wake-up words, train with their own datasets and keep all the data.\n\nAmazon just followed suit and launched Alexa Custom Assistant. Device makers can use Alexa’s technology to create their own virtual assistants based on brand identity and user needs. Fiat, the first company to use the product, will integrate it into the Uconnect system of select vehicles. Its drivers may have to get used to saying “Hey, Fiat” instead of “Hey, Alexa.”\n\nBut don’t underestimate the power of “Hey, Fiat.” Car manufacturers struggle with brand loyalty and fostering relationships with customers, who often switch cars every few years. Automakers can start to build relationships with customers through voice.\n\nIn fact, more than 60% of car buyers say the availability of a voice assistant plays a factor in their purchase decision. This explains why companies such as Cerence and SoundHound have also stepped in to offer white-label voice assistants for the automotive industry.\n\nHow podcasts fit in\n\nThe big-name voice assistants are all pretty good at understanding voice commands, extracting intent and building chatbots. Amazon touts Alexa’s frictionless purchasing, while Google promotes its dominant search engine, but the voice assistants’ basic capabilities are fairly commoditized.\n\nConsumers haven’t yet embraced voice purchasing. Instead, they have enthusiastically adopted looking or content, including weather, news updates or podcasts. I expect content to become a critical factor in whether consumers choose Alexa, Google, Bixby or a white-label offering.\n\nBut podcasts are long, often 45 minutes or more. Distribution is also fractured. Taken together, listeners have a tough time searching for and finding the podcasts that align with their interests. They need audio content that can be skimmed and sampled, much like text or video.\n\nConsumers, who have been spoiled by Twitter, TikTok and Netflix, expect audio content to be short and personalized.\n\nBut personalization requires a structural change. Music personalization, a real game-changer, was only made possible once Steve Jobs convinced the music industry to break whole albums into individual songs. This fragmentation provides a flexible, superior experience, with personalization at its core.\n\nLikewise, personalized podcast listening experiences can only be delivered once podcast episodes are broken down into small bits and then reconstructed. And voice assistants are going to leverage such content more and more.\n\nAudio content also solves a major challenge tied to having a talking piece of hardware in your bedroom — authenticity. Voice users want authentic experiences. That’s impossible when the platform sounds like a robot. As much as Google and Amazon have tried to give their chatbots personality, there’s no forgetting that they are machines.\n\nShort-form audio can make all the difference. If I want to hear the most recent Tesla news, I’d rather listen to highlights of recent podcasts discussing the latest on the stock, with plenty of color and analysis, rather than receive a robotic answer that only relays the stock numbers.\n\nVoice assistants that harness the power of short-form content will gain an edge over the competition. Those that can best serve the needs of podcast listeners will win the users and take the cake.\n\nTC Early Stage: The premier how-to event for startup entrepreneurs and investors\n\nFrom April 1-2, some of the most successful founders and VCs will explain how they build their businesses, raise money and manage their portfolios.\n\nAt TC Early Stage, we’ll cover topics like recruiting, sales, legal, PR, marketing and brand building. Each session includes ample time for audience questions and discussion.\n\nUse discount code ECNEWSLETTER to take 20% off the cost of your TC Early Stage ticket!"}