{"url": "https://techcrunch.com/2020/09/08/dnx-ventures-launches-315-million-fund-for-u-s-and-japanese-b2b-startups/", "title": "DNX Ventures launches $315 million fund for US and Japanese B2B startups", "authors": ["Catherine Shu", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2020-09-08T00:00:00", "text": "DNX Ventures, an investment firm that focuses on early-stage B2B startups in Japan and the United States, announced today that it has closed a new $315 million fund. This is DNX’s third flagship fund; along with supplementary annexed funds, this brings its total managed so far to $567 million.\n\nFounded in 2011, with offices in San Mateo, California and Tokyo, Japan, DNX has invested in more than 100 startups to date, and has 13 exits under its belt. The firm, a member of the Draper Venture Network, focuses on cloud and enterprise software, cybersecurity, edge computing, sales and marketing automation, finance and retail. The companies it invests in are usually raising “seed plus” or Series A funding and DNX’s typical check size ranges from $1 million to $5 million, depending on the startup’s stage, managing director Q Motiwala told TechCrunch.\n\nDNX isn’t disclosing the names of its third fund’s limited partners, but Motiwala said it includes more than 30 LPs, including financial institutions, banks and large conglomerates. DNX began working on the fund last year, before the COVID-19 pandemic hit. Motiwala says DNX is optimistic about the outlook for B2B startups, because past macroeconomic crises, including the 2008 global financial crisis and the 2001 dot-com burst, showed founders continue innovating as they figure out how to make their businesses more efficient while building urgently needed solutions.\n\nFor example, DNX has always focused on sectors like cloud computing, cybersecurity, edge computing and robotics, but the COVID-19 pandemic has made those technologies even more relevant. For example, the massive upsurge in remote work means that companies need to adapt their tech infrastructure, while robots like the ones developed by Diligent Robotics, a DNX portfolio company, can help hospitals cope with nursing shortages.\n\n“Our overall theme has always been the digitization of traditional industries like construction, transportation or healthcare, and we’ve always been interested in how to make the reach to the customer much better, so sales and marketing automation, for example,” said Motiwala. “Then the last piece of this is, how do you make society or businesses function better through automation, and those might take things like robotics and other technology.”\n\nThe differences and similarities between U.S. and Japanese B2B startups\n\nOne of the reasons DNX was founded nine years ago was because “Japan has very strong spending on enterprise,” Motiwala said. The firm launched with offices in the U.S. and Japan and has continued to focus on B2B while growing the size of its funds. The firm’s debut fund was $40 million and its second one, announced in 2016, was more than $170 million. Motiwala said the $315 million DNX raised for its third fund was more than the firm expected.\n\nU.S. B2B startups tend to think about global expansion at an earlier stage than their Japanese counterparts, but that has started to change, he said, and many Japanese B2B companies launch with an eye on expanding into different countries. Instead of the U.S. or Europe, however, they tend to focus on Southeast Asian countries like Indonesia, Malaysia and Singapore, or Taiwan. Another difference is that U.S. startups make heavier initial investments in their technology or IP, while in Japan, companies focus on getting to revenue and breaking even earlier. Motiwala said this might be because the Japanese venture capital ecosystem is smaller than in the U.S., but that attitude is also changing.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nExamples of DNX portfolio companies that have successfully entered new countries include Cylance, a U.S. company that develops antivirus software using machine learning and predictive math modeling to protect devices from malware. DNX helped Cylance establish operations in Europe and Japan. On the Japan side, software testing company Shift, an investment from DNX’s first fund, has done “phenomenally well” in Southeast Asia, Motiwala said.\n\nIn terms of going global, DNX doesn’t push its portfolio companies, but encourages them to expand when the timing is right, especially if a U.S. startup wants to enter Japan, or vice versa. “We like to use the fact that we have teams in both regions. What we’ve seen more is the U.S. companies entering channel partnerships for Japanese distribution,” Motiwala said. “It has been more difficult to show the same thing to Japanese companies, but at the same time what we’ve realized is that instead of saying they should come into the U.S., they’ve done amazing stuff going into the Philippines or Singapore.”"}