{"url": "https://techcrunch.com/2025/01/17/amazon-bought-more-renewable-power-last-year-than-any-other-company/", "title": "Amazon bought more renewable power last year than any other company", "authors": ["Tim De Chant", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-01-17T00:00:00", "text": "Amazon bought renewable power at a rapid clip last year, adding around 100 new projects and bumping its portfolio to over 33 gigawatts of generating capacity. That’s over 10 gigawatts more than its nearest competitor, Apple.\n\nThe additions made Amazon the largest corporate purchaser of renewable power, according to BloombergNEF. The company’s total portfolio is split roughly evenly between utility-scale wind and solar farms and on-site solar power projects. In total, it’s enough to power 8.3 million homes, Amazon said.\n\nAmazon’s renewable and storage contracts have allowed it to reduce emissions from purchased electricity, so-called Scope 2 emissions, even as it has ramped up its data centers.\n\nStill, the company has a long way to go to eliminating its carbon footprint. Like many companies, the vast majority of Amazon’s emissions come from Scope 3, which covers activities over which it exercises less control. That includes outlays like air travel, leased buildings, and building construction.\n\nAccording to Amazon’s 2023 sustainability report, total emissions peaked in 2021 after rising sharply for many years. Its carbon intensity — a measure of greenhouse gas emissions divided by gross sales — has also been declining. (Carbon intensity is a metric favored by fast growing organizations, since they tend to consume more fossil fuels as they grow. If they invest in zero-carbon power, carbon intensity tends to grow more slowly or decline relative to overall emissions, telling a more positive story.)\n\nAmazon has yet to release its 2024 sustainability report, which would give a more complete picture of the company’s progress toward its 2040 net zero goal."}