{"url": "https://techcrunch.com/2022/07/29/heres-what-swarm-has-been-up-to-in-the-10-months-since-being-acquired-by-spacex/", "title": "Here’s what Swarm has been up to in the 10 months since being acquired by SpaceX", "authors": ["Darrell Etherington", "Editor At Large", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block"], "publication_date": "2022-07-29T00:00:00", "text": "It’s been nearly a year since satellite Internet-of-Things connectivity provider Swarm was acquired by SpaceX, and Swarm co-founder and CEO Sara Spangelo (now senior director of Satellite Engineering at SpaceX) is ready to talk about what Swarm’s been up to in that time. SpaceX is not known to be a super acquisitive company, so I was curious to hear about what it’s been like for Spangelo and for Swarm. Mostly, it’s been 10 months of rapid acceleration, she says.\n\nOne of Swarm’s biggest blockers in terms of speed of deployment and growing its network was the ability to actually launch its satellites, which themselves are tiny — the company says they’re “the smallest operational satellites in space,” at little more than the size of your average sandwich. Spangelo said that unlocking launch availability has been one of the biggest benefits of operating under the SpaceX umbrella so far.\n\n“Access to basically free launch is pretty exciting,” she told me in an interview. “We actually have launched probably three or four times since we last spoke [Editor’s note: in June 2021 for our Found podcast], and we now have over 160 satellites in LEO [low-Earth orbit] — some of those are experimental.”\n\nThose experimental payloads have helped the company improve its overall latency, so now it can guarantee latency at under one hour (meaning a Swarm satellite passes overhead any given point on Earth at least once an hour), which opens up broad new customer categories and applications for its low-bandwidth, hyperefficient connectivity services.\n\n“That’s a pretty important threshold, if you’re doing any sort of monitoring, whether it’s floods, water, forest fire detection, agriculture applications, logistics applications — that’s like a pretty important threshold in that community,” Spangelo explained. “So being low [latency], that has unlocked a bunch of exciting new use cases and customers.”\n\nSwarm’s tiny satellites have essentially been hitching a ride on SpaceX launches for other customers, where it’s easy for the company “to just pop them on” in Spangelo’s words. Satellite launch tends to be a game of ounces because of weight considerations, but the benefits of being the smallest operational satellites in space mean that you stand a better chance than most of fitting within existing mission payload parameters for SpaceX’s Falcon 9 rockets even with other cargo on board.\n\nWhile access to regular orbital delivery service is incredibly valuable to a technology like Swarm’s, Spangelo says that it’s also unlocked a host of other efficiencies that help the previously small startup leap ahead in terms of its maturation and infrastructure.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We’ve had access to just more support systems,” she said. “So legal, accounting, HR, recruiting, logistics, supply chain and production. That’s also helped us accelerate a lot of our production rate, [and] our hiring rate. We’ve been scaling up and we’ll probably do 10x the number of devices sold this year vs. what we did last year.”\n\nOf course, it’s a two-way street (it wouldn’t make much sense as an acquisition otherwise) and Spangelo says SpaceX is already benefiting plenty, too.\n\n“We’re also supporting SpaceX in a bunch of ways, from engineering and technology, and regulatory strategies, to lots of other programs that hopefully we get to talk about in the future,” she said, reserving details on just what those programs might entail for now. I suggested that some kind of marriage between Starlink’s consumer internet service and Swarm’s connected device offerings might make sense, and she did agree that there are synergies they’re exploring there.\n\n“We’re definitely having product discussions across the chasm that is Starlink broadband, to Swarm IoT and everything in between,” she said. “And the roadmap really fills in a lot of the gaps between those things that you’re hinting at. Certainly on the enterprise side, we’ve started to engage with some of the same enterprise customers. You can imagine big agriculture companies, or oil and gas, or maritime companies have need for broadband, as well as for satellite IoT. So we’ve definitely been able to benefit from those mutual relationships really both ways: Some Swarm customers are interested in Starlink, and vice versa.”\n\nWith new use cases and new sales relationships, as well as plenty of demand on both sides, Spangelo says both Starlink and Swarm within SpaceX are still growing their teams despite the current macroeconomic conditions, especially when it comes to specific types of talent.\n\n“A lot of people don’t know that Starlink is actually kind of a networking company,” she said. “We think of [SpaceX] as a hardware rocket company — a bunch of mechanical engineers. But the sophistication of the software, networking algorithms, back ends at the core networks and laser mesh networks, it’s incredibly complicated. So we have, I think, over 200 software engineers on Starlink, and 500 or so at [SpaceX]. But we are definitely looking for incredible talent there.”\n\nAs for what Spangelo is excited that Swarm has been able to do, and do better, working as a SpaceX company, she mentioned a number of new use cases that have come online since we last spoke, including wildfire detection. With a max of under one hour of latency, and often results that refresh in minutes, you can change considerably the approach to detection and mitigation of wildfires, which can spread for hours or even days without people knowing when monitored only through traditional methods. Swarm is working with a number of companies there, including Berlin-based Dryad Networks.\n\nAnother recent customer, Rainforest Connection, uses Swarm’s IoT network to connect simple acoustic sensors deployed in the Brazilian rainforest.\n\n“Basically, they have just an acoustic sensor, like you have on your phone, and it basically just hears a chainsaw, and then calls in the people that will stop the [deforestation],” she said. “That one is just so cool to me — that such a simple sensor can have like such a big impact, because it’s so hard to find these things.”\n\nAs for what the future holds for Swarm, Spangelo says that they’re actually pretty pleased with where the satellite hardware and design is currently, though they’re looking to build more software products for enterprise customers. There are also “some products that are more standalone that are actually more appropriate for tracking use cases, and some of the bigger enterprise use cases” that don’t require the sophisticated integration of their current modem design, she said, something more “on brand with” Elon Musk’s “out of the box philosophy”; something she said has already had influence on the product side.\n\nMeanwhile Swarm continues to operate out of its facility in Mountain View, just a short distance from a nearby SpaceX office, making collaboration relatively simple. The Falcon 9 launch pads are a little farther away, but you can’t beat the price for the ride."}