{"url": "https://techcrunch.com/2022/08/24/amazon-and-directv-partnership-brings-thursday-night-football-to-300000-bars-restaurants-and-other-venues/", "title": "Amazon and DirecTV partner on 'Thursday Night Football'", "authors": ["Lauren Forristal", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-08-24T00:00:00", "text": "Amazon Prime Video and DirecTV struck a multiyear agreement that allows business owners to stream “Thursday Night Football” for their patrons. Amazon’s “TNF” broadcasts, including pregame, halftime and postgame coverage, will be available to more than 300,000 sports bars, restaurants, retail stores, hotel lounges, casinos and sports books, among other venues across the U.S., regardless of if it is a national chain or local.\n\nDirecTV for Business customers that are subscribed to Business Entertainment, Business Xtra, Commercial Entertainment, Commercial Xtra, Commercial Choice PLUS and the Spanish-language Commercial Mas Ultra will automatically get Prime Video’s “Thursday Night Football” feed for no extra cost. The games can be found on DirecTV channel 9526.\n\nThe deal will begin with the preseason football matchup between the San Francisco 49ers and the Houston Texans on August 25. The regular season slate will commence on September 15.\n\nTypically, bars and restaurants don’t have streaming services because it can be expensive to upgrade all the TVs. DirecTV for Business allows venues to continue providing NFL fans with an otherwise streaming-exclusive “Thursday Night Football” lineup of games.\n\n“The sports media landscape continues to evolve rapidly, and the focus on delivering a great experience to our entire range of customers must remain at the center of that evolution,” said Rob Thun, DirecTV chief content officer, in a statement. “This agreement between Amazon and DirecTV for Business comes at an important time when more streaming companies are obtaining exclusive rights to marquee sports programming and fans want to cheer on their teams at home and while out at bars, restaurants, and other businesses with friends, family, and coworkers.”\n\nStarting in 1994, DirecTV hosted NFL’s “Sunday Ticket.” However, its rights to broadcast the popular football package expire at the end of the upcoming season. While it will no longer be a partner for “Sunday Ticket,” this new deal with Amazon allows the satellite company to remain in the NFL business.\n\nLast month, NFL Commissioner Roger Goodell said the National Football League would most likely announce a streaming partner for “Sunday Ticket” in the fall.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe NFL’s 11-year media rights agreement with Amazon Prime Video makes the streaming service the first streamer to hold exclusive rights to a package of NFL games.\n\nLast week, Amazon closed a three-year deal with Nielsen to include the streaming service and its livestreaming program “Thursday Night Football” in its National TV measurement service, a first for the data measurement firm."}