{"url": "https://techcrunch.com/2022/07/20/skullcandy-is-partnering-with-amazon-to-offer-dual-smart-assistants/", "title": "Skullcandy is partnering with Amazon to offer dual smart assistants", "authors": ["Ivan Mehta", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-07-20T00:00:00", "text": "Skullcandy announced at Amazon’s Alexa live event today that is partnering with Native Voice — a voice service provider for hardware devices — to make multiple voice assistants available on the upcoming models of its Push Active and Grind Series headphones.\n\nThese headphones will have support for Amazon Alexa and “Hey Skullcandy” wake words. Skullcandy unveiled its voice assistant last year with limited functionality to control play/pause songs, control volume, skip tracks and accept/reject calls. Now, on select headphone models, you’ll be able to use Skullcandy’s own assistant to control playback and Alexa to issue other smart commands such as finding a song, getting information about the weather or setting a reminder.\n\nIn May, Sonos unveiled its own voice assistant for a range of speakers to control and even play songs on select services like Apple Music, Amazon Music, Deezer and Pandora. But you can also add other assistants like Amazon Alexa for other smart commands. While you can use Sono’s Sonos Voice Control with Alexa simultaneously on the same speaker, Google Assistant doesn’t have the same ability. You can only invoke Pioneer’s driving assistant device NP1 also has support for dual assistants.\n\nAt its Alexa Live event, Amazon announced future capabilities like Universal Device Commands (UDCs) to invoke a command from any compatible assistant on the device and Agent Transfers (ATs) to shift requests from one assistant to another. These are some of the features that will make it easier for customers to use multiple assistants on a device without worrying about remembering a voice assistant’s specific features and limitations.\n\nWhat’s more, the company is clubbing Alexa Smart Screen SDK and the AVS Device SDK under a single SDK called Alexa Voice Service(AVS) SDK 3.0 to enable multimodal experiences across smart devices."}