{"url": "https://techcrunch.com/2022/07/28/fly-io-wants-to-change-the-way-companies-deploy-apps-at-the-edge/", "title": "Fly.io wants to change the way companies deploy apps at the edge", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-07-28T00:00:00", "text": "Fly.io co-founder and CEO Kurt Mackey says that developers don’t really understand the term edge computing. They just know they want to run their applications closer to the user to make them more responsive. He believes that the traditional way of doing this with a content delivery network (CDN) is a flawed approach, and he started Fly.io to deliver applications close to the user in a more efficient way.\n\nToday the company announced a $25 million Series B that it closed in June, and also publicly revealed a $12 million Series A for the first time that it raised last August.\n\nThe best way to think about Fly is a new kind of public application delivery cloud that delivers applications all over the world wherever the end user happens to be. It doesn’t involve building its own data centers, at least not yet, but it does require installing hardware in different co-location facilities around the world.\n\n“So we deploy our own hardware. We’re not built on top of other [clouds]. Developers are building applications, particularly real-time applications where responsiveness to user interactions matters a lot. So basically they use us to just ship their stack in whatever country they happen to be in,” Mackey explained.\n\nIf that sounds like a CDN to you like Cloudflare or Akamai, Mackey sees a big difference between what his company is doing and this approach. “My hot take is that a CDN is kind of a misfeature for most developers building dynamic applications because what happens is you end up running your app in Virginia, and then putting some of it on the CDN that then runs close to users, rather than just putting the application itself where it needs to go,” he said.\n\nThe company launched in 2017 and it has spent a great deal of time refining the process of deploying the hardware where it’s needed, and Mackey thinks that from those lessons, he can continue to scale as the company grows. In fact, he sees this as an operational problem, rather than a financial one, getting enough money to finance the hardware.\n\n“We have several hundred thousand apps deployed at this point. And the types of users using us today are kind of small teams of developers running a full stack app in a database. They might be using like 50 to 100 gigs of data, but it’s easy to size because the servers we buy are so enormous, we can support a lot of those customers with the original install.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe company helps the developers deploy the applications where it’s needed. He says that the founders grew up using Heroku and they’ve tried to use that as a reference point as they built the software side of the company. “The way you deploy an app is very similar to Heroku. You download the CLI, and then you run in ‘fly launch’ and if all goes well, your app gets packaged up and deployed to our cloud,” he said.\n\nMackey previously founded a company called MongoHQ, which later changed its name to Compose before being sold to IBM in 2015. In spite of being an experienced founder with an exit under his belt he and his co-founders went through Y Combinator in Winter 2020. He says that he benefited more than he thought he would from the experience. “I went in a little arrogant, and then as soon as I started talking to the partners there, I realized they knew so much more than I do because [they have dealt with] thousands of companies, and their advice was incredibly helpful,” he said.\n\nWhen the company came out of Y Combinator and started talking to investors in the 2020 timeframe, most thought the idea of deploying their own physical hardware was silly, but they came around to it as they saw it was less expensive than running Amazon EC2 instances, and they were building a system where they could control costs better.\n\nThe company currently has around 35 employees, and it’s hiring. Mackey says that he gives a lot of thought to how to build a more diverse workforce, while recognizing that it’s easier said than done.\n\n“I think we’ve done a few things well to make progress, but I also think that as I’ve gotten older, I’ve realized this is a priority that remains important, but never gets solved,” he said. One thing his company has done is rather than hiring the most experienced engineers he can find, he looks at people from different backgrounds and then benefits from getting these differences in perspective.\n\n“I’d say that the one thing we’ve done really well this time around is just basically being good at engineering management and giving people a place where they could start early and then progress.”\n\nThe company’s $25 million Series B was led by Andreessen Horowitz with help from Intel Capital, Dell Technologies Capital, Initialized Capital and Planetscale CEO Sam Lambert. The Series A was led by Intel Capital."}