{"url": "https://techcrunch.com/2024/09/09/confluent-acquires-streaming-data-startup-warpstream/", "title": "Confluent acquires streaming data startup WarpStream", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-09-09T00:00:00", "text": "Streaming data and Kafka specialist Confluent on Monday announced that it has acquired WarpStream, a Kafka-compatible streaming data solution. Confluent plans to use WarpStream’s cloud-native solution to fill out its portfolio by offering a new service (Confluent WarpStream) that can sit in between its fully managed Confluent Cloud and self-managed Confluent Platform.\n\nAs Confluent co-founder and CEO Jay Kreps told me, he thinks that what sits in between those two existing models is what he calls the “bring your own cloud” (BYOC) model.\n\n“There’s definitely a set of people who want some self-managed piece of software. They’re going to go around themselves,” he explained. “And there’s a set of people who want a fully managed cloud. But in some of these organizations, there’s a set of use cases that either have requirements around the data in their environment not being able to leave or just need a fair amount of customization that leaves them doing everything themselves, which is not ideal. So this kind of ‘bring your own cloud’ is like a nice middle position where you can have something that’s like a cloud offering, but it could be in your environment with a fair amount of control.”\n\nImage Credits:Confluent\n\nWarpStream, Kreps said, built the right product for this market, and while Confluent could’ve tried to adapt one of its products for these users, he didn’t think that this approach would work well. “We feel this kind of completes the set of offerings. And this has been one of our beliefs for streaming: Since customers need it across such a broad set of use cases, you have to have the full portfolio of offerings if you really want to get all the streams of data and actually make it useful for customers,” he said.\n\nHe also noted that nobody wants to adopt a new protocol for different data streaming use cases. The market, for the most part, has standardized on Kafka, even if the underlying technology continues to evolve. That’s true for WarpStream as well, which Kreps noted has done a good job establishing itself with users in the observability, logging and IoT spaces.\n\nImage Credits:Confluent\n\nConfluent also hopes that WarpStream will offer some of the customers who are using and managing their own open source Kafka systems an easy on-ramp onto its platforms.\n\n“We’re excited that the leader in the data streaming space has acquired WarpStream to offer next-gen BYOC to customers,” said Richard Artoul, co-founder and CEO, WarpStream. “Together with Confluent, we will continue to ensure that Kafka-compatible data streaming is accessible to every organization.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWarpStream launched just over a year ago and had a team of 13 at the time of the acquisition. In Monday’s announcement, Artoul describes how Kreps reached out to him shortly after the company launched. “Over the next few months we met with more people at Confluent to determine if there was a path forward for WarpStream to exist under the Confluent umbrella, and today we’re happy to announce that we’ve found one,” he writes.\n\nClearly, there was a path forward, and while the two companies did not disclose the price of the acquisition, it’s worth noting that WarpStream announced a $20 million funding round led by Greylock and Amplify Partners earlier this year. “It was a good deal for all involved,” Kreps said."}