{"url": "https://techcrunch.com/2022/01/18/us-airlines-warn-c-band-5g-could-cause-catastrophic-disruption/", "title": "US airlines warn C-Band 5G could cause ‘catastrophic disruption’", "authors": ["Igor Bonifacic", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-01-18T00:00:00", "text": "The airline industry claims a “catastrophic” event could unfold on Wednesday when AT&T and Verizon activate their new C-Band 5G networks. In a letter obtained by Reuters , the CEOs of several prominent passenger and cargo airlines, including Delta, United and Southwest, warn interference from 5G cell towers could affect the sensitive safety equipment on their planes.\n\n“Unless our major hubs are cleared to fly, the vast majority of the traveling and shipping public will essentially be grounded,” they state in the letter, which was sent to the heads of the White House Economic Council, Federal Aviation Administration and Federal Communications Commission, as well as Transportation Secretary Pete Buttigieg. “Immediate intervention is needed to avoid significant operational disruption to air passengers, shippers, supply chain and delivery of needed medical supplies.”\n\nThe airlines have asked that AT&T and Verizon not offer 5G service within 2 miles of some of the country’s busiest and most vital airports. They’re also urging the federal government to ensure “5G is deployed except when towers are too close to airport runways until the FAA can determine how that can be safely accomplished without catastrophic disruption.” The agency established 5G buffer zones at 50 airports on January 7th.\n\nThe letter is the latest development in the ongoing back and forth between the airline and wireless industries. AT&T, T-Mobile and Verizon spent nearly $80 billion at the start of 2021 to secure the repurposed C-Band spectrum the FCC had put up for auction. In November, AT&T and Verizon agreed to delay their C-Band rollouts to January 5th to help the FAA address any interference concerns. They later proposed limiting the power output of cell towers close to airports and agreed to a further two-week delay on January 4th.\n\nEditor’s note: This article originally appeared on Engadget."}