{"url": "https://techcrunch.com/2024/02/22/sonys-ps-vr2-is-getting-compatibility-possibly-by-end-of-year/", "title": "Sony’s PS VR2 is getting compatibility, possibly by end of year", "authors": ["Brian Heater", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-02-22T00:00:00", "text": "PlayStation VR often gets overlooked in conversations about mixed reality. These days, it seems all anyone wants to talk about is Apple Vision Pro versus Meta Quest. But Sony has been an enduring presence in VR for years now, throughout the industry’s various ups and downs (mostly downs, if we’re being honest here).\n\nThe Japanese electronics giant this week confirmed plans to give the PS VR2 a new lease on life, as it has begun testing PC compatibility. The news was buried a few paragraphs deep in a PlayStation.Blog post highlighting a number of new titles for the platform.\n\nHere’s the entirety of what Sony Interactive Content Communications Manager Gillen McAllister wrote on the topic this morning: “Also, we’re pleased to share that we are currently testing the ability for PS VR2 players to access additional games on PC to offer even more game variety in addition to the PS VR2 titles available through PS5. We hope to make this support available in 2024, so stay tuned for more updates.”\n\nPhrases like “we hope to make” don’t instill a lot of confidence around when — or if — the cross-platform compatibility will arrive. Given that we’re only just entering late-February, we’re talking about a big window, assuming Sony does hit the 2024 deadline.\n\nThat the feature was tossed off in a post of new titles is telling in itself. Content has always been an issue for mixed reality, but opening up the headset to Windows titles would suddenly bring in a flood of new experiences overnight.\n\nPlayStation exclusivity is likely a big part of the reason PS VR often doesn’t feel like a part of the broader mixed reality conversation. So, too, is the fact that the peripheral is focused pretty exclusively on gaming, whereas Apple, Meta and — to an extent — HTC are looking to encompass something broader that also includes spatial computing/productivity, enterprise applications and other entertainment avenues.\n\nGaming is, of course, a big, broad category unto itself. The space has been the key driver of VR technologies for decades now, and there’s plenty of growth to navigate and grow in that line. Opening up to PC titles will certainly help PS VR on both of those fronts."}