{"url": "https://techcrunch.com/2022/05/04/twitter-tries-to-woo-anxious-advertisers-with-a-slate-of-premium-video-content-at-the-newfronts/", "title": "Twitter tries to woo anxious advertisers with a slate of premium video content at the NewFronts", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-05-04T00:00:00", "text": "Twitter returned to the Digital Content NewFronts this evening to pitch its upcoming premium video content slate to advertisers, as it had in previous years. But this time around, the company is faced with a group of media buyers who are worried about the future of the social network as a “brand-safe” platform for their marketing efforts. As various reports have noted, some Twitter advertisers have already begun planning how to stop spending on Twitter if Elon Musk’s takeover leads to the service becoming a more toxic and abusive social network.\n\nAdvertisers understand that Musk’s vision of Twitter as a “free speech” platform is one that doesn’t necessarily align with their interests. Brands are historically adverse to having their messages appear next to abusive and divisive speech, hate speech and misinformation. And if Musk were to roll back Twitter’s existing content moderation controls, it could lead to an increase in the sort of content that brands like to avoid becoming more prevalent across Twitter’s platform.\n\nIn recent days, Twitter attempted to assuage advertisers’ fear by writing to ad agencies with assurances that Twitter would remain a safe place for them in the future by separating their ads from any harmful content. But businesses know that Twitter can’t make promises about changes Musk has yet to make. Twitter knows that, too — in an SEC filing this week, Twitter warned that a loss of ad dollars is one of the risk factors related to the acquisition.\n\nIn previous years, Twitter’s presentation at the NewFronts has previously been a more tepid affair. The company isn’t really thought of in the same space as larger streamers and media companies like Roku, Amazon or NBCU. And it tends to have less to offer than rival social media companies like Snap, Meta and now TikTok — all of which have already presented this week.\n\nThis time, however, Twitter didn’t just have to pitch its content, it had to convince advertisers it has enough relevant and interesting content to retain them as partners, despite the changes ahead.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhile the presentation fell short of being the “spectacle” Bloomberg sources promised, it did include a lot of loud music and boisterous cheering from the audience for every announcement (which was … not suspicious at all).\n\nEssentially, Twitter aimed to convince advertisers that their content would be available in a brand-safe zone on Twitter thanks to its upcoming premium video partnerships.\n\nAfter taking the stage, Twitter’s Chief Customer Officer Sarah Personette promised the audience the company’s investments in its video and ads business would continue.\n\n“I hope that you see that we are going to continue to invest in the parts of our business that bring scroll-stopping content to the timeline,” she said, first pointing to Twitter’s premium video product before highlighting its ad program’s success.\n\n“Twitter Amplify has been one of our fastest-growing products over this past year, proving that it’s turnkey products like this that drive real results for you,” she continued.\n\n“We’re committed to growing our audience. We are committed to investing in our product innovation, and we are committing to increasing the velocity with which we ship products. We’re committed to deepening the relationships with the top rights holders and premium content publishers in the world and also across this country. This is extremely important to us because we know it matters for you to be able to connect your brands with the people that matter to you. So I hope that you have seen this commitment from us tonight,” she said.\n\nTwitter’s content lineup — which this year included both video and audio deals, thanks to Twitter Spaces — wasn’t significantly differentiated from the type of deals that are expected for the social network, however.\n\nThe company announced an expansion of a partnership with Condé Nast for live events like Vogue’s Red Carpet at the Met Gala, the Vanity Fair Oscar Party Red Carpet and the Pitchfork Music Festival. It said it will also include other content from Wired, Bon Appetit and The New Yorker, plus highlights, Twitter Moments and multiple Twitter Spaces (audio events) per month.\n\nTwitter is also expanding its partnership with Essence and the WNBA. The former will showcase highlights from events like the Essence Festival of Culture and the Global Black Economic Forum; weekly clips from series like “The Receipts” and “Essence Uncovered” and monthly Spaces. The WNBA and Twitter are announcing a multiyear extension of their now six-year partnership, which will include 12 live games during the 2022 season. For the first time, the @WNBA account will also host Spaces throughout the season and during WNBA tentpole events and the offseason.\n\nE! News, meanwhile, will launch a new livestreaming show for Twitter called “While You Were Streaming,” hosted by Danielle Robay. The show covers popular TV shows like “Stranger Things,” “Obi-Wan Kenobi,” “The Real Housewives” and others, where Robay will be joined by a rotating selection of guests, experts and past stars.\n\nTwitter will also newly partner with Revolt to bring music, lifestyle, urban entertainment, sports and social justice content to the platform, including “Drink Champs,” a hip hop podcast; Revolt Summit; “The Crew League,” where artists compete on the basketball court; financial literacy series “Assets Over Liabilities;” and “Revolt Black News Weekly.”\n\nThe company also said it will be the first social partner to test an integration with NBCU’s cross-platform video-certified measurement partner, iSpot. Advertisers who purchase Amplify sponsorships from NBCUniversal will gain additional insights about the incremental audience generated by their Twitter media campaigns with this deal.\n\nFinally, Twitter said it will launch a pilot program that will bring real-time highlights about global events to the platform. The program will allow advertisers to promote and run pre-roll on live event pages with the highlights, which will allow Twitter users to discover content in their timeline and in the Explore tab.\n\n“At the heart of advertising is a desire to not just reach consumers but to connect with them around something they care about. Twitter Amplify helps brands get there,” Robin Wheeler, Twitter’s VP and new head of U.S. Client Services, said in a statement shared ahead of the event. “When advertisers tap into Twitter’s premium video content, they are aligned with the topics that our uniquely engaged audience is already obsessing over. Premium, brand-safe content that serves diverse communities is more important than ever today. We’re grateful to find new ways to expand this inventory on Twitter, giving our advertisers and marketers a place to drive incremental reach and results” Wheeler added.\n\nPersonette concluded tonight’s presentation with an offer of gratitude to the brands (still?) working with Twitter.\n\n“Your partnership makes us better each and every day. And we are exceptionally grateful for how you stand with us … ,” she said."}