{"url": "https://techcrunch.com/2024/08/19/as-co2-emissions-from-supply-chains-come-into-focus-this-startup-is-aiming-at-farms/", "title": "As CO2 emissions from supply chains come into focus, this startup is aiming at farms", "authors": ["Mike Butcher", "Editor At Large", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-08-19T00:00:00", "text": "There are by now plenty of carbon accounting and emissions management platforms. However, startups tracking emissions problems have tended to go for the lowest-hanging fruit first: the direct greenhouse gas emissions from sources owned by a company. In the parlance of the climate industry these are called “Scope 1.” “Scope 2” emissions are all about GHG emissions from the energy a company uses. Now, if you put together Scope 1 and 2, they account for only about 25% of total global emissions. The rest come under Scope 3 emissions, and these are hidden inside supply chains and are very hard to track.\n\nStartups are starting to tackle these supply chain emissions. For example Clearly recently raised a $4.3 million seed round to tackle the emissions of supply chains associated with transportation.\n\nAnother example of this is how the 113 million tons of CO 2 emissions that Nestlé produces equals all of Belgium’s GHG emissions: More than 107 million are emitted across the supply chain.\n\nNow another “vertical” play is attracting investors. This time in the shape of a startup looking to decarbonize the supply chains in agriculture.\n\nRoot Global helps food and beverage companies collect primary data on their agricultural supply chains. The RootOS platform was launched in October 2023 by co-founders Eric Oancea and Maurice Hensl, and now has clients from dairy plants and fast-food chains, though the company has declined to name its customers so far. It’s working with more than 10,000 farmers to date.\n\nRoot Global has now raised an €8 million seed round, led by Christoph Janz at Point Nine, with participation from Project A, HelloWorld, Arc Investors and other startup operators such as P9 alumnus Robin Dechant and Cargo.one CTO Mike Rötgers.\n\nThe startup says sustainability and procurement teams at food companies use its platform to collect verifiable primary data from farmers, who just answer a few simple questions. The rest of the data needed for GHG emissions calculations is then retrieved from existing documents and other data sources.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nRoot Global then models each product’s environmental footprint, allowing companies to see the “emission hotspots” across their supply chains.\n\nOancea thinks emissions-tracking companies like Watershed, Sweep and Normative are too “one-size-fit-all.” “What these companies are doing is using secondary data and industry benchmarks, to calculate, say, on average, one piece of aluminum has a carbon footprint of 5 kilograms of CO 2 ,” Oancea said. “Or 1 liter of milk has a carbon footprint of 2 kilograms of CO 2 . But in reality, those numbers are incredibly different.”\n\nHe says the food industry needs to shift away from using generic software solutions or climate consultancies that use market benchmarks “towards a system or a process in which you as a company actually start collecting activity data from your supply chain.”\n\nOf course, that means getting very granular. The hundreds of thousands of farmers that might, for instance, supply McDonald’s emit CO 2 based on a bewildering array of variables such as how many cows they have, what they feed them, what fertilizer they use, etc.\n\nOancea says these variables “will lead to gigantic differences in greenhouse gas emissions between suppliers and so until we don’t get there and we collect data from these suppliers, it’s impossible to make better decisions to reduce the carbon.”\n\nHe says Root Global’s platform is used by sustainability managers and procurement managers in big food companies that use it to interact with their suppliers such as farmers. It can hook into a farm management information system, and pull in the relevant data. “We put it into our carbon calculator, and with that, every supplier gets a tailored score that represents the reality on their farm.”\n\nRight now Root Global is only available in the German-speaking DACH market and in some Eastern European countries, but it plans to expand across the whole of Europe this year."}