{"url": "https://techcrunch.com/2023/03/23/hex-lands-another-28m-as-data-collaboration-platform-continues-to-gain-traction/", "title": "Hex lands another $28M as data collaboration platform continues to gain traction", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-03-23T00:00:00", "text": "Many companies are struggling to get funding these days in an increasingly tight investment environment. It seems the days are gone when VC firms approach promising startups about funding instead of the other way around, but Hex, a data collaboration startup, has defied the odds.\n\nCompany co-founder and CEO Barry McCardel says he wasn’t looking for funding when Sequoia came knocking on his door. The company ended up landing another $28 million from Sequoia, with participation from existing investors Andreessen Horowitz, Amplify and Snowflake.\n\nMcCardel says he still hasn’t touched the $52 million he had in the bank from his previous funding round last year. “We weren’t raising, and didn’t need the money — we hadn’t touched a dime of the last round. But Matt Miller at Sequoia approached us preemptively with an offer that gave us very little dilution, and let us put another 2-3 years of runway in the bank,” McCardel told TechCrunch.\n\n“This felt like a no-brainer coming into a time when we want to be investing deeply in our product and team, especially around the AI opportunity,” he said.\n\nOne of the reasons for the investor interest is that the company has been growing at a rapid clip since its funding last year. “We’ve been on a tear. I think from a top line business perspective, we’ve grown revenue by 4x and the size of the business by 4x in one year, which has been great. We 10xed our user base because we launched a tier that just opened up access to a ton more people.”\n\n“So just the raw number of people using the product in the last year has been great. And I think that obviously caught the eye of new investors,” he said.\n\nThe company now has 450 paying customers including Brex, Notion, Toast and Chegg. He believes that the collaborative approach to data and the growing recognition that AI is transforming workflows are the biggest reasons for the product’s growing popularity.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMost recently, the company added a tool called Hex Magic, a generative AI approach to interacting with the data with plain language by asking questions about the data, or asking Hex to undertake a task like auto-completing a join, and the software responds to the requests. He sees this as a way to expand the user base beyond folks like data scientists and people who know SQL or Python.\n\n“Our product uniquely allows collaboration across different data personas. I think that’s also really powerful. And I think the AI stuff is just accretive to that. You don’t necessarily have to know how to write the perfect syntax in Python to do something because Hex can help you do that. So I think that’s a pretty powerful thing that we’ll just see become more and more important in terms of opening up [the platform] to more people,” he said.\n\nHex was founded in 2019 and has now raised more than $100 million dollars in just four years, per Crunchbase data. With the most recent round of funding. McCardel says he should have five years of runway, setting his company up to ride out whatever economic uncertainty may be out there, while giving him the freedom to grow the platform as needed."}