{"url": "https://techcrunch.com/2024/03/06/twitch-is-looking-at-life-beyond-the-livestream/", "title": "What’s next for Twitch? A big app redesign and more social sharing", "authors": ["Taylor Hatmaker", "Culture Editor", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block"], "publication_date": "2024-03-06T00:00:00", "text": "In an open letter published on Wednesday, Twitch CEO Dan Clancy outlined the livestreaming company’s plans for 2024, with a focus on helping streamers grow their audiences even when they aren’t live.\n\nThis year, Twitch plans to overhaul its app for the first time in five years, ditching its long-standing design to focus on a scrollable feed that takes after TikTok and lets viewers hop between bite-sized bits of content to discover new streamers. The company hasn’t named a date for the launch of the redesigned app, but the move shows that Twitch is prioritizing changes to make both its business and its streamer community more sustainable for the long haul.\n\n“People can’t be live all the time, right? So we want to give tools to creators, to help them continue to engage their community while they’re offline,” Twitch VP of Community Product, Jeremy Forrester, told TechCrunch in an interview.\n\nTwitch has had a rocky year. Emmett Shear, one of the original founders of Justin.tv, the variety livestreaming service that would grow into Twitch, stepped down from his role as the company’s CEO a year ago. In the time since, Twitch has undergone rounds of deep layoffs, cutting another 500 employees — an additional 35% of its workforce — last month. Late last year, the company announced that it would pull out of South Korea, a major esports market, citing the “prohibitively expensive” cost of running an online business there. In 2023, Twitch also wrestled with community-wide controversies following updates to its revenue split and branded content rules, which in both instances the company walked back after a backlash from streamers.\n\nGiven the layoffs and broader uncertainty about its business, 2024 is a make-or-break year for Twitch. The company needs to tighten things up while reassuring the streamers who make the platform tick that Twitch is the right place to invest their time and energy.\n\nBeyond going live\n\nLivestreaming has long been Twitch’s bread and butter, but in the past year the platform has been more open to ways of packaging its content that don’t require streamers and viewers to be online at the same time.\n\nA year ago, Twitch released a tool that helped streamers easily export video clips to apps like YouTube and TikTok, with plans to export directly to Instagram on the way soon. Those additions show that Twitch knows that it needs a symbiotic rather than purely competitive relationship with other social networks to boost discoverability and make it easier for creators just getting started to build an audience.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We want to drastically increase the amount of content that’s exported from Twitch into other social networks,” Forrester said. “So the goal really is like, a lot more people seeing more Twitch content every time they’re in Instagram, every time they’re in TikTok, every time they’re in YouTube Shorts.…\n\n“Live content is very different from offline content, and offline content has a somewhat easier ability to go viral. In general it’s easier to get massive boosts on offline content than it is on live. And that’s one of the benefits of getting more content onto other services … you have an opportunity to be exposed to more people and more opportunities to get seen by many people and bring them back to your community.”\n\nStream Together, the co-streaming product previously known as Guest Star, is another gesture toward improving discovery. Twitch says that it plans to bring improvements to Stream Together to streamline the setup process and build a way for streamers to “spontaneously” discover other streamers to collaborate with on the platform, rather than counting on them having an existing community of peers to tap. That might be a risky proposition (a lot can go wrong when you’re live), but it shows that Twitch knows it needs all of the force multipliers it can get to drive viewers to channels beyond its well-followed superstars.\n\nTwitch also introduced its own version of a Snapchat or Instagram-like Stories into the app last year. The feature sits at the top of the current design and highlights ephemeral posts from channels its users follow. Twitch’s Stories will soon add some basic quality-of-life improvements, like letting streamers create and upload original short videos, adding pinch-to-zoom for photos and making it possible to share vertical stream clips.\n\n“The purpose is how do we allow creators to engage with their community when they’re not live,” Forrester said. “How do we allow creators to take a break, but still be able to connect with their fans and their watchers and hopefully bring them back to future live streams.”\n\nBecause of its long viewing sessions and the fact that streamers rely on beefy PCs (and, perhaps even more essentially, ambient RGB lighting), Twitch historically has focused more on its desktop experience than its mobile app. But the company wants to make those experiences more equal, including for the moderators who keep many of its popular communities humming along. In the open letter, Clancy acknowledged that the lack of mobile tools for mods was “a real limitation” for keeping communities safe and that the company will introduce a mobile mod view for iOS so mods can do their thing on the go.\n\nTwitch’s growing pains\n\nMost social media platforms focus on punchy, seconds-long videos or short, grabby lines of text, but Twitch has always been a different beast. Content on Twitch is extremely long form, with streamers regularly broadcasting gameplay or just chatting for many hours per session. Viewers who follow streamers on Twitch are glued to these lengthy sessions, but the long-form approach does have some inherent challenges, which the company is grappling with in 2024.\n\nFor one, all of that livestreaming infrastructure for many hourslong sessions is very expensive, even under Amazon’s wing. And given the depth of recent layoffs, Twitch’s parent company doesn’t seem willing to let its livestreaming business lose money forever. Another problem is that every six-hour streaming session is powered by a streamer — an individual person that Twitch needs to adequately incentivize to keep broadcasting for long hours without them burning out.\n\nUnfortunately for Twitch, many compelling alternatives to broadcasting one’s life for hours on end exist, particularly in the form of YouTube. YouTube has its own livestreaming service, YouTube Gaming, but is much better known for its creator-friendly economics and the trove of asynchronous videos discoverable through its keen recommendation engine.\n\nFor now, Twitch’s plan is to cultivate products that complement the long live sessions the platform is known for, ideally giving streamers a little more breathing room in the process.\n\n“We are very mindful about the amount of hours it takes to be successful on the platform and we are not looking to ever increase that,” Forrester told TechCrunch. “But hopefully over time, I would love to be able to show that you can be as successful investing less hours in the live portion of your work.”\n\n“I think the proof is kind of in the pudding: If we can make it so the streamers can more efficiently grow, more efficiently monetize, I’m hopeful and optimistic that opens the door for streamers to be like, ‘Oh, I’m going to take more time off, I’m gonna spend more time doing other things [and] invest in other aspects of my career,’ which hopefully will pay off in the long run.”"}