{"url": "https://techcrunch.com/2021/06/09/voice-ais-are-raising-competition-concerns-eu-finds/", "title": "Voice AIs are raising competition concerns, EU finds", "authors": ["Natasha Lomas", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-06-09T00:00:00", "text": "The European Union has been digging into the competition implications of AI-powered voice assistants and other Internet of Things (IoT) connected technologies for almost a year. Today it’s put out a first report discussing potential concerns that EU lawmakers say will help inform their wider digital policymaking in the coming years.\n\nA major piece of EU legislation introduced at the back of last year is already set to apply ex ante regulations to so-called “gatekeeper” platforms operating in the region, with a list of business practice “dos and don’ts” for powerful, intermediating platforms being baked into the forthcoming pan-EU Digital Services Act.\n\nBut of course applications of technology don’t stand still. The bloc’s competition chief, Margrethe Vestager, has also had her eye on voice assistant AI technologies for a while — raising concerns about the challenges being posed for user choice as far back as 2019, when she said her department was “trying to figure out how access to data will change the marketplace”.\n\nThe Commission took a concrete step last July when it announced a sectoral inquiry to examine IoT competition concerns in detail.\n\nIt’s now published a preliminary report, based on polling more than 200 companies operating in consumer IoT product and services markets (in Europe, Asia and the U.S.) — and is soliciting further feedback on the findings (until September 1) ahead of a final report due in the first half of next year.\n\nAmong the main areas of potential competition concern it found are: Exclusivity and tying practices in relation to voice assistants and practices that limit the possibility to use different voice assistants on the same smart device; the intermediating role of voice assistants and mobile OSes between users and the wider device and services market — with the concern being this allows the owners of the platform voice AI to control user relationships, potentially impacting the discoverability and visibility of rival IoT services.\n\nAnother concern is around (unequal) access to data. Survey participants suggested that platform and voice assistant operators gain extensive access to user data — including capturing information on user interactions with third-party smart devices and consumer IoT services as a result of the intermediating voice AI.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“The respondents to the sector inquiry consider that this access to and accumulation of large amounts of data would not only give voice assistant providers advantages in relation to the improvement and market position of their general-purpose voice assistants, but also allow them to leverage more easily into adjacent markets,” the Commission writes in a press release.\n\nA similar concern underlies an ongoing EU antitrust investigation into Amazon’s use of third-party merchants’ data which it obtains via its e-commerce marketplace (and which the Commission believes could be illegally distorting competition in online retail markets).\n\nLack of interoperability in the consumer IoT sector is another concern flagged in the report. “In particular, a few providers of voice assistants and operating systems are said to unilaterally control interoperability and integration processes and to be capable of limiting functionalities of third-party smart devices and consumer IoT services, compared to their own,” it says.\n\nThere’s nothing very surprising in the above list. But it’s noteworthy that the Commission is trying to get a handle on competitive risks — and start mulling potential remedies — at a point when the adoption of voice assistant AIs is still at a relatively early stage in the region.\n\nIn its press release, the Commission notes that usage of voice assistant tech is growing worldwide and expected to double between 2020 and 2024 (from 4.2 billion voice AIs to 8.4 billion) — although only 11% of EU citizens surveyed last year had already used a voice assistant, per cited Eurostat data.\n\nEU lawmakers have certainly learned lessons from the recent failure of competition policy to keep up with digital developments and rein in a first wave of tech giants. And those giants of course continue to dominate the market for voice AIs now (Amazon with Alexa, Google with its eponymous Assistant and Apple’s Siri). So the risks for competition are crystal clear — and the Commission will be keen to avoid repeating the mistakes of the past.\n\nStill, quite how policymakers could look to tackle competitive lock-in around voice AIs — whose USP tends to be their lazy-web, push-button and branded convenience for users — remains to be seen.\n\nOne option, enforcing interoperability, could increase complexity in a way that’s negative for usability — and may raise other concerns, such as around the privacy of user data.\n\nAlthough giving users themselves more say and control over how the consumer tech they own works can certainly be a good idea, at least provided the platform’s presentation of choices isn’t itself manipulative and exploitative.\n\nThere are certainly plenty of pitfalls where IoT and competition are concerned — but also potential opportunities for startups and smaller players if proactive regulatory action can ensure that dominant platforms don’t get to set all the defaults once again.\n\nCommenting in a statement, Vestager said: “When we launched this sector inquiry, we were concerned that there might be a risk of gatekeepers emerging in this sector. We were worried that they could use their power to harm competition, to the detriment of developing businesses and consumers. From the first results published today, it appears that many in the sector share our concerns. And fair competition is needed to make the most of the great potential of the Internet of Things for consumers in their daily lives. This analysis will feed into our future enforcement and regulatory action, so we look forward to receiving further feedback from all interested stakeholders in the coming months.”\n\nThe full sectoral report can be found here.\n\nUpdate: In a speech discussing the findings, Vestager suggested some practices could lead to new competition cases being opened in the future, if confirmed. But she stressed that it’s still early, saying that the Commission still needs to “better understand the extent of the concerns”.\n\n“So far, the results of the sector enquiry confirm the central role of operating systems and voice assistants in the interconnection of different smart devices and services. Respondents flag that this may give providers of operating systems and voice assistants opportunities to engage in behaviors that negatively affect competition,” she also said. “In the EU, Google Assistant, Amazon’s Alexa and Apple’s Siri are the leading voice assistants. In addition, Google, Amazon and Apple provide the main operating systems for smart home and wearable devices, they offer digital services and they manufacture smart devices.\n\n“In practice, these companies determine how the different devices and services can communicate and inter-operate with one another. In addition, voice assistants learn a lot about their users. Smart devices and Internet of Things services generate a huge amount of data about what we do in our homes.”\n\n“Many of the issues identified so far, such as access to data, access to users or barriers to switching, are familiar themes from our enforcement work in digital markets,” she added. “In fact, a number of the practices reported in the enquiry feature in the Do’s and Don’ts of the Commission’s proposal for the Digital Markets Act. With today’s preliminary findings and the future work to be done in the coming months, the sector enquiry will certainly contribute to the debate on the scope of the Digital Markets Act.\n\n“Through competition enforcement and complementary legislative action, we aim at creating a digital economy that works for everyone. To do so, we must make sure that our digital markets, including the consumer Internet of Things, are open and fair for consumers, with room for businesses of all sizes to innovate and grow.”\n\nUpdate: Amazon reached out to send the below statement, responding to the Commission’s report:"}