{"url": "https://techcrunch.com/2021/07/05/hear-top-vcs-albert-wegner-jenny-rooke-and-shilpi-kumar-talk-green-bets-at-the-extreme-tech-challenge-finals/", "title": "Hear top VCs Albert Wegner, Jenny Rooke, and Shilpi Kumar talk green bets at the Extreme Tech Challenge finals", "authors": ["Connie Loizos", "Editor In Chief", "General Manager", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-07-05T00:00:00", "text": "This year, TechCrunch is proudly hosting the Extreme Tech Challenge Global Finals on July 22. The event is among the world’s largest purpose-driven startup competitions that are aiming to solve global challenges based on the United Nations’ 17 sustainability goals.\n\nIf you want to catch an array of innovative startups across a range of categories, all of them showcasing what they’re building, you won’t want to miss our must-see pitch-off competition.\n\nYou can also catch feature panels hosted by TechCrunch editors, including one of the most highly anticipated discussions of the event, a talk on “going green” with guest speakers Shilpi Kumar, Jenny Rooke, and Albert Wenger, all of whom are actively investing in climate startups that are targeting big opportunities\n\nShilpi Kumar is a partner with Urban Us, an investment platform focused on urban tech and climate solutions. She previously led go-to-market and early sales efforts at Filament, a startup focused on deploying secure wireless networks for connected physical assets. As an investor, Shilpi has also focused on hardware, mobility, energy, IoT, and robotics, having worked previously for VTF Capital, First Round Capital, and Village Global.\n\nJenny Rooke is the founder and managing director of Genoa Ventures, but Rooke has been deploying capital into innovative life sciences opportunities for years, including at Fidelity Biosciences and later the Gates Foundation, where she helped managed more than $250 million in funding, funneling some of that capital into genetic engineering, diagnostics, and synthetic biology startups. Rooke began independently investing under the brand 5 Prime Ventures, ultimately establishing among the largest life sciences syndicates on AngelList before launching Genoa.\n\nLast but not least, Albert Wenger, has been a managing partner at Union Square Ventures for more than 13 years. Before joining USV, Albert was the president of del.icio.us through the company’s sale to Yahoo and an angel investor, including writing early checks to Etsy and Tumblr. He previously founded or co-founded several companies, including a management consulting firm and an early hosted data analytics company. Among his investments today is goTenna, a company trying to advance universal access to connectivity by building a scalable mobile mesh network.\n\nSustainability is the key to our planet’s future and our survival, but it’s also going to be incredibly lucrative and a major piece of our world economy. Hear from these seasoned investors about how VCs and startups alike are thinking about Greentech and how that will evolve in the coming years.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nJoin us on July 22 to find out how the most innovative startups are working to solve some of the world’s biggest problems. And best of all, tickets are free — book yours today!"}