{"url": "https://techcrunch.com/2023/10/11/aampe-aims-to-personalize-app-marketing-with-algorithms/", "title": "Aampe aims to personalize app marketing with algorithms", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-10-11T00:00:00", "text": "Aampe, a marketing automation platform for mobile apps, recently closed a $7.5 million funding round led by Matrix India and Peak XV, the company announced last week.\n\nBringing Aampe’s total raised to $9.3 million, the new cash will support product development and growing Aampe’s go-to-market teams, co-founder and CEO Paul Meinshausen says.\n\n“Existing conventional customer relationship management tools require customer relationship and lifecycle marketers to manually segment their user populations, build user journeys and perform labor-intensive A/B tests,” Meinshausen told TechCrunch via email. “Aampe replaces deterministic rules with probabilistic and dynamic AI to autonomously generate and send messages to each user to maximize the user’s likelihood to engage and convert.”\n\nMeinshausen co-founded Aampe in 2020 with Sami Abboud and Schaun Wheeler. Previously, Meinshausen co-launched PaySense, an India-based micro-loan app that was acquired by PayU, the Netherlands-based payment service provider, in 2019 for $185 million. He met Wheeler through a U.S. Army Department of Intelligence program in 2009, and the pair came into contact with Abboud at DT One, the telecom payments API business, where Abboud was then the chief product officer.\n\n“Aampe was founded at the intersection of two major changes happening in the industry: privacy-driven changes to performance adtech and marketing, and AI,” Meinshausen said.\n\nWhat’s that mean, concretely? As Meinshausen explained to me via email, Aampe plugs into a mobile app to collect metrics like how much users are spending on in-app purchases and the typical makeup of a person’s in-app shopping cart. Then, it conducts thousands of experiments using canned or AI-generated text (powered by OpenAI’s GPT-3) notifications (e.g. “Feeling ravenous?” “What’s for dinner?” “Got a big appetite?”), offering sliding discounts to customers if Aampe’s AI predicts that they’d be more likely to engage within the app.\n\n“Aampe operates at the level of the mobile app event-stream or click-stream, which has a common data structure,” Meinshausen said. “Every app generates a sequence of events that represents each user’s actions — every swipe and click — in the app. Aampe’s AI fits that general pattern, and is agnostic to the semantics of each app’s particular business.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAampe certainly isn’t the only marketing automation platform personalizing texts and notifications algorithmically. There’s Postscript, which is specifically geared toward Shopify merchants. Mobiz is integrating hyper-personalization into it own brand of mobile marketing. Elsewhere, there’s Marvin, which claims it can improve app engagement by making marketers more timely.\n\nSo what’s Aamp’s secret sauce? The aforementioned experimentation, Meinshausen asserts.\n\nRather than try to predict the future from historical training data, Aampe generates training data by running experiments and then adjusts the messaging dynamically depending on the results of those experiments. This minimizes the need for marketers to set event triggers, figure out when and how often to send messages to users and manually orchestrate messages across channels, Meinshausen says.\n\n“One of the things that surprises our customers is that our infrastructure is generalizable across so many industries and mobile app use cases,” he added. “Aampe is an example of the coming wave of more ‘agentic’ data layers and software — infrastructure that makes active decisions rather than simply and naively implementing human-designed rules.”\n\nAampe, which has customers across the U.S., Europe and Asia, including Swiggy and PayU, powers messages that reach over 50 million users each month, according to Meinshausen. In the near term, Aampe intends to focus on hiring, expanding its 15-person team to 20 to 25 by the end of the year."}