{"url": "https://techcrunch.com/2022/10/12/samsung-and-google-partner-to-speed-up-matter-enable-smart-home-setups/", "title": "Samsung and Google partner to speed up Matter-enabled smart home setups", "authors": ["Ivan Mehta", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-10-12T00:00:00", "text": "Samsung and Google announced a new partnership today that will allow easier setup for Matter-enabled devices on both Samsung SmartThings and Google Home systems.\n\nAt the Samsung Developer Conference held in San Fransisco, the Korean tech giant said that it will update its SmartThings app in the coming months so that users can onboard Matter-enabled devices even if they are set up in Google’s ecosystem and vice versa.\n\nFor the uninitiated, Matter is an Internet of Things standard that’s being developed by companies like Apple, Google, Amazon and Samsung to ensure smart home devices from different companies work across ecosystems. Last week the Connectivity Standards Alliance, the consortium behind Matter, officially approved the first set of specifications so developers can apply for certification for their solutions.\n\nSamsung said it’s using Matter’s multi-admin capabilities to make compatible devices easy to find and control across different apps. Once the company updates the SmartThings apps, users can see Matter-enabled devices that were set up under Google’s ecosystem and then import them into Samsung’s ecosystem and vice versa. This way, users will be able to control these devices from either the Samsung SmartThings app or the Google Home app.\n\n“As the largest Android developer, Samsung values its strong partnership with Google. Providing users with greater flexibility through this new multi-admin feature is a natural progression in our evolution as partners, allowing us to better support our massive existing and potential user base with both Samsung and Google products,” Jaeyeon Jung, Corporate VP and head of SmartThings at Samsung said in a statement."}