{"url": "https://techcrunch.com/2023/08/30/google-assistant-and-alexa-finally-play-nicely-together-but-only-on-one-speaker-lineup/", "title": "Google Assistant and Alexa finally play nicely together — but only on one speaker lineup", "authors": ["Kyle Wiggers", "Ai Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-08-30T00:00:00", "text": "After years of fierce brawling, Google Assistant and Alexa are finally playing nicely together.\n\nHarman today announced new additions to its JBL Authentics speaker lineup that integrate both Google Assistant and Alexa — the first devices on the market to do so. The Authentics 200, Authentics 300 and Authentics 500, all of which sport automatic self-tuning, Bluetooth and multiroom playback, will be available starting on September 17.\n\nFor years, Google has resisted enabling manufacturers — outside of Sonos, at least — to build smart devices featuring both Google Assistant and Alexa.\n\nThat’s led Amazon to ramp up the pressure — not necessarily out of a sense of altruism, but to level what it perceived as an uneven playing field.\n\nWhile Alexa has a respectable install base — about 500 million devices as of early this year — Google’s long benefited from shipping Google Assistant as the default assistant on Android smartphones. (This preferential treatment was once the subject of an EU antitrust investigation.) In 2019, Google said that Google Assistant was available on more than 1 billion devices.\n\nSo in 2019, Amazon launched the Voice Interoperability Initiative, a program aimed at ensuring voice-enabled products such as smart speakers, smartphones and smart displays let users choose among multiple voice assistants. Google, along with Samsung and Apple, declined to join. But now the search giant’s changing its tune.\n\nWhy? In an email interview, Marissa Chacko, director of product management of Google Assistant, glossed over Amazon and Google’s contemptuous history and seemed to say, in so many words, “why not?”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Voice assistants have become part of our everyday lives,” she said. “Both Google and Amazon wanted to make it easy for users to access either of these voice services simultaneously … We aren’t trying to compensate for capability gaps, but rather give users choice.”\n\nOn the new JBL Authentics speakers, Google Assistant and Alexa will work interchangeably. Users will be able to ask Alexa to set a timer, for example, and, when it rings, ask Google Assistant to stop it (and vice versa).\n\nThat’s thanks to what Amazon calls universal device commands (UDC), functionality driven by Amazon’s Multi-Agent Experience Toolkit, which was borne out of the Voice Interoperability Initiative. With UDC, a user can ask Alexa and Google Assistant to stop certain tasks — like music, timers, reminders and alarms — without having to remember which assistant started the request or ask for the request to be handed off to the other assistant.\n\nPerhaps just as importantly, the assistants won’t try to speak over one another. The Authentics speakers will automatically change the “audio focus” in the appropriate moment to prevent, for instance, Alexa from speaking over a Google Assistant timer.\n\nAmazon and Google have been testing UDC during beta trials, Aaron Rubenson, VP of Alexa, told me via email.\n\n“Customers might prefer to access Alexa or Google Assistant to use their favorite Amazon and Google services,” he said. “You might ask Google Assistant for a good substitute for milk, and then ask Alexa to buy it from Amazon.com. Or, get an Amazon package delivery notification from Alexa, and then ask Google Assistant to add a reminder about the delivery to your Google Calendar.”\n\nBut aren’t Google and Amazon concerned about engagement with either Google Assistant or Alexa suffering now that both assistants are on one device? Apparently, no. In a remarkable change in tune, Rubenson and Chacko say that they see the assistants as being “complementary” rather than competitive with each other.\n\n“While we of course want to increase engagement with Alexa, the focus of this integration is to create a great customer experience where customers have seamless access to both assistants,” Rubenson said. “We fully expect customers to use Alexa and Google Assistant on their own or alongside each other on the JBL Authentics 200, 300, and 500 speakers.”\n\nChacko added: “We believe in creating a strong smart home ecosystem, and ultimately want to make it easier for people to have access to their preferred assistants … We know that many households have mixed voice assistant preferences and several devices, which can be difficult to manage. Along with Amazon and Harman, we had a shared vision for this integration to provide users value and choice by delivering simultaneous access to multiple voice assistants on a single device.”\n\nBut there’s important subtext.\n\nSmart speaker sales have been in decline for some time. Shipments were down 30% in Q1 2023, the sixth quarterly consecutive dip. And according to a survey by UpCity, a business-to-business service directory, only half of U.S. consumers are using voice search daily.\n\nThe stakes are lower than they used to be, simply put — especially in light of both Amazon and Google internally scaling back their voice assistant efforts.\n\nAmazon was reportedly on pace to lose about $10 billion on Alexa and other devices in 2022 alone. And Google has ramped down its investments in Google Assistant both for third-party devices and its own hardware lineup, recently stripping third-party voice games and apps from Nest hub smart displays.\n\nDeclining sales likely aren’t the only reason to blame for the shifting corporate priorities. As it turns out, it’s hard to make money with voice assistants. Amazon is said to have raked in less than $2 million on Alexa apps in 2019, falling well short of the company’s $5 million target.\n\nBut be all this as it may, the Harman/Amazon collaboration could end up being a one-off. Chacko wouldn’t commit to future Google Assistant and Alexa integrations, implying that it’ll depend on how this one’s received.\n\n“It’s early to determine this integration’s impact,” she said. “While we don’t have any plans to share about future integrations, we’re excited to see how …. [users] utilize having simultaneous access to both Google Assistant and Alexa at home.”\n\nIn other words, it’s a temporary alliance — not a lasting truce."}