{"url": "https://techcrunch.com/2018/11/11/how-issues-of-microtransit-congestion-and-parking-are-closing-in-on-cities/", "title": "How issues of microtransit, congestion and parking are closing in on cities", "authors": ["Arman Tabatabai", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2018-11-11T00:00:00", "text": "Earlier this week in a new experimental newsletter I’ve been helping Danny Crichton on, we briefly discussed transit pundit Jarrett Walker’s article in The Atlantic arguing against the view that ridesharing and microtransit will be the future of mass transit. Instead, his thesis is that a properly operated and well-resourced bus system is much more efficient from a coverage, cost, space, and equality perspective.\n\nConsider this an ongoing discussion about Urban Tech, its intersection with regulation, issues of public service, and other complexities that people have full PHDs on. I’m just a bitter, born-and-bred New Yorker trying to figure out why I’ve been stuck in between subway stops for the last 15 minutes, so please reach out with your take on any of these thoughts: @Arman.Tabatabai@techcrunch.com.\n\nFrom an output perspective, Walker argues that by operating along variable routes based on at-your-door pick ups, microtransit actually takes more time to pick up fewer people on average. Walker also gives buses the edge from a cost and input perspective, since labor makes up 70% of transit operating costs in a pre-autonomous world and buses allow you to service more customers for the price of one driver.\n\n“The driver’s time is far more expensive than maintenance, fuel, and all the other costs involved. In almost every public meeting I attend, citizens complain about seeing buses with empty seats, lecturing me about how smaller vehicles would be less wasteful. But that’s not the case. Because the cost is in the driver, a wise transit agency runs the largest bus it will ever need during the course of a shift. In an outer suburb, that empty big bus makes perfect sense if it will be mobbed by schoolchildren or commuters twice a day.”\n\nBut transit is not solely an issue of volume and unit economics, but one of managing public space. Walker explains that to ensure citizens don’t use more than their fair share of space, cities can either provide vehicles that are only marginally bigger than a human body, i.e. bikes and scooters, or have many people share large-scale vehicles, i.e. mass transit. Doing the latter through a mass fleet of on-demand microtransit solutions, Walker argues, increases congestion and makes it harder to manage scheduling and allocate infrastructure.\n\nWhile the article offers an effective comparison of unit economics and acts as a useful primer on the various considerations for city transit agencies, some of the conclusions are a bit binary. The discussion is a bit singular in its focus of microtransit as a replacement of public transit rather than an additive service and doesn’t give much credit to the trip planning and space management capabilities of many microtransit services, nor changes in consumer expectations towards transportation.\n\nBut despite some of the gaps in the piece, Walker highlights two ideas that spill over to some broad areas that have caught my interest lately: Tolls and Parking.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nTolls\n\n“To succeed, microtransit would have to help people get around cities better, not just make them feel good about hailing a ride on a phone. Full automation of vehicles, if indeed it ever arrives, might solve the labor problem—although it would put thousands of drivers out of work. But the congestion problem will remain.”\n\nLike many, Walker argues that ridesharing aggravates city traffic rather than alleviates it. Even though ridesharing’s long-term impact on traffic is widely contested, nearly everyone agrees that a solution to urban congestion is desperately needed.\n\nWhat’s interesting is that regardless of the discourse that surrounds them, trends in US tolling mechanisms seem to suggest American cities may be moving closer to congestion pricing methods.\n\nAs an example, solutions to congestion are top of mind behind the New York state election that saw Democrats taking control of both state legislative houses. Though it seems like the argument resurfaces every few years, the elections have brought renewed debate over the possible implementation of congestion pricing in New York City. In essence, congestion pricing is a system where drivers would pay higher prices for using high-traffic streets or entering high-traffic zones, allowing cities to better dictate the flow of drivers and reduce congestion.\n\nOutside of the obvious political tension created by effectively implementing a new tax, some lawmakers have pushed back on the effectiveness of a congestion pricing policy, with some arguing that it can aggravate income inequality or that a policy addressing construction and pedestrians, rather than vehicles, would have a bigger impact on traffic.\n\nHowever, over the past year or so, an increasing number of states have been rolling out highway tolls that are priced dynamically, instead of using traditional fixed-price tolls. The exact drivers behind the toll prices vary, with some cities charging prices based on traffic conditions and others charging varying prices for the use of express and HOV lanes.\n\nSeveral new technologies and companies have also made it easier for local governments to implement more sophisticated, adjustable toll pricing or congestion fees at a much lower cost. In the past, congestion pricing systems around the world have required physical detection systems that can be extremely costly to implement.\n\nNow, companies like ClearRoad are helping governments use a wide range of connected vehicle technologies to establish and collect road usage pricing from any location without the need for physical infrastructure. Oregon is one geography working with ClearRoad to manage its new opt-in road usage program where the state is able to calculate drivers’ usage of certain roads and their gas consumption, and then reimburse them for gas taxes they’re paying.\n\nSo even though people are still screaming at each other in state capitols, it seems like we may be closer to seeing congestion pricing in major cities than we think. And while executing these programs can be difficult and painfully slow (often needing to satisfy city regulations and tax laws forty layers deep), if these smaller-scale programs we’re seeing in the US are actually effective, congestion pricing may be a solution to plug chunky budget gaps, better finance infrastructure projects and replace lost gas tax revenue in an electric vehicle future.\n\nParking\n\nIn his piece, Walker goes back to some basic principles of urban design, highlighting that at their core, functioning cities come down to how millions of people share a comparatively tiny amount of space.\n\nWalker explains that city dwellers that travel with cars and solo rideshare trips rather than with large-scale shared transit are effectively taking up more than their fair share of public space. While the argument is made in the context of ridesharing and congestion, the same idea applies to the less-discussed impact mass-transit ridesharing can have on city parking.\n\nAt least in the near-term, certain cities have seen ridesharing actually increase vehicle usage rather than reduce it (a claim rideshare companies dispute), resulting in an even wider gap between the supply and demand for available parking spots. And if people are using ridesharing but still choosing to own cars regardless, in an indirect fashion, they are similarly reducing the stock of available parking space by more than their fair share.\n\nAnd while it makes sense that rideshare vehicles should receive a larger portion of the parking stock, given that it serves more passengers, the use of available parking by these vehicles can and has caused tension with local residents that have to store their cars further away.\n\nThere are companies like the mobility-focused data platform, Coord, that are working on tools geared towards helping cities and citizens more effectively allocate and plan parking strategies for the future multi-modal transportation network. And theoretically, ridesharing should reduce the number of vehicles in search of parking in the long-term. But at least for now, the impact on parking congestion is just another unintended consequence that weakens the argument for ridesharing as mass transit.\n\nAnd lastly, some reading while in transit:"}