{"url": "https://techcrunch.com/2024/12/06/a16z-backed-toka-wants-to-help-us-agencies-hack-into-security-cameras-and-other-iot-devices/", "title": "a16z-backed Toka wants to help US agencies hack into security cameras and other IoT devices", "authors": ["Charles Rollet", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-12-06T00:00:00", "text": "U.S. government agencies legally hack into cell phones or emails all the time: think of the FBI wiretapping a suspected drug lord or the NSA monitoring emails for terrorism plots.\n\nBut now there’s rising interest in hacking other kinds of devices people use, like Wi-Fi-connected security cameras and other IoT products.\n\nToka, an Israeli startup backed by Andreessen Horowitz, specializes in this type of work. It previously gained attention for a 2022 Haaretz article detailing its claims about being able to obtain and even delete security camera footage.\n\nThe company is now looking to hire a “Client Director USA” to “support new business growth within the US government market.” The position requires a “strong history of technology sales within DoD and national security agencies.”\n\nToka is also seeking a customer success engineer under its North America team that is responsible for helping its clients with “deployment, training, and enablement.” Experience working with federal law enforcement is considered an advantage.\n\nToka told TechCrunch it is “mostly filling open slots” and declined to comment further on its U.S. government activities.\n\n“What we can say is that Toka only sells to militaries, homeland security organizations, intelligence, and law enforcement agencies in the United States and its closest allies who use our products in compliance with local laws,” a company spokesman said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nHacking IoT products is becoming increasingly common in the murky defense and intelligence worlds.\n\nIsrael, where Toka is headquartered, has gained some renown for this kind of intelligence-gathering. Hezbollah warned Lebanese residents earlier this year to turn off their security cameras to prevent Israel from hacking into them to spot targets.\n\nBut this kind of tech doesn’t have to be limited to war zones. TechCrunch reported last month that a16z’s Ben Horowitz tried to donate funds to the Las Vegas Police Department for purchasing Toka software. They didn’t take him up on it, a Toka spokesman said.\n\nToka has publicly raised $37.5 million since its founding in 2018 from investors like a16z, Dell Capital, and others. Haaretz previously reported in 2022 that Toka was seeking to work with U.S. Special Forces and an unnamed U.S. intelligence agency.\n\nToka has sought to avoid scrutiny on Israeli spyware outfits like the U.S.-sanctioned NSO Group, publicly promising that it only does business with governments from a “select list of countries” with good track records on civil liberties and corruption.\n\nToka is listed as attending a conference in the UAE in 2021 and earlier this year hired a vice president of international sales who previously worked for Cellebrite, another controversial Israeli cyber firm. But Toka told TechCrunch it doesn’t have any clients in the UAE and monitors its international sales closely.\n\n“We regularly review this select list of countries, using outside assessments on a range of issues, including civil liberties, rule of law, and corruption,” Toka’s spokesman said. “Assisting us in this process are two distinguished outside advisers: Professor Peter Schuck of Yale Law School and Israel Prize-winner Jacob Frenkel, currently Chairman of JP Morgan Chase International and a former IMF official.”"}