{"url": "https://techcrunch.com/2024/12/17/remote-enables-usdc-crypto-payouts-for-contractors/", "title": "Remote enables USDC crypto payouts for contractors", "authors": ["Romain Dillet", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-12-17T00:00:00", "text": "Getting paid in cryptocurrencies may sound like a bad idea, but this could be an actually useful feature for international contractors. Remote, the company that lets you hire people and manage contractors all around the world, is introducing crypto payouts on Tuesday.\n\nCompanies based in the U.S. can start paying their contractors with stablecoins in 69 countries. For this feature, Remote is partnering with Stripe.\n\nThe company only supports USDC for now, a widely used cryptocurrency stablecoin managed by Circle. One USDC is worth one USD at any point in time, which means that companies and contractors are never exposed to the volatility risks incurred by cryptocurrencies.\n\nAs a contractor, getting paid in USDC means that payments are fast and can’t get stuck in international transfer limbo. Crypto payouts are sent on Base, the Layer-2 blockchain from Coinbase.\n\nAnd of course, it means that contractors get paid in a USD-denominated cryptocurrency. If you live in a country that suffers from money devaluation, being able to hold USDC can increase your purchasing power.\n\nWhen you need to buy something in your local shop, you can exchange some USDC to your local currency, send the money to your bank account, and keep the rest in your crypto wallet. Some people might even start using a debit card issued by a crypto exchange to seamlessly spend USDC.\n\nWhen contractors are invited to Remote to create an account, they can decide how they want to get paid: in a local currency on a bank account or in USDC. If they select USDC, they can enter their wallet address and start uploading invoices. When companies approve invoices in their Remote dashboard, Remote creates a payment request for all their contractors and automatically transfers money using the right payout method.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIn the future, Remote plans to enable the feature for customers headquartered in other countries and add support for more cryptocurrencies, including Bitcoin and Ethereum, for those who are crypto maximalists."}