{"url": "https://techcrunch.com/2025/03/11/bolt-ceo-ryan-breslow-explains-his-troubled-30m-personal-loan-announces-new-super-app/", "title": "Bolt CEO Ryan Breslow explains his troubled $30M personal loan, announces new ‘super app’", "authors": ["Charles Rollet", "Mary Ann Azevedo", "Senior Reporter", "Sr. Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec"], "publication_date": "2025-03-11T00:00:00", "text": "Bolt’s controversial co-founder Ryan Breslow, who returned as CEO earlier this month, spoke on Monday about the $30 million personal loan he took out of his company that sparked legal battles and contributed to his (temporary) ouster.\n\nBreslow also announced that Bolt will launch an “everything app” that will integrate one-click checkouts for everything from crypto to financial services “very soon.”\n\nThe legal battle over the loan began in 2023, when Bolt investor Activant sued Breslow. Activant claimed Breslow saddled the startup with $30 million in debt by borrowing that amount and then defaulting, with company funds used to pay it back.\n\nThe case was eventually settled, with Bolt agreeing to repurchase Activant’s shares for $37 million last year.\n\nSpeaking at Fintech Meetup in Las Vegas yesterday, Breslow defended the loan, framing it as an act of loyalty to Bolt rather than the self-dealing the Activant lawsuit alleged it was.\n\nHe said he opted for the loan instead of selling his stock in a secondaries transaction and that the loan was unanimously approved by Bolt’s board.\n\n“It was done to be pro-Bolt,” Breslow said. “I took it out instead of selling any meaningful secondaries. I wanted to show all of our investors that I’m keeping all my chips in, I believe so much in the stock that I’m not selling my shares.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBreslow said he thought he had plenty of time to pay back the loan and was waiting for Bolt to IPO to do so. He said that after he left the CEO role, the board called in the loan, which he viewed as “a bit of an attack.”\n\nBreslow, the outspoken founder of Bolt, stepped down as CEO in early 2022. In the years between then and his return this year, he has also faced allegations that he misled investors and violated security laws by inflating metrics while fundraising the last time he ran the company.\n\nOn Monday, Breslow admitted he made “a ton of mistakes” — but said they were not the ones he was accused of. He viewed his main mistake as allowing people to join Bolt’s cap table that he “did not know very well” (without specifying who).\n\n‘Super app’ in the works\n\nNow that he’s back as CEO, he says Bolt will soon be launching a new “super app” that will integrate Bolt’s one-click checkout e-commerce experience across a wide array of services.\n\n“Instead of one-click checkout, we’re going to have one-click everything: financial services, peer-to-peer, crypto, cards, financial products, all in one app,” he said.\n\nBreslow compared Bolt to U.K. fintech Revolut, which was valued at $45 billion last year, claiming Bolt has 80 million “wallets” compared to Revolut’s 45 million, although he admitted Bolt has not “monetized our consumers yet.”\n\nIndeed, Bolt’s ARR stood at about $28 million with $7 million in gross profit as of the end of March 2024, tech publication Newcomer reported last year. That’s small compared to Revolut, which announced $2.2 billion in revenue and $545 million in profits (before tax) for 2023 alone.\n\nThe big question remaining about Bolt is the status of its next fundraise. In August, news broke about a pending $450 million fundraise deal. But it raised questions over its unusual use of $250 million in “marketing credits” and lack of confirmation from an investor mistakenly identified as its lead.\n\nSome of Bolt’s investors, including BlackRock and Hedosophia, sued to block the round, Forbes reported, but that has been voluntarily dismissed by all parties, Bolt announced today.\n\nBreslow noted during his speech that “all” the legal cases against him are “fully settled, dismissed” but didn’t provide an update on the $450 million fundraise.\n\nHe did comment, though, that he’s been “humbled” by his experience and has found a newfound determination to run Bolt after his faith and himself — and his startup — was challenged.\n\n“You know, I obviously make mistakes but I’ve got a very big chip on my shoulder,” he said. “I’m ready to take Bolt to really new heights.”\n\nBlackRock and Hedosophia didn’t respond to a request for comment."}