{"url": "https://techcrunch.com/2025/04/08/blackbird-gobbles-up-50m-for-its-blockchain-based-payment-loyalty-app-for-restaurants/", "title": "Blackbird gobbles up $50M for its blockchain-based payment-loyalty app for restaurants", "authors": ["Ingrid Lunden", "Europe Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-08T00:00:00", "text": "A founder who has carved out a name for himself building products to help restaurants connect better with would-be diners has raised $50 million for his latest startup: a new take on the idea of customer loyalty.\n\nBlackbird Labs has built a payments-meets-loyalty-meets-blockchain platform for restaurants to grow repeat business while reducing some of the friction around transactions. Now, with some 1,000 restaurants signed up, CEO Ben Leventhal said Blackbird plans to use the money to launch its newest product, a cross-restaurant “points” service it’s calling Blackbird Club, as well as to expand into more markets outside of New York (its headquarters), San Francisco, and Charleston, South Carolina.\n\nWhy Charleston, you ask? “Charleston punches above its class,” Leventhal said in an interview with TechCrunch. “It’s a great restaurant city for its size.” It also appears to be Blackbird’s equivalent of New Zealand for Meta, with Leventhal calling it “a good test market for us.”\n\nSpark Capital, a new backer, is leading this latest round, with participation also from Coinbase Ventures, Amex Ventures, and Andreessen Horowitz — three investors that backed Blackbird in its $24 million Series A in 2023. Valuation is not being disclosed, but for a point of reference, PitchBook notes that the startup was valued at around $124 million in that last round. The startup has raised $85 million to date.\n\nCoinbase and Amex are strategic names in that list.\n\nAmex acquired Resy, a reservations platform that Leventhal previously founded, in 2019. The two companies — Resy and Blackbird — are not integrating now, but “it’s fair to say we will,” Leventhal said. Prior to Resy, the third restaurant-focused startup Leventhal founded, the food blog Eater, was also acquired: it’s now part of Vox. No plans on how or if that’ll lead to a partnership deal.\n\nBlackbird describes its Flynet payment service as a layer-three transaction protocol built on Coinbase’s Base. Diners can use it to pay for meals at the table via Blackbird’s app, as well as to redeem loyalty points when they visit restaurants.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIt’s worth asking whether blockchain was strictly a necessary part of the mix. There are plenty of other loyalty and payment programs in the market, including a number that are direct competitors to Blackbird, like Punchh, Toast, and Lightspeed, built on more conventional financial structures.\n\n“I don’t think it necessarily ‘has to be built on blockchain,’” Leventhal said. “Visa’s network, more or less, was created using the same principles that we’re using for Flynet, and obviously they didn’t have blockchain.”\n\nBut Leventhal pointed out, too, that “there are a few things that we do believe that over time will be important opportunities, and those opportunities will be based on being on-chain.” These include how Blackbird and restaurants hold customer profiles and activity, he said. “Consumers will be able to continue to own that profile,” Leventhal told TechCrunch. It also relates to how Blackbird envisions its engagement with restaurants, he said: Each restaurant customer ultimately will be a shareholder of Blackbird.\n\nYou might think that, with two startups dedicated to the consumer-facing side of the restaurant trade, Leventhal might have had his fill of the business. As it turns out, he’s still hungry for more.\n\nOwning restaurants has long been a challenging enterprise, but the economy and changing consumer habits have especially knocked the world of restaurants around a lot in the last few years.\n\nLeventhal cites figures from the National Restaurant Association that note that the average profitability of restaurants these days is under 5%, compared to an average of around 20% in the early 2000s.\n\nWhile platforms like Instagram and TikTok have turned the world into armchair foodies, producing legions of people who virally flock to the latest and coolest cafe, they are doing this amid a time of rapidly declining margins and heightened price sensitivity. These are areas that are only going to get tougher if the U.S. really locks down on its latest tariff hikes.\n\n“There is a disconnect in the restaurant industry between the popularity and the intensity of consumer love for restaurants and ultimately the profitability of the industry,” he said.\n\nThat disconnect, of course, in startup thinking means opportunity.\n\n“The restaurant industry is made up of millions of local, small business owners around the world,” Arianna Simpson, a general partner at a16z, told TechCrunch over email. “Those restaurants are at the mercy of tech platforms that can charge a large, and often growing, percentage of a restaurant’s margin.”\n\nSimpson believes this is specifically where blockchain can play a role: improving that margin structure. “Ben’s vision is for a network that is owned by the restaurants and the diners themselves, which is something that only blockchains enable,” she said, adding that Blackbird is already saving its restaurant customers 3-4% in payment processing fees."}