{"url": "https://techcrunch.com/2024/03/07/zamas-homomorphic-encryption-tech-lands-it-73m-on-a-valuation-of-nearly-400m/", "title": "Zama’s homomorphic encryption tech lands it $73M on a valuation of nearly $400M", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-03-07T00:00:00", "text": "Homomorphic encryption, a complex technique that uses cryptographic algorithms to keep data secure as it travels around networks and to third parties, continues to elude mass-market scalability and thus adoption — not least because currently, the complexity that makes it so effective also makes it slow and hard to use widely.\n\nBut in a world rife with data leaks and creative, malicious hacking, the approach holds a lot of promise for ensuring data security longer term, so investors continue to fund startups staffed with smart people chipping away at making the concept into a reality.\n\nIn the latest development, a startup out of Paris called Zama has raised $73 million in a Series A co-led by Multicoin Capital and Protocol Labs at a valuation approaching $400 million. Notably, among the longer list of other investors in this equity round is Metaplanet, a deep tech investor out of Estonia that wrote the first check for DeepMind (among hundreds of other investments).\n\nThis is the largest round to date for a homomorphic encryption company not only out of Europe, but also maybe globally. Amid an ongoing funding crunch globally, deep tech in the region appears to still open checkbooks. Earlier this week, quantum startup Multiverse Computing also picked up $27 million.\n\nThe plan is to continue investing in R&D, as well as to hire more engineers (expanding on a current team of 75) to build around the two market opportunities that Zama sees for the early versions of its work.\n\nIt has solutions to address blockchain transactions and solutions for data exchange around artificial intelligence training and usage. It has also built and posted four libraries to carry out that work on GitHub and claims that 3,000 developers are using these.\n\nWhile there are a lot of deep tech efforts underway to improve how HME can be used in the world — including those at Zama — the startup is also getting on with the business of . . . being a business.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“We started commercialising Zama six months ago, and we have signed north of $50 million in contract value,” said Rand Hindi, Zama co-founder and CEO, in an interview. Although Hindi firmly believes that the longer-term bigger business will be in machine learning, customers so far have primarily come from the blockchain camp, so the $50 million is a rough estimate of value since not all of these operate in fiat.\n\n“If they have a token, we charge tokens,” he said. “If it’s a bank using a private blockchain, we charge by transaction.”\n\nPrior to this, Zama raised $8 million across a pre-seed and seed round, bringing the total now to $81 million raised. We understand from sources that the latest funding puts the company’s valuation at the high end of $300 million to $400 million, although Hindi declined to disclose the amount.\n\nIf you think these are large numbers for technology that has yet to break into mainstream markets, especially in the current funding climate, there are a couple of reasons why the company has attracted attention.\n\nThe first is simple market opportunity.\n\n“FHE is the most important foundational cryptographic primitive for the next decade of computing. Zama’s technology is the key to build multiplayer, privacy-preserving applications,” said Kyle Samani, managing partner of Multicoin Capital, in a statement. “Zama’s groundbreaking work on open source FHE tooling is only the beginning. We are proud to help them build the next generation of crypto-enabled, privacy-first applications.”\n\nSecondly, it is likely because of its founding team.\n\nHindi’s background is in computer science with a PhD in bioinformatics, but he’s a polymath interested in AI as well as privacy and how to preserve it in the modern world. One of his previous startups was an AI voice platform called Snips that was acquired by Sonos.\n\nHis co-founder Pascal Paillier, Zama’s CTO, is cryptography expert whose patents (he notes he has some 25 patent families to his credit) are being used in smart card and other applications today.\n\nTogether, the two started work as far back as 2016 on the early technology that would become Zama. The breakthrough, Hindi said, was in 2019 when they arrived at algorithms that sped up calculations by 100x.\n\n“This was the unlock that let us turn this into a business,” Hindi said.\n\nThat still doesn’t represent useful speeds for most of the world’s transactions, but given that blockchain transactions themselves are typically slow-moving, that presented an opportunity to offer Zama’s solutions to crypto developers. As Hindi puts it, whether you are a skeptic on crypto or not, when you consider payroll and other kinds of financial transactions that are being created, it’s undeniable, he said, that “hundreds of thousands of people are building on the blockchain, and this gives them an opportunity to build more.”\n\nAs we have previously described it, full homomorphic encryption is something of a holy grail in the worlds of security and cryptography in part because implementations of it are too complicated to execute in realistic timeframes.\n\nSome of that might get addressed over time with the development of chips optimized for the calculations, which are being developed by both startups and major names in semiconductors like Intel.\n\nIn the meantime, companies like Zama are continuing to work on algorithms and techniques to compress the work involved to carry out homomorphic encryption on existing infrastructure. Its libraries and work to date include fully homomorphic encryption libraries to bring FHE to machine learning; a compiler to help translate Python programs into the FHE equivalent; and a library to enable an entity to interact with an Ethereum virtual machine using homomorphic encryption.\n\nThere are a number of other startups in the space, including Ravel, Duality, and Enveil, but for now, Hindi said, the market is so small — and still trying to prove itself, I would add — that the aim is really to continue growing the market.\n\n“We are mostly friends with each other,” he said. “The goal is not to fight but to build a market. Coopetition. We see each other at conferences and talk about [it] and one day we will compete but not today.”"}