{"url": "https://techcrunch.com/2024/03/05/this-swedish-startup-wants-to-reduce-the-cost-and-controversy-around-stem-cells-production/", "title": "This Swedish startup wants to reduce the cost, and controversy, around stem cell production", "authors": ["Mike Butcher", "Editor At Large", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-03-05T00:00:00", "text": "With the news that “mini organs” have been grown for the first time using human stem cells, this futuristic area of bio-medicine is clearly accelerating by leaps and bounds. However, harvesting stem cells is a controversial process, since a major method involves harvesting during pregnancy. Now a Swedish startup has raised VC investment to take a new process for generating stem cells (from adult volunteer-donated bone marrow), hailed as a revolutionary tool to alleviate and prevent a wide variety of medical conditions, to industrial-scale levels.\n\nIn an exclusive to TechCrunch, Stockholm-based Cellcolabs revealed it has now raised $8.7 million, taking the total amount it has raised to $21.5 million since its founding in 2021.\n\nTo date, most stem cells are harvested from adult stem cells or post-termination fetal tissue. The news yesterday detailed how researchers at UCL and Great Ormond Street Hospital in London extracted stem cells that had passed into the amniotic fluid, which surrounds the child in the womb and protects it during pregnancy.\n\nBut, for obvious reasons, regulations restrict when these fetal samples can be obtained. In countries like the U.S., fetal sampling is, in fact, completely illegal.\n\nThe clinical-stage biotechnology startup raised the round from a number of investors, including Swedish investors Fredrik Österberg and Jens von Bahr (Österberg co-founded Evolution AB with von Bahr in 2006, which sells casino solutions to online operators). Previous investors include Norrsken Launcher, and the founders of Avito, Jonas Nordlander and Filip Engelbert. The funding will be used to scale up R&D, operations and business development.\n\nCellcolabs originated from the pioneering stem cell research of Professor Katarina Le Blanc at the world-renowned Karolinska Institute in Stockholm, most famous for handing out the Nobel Prize in medicine.\n\nFounders Per Båtelson and Maria Rankka, and impact investor Norrsken, joined with Professor Le Blanc to create Cellcolabs, and brought in medically trained Mattias Bernow as CEO.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nCellcolabs will specialize in mesenchymal stem cells (MSCs), which are scarce and expensive. According to a statement by the company, these are a type of stem cell with anti-inflammatory, regenerative and immunomodulatory properties, which can “promote the healing of damaged tissue and regulate immune responses to reduce inflammation — an underlying cause of many diseases.” MSCs are also used in the realm of longevity, since inflammation contributes to aging.\n\nCellcolabs claims that its process of harvesting the cells from the bone marrow of healthy volunteer donors could slash the price of MSCs by up to 90% within the next decade through large-scale production.\n\nIn an interview with TechCrunch, Bernow said, “The promise of stem cells or what it holds, is really mind boggling. For me as a physician, what is really interesting is, of course, if we can use cells to prevent disease. In many cases, I think we will be able to alleviate some of the disease burden.”\n\n“We are really about making the cells available. MSCs are extremely expensive, and they’re very hard to come by. We’ve been granted the opportunity to work with one of the world’s most well-known professors in this area, and to some extent, it’s an unfair advantage and a blessing.”\n\nBernow said the company doesn’t have any competitors to the extent of his knowledge, at least not at the industrial scale. However, he admitted that “it’s very hard to know what the Chinese are doing in this arena.” French startup TreeFrog Therapeutics is also working on cell manufacturing, however, its approach is to take cells from the skin or blood and “reprogram” them into stem cells. The company raised $75 million in September 2021.\n\n“We’ve built this facility, which we believe is one of the world’s largest facilities, solely dedicated for production of this kind of stem cell. We’re just over 45 people here in Stockholm, and we’ve applied to the Swedish version of the FDA,” said Bernow.\n\n“We can supply to anyone who’s serious about doing good research and making it available for patients,” he added.\n\nIn a statement, investor Fredrik Österberg said, “When it comes to investments, our focus is on companies that boast a strong business case and contribute positively to society. With the 25 years of research of Professor Le Blanc, the promising potential of MSCs for healthcare, and an exceptional team at the helm, Cellcolabs is well-positioned to revolutionize the field of stem cells and healthcare.”"}