{"url": "https://techcrunch.com/2024/12/19/k2-space-will-fly-its-extra-large-satellite-for-the-first-time-in-2026/", "title": "K2 Space will fly its extra-large satellite for the first time in 2026", "authors": ["Aria Alamalhodaei", "Reporter", "Space", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-12-19T00:00:00", "text": "K2 Space is betting that the future of space hardware will be big — really big.\n\nThe startup is building massive spacecraft under the assumption that launch costs will continue to drop as SpaceX’s Starship and other heavy-lift vehicles come online. It looks like the Space Force is taking up their side of that bet, with K2 Space announcing Thursday that its first full satellite mission will fly a number of Department of Defense payloads under a $60 million contract.\n\nThat mission, called Gravitas, will fly no earlier than February 2026. The satellite will fly on SpaceX’s Transporter-16 rideshare mission, where it will carry multiple national security payloads. The spacecraft will conduct operations in low Earth orbit (LEO) before raising its orbit to medium Earth orbit (MEO). MEO, which is between LEO and geosynchronous orbit, has “historically been an incredibly challenging orbit to operate in,” K2 Space co-founder and CEO Karan Kunjur said in an interview.\n\nTo even get there, spacecraft operators typically either need to equip their satellites with powerful propulsion systems or pay a premium for a launch that takes them directly to the target orbit. Once there, the spacecraft must be capable of surviving the high radiation environment for the duration of the mission. But the Space Force has been building out assets in MEO, primarily for missile tracking and warning, but also to enhance the Global Positioning System (GPS) network.\n\n“MEO offers another level of resilience,” Kunjur said. “If you think about a multi-orbit strategy or multi-orbit architecture, what you want, if you want resilience, is to have assets that are in LEO, assets that are in MEO, and assets that are in GEO. We really at K2 believe in that future.”\n\nKunjur, who founded the company with his brother Neel, called the contract a “step change” for the business. The $60 million in funding includes a 1:1:2 mix of government funds, Small Business Innovation Research matching funds, and private funds — that means $30 million came from private backers, an amount that nearly rivals the startup’s $50 million Series A that closed in February.\n\nVenture investors and the DoD have been pulled in by K2 Space’s proposal for large hardware — the company’s Mega class satellite features a huge 3-meter-by-3-meter payload bay — at a cost of less than $15 million per satellite, with lead times of less than three months. These figures represent a paradigm-shifting change from traditional large satellite procurement.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe Torrance, California-based startup’s novel satellite architecture means that a substantial percentage of the spacecraft components are being built in-house. These include things like reaction wheels, flight computers, solar arrays, and the 20-kilowatt electric propulsion system, which will be among the most powerful to ever fly on orbit. The supply chain for these components at a cost-effective price point simply doesn’t exist, Kunjur said — which is why K2 Space is setting up those manufacturing lines on its own.\n\n“The challenge is not only designing it to hit the performance that this mission requires, but also designing it in a way that we can mass produce it,” he said. “It’s not like we’re going to build one, use it for Gravitas, this mission, and then redesign it for mass production. No, the idea is to build this so that when the first one comes off the line, the second one is right behind it, the third one is behind it, and so on.”\n\nThe company will also fly several technology demonstrators on SpaceX’s upcoming Transporter-12 mission in January, for a mission duration that is expected to last no more than a few months."}