{"url": "https://techcrunch.com/2025/04/24/uber-and-volkswagen-pair-up-to-launch-robotaxi-service-with-self-driving-electric-microbuses/", "title": "Uber, Volkswagen pair up to launch robotaxi service in US with self-driving, electric microbuses", "authors": ["Kirsten Korosec", "Transportation Editor", "Tim De Chant", "Kyle Wiggers", "Cindy Zackney", "Amanda Silberling", "Theresa Loconsolo", "Anthony Ha", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2025-04-24T00:00:00", "text": "Volkswagen of America and Uber on Thursday unveiled an ambitious plan to launch a commercial robotaxi service — using autonomous electric VW ID. BUZZ vehicles — in multiple U.S. cities over the next decade.\n\nThe companies expect to launch a commercial service in Los Angeles, the first city on the list, by late 2026. VW and Uber didn’t provide details on potential future markets.\n\nInitially, the service won’t be driverless. The fleet of autonomous vehicles will have human safety operators behind the wheel before they go driverless in 2027, a VW spokesperson told TechCrunch.\n\nThat gives Volkswagen ADMT, the autonomous vehicle subsidiary of Volkswagen of America, up to two years to navigate the regulatory landscape in California and gain the permits required to test its autonomous vehicles and eventually operate a commercial service.\n\nVolkswagen ADMT will begin testing in Los Angeles later this year once it receives its initial testing permit from the California Department of Motor Vehicles. The agency regulates autonomous vehicle testing and deployment in the state, and the California Public Utilities Commission handles permitting for the commercial ride-hailing component of robotaxi services.\n\nDespite the considerable hurdles ahead, the partnership is a notable step for Volkswagen ADMT. The subsidiary publicly launched in July 2023 with an autonomous vehicle test program in Austin and a fleet of 10 all-electric ID. Buzz vehicles equipped with partner Mobileye’s technology.\n\nIts parent Volkswagen Group, along with Ford, had hitched their autonomous vehicles ambitions to startup Argo, until the two automakers pulled financial support and gobbled up its remains. Volkswagen then turned to Mobileye to source autonomous vehicle technology, and that relationship has deepened recently. ADMT, Volkswagen’s U.S.-based effort, launched about nine months after Argo shut down.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nVolkswagen in 2023 said it wasn’t interested in building a dedicated ride-hailing service. Still, it did appear to see a business in selling its self-driving ID. Buzz vans and fleet management software to other companies.\n\nDetails of its partnership with Uber suggest that plan is intact.\n\n“Volkswagen is not just a car manufacturer — we are shaping the future of mobility, and our collaboration with Uber accelerates that vision,” Christian Senger, CEO of Volkswagen Autonomous Mobility, said in a statement. “What really sets us apart is our ability to combine the best of both worlds–high-volume manufacturing expertise with cutting-edge technology and a deep understanding of urban mobility needs.”\n\nThis is also Uber’s latest AV partnership. The ride-hailing giant has spent the past several years locking up deals with more than 14 autonomous vehicle firms across ride-hailing, delivery, and trucking. Uber recently launched a robotaxi service with Waymo in Austin, and is about to do the same in Atlanta."}