{"url": "https://techcrunch.com/2025/04/03/thatch-raises-40m-to-give-employees-more-control-of-their-health-insurance-choices/", "title": "Thatch raises $40M to give employees more control of their health care choices", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-03T00:00:00", "text": "Thatch, a startup that aims to transform the health insurance experience for employers and employees alike, has raised $40 million in a Series B round of funding, it tells TechCrunch exclusively.\n\nIndex Ventures led the financing, which included participation from existing backers Andreessen Horowitz (a16z), General Catalyst, SemperVirens, PeopleTech Partners, The General Partnership, and new investor ADP Ventures. In total since its October 2021 inception, Thatch has raised $84.5 million in equity funding.\n\nWhile the San Francisco-based startup declined to reveal its new valuation, co-founder Adam Stevenson told TechCrunch that it was about three times higher than its Series A (Thatch raised $38 million in a Series A round led by General Catalyst in February of 2024).\n\nThatch helps employers offer Individual Coverage Health Reimbursement Arrangement (ICHRA) to employees. ICHRA is a relatively new insurance option, in effect as of 2020.\n\nSo what’s the difference between an ICHRA and HRA? A typical HRA exclusively covers out of pocket medical expenses such as therapy, braces, and prescriptions.\n\nThe ICHRA allows employers to also use the funds to cover individual medical insurance.\n\n“So imagine each employee gets $1,000 a month — one employee might buy a Kaiser HMO plan for $800 a month and spend the remaining $200 month on therapy, while another employee might spend $1,000 a month fully on a United PPO plan. Previously, HRAs could not pay for insurance,” CEO and co-founder Chris Ellis explained.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThatch hosts a marketplace that allows employees to choose from different health insurance options, as well as offering a debit card that allows them to spend their remaining balance. Employees in turn use that budget through Thatch to choose healthcare plans they want, including medical, dental, and vision. If there are leftover funds, they can use that to pay for treatment costs. With Thatch, if an employee grows unhappy with one insurance carrier, they can switch, the founders said.\n\n“We see about ~50% of members carry a balance left over of around $250 month on average,” Ellis told TechCrunch. Those employees then have the ability to use the extra balance to pay for things that health insurance doesn’t cover, he added.\n\nIn the founders’ view, since the regulation is relatively new, there is plenty of room for innovation. For example, ICHRA employee classes, Stevenson said, allow businesses to customize their health benefits by grouping employees based on factors like hours worked or geographical location. Such flexibility lets employers tailor health plan offerings to different classes.\n\n“It makes no sense for healthcare to be dependent on your employer,” said Stevenson, who serves as the company’s president. “Rather than selecting one-size-fits-all benefits for their teams, ICHRA instead allows businesses to give their employees tax-free money to spend on healthcare in the way that works best for them.”\n\nThatch has partnered with QuickBooks so that the company “can embed and distribute ICHRA directly within” its own product, Ellis said. This means that companies that use QuickBooks can easily set up ICHRA accounts for employees. Thatch is in the process of building a similar offering for ADP, which hasn’t launched yet.\n\nWhile Stevenson declined to reveal revenue figures, he said Thatch has onboarded “over a thousand companies” over the last 18 months and that revenue grew 8x year-over-year. (The company launched its offering in August of 2023). Customers include Dave’s Hot Chicken, Jersey Mike’s, PeopleTech Partners, Fragment.dev, Ferry Health, and Friends of Bonobos.\n\nHealthcare meets fintech\n\nThe two founders’ experience is primarily in healthcare. Ellis started his career as a cancer researcher at MIT. He then founded the U.S. sales team at Sophia Genetics, a clinical software startup, before working on the software product team at Agilent Technologies, a large testing equipment company.\n\nStevenson spent four years at health insurance giant Humana, while launching a few bootstrapped SaaS companies on the side. He eventually landed at Stripe, where he started and led different customer engineering teams for seven years.\n\nThe pair said they came to realize that making ICHRA work would ultimately be tied to solving fintech problems such as managing budgets, issuing funds, remitting and tracking payments, and handling adjudication. So the company worked to recruit employees from companies such as Stripe, Rippling, and Ramp to “to create all of the financial and operational infrastructure necessary to abstract away all of the messiness of ICHRA.”\n\nThatch also has recently hired Gary Daniels, the former CEO for UnitedHealthcare’s Pacific Northwest division, as its chief growth officer.\n\n“He’s joining because he believes ICHRA is the future of employer-sponsored healthcare,” Stevenson told TechCrunch.\n\nAs of March, Thatch had 72 employees.\n\nJahanvi Sardana, partner at Index Ventures, likened the process of choosing a health plan to “trying to buy a house without knowing the price or details.”\n\n“You’re handed a limited set of options and hope for the best,” she told TechCrunch “Thatch makes benefits work like a modern marketplace — transparent, personalized, and designed around choice. They’re not tweaking the system — they’re replacing it with something fundamentally better. It’s the kind of shift that, once it happens, will feel obvious in hindsight.”\n\nSardana believes that Thatch isn’t just tackling benefits — but also a technology and payments problem.\n\nShe said: “Every piece — plan selection, payments, reimbursements — is designed around the end user…That kind of shift doesn’t happen by accident…When the best companies in the world want your product before you even knock on their door, you know you’re building something game-changing.”"}