{"url": "https://techcrunch.com/2022/10/13/securithings-is-bringing-order-to-iot-device-management-with-21m-investment/", "title": "SecuriThings is bringing order to IoT device management with $21M investment", "authors": ["Ron Miller", "Enterprise Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-10-13T00:00:00", "text": "As companies deploy more security devices like cameras, access control systems, intercoms and many other tools throughout their organizations, they are often disconnected from traditional IT, and may lack any way of managing the equipment in a systematic way. SecuriThings has built a solution to solve this problem with a platform that helps building operations understand and control what’s happening on physical security devices across a company.\n\nToday the company announced a $21 million Series B.\n\nRoy Dagan, company CEO and co-founder, says that while companies are spending inordinate amounts of money on this equipment, they often don’t know if they are even working because they lack visibility. “We built the ultimate system to help them automate the management of these devices at scale, and really provide the equivalent of an IT type of system for managing these kinds of devices,” Dagan told TechCrunch.\n\nThe system automates a bunch of management tasks that are typically done manually, including firmware upgrades, managing certificates and rotating passwords. What’s more, it can help find and troubleshoot issues with these devices as they happen.\n\n“It can also perform things like root cause analysis. So we can tell when an issue occurs, and we can tell you what’s at fault,” he said.\n\n“You may think it’s a [camera], but it’s actually a switch and it’s affecting 15 [cameras], which are all down.\n\nAnd that’s a problem because while building operations manages the broken cameras, the broken switch is under the purview of IT, and they need to know about it to fix it. SecuriThings includes ways to communicate with IT about these issues.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“You can collaborate with your counterparts in IT. So it can be integrated with ServiceNow or other ticketing systems…and that helps you also start working better with the rest of the enterprise,” Dagan said.\n\nHe believes that in spite of the economic uncertainty we are seeing, his company is well positioned to deal with it. “One of the cool business outcomes is really around cost reduction. Because if you look at the enterprise, and you look at the amount of spend they have today on these devices, and the way things are done manually and reactively, it’s almost a no brainer. The cost savings are huge,” he said.\n\nWhile he wouldn’t discuss revenue growth, he said the company currently has dozens of customers using the platform and the number of customers has grown over 300% year over year.\n\nThe startup currently has 70 employees, with plans to add more with the new investment. He says that being diverse is built into the company’s values. “So it’s just part of our culture, and it’s core to the company. It really is, and just looking at stats that we have today where 40% of leadership is female, and 40% of the company is female…But then also our HR team is constantly evaluating the numbers and looking at different opportunities and how we create that diversity even more,” he said.\n\nToday’s investment was led by U.S. Venture Partners (USVP) and participation from Swisscom Ventures and existing investors Aleph, Firstime VC and Cresson Management. The startup reports it has now raised a total of $39 million."}