{"url": "https://techcrunch.com/2022/09/13/maverick-deepfakes-e-commerce/", "title": "Maverick leverages deepfakes for real e-commerce connection", "authors": ["Christine Hall", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-09-13T00:00:00", "text": "In a world full of mass messages, trying to be different and send out 20,000 personalized messages can be pretty daunting.\n\nMaverick Lab, a business-to-business personalized video messaging startup, aims to help e-commerce entrepreneurs send more personalized messages using deepfakes.\n\nDeepfake tech isn’t new. Debarshi Chaudhuri, co-founder of Maverick, told TechCrunch that companies like Bonjoro and Vidyard have developed video technology in this space and are considered competitors.\n\nHowever, he points out that these companies offer features, for example, where someone manually records each video, that are focused on sales only or personalization is “like showing a slide with your name.”\n\nInstead, Maverick is focused on the e-commerce niche, which Chaudhuri says has some more specific needs, especially once a company scales past a certain number of orders per day. In addition, the company decided to go with humans rather than avatars like others are doing.\n\n“We think it works best when the real person is behind the brand and the message is augmented for the customer name,” he added. “In addition, videos are driving revenue, so you are investing in not just content creation, but data analytics attribution and how these videos perform compared to other content.”\n\nCustomers record a 30-second video once, and the company’s technology uses the voice samples to generate thousands of videos that are personalized to each customer using deep learning models and audio/video processing techniques.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIt can be any message, for example, a “thank you,” something to win them back or welcome them as a new customer, Maverick co-founder Eitan Winer said. The founders are seeing return on investment anywhere between $10 and $40 for every dollar by sending out the videos, which are typically used to address abandoned carts, first-time conversions and loyalty campaigns.\n\n“We just need a voice sample, an automated notification and know when to send a video,” he added. “Customers can integrate it into their shopping platform and send us a notification when someone places an order. After that, they can set it and forget it.”\n\nThe company also built an analytics and attribution platform so that brands can understand what engagement looks like with these videos and how much revenue is being driven by them.\n\nThe market for personalized marketing was likely to grow 40% more in revenue for those who use it versus those who didn’t, according to a 2021 McKinsey report.\n\nChaudhuri and Winer are seeing some of that growth already since founding Maverick a year ago. The company has a few dozen paying customers already, many of whom have stuck around since Maverick launched, and has sent out 200,000 personalized videos to date.\n\nMaverick’s approach has also turned some investor heads. The company closed on a $2.7 million round of seed funding in March led by Signia Venture Partners. Joining them was participation from Global Founders Capital, Unpopular Ventures, Hack VC and a group of angel investors that included founders and executives from companies like Benchling, Shogun, Pocket Gems, Salesforce, AppLovin, Made Renovation, Dover, Memmo and Ebates.\n\nThe company is building out its team, which currently has found people and is doubling down on product and growth. Continuing to add to the workforce is what Winer says will be the near-term focus as well as onboarding customers and product development.\n\n“We want to show them as much value as possible,” he added."}