{"url": "https://techcrunch.com/2025/04/10/blueskys-latest-update-adds-chat-reactions-and-an-explore-page-similar-to-x/", "title": "Bluesky’s latest update adds chat reactions and an Explore page, similar to X", "authors": ["Sarah Perez", "Consumer News Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-10T00:00:00", "text": "Social network Bluesky is rolling out a new version of its software, which adopts some of the features former X users have missed. Nope, it’s not an edit button! Instead, the open social network is adding support for chat reactions in its direct messages feature and is revamping its search page as “Explore,” directing users to trends, suggested accounts, Starter Packs, and more.\n\nThe features both take inspiration from X, which has let users react to direct messages with an emoji since 2020. X expanded the feature a few years later, allowing users to choose any emoji beyond the default set.\n\nBluesky is now offering the same, as users can now click on the emoji button next to a person’s message to add a reaction. In the initial pop-up, a handful of common emojis like the heart, thumbs up, eyes, sad face, and a laughing face are available. However, users can click on the three-dot menu to select any other emoji as their reaction, similar to what they can do in X.\n\nImage Credits:Bluesky\n\nNotably, the Bluesky search page is becoming more useful with the new release, as it now helps connect users to what’s trending on the network. A feature like this may not have made as much sense when Bluesky was smaller, but with a now sizable user base of over 34 million users, it’s easier to spot trends surfacing among the many discussions on the platform.\n\nFor instance, some of the trends today are linked to timely events, like Trump’s tariffs and their impact, while others point to popular communities on Bluesky, like the readers on BookSky. The trends are also marked with labels like “New” or “Hot” or how long ago they began trending, like “5h ago.”\n\nImage Credits:Bluesky\n\nIn addition, the new Explore page lets users enter their own interests to better personalize the content shown to them on Bluesky. It also offers suggestions of accounts to follow within different categories, like Art, Sports, Music, Comics, Politics, Science, News, Animals, Books, Video Games, and others.\n\nBelow this, the app suggests interesting Starter Packs — or, curated lists of users that newcomers can follow with a click — as well as suggestions of other popular custom feeds, like NFL+, which connects users to those talking about American football on Bluesky.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nImage Credits:Bluesky\n\nEarlier this week, Bluesky CTO Paul Frazee credited the company’s recent hire of Darrin Loeliger for the updated Explore page, saying he showed the team “the upside of hiring a designer.”\n\nThough smaller additions, these new updates could make former X users feel more comfortable when they join Bluesky, as they’ll have access to similar tools to engage with friends and discover discussions, people, and interests."}