{"url": "https://techcrunch.com/2025/04/24/parents-who-lost-children-to-online-harms-protest-outside-of-metas-nyc-office/", "title": "Parents who lost children to online harms protest outside of Meta’s NYC office", "authors": ["Rebecca Bellan", "Senior Reporter", "Zack Whittaker", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-04-24T00:00:00", "text": "Meta may have managed to kill a bipartisan bill to protect children online, but parents of children who have suffered from online harm are still putting pressure on social media companies to step up.\n\nOn Thursday, 45 families who lost children to online harms — from sextortion to cyberbullying — held a vigil outside one of Meta’s Manhattan offices to honor the memory of their kids and demand action and accountability from the company.\n\nMany dressed in white, holding roses, signs that read “Meta profits, kids pay the price,” and framed photos of their dead children — a scene that starkly contrasted with the otherwise sunny spring day in New York City.\n\nWhile each family’s story is different, the thread that holds them together is that “they’ve all been ignored by the tech companies when they tried to reach out to them and alert them to what happened to their kid,” Sarah Gardner, CEO of child safety advocacy Heat Initiative, one of the organizers of the event, told TechCrunch.\n\nOne mother, Perla Mendoza, said her son died of fentanyl poisoning after taking drugs that he purchased off a dealer on Snapchat. She is one of many parents with similar stories who have filed suit against Snap, alleging the company did little to prevent illegal drug sales on the platform before or after her son’s death. She found her son’s dealer posting images advertising hundreds of pills and reported it to Snap, but she says it took the company eight months to flag his account.\n\n“His drug dealer was selling on Facebook, too,” Mendoza told TechCrunch. “It’s all connected. He was doing the same thing on all those apps, [including] Instagram. He had multiple accounts.”\n\nThe vigil follows recent testimony from whistleblower Sarah Wynn-Williams, who reveals how Meta targeted 13- to 17-year-olds with ads when they were feeling down or depressed. It also comes four years after The Wall Street Journal published The Facebook Files, which show the company knew that Instagram was toxic for teen girls’ mental health despite downplaying the issue in public.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nParents of children lost to online harms left an open letter to Meta CEO Mark Zuckerberg outside Meta’s office in NYC, April 24, 2025. Image Credits:Rebecca Bellan\n\nThursday’s event organizers, which also included advocacy groups ParentsTogether Action and Design It for Us, delivered an open letter addressed to Zuckerberg with more than 10,000 signatures. The letter demands that Meta stop promoting dangerous content to kids (including sexualizing content, racism, hate speech, content promoting disordered eating, and more); prevent sexual predators and other bad actors from using Meta platforms to reach kids; and provide transparent, fast resolutions to kids’ reports of problematic content or interactions.\n\nGardner placed the letter on a pile of rose bouquets that were placed outside Meta’s office on Wanamaker Place as protesters chanted, “Build a future where children are respected.”\n\nOver the past year, Meta has implemented new safeguards for children and teens across Facebook and Instagram, including working with law enforcement and other tech platforms to prevent child exploitation. Meta recently introduced Teen Accounts to Instagram, Facebook, and Messenger, which limits who can contact a teen on the app and restricts the type of content the account holder can view. More recently, Instagram began using AI to find teens lying about their age to bypass safeguards.\n\n“We know parents are concerned about their teens’ having unsafe or inappropriate experiences online,” Sophie Vogel, a Meta spokesperson, told TechCrunch. “It’s why we significantly changed the Instagram experience for teens with Teen Accounts, which were designed to address parents’ top concerns. Teen Accounts have built-in protections that limit who can contact teens and the content they see, and 94% of parents say these are helpful. We’ve also developed safety features to help prevent abuse, like warning teens when they’re chatting to someone in another country, and recently worked with Childhelp to launch a first-of-its kind online safety curriculum, helping middle schoolers recognize potential online harm and know where to go for help.”\n\nGardner says Meta’s actions don’t do enough to plug the gaps in safety.\n\nFor example, Gardner said, despite Meta’s stricter private messaging policies for teens, adults can still approach kids who are not in their network through post comments and ask them to approve their friend request.\n\n“We’ve had researchers go on and sign on as a 12- or 13-year-old, and within a few minutes, they’re getting really extremist, violent, or sexualized content,” Gardner said. “So it’s clearly not working, and it’s not nearly enough.”\n\nVogel countered that Teen Accounts are private by default and under 16s can’t change this without a parent’s permission, so adults who aren’t connected to the kid can’t see their comments on posts. She also said that people who sign up with an under 13 date of birth wouldn’t be able to set up an account, so “a researcher would not have been able to set up an Instagram account as a 12-year-old.”\n\nGardner noted that Meta’s recent changes to its fact-checking and content moderation policy in favor of community notes are a signal that the company is “letting go of more responsibility, not leaning in.”\n\nMeta and its army of lobbyists also led the opposition to the Kids Online Safety Act, which failed to make it through Congress at the end of 2024. The bill had been widely expected to pass in the House of Representatives after sailing through a Senate vote, and would have imposed rules on social media to prevent the addiction and mental health harms the sites are widely agreed to cause.\n\n“I think what [Mark Zuckerberg] needs to see, and what the point of today is, is to show that parents are really upset about this, and not just the ones who’ve lost their own kids, but other Americans who are waking up to this reality and thinking, ‘I don’t want Mark Zuckerberg making decisions about my child’s online safety,’” Gardner said.\n\nThis story has been updated with additional information from Meta."}