{"url": "https://techcrunch.com/2024/12/11/microsofts-m12-invests-another-22-5m-into-nuebird-months-after-its-22m-seed-round/", "title": "Microsoft’s M12 invests another $22.5M into NeuBird, months after its $22M seed round", "authors": ["Marina Temkin", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-12-11T00:00:00", "text": "Late last year, Gou Rao and Vinod Jayaraman founded NeuBird to automate IT site reliability operations tasks with generative AI.\n\nHaving sold their previous cloud-native storage startup, Portworx, to PureStorage for $370 million, the pair was well-versed in the IT challenges faced by today’s enterprises.\n\n“It’s very hard to find good site reliability engineers. There’s a lot of churn,” Rao, NeuBird’s CEO, told TechCrunch. “It doesn’t help that the modern IT stack just keeps getting more and more complex. Humans alone cannot possibly keep up with this kind of change.”\n\nTo deal with that increased complexity, NeuBird built Hawkeye, an AI-powered SRE that can quickly identify, diagnose, and resolve issues, freeing human engineers for more strategic work.\n\nHaving raised a $22 million seed round from Mayfield in April (at a $100 million valuation, according to PitchBook data), NeuBird wasn’t seeking additional funding. But when Microsoft’s venture fund M12 reached out about an investment, NeuBird couldn’t say ‘no’.\n\nSince many of NeuBird’s customers run on Azure cloud, the partnership could help the company bring its solution to a larger market.\n\nOn Wednesday, NeuBird announced a $22.5 million seed extension round led by M12, with participation from Mayfield, Stepstone Group and Prosperity7 Ventures.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAlthough extensions are often done by companies that are not growing fast, this was certainly not the case for NeuBird. Rao said he chose to call the round “seed-1” precisely because NeuBird wants to raise larger funding from traditional Series A investors in the future, adding that the valuation for this round was “a lot higher” than the previous financing.\n\nJudging by investor interest, NeuBird is on to something.\n\nCompanies could “hire” Hawkeye to look for active alerts and alarms in a continuous loop throughout the day. Once Hawkeye identifies an issue, it tries to troubleshoot it, but if it doesn’t succeed, it escalates the incident to a human engineer.\n\nHawkeye works by using LLM reasoning to check logs of any system, including custom-built ones. “LLMs have seen so many different application configuration scenarios that the fact that the LLM would run into an application log line message that it doesn’t understand is minuscule,” Rao said.\n\nHawkeye taps into all systems in a read-only mode, which means it doesn’t store any of the customers’ proprietary data. That’s important for banks and other organizations that must safeguard personally identifiable information.\n\n“Hawkeye doesn’t need to see the application itself or the application data. We don’t need to see your transactional records,” he said. “All we’re looking at is the health data. Are there any alarms? Are there any errors in the logs? Is the CPU too high?”\n\nThe company has already succeeded in landing customers ranging from large car manufacturing companies, financial institutions, pharmaceuticals, and even startups, with as few as 30 employees and only one IT operations engineer who is not able to keep up with incident tickets. While some of these organizations are still piloting the product, many have moved to production mode over the last couple of months.\n\nStill, while NeuBird has got VCs throwing money at it, with high valuations, at its seed round, it’s not the only startup working on AI-powered SRE tasks. Y Combinator has supported three of them in 2024 alone (SRE.ai, Opslane, Parity) and a few others have launched as well like Cleric. And bigger players, like Moogsoft, also offer automated incident response features.\n\nStill, like sales automation and customer service automation, copilots, or teammates, as Mayfield’s managing partner calls what NeuBird does, are coming for many developer and DevOps functions. And with this level of excitement from VCs, NueBird is one to watch.\n\nEditor’s note: this story was modified to clarify that the company’s previous seed-round valuation came from PitchBook."}