{"url": "https://techcrunch.com/2025/04/16/rippling-wants-uk-fintech-revolut-to-reveal-who-paid-off-deels-alleged-spy/", "title": "Rippling wants Revolut to reveal who paid off Deel’s alleged ‘spy’", "authors": ["Charles Rollet", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-16T00:00:00", "text": "Another highly valued startup has just been added to the mix in the ongoing legal drama between Rippling and Deel: U.K. fintech giant Revolut.\n\nIn his blockbuster affidavit that reads like it’s straight out of a movie, Irish Rippling employee Keith O’Brien claimed that Deel paid him about $6,000 a month to spy on Rippling. He alleged the first $6,000 payment was sent to his Revolut account by Alba Basha Westgarth, the wife of Deel’s COO Dan Westgarth, back in November 2024.\n\nAt the time, Alba Basha Westgarth was working as the crypto compliance lead at Robinhood, according to a LinkedIn profile reviewed by TechCrunch that has since been deleted. Robinhood told TechCrunch that she left Robinhood earlier this year, but did not explain why.\n\nThe deleted LinkedIn profile listed her location as Dubai — that’s the same place where Deel’s CEO and legal director are now located as Rippling tries to serve them papers. The UAE has a reputation as an extradition haven.\n\nRippling is now suing Revolut to get the full name and address of the “Alba Basha” listed as the sender on that $6,000 receipt, court records show. Rippling is also seeking all account opening documentation — things like IDs and utility bills — to definitively confirm her identity.\n\nIn response, Revolut has hired a top lawyer in Ireland. It also sent a letter responding to Rippling last week, which a lawyer for Rippling described as “helpful but complicated” in a court hearing (without elaborating.)\n\nTo be clear, there’s no indication or accusation that Revolut has done anything wrong here. The E.U. has strict privacy laws, so supplying that kind of information isn’t simple, especially in a civil case like this one. A key sticking point is that there hasn’t been an order from the Irish court itself on Revolut to provide the information.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nRevolut declined to comment specifically on the case but told TechCrunch that, in general, it will “always comply with any court order request for disclosure.”\n\nWhether Revolut ends up providing more details about the “Alba Basha” behind the transfer remains to be seen. The only other option under European privacy laws would be customer consent, which seems unlikely in this case.\n\nDeel, which has denied all wrongdoing to the media, didn’t respond to a request for comment. Deel COO Dan Westgarth and Alba Basha Westgarth didn’t respond either. Rippling declined to comment.\n\nAlthough the evidence isn’t yet definitive, the Irish High Court gave a clue that it may honor Rippling’s wishes to verify Alba Basha’s identity in some way or form.\n\nAfter a lawyer for Rippling rattled off evidence connecting Alba Basha to Dan Westgarth, including a Facebook photo of the two together, during an April 2 court hearing, Judge Mark Sanfey remarked that “it could be a coincidence, but it’s unlikely!”\n\nYou can send tips securely to this reporter on Signal at +1 628-282-2811.\n\n"}