{"url": "https://techcrunch.com/2022/02/21/groundfloor-steps-up-its-real-estate-debt-crowdfunding-platform-with-fresh-capital/", "title": "Groundfloor steps up its real estate debt crowdfunding platform with fresh capital", "authors": ["Anita Ramaswamy", "Reporter", "Crypto", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2022-02-21T00:00:00", "text": "Crowdfunding has become an increasingly popular way for companies to raise capital, and investors are taking notice. Groundfloor, the first real estate crowdfunding platform to gain regulatory approval, announced today that it raised its first round of institutional capital since 2015.\n\nBrian Dally, a former mobile network exec, and Nick Bhargava, a co-author of the bipartisan JOBS (Jumpstart Our Business Startups) Act, founded Groundfloor in 2013. The Atlanta-based company raised its $5 million Series A led by Fintech Ventures shortly after new crowdfunding rules under the JOBS Act took effect, allowing small businesses to fundraise up to $75 million from non-accredited investors without needing to register the offering.\n\nGroundfloor’s platform offers investments in real estate debt to its 150,000+ users, with a minimum investment of $10. Nearly all of the products available on its platform are open to non-accredited investors, Dally, who serves as CEO, told TechCrunch. Groundfloor users have a wide range of reasons for using the platform, from new investors who are looking for a safer alternative to public markets to experienced investors who prefer investing through an app instead of using the broker, Dally said.\n\nDally and Bhargava started Groundfloor to help average investors access opportunities similar in their risk-return profile to those available to institutions, according to Dally. Groundfloor offers an alternative way for these investors to access real estate “without having to buy a publicly-traded REIT (real estate investment trust) or having to go buy a whole rental property and take on the operational risk and concentration risk,” Dally said.\n\nThe company’s “secret sauce” comes from its deep understanding of regulatory frameworks, according to Dally. Launching its first product felt like waiting for regulators to approve a new drug, he added, noting that it took two years and roughly $1 million for Groundfloor to gain Securities and Exchange Commission (SEC) approval to operate in its first U.S. state. Today, the company sells securities in 49 of 50 U.S. states and lends capital to real estate projects in 35 states.\n\nGroundfloor underwrites the loans on its platform using an algorithm that assigns each loan a grade based on its risk across six different factors, with an emphasis on the track record and experience of the real estate investor receiving the loan, Dally said. Investors on Groundfloor can then make allocation decisions that are appropriate for their own risk tolerance levels based on these scores, he continued.\n\nGroundfloor has scaled its platform by adding new debt investment products, including a saving and investing app called Stairs that it launched last fall, which now has $22 million in assets invested. On Stairs, users earn between 4% and 6% interest on cash held in what is essentially a checking account. Groundfloor uses the capital it gets from Stairs users to make loans to real estate entrepreneurs, which it holds briefly on its own books before selling them to investors, Dally said. Stairs users have constant liquidity and can take their money out of the app whenever they want, he added — a novel structure that he said took nine months to qualify with the SEC.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“These are heavy RegTech lifts. A lot of legal engineering goes into it. So that process takes a lot takes a long time, but we think it’s worth it,” Dally said.\n\nIn 2018, the company began raising capital from its own users through its own platform and equity crowdfunding platform SeedInvest, totaling $30 million over four public equity raises since then. Individual investors now own about 30% of Groundfloor, Dally said.\n\nThe newly-announced Series B comes on the heels of substantial growth for Groundfloor, which saw revenue grow 114% to $12 million in 2021, according to the company. Groundfloor said its investors enjoyed an average return of 10% across all its real estate loans during the year.\n\nThe latest round brought in a total of $118 million for the company, with $5.8 million in equity coming from Israeli real estate company Medipower and $7.2 million from 3,600+ individual investors who back Groundfloor through crowdfunding platform SeedInvest. 86 individuals also participated in the round directly through the Groundfloor app, with their investment comprising $5.0 in convertible notes. Dally noted that convertible notes are one of the only products on Groundfloor that aren’t available to non-accredited investors, partially because the company rarely raises them.\n\nGroundfloor announced a strategic partnership with Medipower, which specializes in shopping centers and retail real estate, as part of the funding news. Medipower plans to invest up to $100 million this year in loans on Groundfloor, and up to an additional $220 million next year. The company, which is traded on the Tel Aviv Stock Exchange under the ticker MDPR, will invest in these loans on the same terms as individual investors on the platform and will be limited in how much it can invest to ensure other investors don’t get crowded out. As part of the deal, Medipower founder and chairman Yair Goldfinger will join the Groundfloor board.\n\nMedipower’s investments could amount to 25% of Groundfloor’s assets under management by the end of 2022, Dally said. He sees the Medipower loan investments as a non-dilutive source of financing because he expects the institutional validation from Medipower investing on Groundfloor to attract revenue for the company from other sources.\n\n“That [capital] is going to be directly benefiting real estate entrepreneurs who are doing new construction projects and building housing all over the country,” Dally said.\n\nGroundfloor plans to use the proceeds from the fundraise, in part, to add 50 new employees to its team, which is currently composed of about 70 people. Around 40% of these new hires will be engineers to support the company’s growth plans, particularly on the product side, Dally said.\n\n“We’re getting ready to go from 160,000 investors to a million investors in the next couple years,” Dally said."}