{"url": "https://techcrunch.com/2022/11/08/southeast-asia-health-tech-platform-speedoc-raises-28m/", "title": "Southeast Asia health tech platform Speedoc raises $28M", "authors": ["Catherine Shu", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-11-08T00:00:00", "text": "Speedoc, a health tech platform that brings hospital care to homes, has raised $28 million in pre-Series B funding. The round included Bertelsmann Investments, Shinhan Venture Investment and Mars Growth. Returning investor Vertex Ventures Southeast Asia and India, which led Speedoc’s $5 million Series A in 2020, also participated.\n\nBased in Singapore, Speedoc was founded in 2017 by Dr. Shravan Verma and Serene Cai. Its services include telemedicine consultations, on-site doctor and nurse visits, virtual hospital wards and ambulance hailing. Speedoc is available in a total of nine cities, including eight in Malaysia.\n\nDr. Verma told TechCrunch that he became interested in creating an app for on-demand medical services while he was a doctor in an emergency department, and saw how many patients had to wait hours for minor conditions. Cai, meanwhile, wanted to create an easier way for people to get medical help, especially in underserved communities, while her family was caring for her grandmother, who had severe dementia.\n\nSpeedoc is currently participating in the Ministry of Health Office for Healthcare Transformation’s Mobile Inpatient Care@Home initiative, and its hospital partners include National University Health System (NUHS), the Singapore General Hospital (SGH) and Khoo Teck Puat Hospital. As part of the program, Speedoc plans to expand its virtual hospital program, which includes a 24/7 patient care team.\n\nH-Ward is one of the main ways Speedoc differentiates from other telemedicine platforms, Dr. Verma said, because it standardizes services like telemedicine, remote monitoring and home-based doctors and nurses for continuous care. Patients are able to receive frequent medical reviews, 24/7 nursing, intravenous therapies, blood tests and in-person visits.\n\n“Research and survey findings have shown that given the same medical care and treatment, patients could recover faster at home,” Dr. Verma said. “We have also been encouraged by our patients advocating for home-based care, and preferences to be admitted at home. Most importantly, on the impact on the healthcare landscape, the thrust towards virtual hospitals will ensure more optimal utilization rates, and more capacity for medical personnel to attend to life-threatening conditions.”\n\nSpeedoc will use its new funding to expand in Southeast Asia, especially in cities where there is a shortage of healthcare professionals.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nIn a statement about the funding, Shinhan Venture Investment (Global Investment) director Jinsoo Lee said, “Healthcare provision and delivery in Southeast Asia is poised for tremendous change in the next decade. We believe the healthcare model Speedoc champions will see greater adoption in meeting the healthcare gap in the region.”"}