{"url": "https://techcrunch.com/2023/03/21/nvidia-teams-up-with-quantum-machines-to-combine-classical-and-quantum-machines/", "title": "Nvidia teams up with Quantum Machines to combine classical and quantum machines", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-03-21T00:00:00", "text": "Nvidia and Quantum Machines, the Israeli startup offering an orchestration platform to controlling and operating quantum processors, today announced the launch of Nvidia DGX Quantum, which combines Nvidia’s Grace Hopper Superchip with Quantum Machines’ controller.\n\nOver the course of the last few years, it’s become increasingly clear that to effectively operate a quantum computer, you’ll also need a lot of classical compute resources to control these systems. And these two systems also need to be tightly integrated, in part because you need to run calibration and error correction algorithms on the classical machines to keep the quantum machines running. But every additional compute cycle then also helps to run additional functions and evaluate the data from the quantum computer.\n\n“Quantum computers do have a very natural place — and that is to power supercomputers,” said Quantum Machines co-founder and CEO Itamar Sivan. “The most natural place for them, I think, is in supercomputing infrastructure and cloud infrastructure. On the one hand, these will be the first places to integrate quantum computing at a greater scale. We want to power these supercomputers with quantum, but we also want to power the quantum with the supercomputers.”\n\nThat’s what this collaboration is all about. You can’t run a quantum computer without massive classical compute resources and for a supercomputer, quantum essentially becomes another co-processor for handling specific tasks, similar to how GPUs are often used to accelerate machine learning tasks, for example.\n\n“If you have a million cubits or hundreds of thousands of cubits and each has a dozen parameters that need to be independently optimized — the leaders in the community are turning their attention towards AI methods, which shine on an NVIDIA platform,” explained Tim Costa, Nvidia’s director of high performance computing and quantum. “There’s this huge GPU compute requirement for standing up a computer which will deliver on the promise of quantum. And to do that, of course, we have to get tightly coupled to quantum, so we need to work with the leader in the field in terms of interfacing with quantum and controlling quantum, which is Quantum Machine.”"}