{"url": "https://techcrunch.com/2022/10/11/apple-google-software-update-5g-india/", "title": "Apple, Google and Samsung to soon release 5G support software updates in India", "authors": ["Ivan Mehta", "Jagmeet Singh", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2022-10-11T00:00:00", "text": "Apple, Google and Samsung said Wednesday they will roll out software updates to enable 5G support on their respective handsets in India, the world’s second-largest wireless market, just days after local bureaucrats began pushing the phonemakers to expedite their efforts.\n\nReliance Jio and Airtel, India’s two largest carriers, have started to offer 5G services in select Indian cities in recent weeks, but many popular handsets in the nation currently don’t support the local airwaves. These smartphones have hardware capabilities for 5G, but manufacturers need to work with local network carriers to release software updates to enable support for their networks.\n\nTo that end, Apple today said that it will issue a software update in December to enable 5G on iPhones used in India. Apple first introduced 5G capabilities with the iPhone 12 in 2020.\n\n“We are working with our carrier partners in India to bring the best 5G experience to iPhone users as soon as network validation and testing for quality and performance are completed. 5G will be enabled via a software update and will start rolling out to iPhone users in December,” Apple said in a statement.\n\nGoogle has also promised a software update for its devices — though it hasn’t provided a specific time frame for the rollout.\n\n“Pixel 7, 7 Pro, and Pixel 6a are 5G capable devices. We are actively working with the Indian carriers to enable functionality at the earliest,” a Google spokesperson said in a statement. Google launched the Pixel 6a in India in July, and the Pixel 7 series will go on sale soon.\n\nSimilar to Apple and Google, Samsung, which is the country’s second-largest smartphone vendor, is also working toward bringing software upgrades to enable local airwaves support across all its 5G phones in the country.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Samsung has pioneered 5G technology development since 2009 and took the leading role in standardizing 5G technology globally. In India, Samsung has the widest portfolio of 5G devices. We are working closely with our operator partners and are committed to rolling out OTA updates across all our 5G devices by mid-November 2022, enabling Indian consumers to experience 5G seamlessly,” a Samsung India spokesperson said in a statement.\n\nIn July, India sold the license to 5G airwaves in an auction for a record sum of $19 billion. Billionaire Mukesh Ambani’s Jio has purchased most of the spectrum and has committed to spending $25 billion alone in rolling out and broadening its 5G services. The South Asian nation, which is one of the last major markets to adopt 5G, has high hopes for its potential.\n\n“5G is a knock on the doors of a new era in the country. It is the beginning of an infinite sky of opportunities,” Prime Minister Narendra Modi said at an event last month.\n\nBoth Apple and Google’s devices hold a small percentage in terms of market share in the Indian smartphone market. While Apple commands just 4% of the local smartphone market, Google’s numbers are not available because of comparatively lower sales. According to analyst firm Counterpoint, the total install base of 5G-ready smartphones in India was 50 million in July.\n\nAccording to a support page by carrier Bharti Airtel, some headsets from Chinese manufacturers like Xiaomi, Oppo, Vivo, Realme and OnePlus already support its 5G services.\n\nNotably, Airtel has enabled its 5G services in eight cities and Reliance Jio has enabled them in four cities through an invite-only program. Both these network providers aim to expand the 5G coverage across the country in the coming few years. Airtel’s chairman Sunil Bharti Mittal said that the company aims to cover all parts of its eight launch cities by March 2023 and the entire country by 2023. Reliance Jio’s goals are rather ambitious as it plans to roll out its 5G services across the country by 2023.\n\nThe story was updated with Samsung’s comment."}