{"url": "https://techcrunch.com/2024/01/17/getsafe-buys-deinestudienfinanzierung/", "title": "Insurtech Getsafe acquires a student loan platform to meet its future clients upstream", "authors": ["Anna Heim", "Freelance Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-01-17T00:00:00", "text": "European insurtech company Getsafe has acquired deineStudienfinanzierung, an aptly named German digital platform for student loans that was showcased on the local version of “Shark Tank” in 2019.\n\nThis is Getsafe’s second acquisition in a few months, after it nabbed the German portfolio of ailing French insurtech company Luko, thereby growing its user base to over 550,000 customers. But this time, the Heidelberg-based company is acquiring more than clients.\n\nWhile terms of the deal weren’t disclosed, TechCrunch has exclusively learned from Getsafe CEO Christian Wiens that deineStudienfinanzierung will continue operating as a standalone business and that all of its team — “about 10 people” — will continue to be employed after the acquisition.\n\nIn practice, deineStudienfinanzierung will keep on helping students apply online for publicly subsidized loans offered by its partner, German state bank KfW. This has been the startup’s core focus ever since it pivoted away from also facilitating grant applications; all in all, it has assisted some 200,000 students in receiving over €1 billion in study financing since its creation.\n\nIf this amounts to less than €5,000 per student, it is because demand for student loans in Germany is different from what you may know, Wiens explained.\n\n“Student loans are the second most popular form of external student financing in Germany after [grants]. Unlike in the U.S., universities in Germany are largely tuition-free, which means that student loans are generally used to cover living expenses. Therefore, the average student loan amount is much lower in Germany than in the U.S.\n\nCOVID boosted demand for student loans because many students could not perform their side jobs due to the lockdowns (e.g., working in bars and restaurants). Many lost their main source of income overnight and had to turn to alternative ways to cover their living expenses. The financing volume has returned to previous levels since.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nJust like Getsafe didn’t invent insurance, deineStudienfinanzierung didn’t invent student loans. Instead, both are bringing a digital-first approach that aims to connect more organically with young people.\n\nOverlapping targets\n\nDespite plans to keep things separate, Getsafe is very much hoping that there will be synergies between the two businesses that go beyond their shared vision. “With deineStudienfinanzierung, we are now a relevant fintech player for students,” Wiens said.\n\nFor Getsafe, this is an opportunity to get acquainted with its future clients before they even think of talking to a broker. On average, it takes about two years for students who obtain a loan on deineStudienfinanzierung to secure their first job — and Getsafe is here for it.\n\nIn a country where Contents or Renters insurance is not a compulsory product, entering the job market is a more common trigger for getting insurance than renting an apartment, Wiens said. “We realized that to become their insurer of choice, we must think one step ahead.”\n\nGetsafe CEO thinks that deineStudienfinanzierung’s users may be even more sensitive to financial risk than the average first-time employee. “When you take out a loan and start repaying it after you start your first job, you are more conscious of the fact that you rely on your income. So this becomes a natural trigger to consider, for example, income protection insurance.” (This is one of the policies that Getsafe offers, alongside contents and personal liability insurance.)\n\nWhen asked whether insurance was a better fit for deineStudienfinanzierung to leverage its user base than banking, its founder, Bastian Krautwald, replied affirmatively.\n\n“The issue with banking is that most customers already have a bank account from an early age. By the time customers apply for a student loan, the barriers to switch are quite high. However, with insurance, it is different. It is not uncommon for young people to deal with insurance for the first time in their mid-twenties,” Krautwald told TechCrunch.\n\nThis was a loaded question: Krautwald also co-founded Wajve, later known as OWWN, a banking product targeted at deineStudienfinanzierung’s customers and target audience. But the fintech offering never made it out of its testing phase, with OWWN instead partnering up with neobank N26 to secure a special discount for its beta users and those on its waiting list.\n\nWhat’s next\n\nOWWN, Wajve and deineStudienfinanzierung didn’t only share a CEO; they shared a parent company, FiRec GmbH, which raised €5 million in funding from investors including EQT Ventures, 468 Capital and finleap, as well as German business angels. Getsafe has now acquired FiRec in its entirety, while Krautwald will remain in his role as CEO of deineStudienfinanzierung.\n\n“We expect deineStudienfinanzierung to grow solidly and profitably as a standalone business this year,” Wiens said. “However, short-term revenue targets are not our primary goal, as this acquisition has mainly strategic value to us to better understand and access our target customers when they graduate.”\n\nWill there be more strategic acquisitions in Getsafe’s near future? “We are currently not actively looking for targets, but with two acquisitions under our belt, we are ready to explore and pursue opportunities quickly when they arise,” Wiens said.\n\nWe won’t hold our breath for it, but we’ll keep closer track of another hint that Getsafe gave in its press release: that it is looking to “expand further to serve even more European markets” than the four countries where it already operates."}