{"url": "https://techcrunch.com/2020/07/01/vcs-see-much-to-like-in-democrats-1-5-trillion-moving-forward-act/", "title": "VCs see much to like in Democrats’ $1.5 trillion Moving Forward Act", "authors": ["Jonathan Shieber", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block", "Margin-Top Flex Font-Size Var"], "publication_date": "2020-07-01T00:00:00", "text": "“The Moving Forward Act reads like a $1.5 trillion validation of our fund’s thesis — that upgrading cities and related infrastructure is key to fighting the existential threat of climate change and improving lives,” said Stonly Baptiste, co-founder and partner at venture capital fund Urban Us.\n\nDemocrats in Congress are wrestling with the twin problems of mass unemployment and a long-delayed need to rebuild America’s crumbling infrastructure. Now, with just 124 days until the election, the party is building a platform that supports national funding to boost employment and develop more sustainable infrastructure heavily focused on renewables.\n\nSome venture investors have long supported aspects of the bill, but persistent gridlock made any movement on new policy unlikely — at least in the near term. The proposed legislation contains provisions that would use $1.5 trillion to overhaul the nation’s transportation infrastructure, schools, affordable housing, renewable energy capacity and postal service.\n\n“[In] this time of strong political division in Washington, D.C., we’ll have to see what if anything can get done on this topic in the Senate. I do have some hope that as we get closer to the election, standing in the way of clean energy is going to be seen by many in the Senate as a vote-loser, and that could sway some votes to support something bipartisan,” said Rob Day, a longtime investor in sustainable technologies and a general partner at Spring Lane Capital. “But I’m not really expecting anything to come close to what’s in this House bill. So as an investor I support what they’re doing here, but I’m not yet changing any investment strategies around it.”\n\nBaptiste said investors already support many of the initiatives under the Moving America Forward Act, but the incentives proposed under the Democratic plan could redouble those efforts.\n\n“In general, it seems like it would incentivize private capital to further align and mobilize in the climate-change battle,” Baptiste said. “Over the last 10 years, VC capital has been increasingly invested in transit in general and there is a 20-year history in the clean energy sector.”\n\nBaptiste took some issue with the commitment to carve out $100 billion for zero-emission buses and said the spending package fails to address potential shifts in perspectives around public transit in a post-pandemic world.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Sharing confined spaces to get around presents a challenge for individuals concerned about their health risks and is already causing a shift back to car ownership,” Baptiste wrote. “Also the bill doesn’t explicitly speak to light EVs, such as e-scooters and e-bikes.”\n\nMeanwhile, Day said the bill does not do enough to strengthen other parts of America’s creaky infrastructure.\n\n“I’m glad to see this emphasis on clean infrastructure build-out not only in the GREEN Act but also in the Moving Forward Act,” wrote Day. “However, I think the latter could have been much more aggressive in supporting electricity transmission, wastewater systems and so forth. The dollar amounts for those sectors aren’t tiny but are still only a fraction of what is needed to catch up to crumbling infrastructure in those sectors.”\n\nBaptiste, whose firm invested in companies that are intended to monitor and manage the infrastructure upgrades that will be necessary in the coming years, sees the potential for spending to boost prospects of portfolio companies like One Concern, Roadbotics and Hades.ai.\n\n“Investing in resilience and carbon pollution reduction is an internal part of climate change mitigation, which is why we need investments in upgrading infrastructure such as bridges, highways, drinking and wastewater systems, the electric grid and affordable housing in cities,” he said.\n\n“$70 billion doesn’t seem like enough to transform our electric grid, expand renewable energy and help develop an electric vehicle charging network but is aligned with what we’ve seen over the last few years as a surge of VC funding of interesting new solutions around new grid infrastructure like our investment in Blueprint Power, and charging infrastructure and EV adoption such as our investments in ChargeLab and more recently Mobilyze.ai,” Baptiste concluded.\n\nAnother investor who would have liked to have seen a more aggressive commitment is Seth Bannon, co-founder of frontier tech investment firm Fifty Years. The firm has invested in the bio-based chemical manufacturer Lygos; cell-cultivated meat company, Memphis Meat; off-grid solar power project developer Oolu Solar; and specialty chemicals manufacturer Solugen, among others.\n\n“Aiming for carbon neutrality by 2050 would bring the U.S. in line with Canada, South Korea, Chile, the U.K., Denmark, France, Germany, Ireland and the EU broadly. This would be movement in the right direction,” wrote Bannon in an email. “That said, Austria’s conservative ruling party set a goal of carbon neutrality by 2040 and 100% clean electricity by 2030. Since when did America become less ambitious than Austria? Finland has a carbon neutrality target of 2035. Surely America can out innovate Finland.”\n\nThe potential initiative in the Democratic plan that would have the most near-term impact would be the final passage of a carbon tax that could address not only the direct effect of carbon emissions but would indirectly support climate-focused technology companies whose products and services address other aspects of sustainability.\n\n“Just in our portfolio we have climate tech companies decarbonizing food, fashion, construction, data storage, transportation, mining and chemicals production that would benefit from a carbon tax,” wrote Bannon. “The government should be getting behind companies like Solugen, which is decarbonizing the chemicals industry by taking a process that emits 2.5 tons of CO2 per ton of H2O2 made and turning it into a process that sequesters 6 tons of CO2 per ton of H2O2 made.”\n\nWhat else would be on Bannon’s wish list for a Democratic climate bill? A massive expansion of ARPA-E’s budget to bring it in line with DARPA’s budget.\n\nAmid the bill’s many proposals are ones that focus on job creation and safety in clean energy, and traditional logistics and transportation. Here too, the portfolios of investors like Baptiste and others can see some benefits.\n\n“Aligned workforce and industry goals are key to winning the climate-change battle and it’s great to see a bill that tries to tie those together,” wrote Baptiste.\n\nFinally, there are lessons that Congress can learn from its failures to address the COVID-19 pandemic on U.S. shores, according to Bannon.\n\n“Politicians need to learn the lessons of COVID-19. The human and economic tragedy of COVID-19 has shown very clearly the dangers posed by natural systemic disasters. It’s a pretty darn good trial run for what’s coming with the climate crisis,” he said. “COVID-19 has laid bare that we are not doing all we should be doing on climate. This pandemic has shown the folly of bypassing real preparedness in order to save billions of dollars, and thereby costing ourselves trillions of dollars and losing the lives of friends and family unnecessarily.”"}