{"url": "https://techcrunch.com/2022/07/11/paytalk-promises-to-handle-all-sorts-of-payments-with-voice-but-the-app-has-a-long-way-to-go/", "title": "PayTalk promises voice-powered transactions, but falls short", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-07-11T00:00:00", "text": "Neji Tawo, the founder of boutique software development company Wiscount Corporation, says he was inspired by his dad to become an engineer. When Tawo was a kid, his dad tasked him with coming up with a formula to calculate the gas in the fuel tanks at his family’s station. Tawo then created an app for gas stations to help prevent gas siphoning.\n\nThe seed of the idea for Tawo’s latest venture came from a different source: a TV ad for a charity. Frustrated by his experience filling out donation forms, Tawo sought an alternative, faster way to complete such transactions. He settled on voice.\n\nTawo’s PayTalk, which is one of the first products in Amazon’s Black Founders Build with Alexa Program, uses conversational AI to carry out transactions via smart devices. Using the PayTalk app, users can do things like find a ride, order a meal, pay bills, purchase tickets and even apply for a loan, Tawo says.\n\n“We see the opportunity in a generation that’s already using voice services for day-to-day tasks like checking the weather, playing music, calling friends and more,” Tawo said. “At PayTalk, we feel voice services should function like a person — being capable of doing several things from hailing you a ride to taking your delivery order to paying your phone bills.”\n\nPayTalk is powered by out-of-the-box voice recognition models on the frontend and various API connectors behind the scenes, Tawo explains. In addition to Alexa, the app integrates with Siri and Google Assistant, letting users add voice shortcuts like “Hey Siri, make a reservation on PayTalk.”\n\n“Myself and my team have bootstrapped this all along the way, as many VCs we approached early on were skeptical about voice being the device form factor of the future. The industry is in its nascent stages and many still view it with skepticism,” Tawo said. “With the COVID-19 pandemic and subsequent shift to doing more remotely across different types of transactions (i.e. ordering food from home, shopping online, etc.), we … saw that there was increased interest in the use of voice services. This in turn boosted demand for our product and we believe that we are positioned to continue to expand our offerings and make voice services more useful as a result.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nTawo’s pitch for PayTalk reminded me much of Viv, the startup launched by Siri co-creator Adam Cheyer (later acquired by Samsung) that proposed voice as the connective tissue between disparate apps and services. It’s a promising idea — tantalizing, even. But where PayTalk is concerned, the execution isn’t quite there yet.\n\nThe PayTalk app is only available for iOS and Android at the moment, and in my experience with it, it’s a little rough around the edges. A chatbot-like flow allows you to type commands — a nice fallback for situations where voice doesn’t make sense (or isn’t appropriate) — but doesn’t transition to activities particularly gracefully. When I used it to look for a cab by typing the suggested “book a ride” command, PayTalk asked for a pickup and dropoff location before throwing me into an Apple Maps screen without any of the information I’d just entered.\n\nThe reservation and booking functionality seems broken as well. PayTalk walked me through the steps of finding a restaurant, asking which time I’d like to reserve, the size of my party and so on. But the app let me “confirm” a table for 2 a.m. at SS106 Aperitivo Bar — an Italian restaurant in Alberta — on a day the restaurant closes at 10 p.m.\n\nOther “categories” of commands in PayTalk are very limited in what they can accomplish — or simply nonfunctional. I can only order groceries from two services in my area (Downtown Brooklyn) at present — MNO African Market and Simi African Foods Market. Requesting a loan prompts an email with a link to Glance Capital, a personal loan provider for gig workers, that throws a 404 error when clicked. A command to book “luxury services” like a yacht or “sea plane” (yes, really) fails to reach anything resembling a confirmation screen, while the “pay for parking” command confusingly asks for a zone number.\n\nTo fund purchases through PayTalk (e.g. parking), there’s an in-app wallet. I couldn’t figure out a way to transfer money to it, though. The app purports to accept payment cards, but tapping on the “Use Card” button triggers a loading animation that quickly times out.\n\nI could go on. But suffice it to say that PayTalk is in the very earliest stages of development. I began to think the app had been released prematurely, but PayTalk’s official Twitter account has been advertising it for at least the past few months.\n\nPerhaps PayTalk will eventually grow into the shoes of the pitch Tawo gave me, so to speak — Wiscount is kicking off a four-month tenure at the Black Founders Build with Alexa Program. In the meantime, it must be pointed out that Alexa, Google Assistant and Siri are already capable of handling much of what PayTalk promises to one day accomplish.\n\n“With the potential $100,000 investment [from the Black Founders Build with Alexa Program], we will seek to raise a seed round to expand our product offerings to include features that would allow customers to seamlessly carry out e-commerce and financial transactions on voice service-powered devices,” Tawo said. “PayTalk is mainly a business-to-consumer platform. However, as we continue to innovate and integrate voice-activated options … we see the potential to support enterprise use cases by replacing and automating the lengthy form filling processes that are common for many industries like healthcare.”\n\nHopefully, the app’s basic capabilities get attention before anything else."}