{"url": "https://techcrunch.com/2024/06/05/climate-insurance-understory-15m/", "title": "Insurance provider Understory gets into renewable energy following $15M Series A", "authors": ["Christine Hall", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-06-05T00:00:00", "text": "Back in 2014, Understory co-founder and CEO Alex Kubicek was on a mission to deploy a network of ground-level weather stations to track weather in real time and anticipate needs, for example, in terms of committing resources to an area after or during a storm.\n\nAt the time, Kubicek teamed up with Bryan Dow to create the weather stations with a goal of adding another 10 to 15 minutes to a thunderstorm or tornado warning. However, they found much of the data used to forecast weather was from the 1980s.\n\n“We needed a much better weather dataset, and that’s when I connected with Bryan Dow to build the weather station,” Kubicek told TechCrunch. “It is a solid-state measurement that measures wind, rain and hail at 125,000 times a second, as well as measuring temperature, pressure and humidity. That gives us a really deep, detailed understanding of what’s happening on the ground.”\n\nOver the next eight years, Madison, Wisconsin-based Understory would deploy the weather stations, dubbed Dot, across the globe, gathering more and more data. It also raised around $40 million in funding, including an initial $1.9 million round led by True Ventures in 2014.\n\nFlush with all of that data, the company was able to build global catastrophe models to help better understand risk to individual properties. Those models were validated by its reinsurance partners, which told Understory that it should sell this set of historical data as a software-as-a-service or data services product, Kubicek said.\n\nUnderstory Dot deployed on a dealership rooftop. Image Credits:Understory\n\nHowever, Kubicek and Dow had bigger plans. During that time, they had met Neil Irwin, who was a senior executive at one of the leading insurance brokers in the world, and decided to build their own insurance company.\n\nIrwin came on as co-founder and international president to help them learn about the insurance industry and “catapult Understory into this really exciting next phase,” Kubicek said.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nUnderstory began providing insurance offerings that adapt to meet the growing threat of severe weather risk, often called parametric insurance. For example, it launched a Dealers Open Lot insurance solution, which offers risk management for U.S. auto dealers. It has since provided protection for dealer inventories across the United States in nearly 1,000 locations.\n\nBy giving auto dealerships early notifications, Understory has been able to save customers hundreds of millions of dollars of damage. Irwin said one client in particular was able to reduce hail damage to cars from $110 million of damage to $50 million just by having that early notice.\n\n“In the audit world, we’re not just helping people with the climate-related risks, although that’s huge,” Irwin said. “We’ve been able to avoid 10 major incidents and about $3 million of actual losses that would have occurred.”\n\nUnderstory has seen 500% year-over-year growth over the past year. And now it is going in a new direction, launching a product focused on the renewable energy sector. It is doing this with a new $15 million round of Series A capital co-led by True Ventures and Prelude Ventures.\n\nKubicek said its proprietary risk mitigation technology helps solar farms, for example, save 50% on hail repair costs by leveraging buying power at scale. With some of its models being able to predict weather events with 45 minutes of notice, solar farm operators could have time to stow or move the panels, which deflects the hail by changing the angle of impact.\n\nThis can turn a $10 million loss into a $5 million loss, or even a $2.5 million loss into a $500,000 loss, with the right approach, he said.\n\n“The current solar industry is actually in a crisis right now,” Kubicek said. “A lot of these contracts are being canceled because the only place that you’re trying to build these large solar projects are in areas where the sky is literally trying to kill you. With our technology, we’re able to mitigate that risk.”"}