{"url": "https://techcrunch.com/2023/06/26/thoughtspot-acquires-mode-analytics-a-bi-platform-for-200m-in-cash-and-stock/", "title": "ThoughtSpot acquires Mode Analytics, a BI platform, for $200M in cash and stock", "authors": ["Kyle Wiggers", "Ai Editor", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-06-26T00:00:00", "text": "ThoughtSpot, an AI-powered analytics platform last valued at $4.5 billion, today announced that it’s entered into a definitive agreement to acquire Mode Analytics, a business intelligence startup, for $200 million in cash and stock.\n\nMode will become a wholly owned subsidiary of ThoughtSpot once the deal closes later this year, subject to customary closing conditions and the approval of Mode’s shareholders.\n\nIt’s ThoughtSpot’s fourth acquisition following (most recently) the company’s purchases of SQL-based analytics firm SeekWell in March 2021 and data integration company Diyotta in May of that same year. Enabling all the deals is ThoughtSpot’s massive war chest, which totaled over $663 million as of August 2019.\n\nAs for the Mode acquisition, ThoughtSpot CEO Sudheesh Nair says that it’ll bolster ThoughtSpot’s generative AI apps while doubling the company’s customer base and growing its annual recurring revenue to more than $150 million.\n\n“With this acquisition, we’re giving both data teams and business users the tools they need to efficiently and quickly turn data into insights and those insights into actions,” Nair said in a press release issued this morning.\n\nSan Francisco-based Mode, which TechCrunch last covered in August 2020, was co-founded by Derek Steer, Benn Stancil and Josh Ferguson in 2013. All three previously worked at Yammer (they were early employees and stayed on after the Microsoft acquisition), where they were a part of a larger team building custom data analytics tools for the Yammer platform.\n\nSteer told my colleague Ingrid Lunden that the impetus for Mode came out of gaps in the market that the three had found through years of experience at other companies. Specifically, they saw an opportunity to build a product that could provide business intelligence and big data analytics capabilities to help data scientists improve their employers’ decision making.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMode indeed managed to find a foothold in the vast and growing business intelligence market (worth an estimated $27.11 billion in 2022, according to Fortune), raising $81 million in venture capital prior to the ThoughtSpot acquisition from investors including H.I.G. Growth Partners, Valor Equity Partners and Rev.\n\nAt one point, Mode claimed that its customer base covered more than 50% of the Forbes 500, including brands such as Anheuser-Busch, Zillow, Lyft, Bloomberg, Capital One, VMware and Conde Nast.\n\n“At Mode, we’ve always focused on helping data analysts, and worked hard to remove the frustrations that interfered with their day-to-day workflows,” Stancil, who serves as Mode’s CTO, said in a statement via email. “By providing data teams with an integrated, code-first experience, we’ve enabled our customers to move far more quickly and find much more value in their data than they previously could.”\n\nFor Mountain View, California-based ThoughtSpot, which was founded in 2012 by a team of engineers who previously worked for Google, Oracle and other Silicon Valley companies, the deal makes perfect logistical sense.\n\nThoughtSpot’s platform is designed to allow “non-technical” users to conduct data analyses, leveraging tools that monitor information for changing patterns and trends from sources such as Snowflake and Databricks. Tapped by companies including Walmart and Apple, ThoughtSpot’s products focus on self-service analytics, primarily — with a dash of AI and machine learning thrown in for good measure.\n\nWhat Mode brings to the table is a complementary product set, then. Nair sees the acquisition creating “new ways” for ThoughtSpot customers to provide value to data teams, for example enabling them to create analytics applications and modeled or visualized data in Mode that can then be served up through ThoughtSpot’s dashboards.\n\n“For too long, data teams have been held back by the last generation of archaic data visualization tools like Tableau that forced them to endlessly tweak and update dashboards,” Nair said in a press release. “Whether you want to be code-free for your business users or code-first for your analytics engineers, now is the time to rethink business intelligence if you want to maximize value from your investments in the modern data stack.”\n\nThoughtSpot’s acquisition, along with other big exits in the big data analytics space, could be a sign of consolidation in the sector ahead of tough macroeconomic conditions to come. Also today, Databricks snatched up MosaicML, a startup developing open source AI tools, for $1.3 billion. And a month ago, Snowflake picked up Neeva, a firm that aimed to build out a new approach to search across consumer and enterprise using AI innovations. (The consumer part never took off, and Neeva sold up.)"}