{"url": "https://techcrunch.com/2024/03/20/pockethealth-transforms-medical-image-exchange-experience-with-33m-series-b-funding/", "title": "PocketHealth eases doctor-patient communications with easy image exchange", "authors": ["Kate Park", "Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-03-20T00:00:00", "text": "Have you ever needed a copy of your medical imaging to take to your doctor or another healthcare provider and been handed a CD? You’re not alone. Many radiologists still use CDs and similar antiquated tech to share patients’ imaging files.\n\nA startup called PocketHealth has taken issue with that. The company has built a medical image exchange platform to digitize the process for every patient and healthcare provider, no CDs involved. The company, headquartered in Toronto, said on Wednesday that it had secured $33 million ($45 million CAD) in a Series B funding round.\n\nPocketHealth’s journey began after one of its co-founders, Harsh Nayyar (CTO), suffered a tennis injury in 2016. He received the results of his CT scan on a CD, but he could not see them and needed to carry the CD along to whatever practitioner he needed to see next. That experience inspired him and his brother, Rishi Nayyar (CEO), to streamline the way hospitals share patients’ medical imaging.\n\n“When we learned that this was still commonplace across healthcare sites all over North America [in 2014], we knew we could change that,” Rishi told TechCrunch. “Despite technological advancements, access to healthcare data remains hindered by legacy image exchanges, creating delays, unnecessary costs and negative patient experiences.”\n\nFor 20 years, legacy image-sharing systems used by healthcare providers have “de-emphasized patient access to their own healthcare data, moving files across a closed network from point A to point B,” Rishi said. PocketHealth wants to change that by giving patients more access to, control over and a deeper understanding of their health records.\n\nThe eight-year-old company says more than 1.5 million patients at 775 healthcare sites use its platform in North America. PocketHealth plans to use the new money to improve its AI technology, double its current headcount of 110 over the next two years and expand its operations across North America.\n\nPocketHealth started by digitizing patients’ imaging reports and giving them access to it, and has now evolved its product by adding a layer of understanding that helps solve data portability problems.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nRishi said the service helps patients understand “what’s happening, showing them what they may have missed, what they can do next, or enabling them to easily return to their provider for follow-up care.”\n\nIt also can benefit service providers. The outfit says Valley View Hospital in Colorado, one of its customers, reduced non-labor costs by 95% by moving on from CDs. Another user, Unity Health in Toronto, was able to close its imaging library and save more than $120,000.\n\nPocketHealth isn’t the only company digitizing and enabling the sharing of medical imaging. Ambra Health, based in New York, runs a similar business, and EnvoyAI, based in Massachusetts, is building a medical imaging AI marketplace. Legacy image exchange providers like Nuance PowerShare and Change Healthcare are also among PocketHealth’s peers.\n\nOne thing that sets PocketHealth apart from incumbents in this space is that it provides patients access to their medical data, while legacy providers enable healthcare providers to share images with each other and have limited patient access capabilities.\n\nWhen asked about its user data privacy policy, Rishi told TechCrunch: “Patients are the owners of their own personal health information (PHI). We store PHI permanently for patients, as they need and want ongoing access [to their imaging], but any patient can permanently delete their data from PocketHealth at any point in time. We do not sell or lease PHI to any third party.”\n\nRishi also said the company encrypts its data to stay compliant with SOC2 Type II, HIPAA and PHIPA standards. “Security is a priority for us. It’s never just a static investment — it’s an ongoing area of focus. Data is stored locally and safeguarded from data breaches. We use Microsoft Azure to host in both Canada and the U.S., with constant security audits and reassessments. Patients have access to their data and can securely share and revoke access to their imaging using an access code, so they’re in control over who sees what and when,” he explained.\n\nRound13 Capital led the Series B round, which brings PocketHealth’s total capital raised to more than $55.5 million in equity. The round also saw participation from Deloitte Ventures and Samsung Next, and existing backers Questa Capital and Radical Ventures."}