{"url": "https://techcrunch.com/2021/10/06/tazah-gets-pre-seed-funding-to-make-pakistans-agriculture-sector-more-bountiful/", "title": "Tazah gets pre-seed funding to make Pakistan’s agriculture sector more bountiful", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-10-06T00:00:00", "text": "The founders of Tazah Technologies, a B2B agriculture marketplace in Pakistan, met while serving leadership roles at Uber subsidiary Careem. Abrar Bajwa and Mohsin Zaka bonded during long working hours as the platform dealt with COVID-19’s impact. Eventually, the two started talking about creating their own startup. When asked how they got from ride-hailing to agritech, Bajwa told TechCrunch that the two grew up in farming communities. “We are from central Punjab and every family there has something to do with agriculture,” he said. “We had seen firsthand how farmers, or people who are involved in small holder farming, do not encounter social mobility based on how the deck is stacked against them.”\n\nAgriculture is Pakistan’s biggest sector, contributing about 24% of its gross domestic product and employing half of its labor force, according to government statistics. But fragmented and complicated supply chains lead to inflated prices, food waste and low profits for farmers, all problems that Tazah wants to solve. The startup, which launched two months ago in Lahore, announced today it has raised a $2 million pre-seed round led by Global Founders Capital and Zayn Capital. Other participants included Ratio Ventures, Walled City Co, i2i Ventures, Suya Ventures, Globivest, Afropreneur Syndicate, +92 Ventures, Sunu Capital, Musha Investments and angel investors like senior executives from ride-hailing platforms Careem and Swvl.\n\nThere are currently about 300 small- to medium-sized sellers buying inventory through the platform and it moves multiple truckloads of produce per day. Right now it offers five main kinds of products: ginger, garlic, tomatoes, potatoes and onions. Tazah plans to expand into other vegetables and fruits, but wants to ensure that it can guarantee consistent supply and quality. For example, instead of just serving as a marketplace to connect farmer and buyers, Tazah also screens produce for quality, removing rotten produce. Then it sorts them into categories for specific types of buyers.\n\nFor example, potatoes are separated into ones for households, restaurants, small retailers or to be made into French fries, based on what Bajwa and Zaka learned during market research. “We have spent months in wholesale markets, we’ve interviewed hundreds of retailers and we got to know that standardization of product is needed in Pakistan,” said Bajwa. “We get into the bottom of operations, because retailers will know what exactly is in the sack.” This has resulted in a monthly retention rate of more than 80%, and most customers buy from the platform about four times a week.\n\n“We’re not just a box-moving operation because in one sack of potatoes, there can be multiple rotten potatoes, so you don’t want to just buy from farmers and then give to retailers. That doesn’t add a lot of value,” said Zaka. Tazah is currently focused on small to medium-sized sellers who are overlooked by fast-moving consumer goods and grocery product inventory providers because they aren’t able to buy at sufficient bulk. It’s also started talking to other customer segments, including B2C marketplaces, grocery apps and stores.\n\nIncreasing farmers’ profits and reducing food waste\n\nTazah’s founders say fragmented supply chains mean that about 30% to 40% of produce is wasted because they perish or are damaged each time they are unloaded, warehoused and reloaded onto a truck. The company wants to fix that by creating a shorter, more streamlined logistics infrastructure. It plans to keep costs down by working with third-party warehouse and trucking providers instead of owning its own facilities.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“There is the traditional supply chain and we’re building a parallel customized supply chain that is a more efficient supply chain,” said Bajwa. “It’s almost like reinventing the wheel to build a supply chain that ensures products move as fast as possible from point of harvest to point of retail.” This means Tazah will make early investments as it works with its warehousing and trucking marketplaces for middle- and last-mile deliveries, establishing best practices for how to handle produce.\n\nSince Tazah needs to make deliveries early in the morning, it operates small fulfillment centers in addition to warehouses to stay close to customers. Part of its new funding will be used to expand its fulfillment center network in Lahore, with the goal of being operational in the entire city by the middle of October, before expanding into new regions.\n\nOver-harvesting also contributes to food waste, and one of Tazah’s goals is to build a data and analytics platform that will help farmers plan crops to make sure there is no oversupply in the markets they serve. Farmers typically sell their produce at markets, occasionally forming groups with other farmers. But they don’t have a lot of information about market places and supply/demand beyond their communities. They also often end up in debt to middlemen because they lack access to working capital.\n\nWhile Tazah is currently focused on its supply chain work, it plans to eventually add financing options for farmers after doing research, like going through several more procurement cycles to understand how much capital farmers need and how they are able to repay it. Some of the barriers they face include lack of formal credit histories or access to financial institutions that usually don’t open branches in rural areas. Sometimes they borrow working capital from intermediaries in the supply chain, or loan sharks who charge interest rates of more than 60%, creating cycles of indebtedness.\n\n“Financing is something we are aggressively looking after because it’s a future play for us and we are working with farmers to know what they are doing, and how they are actually getting financing,” said Zaka.\n\nTazah’s founders hope to see more startups emerge to solve problems for Pakistan’s farmers. “Agriculture has been a mostly ignored sector in Pakistan from a technology perspective, and I think that as more people come into this, they’re going to help each other, as opposed to competing with each other,” said Bajwa. “We feel that as more people come in, it will be better because it will accelerate the problem solving in this very difficult space.\n\nHe added, “this is such a large space in Pakistan and it’s so inefficient that if we are even able to make a small dent, it’s going to lead to social uplift for hundreds or possibly thousands of farmers, improve the availability of fresh produce, result in less food tasted and reduce food price inflation.”"}