{"url": "https://techcrunch.com/2025/05/13/insurtech-bestow-lands-120m-series-d-from-goldman-sachs-smith-point-capital/", "title": "Insurtech Bestow lands $120M Series D from Goldman Sachs, Smith Point Capital", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Lorenzo Franceschi-Bicchierai", "Kyle Wiggers", "Sean O'Kane", "Kirsten Korosec", "Tim De Chant", "Cindy Zackney", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-05-13T00:00:00", "text": "Melbourne O’Banion co-founded insurtech Bestow with Jonathan Abelmann in 2017 after struggling to secure his own life insurance policy.\n\nHis goal was to make it easier for people to obtain life insurance and make the process more tech-enabled.\n\nInitially, Bestow operated as a direct-to-consumer insurance provider — selling, underwriting, and servicing life insurance policies. In those first few years, the startup processed over a million applications. Its no-exam underwriting platform gained traction during the COVID pandemic as traditional medical exams were paused. As it grew its D2C business, Bestow in parallel developed software to help modernize the whole process.\n\nRecognizing the value in that software, Bestow in 2024 sold its insurance carrier and consumer business to Sammons Financial Group for an undisclosed amount. It switched its focus to providing its software and services to other life insurance companies so those companies could “become more digital” and thus, more efficiently serve their customers.\n\nAnd on Tuesday, the Dallas-based company is announcing that it has raised $120 million in Series D funding to launch new products and underwriting capabilities, it has told TechCrunch exclusively. The fundraise, which O’Banion described as “oversubscribed,” was a mix of $75 million in primary and $45 million in secondary investments.\n\nGoldman Sachs Alternatives’ Growth Equity and ex-Salesforce co-CEO Keith Block’s Smith Point Capital co-led the investment. In addition to the equity financing, Bestow also secured a $50 million credit facility from TriplePoint Capital. O’Banion declined to reveal Bestow’s valuation, noting only that it had “approximately doubled” since the company raised $70 million in a Series C round in December 2020. With this latest financing, Bestow has raised more than $300 million in equity funding to date.\n\nO’Banion also declined to reveal hard revenue figures, saying that Bestow’s annual recurring revenue grew 3x in 2024, and “10x” over the last two years. Its revenue model is enterprise SaaS (software-as-a-service) and performance-based. The bulk of its revenue comes from usage fees.\n\n\n\nAshwin Gupta, a Goldman Sachs Alternatives’ Growth Equity team partner, told TechCrunch that he was attracted to backing Bestow for several reasons. For one, its founders were repeat founders who had “successfully pivoted the business.” (Melbourne also co-founded BeautyBio and is a founding member of Presidio Title. Abelmann co-founded publicly traded Invitation Homes.)\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nGupta also thinks its SaaS model gives it an edge over more legacy competitors.\n\n“Bestow has an attractive end market that is large, resilient and relatively underserved by modern technology…,” he said. Gupta, who is joining Bestow’s board as part of the financing, also noted that he was impressed by Bestow’s ability to have won several large customers who were expanding their use of its platform.\n\nIts customers include Nationwide, Transamerica, USAA, Sammons Financial Group, and Equitable, among others.\n\nOther backers include Breyer Capital, Valar Ventures, New Enterprise Associates, Core Innovation Ventures, Morpheus Ventures, and Sammons Financial.\n\nBestow, which has 167 employees, currently operates in the U.S. and is considering an international expansion."}