{"url": "https://techcrunch.com/2021/10/27/pikmin-bloom-an-ar-mobile-game-is-niantics-next-collaboration-with-nintendo/", "title": "Pikmin Bloom, an AR mobile game, is Niantic’s next collaboration with Nintendo", "authors": ["Amanda Silberling", "Senior Writer", "Zack Whittaker", "Rebecca Bellan", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-10-27T00:00:00", "text": "Niantic announced yesterday that its next augmented reality mobile game will be Pikmin Bloom, a collaboration with Nintendo. The free game was first released for iOS and Android in Singapore and Australia, but rolled out in the United States on Thursday morning. Pikmin Bloom is expected to release globally in the coming days.\n\nLike Pokémon Go, Pikmin Bloom will encourage players to get outside and explore their neighborhoods. Only now, instead of catching Pidgey and Rattata, you’ll collect seedlings and create a squad of Pikmin. The more you walk, the more Pikmin you’ll collect. These plant-animal hybrid creatures come from Nintendo’s strategy and puzzle game franchise of the same name.\n\nPikmin Bloom marks the sixth installment in the Pikmin video game series. There are many different types of Pikmin to interact with, and as you walk alongside them, you’ll leave augmented reality trails of flowers behind you. According to in-game footage in the announcement video (seen above), it looks like you can customize your avatar as a Mii.\n\nAnother feature that borrows from Pokémon Go is Pikmin Bloom’s monthly Community Day events. In the former, players are lured outdoors with special bonuses and rare featured Pokémon once per month, encouraging people to get outside and befriend fellow players. Niantic hasn’t released details, but the company said that it will host monthly Community Day events for Pikmin as well to plant and play together.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nPokémon Go has a weekly pop-up on Monday mornings that shows you how far you’ve walked that week. But Pikmin seems more specifically geared toward encouraging movement, showing the routes you walked and the steps you took at the end of every day.\n\nThe last time the two companies released a game together, it shattered expectations — so, no pressure to our floral friends. Even if Pokémon Go doesn’t feel as ubiquitous as it did in summer 2016, it’s making Niantic more money than ever, netting over $1 billion in 2020. But it doesn’t quite seem like there’s as much to do yet in Pikmin Bloom as there is in Pokémon Go or Harry Potter: Wizards Unite. So, this game might be geared toward a more casual crowd who just want to see some pretty pixels while they walk — no shiny-hunting and raid battle coordination here … at least not yet.\n\nUpdate 10/28/21, 10:20 AM EST: The game is now available in the United States."}