{"url": "https://techcrunch.com/2023/05/17/traefik-labs-launches-traefik-hub-a-kubernetes-native-api-management-service/", "title": "Traefik Labs launches Traefik Hub, a Kubernetes-native API management service", "authors": ["Frederic Lardinois", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-05-17T00:00:00", "text": "Traefik today announced the general availability of Traefik Hub, its cloud-native API management solution for publishing, securing and managing APIs. Founded in 2016 by Emile Vauge, Traefik Labs had an early focus on its open source projects: Traefik Proxy and Mesh — a cloud-native reverse-proxy solution and service mesh.\n\nBack in 2015, Vauge was a developer and DevOps consultant after stints at Lyra Network, Airbus, Thales Communications and Nortel. At the time, he was trying to make thousands of microservices accessible over the internet and the existing solutions did not satisfy his needs.\n\n“Basically, I started to work on my own stuff and I ended up by open sourcing Traefik — a reverse proxy built from scratch for microservices and containers. Front page of Hacker News. It was an unexpected great success, which led me to found Traefik Labs the company a few months later,” Vauge told me at KubeCon Amsterdam last month.\n\nBy now, Traefik has been downloaded over 3 billion times, the company has 40 employees and the Traefik project’s community consists of over 700 contributors. The company has also raised just over $11 million in funding from the likes of Balderton Capital, Kima Ventures, 360 Capital and Elaia.\n\nVauge noted that the company’s focus has always been on simplicity. Indeed, one of Traefik’s early slogans was “Making networking boring.” That’s also very much the focus of Traefik Hub. As the company notes, its base of Traefik Proxy users already used the platform as their unified ingress and API gateway. But Traefik Proxy wasn’t necessarily built with API management in mind. Meanwhile, many users were trying to get away from their large monolithic API management solutions, which don’t always align with the DevOps philosophy and cloud-native platforms that many enterprises are now moving toward.\n\nTraefik Hub, then, is a Kubernetes-native API management solution with support for Traefik, as well as other proxies like NGINX, HAProxy, Ambassador and others. Since it gives users this choice, the promise here is that they can standardize on Traefik Hub for their API management without having to swap out all of their existing investments. With this, publishing an API from any existing Kubernetes microservice should become a matter of a few clicks.\n\nThe company also notes that it built the service with security in mind, meaning it supports role-based access controls and authentication and authorization through OAuth 2.0 and JSON Web Tokens, for example.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“In 2015 I saw an opportunity to build a new modern reverse proxy model — that’s because there was a need. I was missing that. And that’s exactly the same [in today’s API space]. There is a huge market and there is a big need. We think that there is a huge opportunity because existing API management solutions are not well-suited to the cloud-native world,” Vauge said. “They are too heavy, too expensive and most importantly, they were built before the cloud-native revolution.”"}