{"url": "https://techcrunch.com/2025/04/09/a-waymo-robotaxi-got-trapped-in-chick-fil-a-drive-through/", "title": "A Waymo robotaxi got trapped in Chick-fil-A drive-through", "authors": ["Kirsten Korosec", "Sean O'Kane", ".Post-Authors-List__Authors --Font-Size Var", "Align-Items Center Display Flex Gap Var", ".Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Display Flex Flex-Shrink Margin Padding .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li List-Style None Margin-Left Margin-Top Important .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs Li First-Child Margin-Left .Post-Authors-List__Authors .Post-Authors-List__Author-Thumbs .Post-Authors-List__Author-Thumb Background-Color Var", "Border Solid Var --Wp--Custom--Color--White", "Border-Radius", "Height -O-Object-Fit Cover Object-Fit Cover Width .Post-Authors-List__Authors .Post-Authors-List__Author-List Display Flex Flex-Wrap Wrap Gap Var", "List-Style-Type None Margin-Bottom Margin-Top Padding .Post-Authors-List__Authors .Post-Authors-List__Author-List Li List-Style None Margin-Top .Post-Authors-List__Authors .Post-Authors-List__Author-List Li Not", "Last-Child"], "publication_date": "2025-04-09T00:00:00", "text": "In Brief\n\nA Waymo robotaxi caused a traffic jam at a Chick-fil-A in Santa Monica, California, this week after getting stuck in the fast food restaurant’s drive-through lane. Waymo confirmed the incident, which was first reported by local broadcast station KTLA 5, to TechCrunch via email.\n\nWaymo told TechCrunch that there weren’t any passengers in the robotaxi. The Waymo robotaxi had dropped off a passenger in the parking lot of the Chick-fil-A. However, the robotaxi was unable to complete a multi-point turn due to the proximity of the drive-through lane and multiple other cars in the tight space, according to the company.\n\nThere were no injuries in this case — just inconveniences for those waiting to order food.\n\nThere have been periodic problems — often highlighted by videos shared on social media — with Waymo robotaxis impeding traffic or otherwise causing disturbances. In the past year, a Waymo has gotten stuck in a roundabout loop, while another stalled in front of former Vice President Kamala Harris’ motorcade in San Francisco. And a parking lot full of Waymos honked for up to an hour during the early morning hours.\n\nWaymo operates a commercial robotaxi service in San Francisco, Phoenix, and Los Angeles. The company also has a robotaxi service in Austin through a partnership with Uber."}