{"url": "https://techcrunch.com/2024/03/22/atomos-spaces-first-mission-on-orbit-is-a-trial-by-fire/", "title": "Atomos Space’s first mission on orbit is a trial by fire", "authors": ["Aria Alamalhodaei", "Reporter", "Space", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var"], "publication_date": "2024-03-22T00:00:00", "text": "Few missions more acutely embody the maxim “space is hard” than Atomos Space’s first demonstration mission, which the company has managed to pull back from the brink of disaster — more than once.\n\nThat demonstration mission, dubbed Mission-1, launched to orbit on a SpaceX Falcon 9 rocket on March 4. The objectives of the mission are ambitious to the extreme: The two spacecraft — an orbital transfer vehicle called Quark-LITE and a target vehicle called Gluon — will eventually demonstrate extremely complex maneuvers, including rendezvous, docking, orbital transfer and on-orbit refueling.\n\nThe company has faced two main issues related to communications and the spacecraft rotation rate — and it’s (largely) solved both problems, despite enormous constraints, infrequent data packets and extremely limited bandwidth. (So limited, in fact, that the team has had to cap its flight software updates to a string of text that is just 145 characters long.)\n\n“It’s been relentless,” Atomos CEO and co-founder Vanessa Clark told TechCrunch.\n\nThe company’s COO and co-founder, William Kowalski, agreed. “What makes it so hard, even in our situation, we’re trying to extrapolate the status of a very complicated system from maybe 100 bytes of data,” he said. “It’s a lot of … making guesses as to what is driving this, knowing that some of those guesses could take you down a path where you never recover.”\n\nThe issues started just hours after the two spacecraft, which are mated together, deployed from the Falcon 9 upper stage. Deployment was nominal, and Atomos received its first ping from the spacecraft seven minutes after deployment. The mood was celebratory.\n\nBut then 40 minutes went by until the company got its next ping. Then eight hours.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAtomos was expecting data packets every couple of minutes.\n\n“The worst [day] was the Monday when we launched, that evening,” Kowalski said. “It was 11 o’clock at night, it was me and the chief engineer … and we haven’t heard anything, and we’re just thinking, did we fail? Did they die? We gave it a shot, and it just didn’t work. That was really a gut punch.”\n\nMission controllers only identified the root cause 24 to 48 hours after deployment, and they did so with the help of another company with assets on orbit. After pulling some strings, they were able to get on the phone with the chief systems engineer of satellite communications company Iridium. The spacecraft were using third-party modems that leveraged Iridium’s inter-satellite link network, in addition to using Iridium’s constellation as their relay satellites. Atomos’ spacecraft were moving too fast, and in direct opposition, such that they couldn’t perform the data “handshake” with those Iridium satellites to actually transmit information back down to Earth.\n\nAtomos engineers ended up pushing a series of software updates that reduced the duty cycling and ensured the radios would always be on, even if the spacecraft was in a low-power state.\n\nAs engineers were trying to fix the communications problem, however, they faced a different issue: The spacecraft were tumbling at an extremely rapid rate of 55 degrees per second (they were designed to deal with a roll rate up to 5 degrees per second). In addition, the spacecraft were slowly rotating so that the solar arrays were no longer facing the sun. That meant it was a race against time — and against the spacecraft batteries dying completely.\n\n“We had two graphs,” Kowalski said. “We graphed out our power trend on when we think we’d be pointed away from sun and be [at] zero power, and our detumble rate. It was get the detumble rate to zero before the power goes to zero.”\n\nThe issue was exacerbated by the limited comms; the teams weren’t able to definitively confirm something was wrong until the fourth day after deployment, and the spacecraft could only digest new commands in-between long periods of what were essentially communications blackouts.\n\nSlowly, over a period of days, they were able to slow the spacecraft. The team got another major win when it managed to establish high-bandwidth comms, a space-to-space link on the Quark-LITE that talks over the Inmarsat network. The company made the first attempt to get on the high-bandwidth comms Thursday, and they successfully maintained comms with the spacecraft for six minutes.\n\nDuring that period, mission controllers received 17 times more data than they had since launch. This has provided mission controllers with immense amounts of data on the spacecraft health. Not all the news was positive — one of the battery packs on the OTV was hit hard by the aggressive cycling, and it seems like the GPS needs to be reset onboard one of the spacecraft — but these are easy fixes, Clark said.\n\nBy Tuesday or Wednesday, the company is aiming to start commissioning the propulsion system. If all goes to plan, and engineers can establish that the prop system is providing pointing accuracy and control, they will test operations with torque rods and reaction wheels off. The company aims to separate the spacecraft in around a month’s time, with the aim of completing all the mission objectives by the end of June.\n\nKowalski and Clark credit some of the startup’s success to the fact that it’s highly vertically integrated. The team — which pulled a 100-hour week in that first week after deployment — was able to bring its intimate knowledge of the spacecraft design to problem-solve the issues that came up.\n\n“It’s obviously been very painful, but it’s like the CEO of Nvidia says: ‘I wish upon you great suffering.’ We have gone through that and it wasn’t great in the moment, but now that we’re through the thick of it, we’re definitely more accomplished,” Clark said."}