{"url": "https://techcrunch.com/2016/05/18/moving-from-population-based-health-to-precision-medicine-with-orion-health/", "title": "Moving from population-based health to precision medicine with Orion Health", "authors": ["Ben Kepes", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2016-05-18T00:00:00", "text": "Orion Health is a New Zealand-founded (now global) provider of technology products developed for the health sector. Orion’s founder and CEO, Ian McCrae, is a passionate advocate for a new way of doing business. He argues that current approaches to patient information are akin to the Victorian era, when a surgeon’s blood-stained uniform was a source of great pride because it showed medical expertise. In McCrae’s view, today’s approach to prescribing drugs, the so-called population-based approach, is harmful.\n\nAs McCrae sees it, clinicians don’t have access to the totality of information available about a patient and, hence, have to use very course treatment protocols. He quotes research published in Nature Journal that found that of the 10 most popular drugs prescribed in the U.S., only a limited number actually help patients — as low as one in 25 patients in some cases.\n\nMcCrae believes that a unique set of circumstances is creating an opportunity to move to precision medicine. Firstly, medical and testing technology is moving in leaps and bounds — the availability of not only traditional testing, such as blood and imaging, but also newer approaches such as genetic sequencing. The development of even deeper testing and information gathering will, in his view, create the lion’s share of total information that is held about an individual health consumer in the future.\n\nCloud computing, and the ability it gives to process and store bulk information quickly, easily and cheaply, is another factor. An aging population, and the need to provide better outcomes for an increasingly at-risk population, is another. And, finally, policy changes will have an impact, such as President Obama’s push toward more results-based health funding.\n\nWith all of these trends occurring around the same time, there is perhaps a unique opportunity to create a new way of providing health that is as transformation as the post-Victorian discovery of sepsis and the need for a clean environment to avoid cross infection and contamination. This is the opportunity that Orion Health was set up to leverage. The company, which is publicly listed on the New Zealand Stock Exchange, employs more than 1,250 people globally and has, to date, ingested close to 120 million medical records of individual patients. Commercial partnerships see it poised to ingest close to another 200 million records.\n\nThat is a staggering amount of data, even based on the more traditional, and hence incomplete, approaches to health data. Four-hundred million individuals’ prescription and assessment records, medical imaging and blood records makes up for a vast and useful aggregation of data. And the vastness of this data will only grow. McCrae believes the “digital body” — that is, the totality of data around an individual when genetic and exogenous (environmental, nutritional, social) factors relating to health data become available — will be in excess of 1 TB per person.\n\nAnd this is where the cloud comes in — 1 TB is simply too much data to be stored by an individual clinician, regardless of the other pitfalls of doing so (like being unable to collaborate with other health professionals). Rather, this data will be set on massive health IT platforms like that which Orion has built. And by sitting on these platforms, a treasure trove of insight is able to be generated from aggregated (and, yes, anonymized and suitably secured in terms of privacy) data. As President Obama stated a few months ago during a White House forum on precision medicine:\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“…the key to all of this is for us to be able to build up databases. And because all of us potentially could have electronic medical records that voluntarily — with strong privacy protections — we pool together so that researchers, practitioners, scientists can share, we may be able to accelerate the process of discovering cures in ways that we’ve never seen before.”\n\nMcCrae is bullish that his company will be a leader in this new field of precision medicine. Around 30 percent of the $100 million-plus revenue that Orion generates per annum is poured back into research and development, and the company is expanding its international footprint, and partnerships with other vendors, rapidly. It has large health-provider customers in the U.K., the U.S. and its home market of Australasia, and it is actively working on solutions that can move beyond the digitization of medical records, to the pooling of those records for deeper analysis and insight.\n\nOne thing is sure: Health IT in the future will be very different from what it is today, and unimaginably so from those Victorian times that seem so archaic now. Orion Health has an interesting part to play in that journey."}