{"url": "https://techcrunch.com/2024/12/10/aqemia-raises-38m-to-find-new-drugs-by-meshing-theoretical-physics-with-genai/", "title": "Aqemia raises $38M to find new drugs by meshing theoretical physics with GenAI", "authors": ["Paul Sawers", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-12-10T00:00:00", "text": "Aqemia, a French startup that’s meshing “quantum-inspired physics” with machine learning to find new drugs, has raised $38 million in a fresh round of funding led by San Francisco-based VC firm Cathay Innovation.\n\nThis is Aqemia’s second fundraise of the year — it announced a €30 million ($31.5 million) raise back in January — and it takes the company’s total funding raised past the $100 million mark.\n\nFounded in Paris by Maximilien Levesque and Emmanuelle Rolland-Martiano (pictured above) in 2019, Aqemia is one of countless startups applying AI to drug discovery. In 2024 alone, we’ve seen the likes of Healx raise $47 million to tackle rare diseases; Sam Altman-backed Formation Bio raise $372 million; and Xaira emerge from stealth with a whopping $1 billion in funding.\n\nGoogle DeepMind CEO Demis Hassabis and Director John Jumper, meanwhile, shared one-half of the Nobel Prize in chemistry for their work on Alphafold, an AI system that accurately predicts protein structures — vital for drug discovery.\n\nAqemia, for its part, says it’s using physics and statistical mechanics algorithms to train a generative AI system, which then helps design potential drug candidates for “critical diseases.” The initial focus is on oncology (cancer) and immuno-oncology (using the body’s immune system to fight cancer).\n\nThe company says this approach to training AI negates the need for experimental data, which is costly and time-consuming, and instead uses algorithms to essentially generate synthetic data to predict the properties of potential drug molecules and how they might interact with the target.\n\nLondon’s calling\n\nIt’s clear that AI-enabled drug discovery is a hot space right now, and Aqemia itself has already been making headway in industry. Last December, the startup signed a multi-year agreement with French pharmaceutical giant Sanofi, a deal that could be worth up to $140 million depending on the outcome of certain R&D milestones.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWith a fresh $38 million in the bank, the company is now gearing up to bolster its recruitment efforts. That includes a new office in London that’s set to open in early 2025 — a move designed to give Aqemia “access to the UK’s rich talent pool,” according to a press release. Having a global VC firm like Cathay Innovation on board could also open the door to new markets.\n\n“Less than a year after our last round, this successful fundraising and the opening of our new London office mark significant strides toward our ambition to accelerate the discovery of new medicines on a global scale,” Levesque said in a statement. “Partnering with Cathay Innovation brings international expertise, particularly in the U.S. and Asia, reinforcing our vision and mission.”\n\nAside from lead backer Cathay Innovation, Aqemia’s latest round saw participation from existing investors Wendel, Bpifrance Large Venture, Eurazeo, and Elaia."}