{"url": "https://techcrunch.com/2024/02/29/vibe-helps-small-companies-buy-video-ads-on-streaming-services/", "title": "Vibe helps small companies buy video ads on streaming services", "authors": ["Romain Dillet", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-02-29T00:00:00", "text": "As streaming apps and services are gradually showing more ads to viewers, adtech startup Vibe plans to help small businesses take advantage of that trend by letting them access that ad inventory with a self-serve ad platform like the ones small businesses use to run ads on Google’s or Meta’s services.\n\nThe startup recently raised a $22.5 million funding round led by Paris-based VC firm Singular. Other investors include Elaia, Motier Ventures and several business angels.\n\nWhile Meta and Google are clearly dominating when it comes to online ad revenue, connected TVs and streaming services represent a growing segment with some untapped potential for adtech companies. But it’s a fragmented market with different streaming apps, channels and live sports leagues.\n\nVibe has signed deals with some of these companies (or some of their partners) so that they would open up some of their ad inventory to Vibe’s customers. “Overall, we can access all the streaming apps and channels that are currently available except for Hulu, Netflix and YouTube TV,” Vibe co-founder and CEO Arthur Querou told me.\n\nBut even if you remove the big names, there are quite a few different ad-supported streaming services, such as FAST (free advertising-supported streaming television) services like Pluto, big OTT platforms like Fubo and of course broadcasters themselves, like Paramount, Warner Bros., CNN, etc.\n\n“We were quite close to Comcast, which owns FreeWheel, a big platform that set up a kind of marketplace for all these inventories. We have Benjamin Antier on the board — he’s the founder of Publica, the biggest ad server for streaming apps. We also have Ari Paparo on the board, the founder of Beeswax, which was acquired by Comcast. Let’s be honest, it’s very political and very much about your personal network,” Querou said.\n\nThe reason Vibe’s team managed to convince a wide range of partners that they should work with Vibe is that Querou is an adtech veteran. After creating MotionLead and selling it to Adikteev, he teamed up with Franck Tetzlaff, one of Doctolib’s co-founders and the former CTO of Frichti, to create an adtech company called KMTX.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThis semantic targeting company was acquired by Seedtag in 2022. After that exit, the duo teamed up once again to create Vibe. They decided to focus on adtech again because they know and like the industry. “It’s a bit like the perfect sandbox. You’ve got a lot of data, it’s a real marketplace, you’ve got decision making… You can do anything you want,” Querou said.\n\nAddressing the long tail with 2,000 clients already\n\nPart of Vibe’s sales pitch is that the platform unlocks some untapped potential with small and medium businesses. While streaming apps and services already talk with Coca-Cola or Ford to secure a small chunk of their annual ad budgets, it’s a bit harder to reach SMBs.\n\nWith Vibe, car dealerships, plumbers and restaurants create their ad campaign directly. Using Vibe’s ad platform is pretty straightforward. After picking the streaming apps and channels where you want to show your ads, you can select a geographical area and an audience based on various interests.\n\nYou then have to upload your video asset, get it approved and you’re ready to go. Vibe also provides a performance dashboard that lets you track how much you spent, the cost per view and other standard ad metrics.\n\nMore than 2,000 U.S. companies have used Vibe already. While the startup didn’t want to share exact revenue numbers, Vibe generated an eight-figure revenue in 2023. There are 40 employees working for the company and it plans to grow to 110 people by the end of the year.\n\nThe team will spend some time working on behind-the-scene optimizations, including better targeting capabilities based on first-party data and automated campaign optimization.\n\nAs for competition from Google and Meta? Querou thinks it’s not going to be an issue. Meta is mostly focused on the ad space on its own social platforms. And Google, “on the one hand, publishers have learned their lesson and don’t necessarily want to go down the same road as they did with Google on the web. And on the other hand, streaming is also competing with YouTube,” he said."}