{"url": "https://techcrunch.com/2025/01/08/gridwares-boxes-literally-listen-to-power-lines-to-find-outages/", "title": "Gridware’s boxes literally listen to power lines to find outages", "authors": ["Tim De Chant", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-08T00:00:00", "text": "Tim Barat loved being a lineman at an electric company in Australia, where he grew up, even in the chaos of the Black Saturday brushfires in 2009 that torched over 1 million acres and left many without power or homes. But when he moved to the U.S. in 2013, his wife was less enthusiastic about him continuing down that path.\n\n“My wife didn’t want me working on high voltage anymore for safety reasons,” Barat told TechCrunch.\n\nSo he went back to school, eventually getting his master’s degree in electrical engineering from UC Berkeley.\n\nBut he just couldn’t stop thinking about power lines. Or rather, listening to them.\n\n“As humans, we can’t sense electricity. We can feel it. We can get electrocuted,” Barat said. Neither of those are conducive to a long career, though. So instead, electric company linemen use their other senses to get a handle on what’s happening during an outage.\n\n“Generally, we’re looking, we’re listening. We’re feeling transformers vibrating differently, things like that. We hit a pole with a hammer and listen to how it sounds, the ringing afterwards, to tell if it’s hollow before we climb it for safety reasons.”\n\nThat’s a laborious and time-consuming process. Utility workers often have to traverse dozens of miles to trace the origin of an outage, whether it be a tree branch resting on a wire, a squirrel that got fried when it grounded a line, or a line downed by high winds. Only once they report the nature and exact location of the problem can the repair work begin.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\n“Some utilities spend nine figures per year on just these patrols alone,” Barat said.\n\nThere had to be a better way, Barat thought, and as he reflected on his experience as a lineman, he recalled all the times he spent listening to various bits of infrastructure. “This is where my mind went,” he said.\n\nTogether with Abdulrahman Bin Omar and Hall Chen, Barat founded Gridware. The company’s product is a device that literally listens for electrical problems.\n\n“We think of the grid like a giant guitar as opposed to a circuit board,” Barat said. “It’s a physical thing. We need to be monitoring the physical attributes of the grid, too, not just voltage and current.”\n\nWires, poles, and transformers make different sounds depending on whether they’ve been hit by tree limbs, struck by cars, or buffeted by winds. Gridware’s sensors, which are mounted on the pole just below the lines, aren’t connected to the wires themselves. Instead they’re waiting for mechanical perturbations — sounds and vibrations — that the company’s AI and signal processing software have been trained to identify as different hazards to the grid.\n\nProcessing happens on each device, and when the software identifies a likely problem, it sends the details and location to the cloud through cellular or satellite connections (or, if the signal is weak, to another device to relay the message). The entire box is about the size of an iPad, and it’s powered by solar panels, with its base angled to allow those panels to face the sun. Because they don’t touch the power lines or need a separate power source, the devices are quick to install: Power lines can remain energized, and each box takes less than 15 minutes to mount and enable.\n\nBarat said Gridware was cash-flow positive last year, but he felt it was still an opportune time to raise money. Gridware recently closed a $26.4 million Series A led by Sequoia, the company exclusively told TechCrunch. Existing investors Convective Capital, Fifty Years, Lowercarbon Capital, and True Ventures participated. “This raise was significantly easier in that we didn’t need it,” he said.\n\nGridware currently monitors over 1,000 miles of power lines for 18 companies from devices on 10,000 poles. The company previously worked with PG&E and ConEd to ensure the devices accurately report problems in the field.\n\nBut before Barat could get onto utilities’ poles, he needed to prove to himself that Gridware’s devices worked.\n\n“I built my own grid,” he said. “It’s full size, 55-foot poles, 200-foot spans, and I spent years destroying it in every way, shape and form. I’ve had so many people watch how I blow up transformers, throw trees onto power lines, cut live power lines with bolt cutters — really doing a lot of risky activities to emulate those events.”\n\nHow did his wife feel about that? “I got in trouble,” he said, but added, “that’s behind us because we’re getting generally three to four events a day in the real world.”"}