{"url": "https://techcrunch.com/2024/11/07/ulysses-is-using-robots-to-restore-seagrass-populations/", "title": "Ulysses is using robots to restore seagrass populations", "authors": ["Rebecca Szkutak", "Senior Reporter", "Kyle Wiggers", "Cindy Zackney", "Amanda Silberling", "Theresa Loconsolo", "Anthony Ha", "Maxwell Zeff", "Kirsten Korosec", "Sarah Perez"], "publication_date": "2024-11-07T00:00:00", "text": "Seagrass punches above its weight. The marine plant only occupies 0.1% of the ocean floor but can be credited with supporting marine ecosystems of plants and fish, filtering ocean water, and capturing quite a bit of carbon. Seagrass is also being destroyed, due to climate change and other factors, with meadows reducing 7% globally each year. Ulysses Ecosystem Engineering wants to restore it.\n\nUlysses’ autonomous robot can be loaded with seeds and programmed to go to specific areas of the ocean floor to plant seagrass. Akhil Voorakkara, a co-founder and CEO at San Francisco-based Ulysses, told TechCrunch that the robot they’ve built has been able to speed up restoration by 100x compared to having volunteers plant the grass seeds by hand and at a fraction of the cost of other robots.\n\nJamie Wedderburn, now CTO, got the idea for the company while on a surf trip with friends on the West Coast of Scotland in early 2023. One of his friends mentioned a recent awful volunteering experience they had that involved planting seagrass on a particularly harsh day of Scottish weather. More than 40 volunteers painfully planted seagrass that ended up just getting wiped away by rough conditions.\n\nWedderburn hadn’t known about the importance of seagrass, and hearing this story sent him down a rabbit hole. He thought there must be a way to use technology to make processes like that better. Wedderburn pitched the idea to Voorakkara, who proceeded to also fall down the same rabbit hole. The company’s other two co-founders, Colm O’Brien and Will O’Brien, had similar reactions.\n\n“I knew that would be fun immediately,” Will O’Brien told TechCrunch. “Also getting the opportunity to build a mission-driven company that works primarily in the oceans, and is really focused on nature and biodiversity, is just like, you know, it was that was extremely compelling to me as well. Growing up as a kid, my hero was Steve Irwin.”\n\nVoorakkara said that the team decided to pursue this problem by building a robot because, while none of them had marine biology experience, they did have experience building robots. They quickly made a 3D prototype which wasn’t waterproof and leaked when they used it, but it worked well enough at injecting sesame seeds, to show them there was something there. Once they had conviction they turned to experts for help.\n\n“None of us are marine biologists,” Voorakkara said. “You won’t get anything unless you ask and we did ask for help and advice very early on in our journey to the top people working in seagrass restoration and making sure it wasn’t crazy. These people were super excited about what we are doing and were super willing to work with us.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nUlysses launched in early 2024 and has since earned nearly $1 million in revenue from both private companies and government organizations. The startup has partnerships with multiple government agencies in places like Florida and Australia for large-scale restoration projects too.\n\nThe startup is now emerging from stealth and announcing a $2 million pre-seed funding round led by Lowercarbon Capital with participation from VCs Superorganism and ReGen Ventures, in addition to angel investors. Voorakkara said the startup will use the funds to bolster its team of five by adding engineers and people focused on go-to-market strategies.\n\nTiming is on Ulysses’ side, as many governments are putting more emphasis and urgency on restoring seagrass meadows. Earlier this year the European Union passed a new regulation focused on restoring different habitats by 2030 and 2050, with seagrass specifically named.\n\nVoorakkara said that this month the company will be testing a new capability for the robot: being able to harvest seeds from approved seagrass beds and then planting those seeds where they are needed.\n\nWhile seagrass is currently the company’s main focus, they think of it as the beginning. Will O’Brien said that the tech is really autonomous drones connected to a main platform so it can expand into other areas like coastal management, coastal security and other types of restoration.\n\n“The oceans really are this frontier in humanity that is extremely under explored,” O’Brien said. “There is not a lot of novel technological solutions and it’s because it’s an extremely difficult domain, dealing with currents, [it’s] very unforgiving when you have all these things. [We want to] bring SpaceX levels of innovation to this new domain here on earth.”\n\nThere are other companies looking to build underwater robots too. Terradepth is one that has raised more than $30 million in VC to focus on mapping the ocean floor for both commercial and government goals. Eelume is another out of Norway that is focused on ocean discovery.\n\n“In five years, we don’t want to just be doing seagrass restoration, we want to be managing hundreds of kilometers of coastline,” Voorakkara said. “We want to supercharge groups like NOAA, the U.S. Coast Guard, and everyone working on serving the ocean and protecting it in a much more efficient manor.”"}