{"url": "https://techcrunch.com/2024/12/17/slip-robotics-snags-28m-for-its-bots-that-can-load-a-truck-in-five-minutes/", "title": "Slip Robotics snags $28M for its bots that can load a truck in five minutes", "authors": ["Kirsten Korosec", "Transportation Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-12-17T00:00:00", "text": "\n\nDrop by any given loading dock and a buzz of forklifts — loaded up with goods — can be spotted maneuvering in and out of truck trailers. This logistical dance can take up to an hour to fill a trailer, leaving truck drivers in idle limbo.\n\nThe founders of Atlanta-based Slip Robotics say they’ve developed a robot that cuts that time down to five minutes. Their design inspiration: the floor.\n\nSlip Robotics, which was founded in 2020 by Chris Smith, Dennis Siedlak, and John Jakomin, has developed and launched a commercial robot-as-a-service business that combines automation software and large floor-like robotic platforms that can hold 10 palettes and carry up to 12,000 pounds. According to the company, these so-called SlipBots can handle uneven ground and navigate routes from the warehouse floor into a truck trailer. Three SlipBots — about 36,000 pounds of payload — fit into one truck trailer. Once the truck arrives at its destination, the SlipBots disembark.\n\nThe idea behind SlipBots came, in part, from Smith’s collective experience at former employers Cummins, Tesla, and Volley Automation, the latter a robotics startup that developed automated car park systems. His time at Tesla, where he led factory simulation and analytics and was one of the first 50 engineers at the Gigafactory in Sparks, Nevada, was particularly influential.\n\nAll of this led to a singular thought, “What if I built the floor, but it moves?” Freight is typically set down on the floor for staging, where it’s picked up by forklifts. Smith’s idea was for that freight to be set down on robotic floor-like platforms that could move everything at once.\n\nAfter three years of development and testing, Slip Robotics launched its commercial service in 2023. Today, there are hundreds of SlipBots being used in facilities across more than 25 sites that range from 20,000 square feet to more than 2 million square feet in size, Chief Commercial Officer Jordan Sanders told TechCrunch. Its customers include John Deere, GE Appliances, Valeo, and Nissan.\n\nSlip Robotics customers pay a subscription license fee for the use of SlipBots, with ongoing software updates, hardware service, maintenance, and repairs included. Sanders said customers typically have a “three, three, three” setup. This means a customer will always have three bots on a dock, three in transit, and three waiting at the destination.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThe bots, and the business model, have attracted investors too. Just a few weeks ago, Slip Robotics closed on $28 million in Series B funding, the company announced on Tuesday. The round was led by DCVC and saw participation from existing investors Eve Atlas, Tech Square Ventures, Hyde Park Venture Partners, Overline, and Pathbreaker Ventures. James Hardiman of DCVC has joined the board, which includes Slip co-founders and Thiago Olson, managing partner of EVE Atlas.\n\nThe company has raised $45 million, to date. Slip didn’t share its valuation.\n\nSanders said the new capital will be used to hire more employees, increase deployments, and enhance its product offerings. He emphasized that Slip Robotics’ success so far is a credit not only to the product but how the startup chose to scale.\n\n“People have come to expect a lot of hype and “smoke and mirrors” from robotics companies about their actual state of technology development and actual commercial scale,” Sanders noted in an email to TechCrunch. “This expectation and implicit skepticism is unfortunate, but it is entirely justified based on the hype and failed promises over the last decade.”\n\nHe said Slip Robotics didn’t try to scale too soon, kept quiet, and focused on developing its robotics platform. That approach appears to have paid off. The company, once less than a dozen people, has now grown to about 50 employees. Importantly, he noted, Slip Robotics now has 10 commercial customers and hundreds of bots in the field.\n\n“If you have more engineers in your office than revenue-generating vehicles in the real world, you don’t have a real business,” Sanders quipped."}