{"url": "https://techcrunch.com/2021/09/28/netflix-acquires-its-first-games-studio-oxenfree-developer-night-school/", "title": "Netflix acquires its first games studio, “Oxenfree” developer Night School", "authors": ["Catherine Shu", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2021-09-28T00:00:00", "text": "Night School Studio, the independent game developer known for narrative-driven titles like Oxenfree, announced today it has been acquired by Netflix. This makes it the first games studio the streaming giant has purchased.\n\nIn Netflix’s announcement, Mike Verdu, vice president of game development, wrote Night School’s “commitment to artistic excellence and proven track record make them invaluable partners as we build out the creative capabilities and library of Netflix games together.” He added that Netflix plans to add “exclusive games designed for every kind of gamer and any level of play” that will be included with its membership and have no ads or in-app purchases.\n\nNight School Studio was founded in 2014 by Sean Krankel, a former senior game designer at Disney Interactive, and Adam Hines, who was a lead writer at Telltale Games. (Telltale Games was a Netflix partner, working on interactive shows like “Minecraft: Storymode” adventure before shutting down).\n\nIn a statement on Night School’s site, Krankel wrote “Netflix gives film, TV and now game makers an unprecedented canvas to create and deliver excellent entertainment to millions of people. Our explorations in narrative gameplay and Netflix’s track record of supporting diverse storytellers was such a natural pairing.”\n\nFor fans of Oxenfree and other Night School titles, Krankel reassured them that it will keep working on Oxenfree II and “cooking up new game worlds.”\n\n“The Netflix team has shown the utmost care for protecting our studio culture and creative vision,” he wrote.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nNews of the acquisition comes less than a day after Netflix launched three new casual mobile games in Poland, Italy and Spain, a month after it released two games that were tie-ins to the “Stranger Things” series.\n\nIn Netflix’s second-quarter shareholder letter, the company said it is in the early stages of exploring its gaming model, and views gaming as another content category, like its original films, animation and reality TV shows.\n\nBefore working on mobile games, Netflix first ventured into interactive storytelling four years ago, when it launched “Choose Your Own Adventure”-style children’s shows. The next year, it took the format to content for adult viewers with the “Bandersnatch” episode of “Black Mirror.” Since then, it’s added other interactive children’s shows like “Minecraft: Story Mode,” and “Emily’s Wonder Lab.”"}