{"url": "https://techcrunch.com/2025/04/09/wayves-self-driving-tech-is-headed-to-nissan-vehicles/", "title": "Wayve’s self-driving tech is headed to Nissan vehicles", "authors": ["Kirsten Korosec", "Transportation Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-09T00:00:00", "text": "Nissan said it will use self-driving software developed by Wayve to beef up its advanced driver-assistance system starting in 2027, a landmark deal for the buzzy U.K. startup that has raised more than $1.3 billion from Nvidia, Microsoft, SoftBank Group, and Uber.\n\nNissan will integrate Wayve’s software as well as its sensors, including lidar from an undisclosed supplier, into its ADAS system known as ProPilot. The Japanese automaker said the system will set a “new standard for autonomous driving with advanced collision avoidance capability.”\n\nNissan said the system being developed for mass production by 2027 will be a Level 2 system operating under driver supervision. Nissan didn’t disclose which models the system would be available in. Level 2, as defined by the Society of Automotive Engineers, means the system can automate multiple driving tasks such as steering and braking but still requires a driver to maintain control at all times.\n\nWayve, which launched in 2017, has garnered attention and investors for its automated driving system, which is self-learning versus rules-based, similar to Tesla’s approach. Wayve has developed its end-to-end data-driven learning approach for “eyes on” assisted driving and an “eyes off” fully automated driving system.\n\nUnlike Tesla, Wayve plans to sell its “Embodied AI” to automakers and other tech companies.\n\nWayve’s self-learning approach is seen as particularly appealing to automakers because it’s not reliant on specific sensors or HD maps. This means Wayve’s system can work with existing sensors like cameras and radar. The automated driving software captures data from those sensors, which directly informs the driving decisions of the system.\n\nAnd while the startup’s development fleet uses Nvidia’s Orin system-on-chip, co-founder and CEO Alex Kendall has said the software can run on whatever GPU its OEM partners already have in their vehicles.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAll of this translates to software that’s cheap to run and used in advanced driver-assistance systems, robotaxis, and even robotics, Kendall said last month at Nvidia’s GTC conference.\n\nNissan spokesperson Shiro Nagai noted in an email that Wayve’s Embodied AI foundation model, a large-scale end-to-end AI trained on vast amounts of real-world driving data, allows the software to adapt across different environments and vehicle platforms.\n\n“Leveraging Nissan’s technology and Wayve’s AI, we are confident it will allow future Nissan vehicles to closely replicate the judgment and actions of a careful and competent human driver in complex driving scenarios,” Nagai said."}