{"url": "https://techcrunch.com/2021/10/15/netflix-fired-the-employee-who-organized-a-walkout-in-solidarity-with-trans-workers/", "title": "Netflix fired the employee who organized a walkout in solidarity with trans workers", "authors": ["Amanda Silberling", "Senior Writer", "Zack Whittaker", "Rebecca Bellan", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2021-10-15T00:00:00", "text": "Netflix fired an employee who led the company’s trans employee resource group and planned a walkout on October 20, a current and former Netflix employee with knowledge of the situation confirmed to TechCrunch. The termination was first reported by The Verge.\n\nNetflix workers planned the walkout to protest statements that its co-CEO Ted Sarandos made about Dave Chappelle’s recently released special, “The Closer.” The company claims that it fired the employee in question because the company suspects that they leaked internal information.\n\n“We have let go of an employee for sharing confidential, commercially sensitive information outside the company,” a Netflix representative told TechCrunch. “We understand this employee may have been motivated by disappointment and hurt with Netflix, but maintaining a culture of trust and transparency is core to our company.”\n\nThe leaked information in question appears to be some internal metrics on “The Closer” that appeared in a story by Bloomberg, which reported that Netflix spent $24.1 million for the one-off special. Meanwhile, the company spent $3.9 million on Bo Burnham’s recent comedy special “Inside” and $21.4 million on the buzzy, nine-episode “Squid Game,” Netflix’s best-ever debut.\n\nEarlier this month, as Netflix prepared to release “The Closer,” employees raised concerns about potentially harmful anti-trans jokes in the show — Chapelle goes as far as declaring that he’s “Team TERF,” referring to trans-exclusionary radical feminists, who conflate gender with biological sex and oppose the movement for transgender rights. When Netflix released the special on October 5 anyway, employees and Netflix subscribers alike lashed out against the streaming service.\n\nThe day after the special’s release, a trans software engineer at Netflix, Terra Field, tweeted a viral thread about the impact of anti-trans rhetoric. “Promoting TERF ideology (which is what we did by giving it a platform yesterday) directly harms trans people, it is not some neutral act. This is not an argument with two sides. It is an argument with trans people who want to be alive and people who don’t want us to be,” Field wrote.\n\nhttps://twitter.com/RainofTerra/status/1445914236668895236\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSoon after, Netflix suspended Field and two other employees for attempting to attend a director-level meeting that they weren’t invited to. But Field was reinstated the next day after finding that she didn’t try to attend the meeting with ill intent — in fact, a director had shared the link, leading her to think she could attend. But some Netflix employees were fed up, especially after co-CEO Ted Sarandos wrote in an email to them that “content on screen doesn’t directly translate to real-world harm.” He continued, “we have ‘Sex Education,’ ‘Orange Is the New Black,’ ‘Control Z,’ Hannah Gadsby and Dave Chappelle all on Netflix. Key to this is increasing diversity on the content team itself.”\n\nA lesbian comedian celebrated for her Emmy-winning Netflix special “Nanette,” Hannah Gadsby spoke out against Sarandos’ attempt to paint her as a figurehead for queer inclusivity at Netflix.\n\n“You didn’t pay me nearly enough to deal with the real world consequences of the hate speech dog whistling you refuse to acknowledge, Ted,” she wrote on Instagram. “Fuck you and your amoral algorithm cult.”\n\nAs Netflix fans the flame by firing an organizer of the upcoming trans walkout, some people are posting links to cancelnetflix.com, which directs users to Netflix’s help page on how to cancel subscriptions.\n\n“We have been reading all of your comments and using them to continue advocating for bigger and better queer representation,” tweeted Most, Netflix’s LGBTQ+ account. “Ok you can go back to yelling at us now.”"}