{"url": "https://techcrunch.com/2024/11/29/asl-aspire-wants-to-gamify-stem-education-for-deaf-kids/", "title": "ASL Aspire wants to gamify STEM education for deaf kids", "authors": ["Rebecca Bellan", "Senior Reporter", "Zack Whittaker", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2024-11-29T00:00:00", "text": "Poor literacy skills have plagued the deaf and hard of hearing community for decades. The median literacy rates of deaf high school graduates have languished at a fourth-grade level since the turn of the 20th century, according to the National Center for Special Education Research. Bringing STEM concepts into the mix — the vocabulary for which is limited in standard American Sign Language (ASL) — only gives deaf kids yet another obstacle to success.\n\nThat’s the problem Illinois-based startup ASL Aspire, one of the startups that presented at TechCrunch Disrupt’s Startup Battlefield 200, is hoping to solve with its game-based approach to STEM education.\n\nThe team at ASL Aspire works with deaf scientists and mathematicians who are standardizing STEM-based vocabulary in ASL to create curricula for teachers to integrate into their existing lesson plans.\n\nASL Aspire, which officially launched in 2022, is targeting middle schoolers at the start, but is creating curricula for students in kindergarten through 12th grade. Ayesha Kazi, ASL Aspire’s co-founder and COO, said high school students have benefited from the platform, too, as many of them are behind their hearing peers.\n\nKazi told TechCrunch that her co-founder, Mona Jawad, got the idea for the company while the two were studying at University of Illinois, Urbana-Champaign. Jawad is working on her doctorate in speech and hearing science there.\n\n“[Jawad] worked directly in a lab with deaf scientists, and so she saw that the biggest gap within the language was in STEM,” Kazi told TechCrunch. “Around 10% of Americans are deaf or hard of hearing, but only around 0.1% are in STEM fields.”\n\nDuring her studies, Jawad noticed that there is plenty of available research on how to help deaf kids learn STEM subjects, but no one had really taken the step to bring those findings from the research world into the commercial world.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nSo in 2021, she asked Kazi, her friend who was (and still is) studying computer science, if she wanted to join her in starting the company. And it was one of those, “Sure, what the hell?” moments: a couple of 17-year-old freshmen who didn’t really know what they were getting themselves into, per Kazi’s retelling.\n\nBut because they were still students, they had the backing of the university, which funded pilots and prototypes of their web app and helped get the tech and curriculum into local schools.\n\n“It was a blessing in disguise that we were able to do those things so early on and be in the school system from day one,” Kazi said.\n\nIn 2023, ASL Aspire completed pilots with five schools, helping around 200 kids, mainly in California. The startup is trying to sell directly to school districts for the farthest reach, a sales process that is difficult at the best of times.\n\n“The budget window is short, usually from January through March, so trying to get your foot in the door right when it opens up is hard,” Kazi said, noting that ASL Aspire has also had to time outreach to ensure they’ve already presented their value proposition to school decision-makers before that window opens.\n\nThe startup, which has raised $400,000 in research grant money, is also working with other educational institutions like the Houston Space Center, according to Kazi.\n\nNext year, ASL Aspire is targeting deaf residential schools in Fremont and Riverside, if all goes well with budget conversations. Kazi also said in the future, the team hopes to expand their game-based learning approach beyond STEM and into all subjects.\n\n“It’s an uphill battle, but it’s worth it at the end, because you’re not just helping one kid … like at the end of the day, I’m gonna get 2,000 students who will be able to use our app,” Kazi said."}