{"url": "https://techcrunch.com/2017/11/09/do-cities-still-want-a-sharing-economy/", "title": "Do cities still want a sharing economy?", "authors": ["Brooks Rainwater", "Nicole Dupuis", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2017-11-09T00:00:00", "text": "Much has been said in recent months about Uber and its travails as a company, with big leadership changes, and then an outright ban in London. Even so, Ubers (and Lyfts) are rolling down city streets, and the 40 million monthly active riders indicate that this is an incredibly popular transportation option.\n\nMany people love using Airbnb, as well, as the company cites 150 million global users. However, concerns continue to arise coast to coast over its impact on neighborhoods and existing services. These companies — representative of much of the public conception of the “sharing economy” — have, together with others in the on-demand space, upended traditional business models and ushered in vast innovation to our cities.\n\nThe relationships between cities and sharing economy companies have grown and morphed in recent years — in many cases, positively. But, challenges surrounding core municipal issues remain, and many established companies are still grappling with how to adjust to a new business environment. The result is a paradigm shift in the way we think about everything from market demand and utilization to regulation.\n\nTo dig deeper into these issues, the National League of Cities (NLC) surveyed city leaders nationwide in Cities and the Innovation Economy: Perceptions of Local Leaders on their views toward the sharing economy and other innovations that include drones and smart city technology. This report is a follow-up to a similar survey conducted in 2015.\n\nBroadly speaking, mayors and council members welcome the innovation and improved services that new technologies provide to constituents, but the operating environment presents both opportunities and challenges to their cities. To better understand the current state of the sharing economy in cities, NLC posed questions about cities’ relationships with sharing economy companies, their level of support for these businesses and the formal partnerships that have been formed since their inception.\n\nWhen it comes to local officials and their relationship with companies like Uber, Lyft and Airbnb, attitudes first exhibited in our early research have solidified in recent years. More than half of cities (51 percent) describe their relationships with sharing-economy companies as good, while 33 percent say they are very poor, with very little variation in-between.\n\nWhile we have seen a hardening of viewpoints on relationships with these companies, the results indicate a growing interest by cities to partner with them. Some cities have already made that leap by developing tax collection arrangements with home-sharing companies or establishing first- and last-mile ride programs with ride-hailing companies.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nCurrently, 16 percent of cities have entered into some type of partnerships with a sharing-economy platform, but of the 84 percent of cities that are not currently partnering in some way, 79 percent expressed an openness to heading in this direction.\n\nPartnerships that bridge between the public and private sector will become even more critical as these companies continue to mature, and as new opportunities with innovations like autonomous vehicles become ubiquitous.\n\nA willingness to partner will be paramount as cities work to shape what this future environment looks like, how new mobility technologies intersect with transit, and how to uphold equity as an ultimate priority in the midst of all of these changes.\n\nButtressing the directional focus on partnerships, the survey results showed that 62 percent of cities support the overall sharing economy — this is much in line with what we saw in 2015 –providing a solid baseline for scaling innovation in our cities within this sector. What we first saw in terms of support of ride hailing versus home sharing in 2015 was relatively consistent with our findings in 2017 — with markedly fewer cities supporting home sharing versus ride hailing.\n\nWe expect that much of this dichotomy stems from the nature of the models themselves –specifically the ways in which home-sharing platforms directly impact neighborhood composition and land-use decisions on one hand versus the nearly immediate impacts ride hailing has on expanding the transportation options in a given city.\n\nThe two models tend to elicit very different responses from different members of the affected communities.\n\nAs sharing economy platforms and other new technologies evolve and continue to impact city governance, cities should expect that their relationships with the private sector will change, as well. As cities transition from being purely the sales target to being the consumers and users of these platforms, there is opportunity for policymakers to make these relationships more reflexive — to be true stakeholders — and influence the way this technology develops for their cities.\n\nAfter all, no one knows better what cities need and want more than the mayors and local leaders immersed in the community and on the front lines of government. New technology platforms are blurring the lines between public and private realms — cities are best suited to channel the power of these new partnerships and opportunities — creating a shared, dynamic, innovative economy for all."}