{"url": "https://techcrunch.com/2023/08/29/meta-avatars-are-finally-getting-legs-in-beta/", "title": "Meta avatars are finally getting legs (in beta)", "authors": ["Amanda Silberling", "Senior Writer", "Kyle Wiggers", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-08-29T00:00:00", "text": "It’s time to beta test Meta’s greatest technological innovation since the News Feed: legs. Now on Meta Quest headsets, you can download an update that lets you walk on two feet, just like our ancient ancestor, the Ardipithecus ramidus, an early hominid that achieved bipedality 4.4 million years ago. Now it comes full circle.\n\nWhen Meta launched its suite of virtual reality social products, its avatars did not have legs, instead hovering as disembodied torsos. Now our digital likenesses can finally get back on their feet. So far, users report that they only have legs in Horizon Home, the area where you find yourself when you first turn on your headset.\n\nThe new Leg IK for Meta is a good start. They kept their opinion that you should only see them as a third person view The lack of crouching is probably the most glaring issue of it so far. But progress 🤷 pic.twitter.com/0s5jmIvuvW — Brad Lynch (@SadlyItsBradley) August 29, 2023\n\nWhile Quest headsets support hand tracking, a technology that allows users to essentially use their hands instead of controllers, it doesn’t track leg and foot movements. This makes it harder to create legged avatars that feel at least a little bit natural. Early testers say that you can only see legs in third person, not first person, which is supposed to make the visual a little less jarring.s\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMark Zuckerberg first announced that Meta was working on legs last October. Perhaps now this feature will get up and running before Meta’s next Connect event in September."}