{"url": "https://techcrunch.com/2023/09/12/sqream-series-c/", "title": "SQream calls in $45M to expand its GPU-based big data analytics platform", "authors": ["Ingrid Lunden", "Europe Editor", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-09-12T00:00:00", "text": "Back in 2010, Israeli data analytics startup SQream made a bet on the potential of GPUs as a cornerstone of enabling the processing and querying of big datasets, an area that it believed would only grow as datasets became larger and larger. That bet has very much paid off — not just because of the rise of AI and the huge data processing that it requires, and the big reliance that has on GPU processing, but because of the vast, and expanding, amount of data that the world produces daily. Now SQream is announcing new funding of $45 million to continue its own growth.\n\nThe Series C is being led by World Trade Ventures, with Schusterman Investments, George Kaiser Foundation (Atento), Icon Continuity Fund, Blumberg Capital and Freddy & Helen Holdings also participating. The company is not disclosing its valuation — “We don’t like to play show and tell,” CEO Ami Gal said — but he added that he is “extremely happy” with the number. (For some context, I’ve been told by sources that the $520 million noted in PitchBook from 2022, during its last round, was off, but nothing more; SQream has now raised around $163 million, so $500 million might be in the ballpark now.)\n\nThe company’s focus is on the enterprise segment in verticals like semiconductors, manufacturing, telecomms, financial services and healthcare, and its disclosed customers include the likes of mobile carrier Orange, Samsung, LG, Alibaba and PubMatic. Its plan is to use the funding to continue doubling down on growth in North America specifically.\n\nThe startup’s name comes from its original focus: Started by Gal along with Razi Shoshani (CTO) and Kostya Varakin (no longer with the company), the initial idea was to focus on SQL database analytics, which would have represented a big market in itself at the time; and the idea of leaning on GPU-based parallel processing, from Nvidia, came from the fact that the three were really into gaming and could see the potential of GPUs back then to create faster and more efficient data queries for business intelligence purposes, machine learning and anything else that came along.\n\n(Its pitch was that it could “analyze up to 20 times more data, up to 100 times faster, at as little as 10% of the cost,” which ironically seems to now be table stakes for any big data analytics company. Indeed, now SQream’s numbers lean much higher and it claims to “expand data capacity while reducing ingestion times by 90%, preparation times by 90%, footprint by 90%, and costs by 80%.”)\n\n“We thought the architecture of GPUs could enable a whole ecosystem of applications for general purposes, as well as for things like machine learning and AI, which were already big. Looks like Nvidia did a good job!” he said with a laugh. “We’re very happy that what was a niche ecosystem became the way all processing went.”\n\nThat focus on SQL attracted a lot of early backers, some of which were very strategic, like Alibaba. But in more recent years, although GPU and SQL still are very much at the core of its business, the company has been working on widening its remit. That included, in 2021, the acquisition of another startup, Panoply, to expand to hundreds more data sources. And some of the funding will also be used to help the company with R&D, exploring how it might leverage advances in processors to build the next generations of its own service.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThat could, one day, include things like quantum processors when (and maybe even if, if you’re more skeptical) these become a reality rather than a theoretical idea. It will also likely include optical processors and other developments. Gal was cagey about any specifics.\n\n“There are quite a few new architectures that will rock the market in the next few years,” he said. “They are a key partner, but Nvidia is going to face a lot of competition in the years head. There will be new compute and quite a few new advantages.”\n\nWhile AI undoubtedly is the technology and application on everyone’s mind right now, Gal is realistic and knows that some of that business — especially around buzzy Generative AI — is bound to level out and even somewhat recede over time. But the bigger data needs will not cease, and that’s what investors are backing.\n\n“SQream is enabling enterprises to become data-driven and deliver insights at the point of impact where they are needed most, and in their ability to push technological boundaries in the ever-growing analytics and AI/ML spaces,” said Abraham Schwartz, partner at World Trade Ventures, in a statement. “We are thrilled to contribute to SQream’s ascent towards reshaping the big data and AI landscape, and look forward to seeing the significant impact they will make in the market, especially in North America, to meet this increasing demand.”"}