{"url": "https://techcrunch.com/2023/10/18/snap-partners-edtech-company-inspirit-bring-ar-tech-50-us-schools/", "title": "Snap partners with edtech company Inspirit to bring its AR tech to 50 US schools", "authors": ["Aisha Malik", "Consumer News Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-10-18T00:00:00", "text": "Snap is partnering with edtech company Inspirit to bring augmented reality into classrooms to help students better understand STEM lessons, the company announced on Wednesday. The two companies are working together to create 25 AR Lenses and STEM curriculums that will be used by at least 50 across the United States next year.\n\nOne of the AR Lenses is designed to help students find the volume of a cylinder, while another gets users to tap on bubbles and choose the correct volume to pop them.\n\nSnap says that since launching its pilot program, it found that 85% of students said AR helped with memory and retention. The company says it also found that AR lessons increased engagement by nearly 50%, and that 92% of students found AR content easy to understand.\n\n“With custom-built Lenses brought into an easy to use mobile application with Camera Kit, Inspirit designed a transformative curriculum that pairs Snap’s AR technology with a comprehensive learning guide, empowering teachers to facilitate dynamic learning and students to achieve their best, whether they’re learning from the classroom or at home,” the company wrote in a blog post. “The curriculum is designed to stimulate classroom engagement, boost confidence levels, and improve students’ self-efficacy.”\n\nSnap’s venture into AR for education comes a month after the company shut down its AR Enterprise Services division less than a year after its launch. The initiative, which was announced in March, gave brands access to tools that allowed them to do things like access AR try-on features, a 3D viewer for looking at a product from multiple angles, fit and sizing recommendation technology and an enterprise manager for their digital assets. The company said that building up the initiative would take “significant” investment and it that couldn’t continue to fund those efforts.\n\nAlthough Snap has seen declining revenue, the company’s shares rose nearly 12% yesterday after reports revealed that an internal memo said Snap could post better-than-expected results next year. The memo revealed that Snap could reach more than 475 million daily active users in 2024, beating analysts’ predictions of 448 million, according to a report from The Verge.\n\nSnap is scheduled to release its Q3 2023 earnings results on October 24."}