{"url": "https://techcrunch.com/2025/03/27/yc-alum-mendel-a-ramp-for-latam-enterprises-raises-35m-series-b/", "title": "YC alum Mendel, a ‘Ramp for LatAm enterprises,’ raises $35M Series B", "authors": ["Mary Ann Azevedo", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-03-27T00:00:00", "text": "Mexico City-based Mendel has raised $35 million in a Series B round of funding, it tells TechCrunch exclusively.\n\nCorporate spend management platform Mendel last raised in December 2021 — a $15 million Series A round and $20 million in debt — after participating in Y Combinator’s Winter 2021 cohort. With this latest capital infusion, the startup has brought in a total of $60 million in equity funding and $50 million via a credit facility.\n\nMendel’s mission is straightforward: to reinvent corporate spend management by automating most of the operations for an enterprise CFO that are currently done manually. Or put even more simply, it wants to be a one-stop shop for all B2B spend. Its offering integrates expense management, payments, and corporate travel.\n\n“Our goal is to give CFOs and finance teams in Latin America real-time visibility and control over their spend — be it employee expenses, vendor payments, or business travel bookings,” said co-CEO and co-founder Alan Karpovsky.\n\nKarpovsky and Alejandro Zecler (who both previously founded and sold other startups) started Mendel in early 2021, and Helena Polyblank (CPO) and Gonzalo Castiglione (CTO) later joined as co-founders.\n\nMendel declined to reveal valuation, with Karpovsky saying only the round reflected “a significant step up” from the company’s previous raise. The company also declined to reveal hard revenue figures, with Karpovsky noting only that its annual recurring revenue (ARR) grew almost 2.5x year-over-year, with gross margins of over 75%.\n\n“We’re not yet profitable, but we anticipate reaching profitability by late 2025,” he told TechCrunch.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nBase10 Partners led Mendel’s latest round, which included participation from new investors PayPal Ventures and Endeavor Catalyst, as well as existing backers Infinity Ventures, Industry Ventures, and Hi.vc.\n\nSAP Concur meets AMEX\n\nThe company says that since it is “software first” and focused on enterprises, it is able to charge recurring SaaS fees rather than relying exclusively on interchange revenue or lending-based models. Its revenue comes from a combination of SaaS fees (over 50%) for its expense management and travel tool and interchange fees from credit cards as well as a take rate from its bill pay product.\n\nKarpovsky believes that the company’s LatAm focus gives it an advantage over other global players in that it’s able to address “complex, country-specific regulations” such as tax codes, invoicing requirements, and multi-currency workflows, among other things.\n\n“We like to say ‘Mendel is like SAP Concur and AMEX having a child,’ Karpovsky quipped.\n\nAs for comparisons to New York-based decacorn Ramp, he said that in many ways, “Mendel is like Ramp for Latin American enterprises” with a few differentiators, including the fact that it is focused on “large, complex organizations that require multi-entity, multi-currency, multi-credit-line and deep ERP integrations.”\n\nPresently, Mendel has 80 employees, compared to 64 employees a year ago. Looking ahead, the company plans to expand geographically. It’s already operating in Mexico and Argentina with about 500 customers, including Mercado Libre, FEMSA, Adecco, and McDonald’s. It’s looking to expand into Chile, Colombia, and Peru in 2025, and Brazil in 2026.\n\n“Our approach from day zero was first consolidating the largest Spanish-speaking market in LatAm before starting the geo-expansion,” Karpovsky said.\n\nBase10 Partner Jason Kong told TechCrunch that his firm was attracted to what it viewed as Mendel’s “unique positioning” as a spend management platform for large companies in underserved — but growing — Latin America.\n\n“The company’s high capital efficiency — being cash-flow positive in December 2024 — stood out in a sector where many players struggle with unit economics,” Kong added. “Additionally, Mendel’s ability to replace legacy solutions like SAP Concur and win large enterprise customers at a fast sales velocity (sub-3 months for 3,000+ employee enterprises) demonstrated clear product-market fit.” Other companies also operating in this space in Latin America include Clara and Jeeves — another YC alum — but both target more SMBs and rely more on transactional fees, noted Kong."}