{"url": "https://techcrunch.com/2025/04/14/arnergy-to-expand-solar-access-in-nigeria-with-18m-series-b/", "title": "Bill Gates-backed Arnergy to expand solar access in Nigeria with $18M as demand surges", "authors": ["Tage Kene-Okafor", "Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-04-14T00:00:00", "text": "Demand for solar energy in power-starved Nigeria has soared in the last decade thanks to worsening grid reliability and rising fuel costs. That’s drawn investor interest to Arnergy, a clean tech startup meeting that need. The company just raised a $15 million Series B extension (on top of a $3 million B1 round last year), bringing its total for the round to $18 million.\n\nThat surge in demand for solar systems follows significant policy shifts, most notably the removal of Nigeria’s decades-old fuel subsidy in May 2023 (the government’s decision — long debated — ended its practice of covering the gap between global and local fuel prices).\n\nSince then, petrol prices have jumped nearly 500%, making power generators, once seen as the more affordable alternative to unreliable grid power and solar systems despite environmental hazards, far costlier to run.\n\nArnergy’s pitch has changed with the times. “When we started the business, we used to position solar as a way to get uninterrupted power, not necessarily to save money. It wasn’t part of a commercial conversation,” founder and CEO Femi Adeyemo told TechCrunch. “Now it is, because we can clearly show customers how our systems save them monthly whether using petrol, diesel, or even the grid.”\n\nAdeyemo launched Arnergy in 2013 to provide solar systems to homes and businesses across sectors like hospitality, education, finance, agriculture, and healthcare.\n\nWhat began as a resilience play is now a cost-savings strategy changing the economics of adoption for the clean tech backed by Bill Gates’s Breakthrough Energy Ventures (the firm led Arnergy’s $9 million Series A in 2019).\n\nLease-to-own increasing adoption\n\nThat adoption is clearest in the company’s lease-to-own product, Z Lite, which became a core focus following Arnergy’s first Series B tranche last year.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhile outright purchases comprised 60% to 70% of revenue in 2023, they accounted for just 25% of sales last year. On the other hand, lease-to-own, where customers pay fixed monthly fees over five to 10 years before owning the system, has gained more traction.\n\nOne reason for this change is affordability when compared to electricity tariffs. Until recently, many people viewed long-term leases as costlier than running diesel or petrol generators. But with diesel prices soaring post-subsidy removal and grid tariffs climbing — especially after a new government policy last April that tripled electricity consumption costs for customers with the most stable power — lease-to-own solar is becoming popular among customers, says Adeyemo.\n\n“Imagine paying ₦200,000 (~$125) every month for power. With our product, that drops to ₦96,000 (~$60). Over five years, it’s a no-brainer what you’ll save,” said the CEO. He added that many existing customers are returning to double their solar capacity or switch completely off-grid as a result.\n\nArnergy tripled its lease customer base between 2023 and 2024 and expects to grow it 4-5x this year. Naira revenues have climbed accordingly and are on track to quadruple by the end of the year.\n\nDollar revenues, on the other hand, have remained flat due to currency devaluation, but Adeyemo said the company is building FX revenue through dollar-denominated B2B2C partnerships and potential expansion into Francophone Africa.\n\nScaling amidst yet another government policy\n\nSo far, Arnergy has deployed over 1,800 systems across 35 Nigerian states, totaling 9MWp of solar and 23MWh of battery storage.\n\nArnergy plans to use its new funding led by Nigerian private equity firm CardinalStone Capital Advisers (CCA) to install more than 12,000 systems by 2029. Breakthrough Energy Ventures as well as British International Investment, Norfund, EDFI MC, and All On participated in the round.\n\nBut hitting that target requires a strategic shift. For nearly a decade, Arnergy handled sales in-house. Now, it’s adopting a partnership-driven model with business clients and physical retail outlets outside Lagos to reach more customers in Nigeria’s power-starved market.\n\nThe Lagos-based cleantech is in talks to raise additional local debt from banks and DFIs to support these projects including energy-as-a-service (EaaS) solutions for multinationals, says Adeyemo.\n\nYet as Arnergy prepares to scale, a proposed policy could threaten its momentum.\n\nLast month, Nigeria’s government announced plans to ban solar panel imports to boost local manufacturing. The move has drawn backlash from stakeholders who argue that domestic capacity is far from ready.\n\nAdeyemo agrees with the goal, but not the approach. He warned that a premature ban could stall an industry that’s only just getting off the ground.\n\nAccording to the CEO, Nigeria needs to create an environment with the right infrastructure, policy stability, and access to capital so that local factories can ramp up over the next three to five years. Only after that should the country start thinking about phasing out imports.\n\n“We’re advocates for local manufacturing. But let’s build capacity before shutting the door on imports. Otherwise, we risk doing more harm than good, both to the industry and to the millions of Nigerians who now rely on solar as their primary energy source,” he remarked."}