{"url": "https://techcrunch.com/2024/05/14/aws-confirms-european-sovereign-cloud-to-launch-in-germany-by-2025-plans-e7-8b-investment-over-15-years/", "title": "AWS confirms it will launch European ‘sovereign cloud’ in Germany by 2025, plans €7.8B investment over 15 years", "authors": ["Paul Sawers", "Senior Reporter", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2024-05-14T00:00:00", "text": "Amazon Web Services (AWS), Amazon’s cloud computing business, has confirmed further details of its European “sovereign cloud,” which is designed to enable greater data residency across the region.\n\nThe company said that the first AWS sovereign cloud region will be set up in the German state of Brandenburg and will go live by the end of 2025. AWS added that it plans to invest €7.8 billion ($8.5 billion) in the facility through 2040.\n\nThe announcement, evidently timed to coincide with the AWS Summit Berlin being held in the German capital today and tomorrow, comes some seven months after AWS first revealed plans for a sovereign cloud.\n\nNavigating regulations\n\nAWS has long offered localized data storage and processing in the European region, but public sector bodies and organizations operating in certain highly regulated industries have been slower to transition to the public cloud due to data (mis)management concerns. That is, regardless of whatever policies and promises a hyperscaler might have in place, the data is still ultimately under the control of a U.S. tech giant.\n\nThus, the AWS European Sovereign Cloud comes with stricter data controls, allowing all qualifying customers to keep all their metadata within the EU — AWS employees based anywhere outside the EU would be unable to access anything contained within the bloc.\n\nIn other words, the sovereign cloud will be “physically and logically separate” from all other AWS regions.\n\nAWS had originally distanced itself from the “sovereign cloud” concept — Amazon chief security officer (CSO) Stephen Schmidt went so far as to call the sovereign cloud “a marketing term more than anything else.” However, in late 2022, AWS announced its “digital sovereignty pledge,” which set about enshrining its data control commitments in stone.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThis change in tact was partly due to growing regulatory pressure and because its big cloud rivals have been throwing their weight behind the sovereign cloud push — Microsoft and Google have launched sovereign cloud efforts, and even Oracle set up a sovereign cloud for EU customers last June.\n\nPart of AWS’ multibillion-dollar investment will include creating new roles to support the European sovereign cloud, such as software engineers, systems developers, and solutions architects. The company also touts that it will support “an average 2,800 full-time equivalent jobs in local German businesses” annually through its supply chain, spanning disciplines such as construction, facility maintenance and telecommunications."}