{"url": "https://techcrunch.com/2022/05/23/siriusxm-acquires-conan-obriens-team-coco-podcast-company-for-150-million/", "title": "SiriusXM acquires Conan O’Brien’s Team Coco podcast company", "authors": ["Lauren Forristal", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2022-05-23T00:00:00", "text": "SiriusXM Holdings, Inc. announced the acquisition of Team Coco today, the Conan O’Brien-led podcast network and digital media business. The $150 million deal (valuation first reported by The Wall Street Journal) will include the former NBC and TBS late-night host’s interview podcast “Conan O’Brien Needs a Friend,” along with 10 other podcasts such as “Inside Conan,” “Why Won’t You Date Me?” with Nicole Byer, “Parks and Recollection” and more.\n\nAlso, as part of the deal, Conan has entered into a five-year talent agreement with SiriusXM. Not only will he remain the host of his hit podcast, but he will also collaborate with the broadcasting company to create and executive produce a new original Team Coco comedy channel for SiriusXM subscribers. Team Coco’s staff will join SiriusXM as well.\n\n“Conan O’Brien Needs a Friend,” which launched in 2018 and now accounts for over two-thirds of the 16 million monthly downloads for all Team Coco podcasts, will continue to be available on other podcasting platforms (Stitcher, the SXM App, Pandora, etc.). The flagship podcast, developed with Stitcher’s Earwolf, is ranked as one of the top five searched-for podcasts and has won two Webby Awards.\n\nOverall, the Team Coco podcast business has more than 1 billion annual video views across YouTube and Facebook, an average of 180 million annual podcast downloads, and 17 million fans across social media platforms. In 2020, the company signed a first-look deal with Amazon’s Audible.\n\n“When I started in television, my ultimate goal was to work my way up to radio,” said Conan O’Brien in a statement. “This new deal with SiriusXM builds on the great relationship that began several years ago with a team that is the standout in their field.”\n\nThe SiriusXM agreement also includes archives of “Conan” on TBS, live events, distribution of select videos from his podcast and merchandise from the Team Coco brands. When the long-running late-night talk show “Conan” ended in 2021, Team Coco transitioned into an independent podcasting venture.\n\nScott Greenstein, president and chief content officer of SiriusXM, said, “We are thrilled that Conan remains committed to producing his incredibly successful podcast and will now expand his role into executive producing an exclusive Team Coco radio channel for SiriusXM. Conan has built an amazing brand and organization at Team Coco with a proven track record of finding and launching compelling and addictive podcasts. We look forward to continuing to grow the Team Coco brand.”"}