{"url": "https://techcrunch.com/2023/01/09/nigerian-agritech-releaf-gets-more-capital-as-it-launches-new-tech-for-food-processing/", "title": "Nigerian agritech Releaf gets more capital as it launches new tech for food processing", "authors": ["Tage Kene-Okafor", "Reporter", "Tim De Chant", "Sarah Perez", "Rebecca Bellan", "Kyle Wiggers", "Julie Bort", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-01-09T00:00:00", "text": "Releaf, a Nigerian agritech startup that supplies ingredients (starting with the oil palm) to consumer goods manufacturers and their food factories, has received $3.3 million in an oversubscribed pre-Series A round.\n\nThe Jack Ma Foundation-backed startup, which announced a $4.2 million (including a $1.5 million grant) seed raise in September 2021, said the funding will support the launch of two new technologies: Kraken II and SITE.\n\nReleaf focuses on value chains where smaller factories are set up near smallholder farmers, allowing them to get better processing yields and less expensive logistics costs. The oil palm is the first, and for now, the only crop Releaf works on; the oil palm market is a $3 billion market that consists of more than 4 million smallholder farmers. These farmers drive about 80% of the crop’s production using rocks or inefficient hardware, responsible for producing low-quality vegetable oil. That’s why the agritech launched Kraken, its static palm nut de-sheller machine built to process this crop and efficiently extract “high-quality” vegetable oil for farmers.\n\n“Our seed round was focused on essentially getting the first evolution of Kraken and proving that we can be the first company to take multiple species of very poor quality smallholder palm nut and turn them into high-quality palm kernel oil,” Uzoma Ayogu, co-founder and CTO, told TechCrunch in an interview.\n\n“After proving that, we needed to figure out how to best place this technology dynamically and, over the last couple of months, made progress on Kraken’s evolution from being static to being portable and reducing the cost significantly [Kraken II] while adding new products [SITE] to complement the suite of tech that we have already.”\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nKraken II is a mobile and less expensive version of the palm nut de-sheller, costing half as much and eliminating over 80% of margin-eroding costs. On the other hand, SITE is a geospatial mapping application that discloses food processing assets. SITE was developed in collaboration with Stanford University’s Professor David Lobell, a MacArthur Fellow, and director of the Center on Food Security and the Environment, whose team refined the age identification process for oil palm trees in Nigeria.\n\nAccording to Ayogu, the YC-backed Releaf figured out that just building tech wasn’t enough to get the best margins for farmers and manufacturers but that the tech needed to be in the right places and at the proper season across different regions in Nigeria. Hence the reason for Kraken’s portability and SITE’s placement and route planning capabilities. The combination of both enables the Uyo-based Releaf to target the best opportunities across Nigeria’s oil palm belt rather than being limited to sourcing crops within 100 kilometers of a fixed processing site like existing food processors.\n\n“The biggest benefit to them [farmers] with this new evolution of Kraken and SITE is that many offer farmers poor prices because they have to pay a lot for logistics. But now that we can eliminate 80% of the logistics costs and process much closer to the farmers, we can pass a lot of that profit back to them while also keeping more of it for ourselves while improving even the quality of the end product,” said Ayogu, who co-founded Releaf with CEO Ikenna Nzewi, on why this new technologies matters for farmers.\n\nIn Nigeria’s food processing industry, there’s more competition downstream, dominated mainly by middlemen and traders, usually single-person or few-person outfits that tend to be closer to consumers and have better pricing power. It’s different for Releaf, which operates upstream and has less competition, at least when the application of tech is considered. Offering farmers better prices and providing working capital are two ways Releaf uses to gain market share in this segment, Ayogu noted.\n\nThe startup has used its supply chain technology to process more than 10 million kilograms of palm nuts since the launch of Kraken in 2021. As a result, Releaf has grown its monthly revenue 7x year-on-year, which is set to increase this year following the securement of more than $100 million in supply contracts from consumer goods manufacturers in Nigeria. With this funding, the agritech, whose valuation has tripled since its seed round, will be looking to expand the regions where it processes palm and extend the crop types it works with.\n\n“Our insights have shown that downstream is capped by supply, which is upstream,” the CTO mentioned. “And so our focus is via the first-mover advantage with differentiated technology, we can capture a significant amount of supply in a fragmented market and then over time verticalized to increase margins and market position.”\n\nThe pre-Series A funding was led by Samurai Incubate Africa, which re-invested after leading Releaf’s seed round, with participation from Consonance Investment Managers. Stephen Pagliuca (chairman of Bain Capital) and Jeff Ubben (board member at World Wildlife Fund and founder of Inclusive Capital Partners) also invested. Rena Yoneyama, managing partner at Samurai Incubate Africa, speaking on the investment, said: “Releaf’s success with its pilot Kraken validates its thesis, and we are excited to continue supporting their ambitious vision to create efficient supply chains within Africa’s agricultural market.”"}