{"url": "https://techcrunch.com/2021/03/24/the-return-of-neighborhood-retail-and-other-surprising-real-estate-trends/", "title": "The return of neighborhood retail and other surprising real estate trends", "authors": ["Eric Eldon", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width", "--C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Height Var --C-Author-Card-Image-Size", "Width Var --C-Author-Card-Image-Size", "Img.Wp-Block-Tc_Author-Card__Image Border-Radius", "Max-Width None -O-Object-Fit Cover Object-Fit Cover Display Block", "Margin-Top Flex Font-Size Var"], "publication_date": "2021-03-24T00:00:00", "text": "The pandemic made remote work and on-demand delivery normal far faster than anyone expected. Today, as the world beings to emerge from the pandemic, location doesn’t matter like it did a year ago.\n\nModern society produced superstar cities filled with skyscraper office and residential buildings. Now, the populations that once thrived in these urban centers are deciding how to repurpose them for a post-pandemic world.\n\nI caught up with ten top investors who focus on real estate property technology to get a sense of how they’re betting on the future.\n\nThey are optimistic overall, because the typically glacial real estate industry now sees proptech as essential to its future. However, they are the most unsure about the office sector, at least as we knew the concept before the pandemic.\n\nThey expect remote work to be part of the future in a significant way and foresee ongoing high housing demand in the suburbs and smaller cities. They are especially positive about fintech and SaaS products focused on areas like single-family home sales and rentals. Many are continuing to invest in big cities, but around alternative housing (co-living, accessory dwelling units) and climate-related concepts.\n\nMost surprisingly, some investors are actually excited about physical retail. I examined the latest evidence and found myself agreeing. As shocking as it sounds, we could be entering a much better era for small, local businesses. Details farther down.\n\n(And before we dig in below, please note that Extra Crunch subscribers can separately read the people cited below responding fully in their own words, with lots of great information I wasn’t able to explore. One other thing, we did suggest they mention their own investments to illustrate what they believe about the sector. )\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nWhen the office is more of a luxury\n\nThe pandemic combined with existing trends has made office renters “more akin to a consumer of a luxury product,” explains Clelia Warburg Peters, a venture partner at Bain Capital Ventures and long-time proptech investor and real estate operator.\n\nLandlords who have “largely been in a position of power since the 1950s” now have to put the customer first, she says. The “best landlords will recognize that they are going to be under pressure to shift from simply providing a physical space, to helping provide tenants with a multichannel work experience.”\n\nThis includes tangible additional services like software and hardware for managing employees as they travel between various office locations. But the market today also dictates a new attitude. “These assets will need to be provided in the context of a much more human relationship, focusing on serving the needs of tenants,” she says. “As lease terms inevitably shorten, tenants will need to be courted and supported in a much more active way than they have been in the past.”\n\nThe changes in office space may be more favorable to the supply side in suburban areas.\n\n“Companies are going to have to offer employees space in an urban headquarters,” Zach Aarons of MetaProp tells me (his firm just published a very positive report on the sector). But many will also want to offer ”some sort of office alternative in the suburbs so the worker can leave home sometimes but not have to take a one-hour train ride to get to the office when needed.”\n\n“If we were still purchasing hard real estate assets like many of us on the MetaProp team used to do in previous careers,” he added, “we would be looking aggressively to purchase suburban office inventory.”\n\nMost people thought that remote work was here for good and would impact the nature of office space in the future.\n\nAdam Demuyakor, co-founder and managing director of Wilshire Lane Partners, is generally bullish on big cities, but he notes that startups themselves are already untethering from specific places. This is a key leading indicator, in TechCrunch’s opinion.\n\n“Something that has been interesting to watch over the past year is how startups themselves have begun to evolve due to newfound geographic flexibility from the pandemic,” he observes. “Previously, startups (especially real-estate-related startups) felt pressure to be ‘headquartered’ near where their customers, prospective capital sources and pools of talent were located. However, we’ve seen this change over the past few months.”\n\nIn fact, a recent report by my former colleague Kim-Mai Cutler, now a partner at Initialized Capital, highlights these trends in a regular survey of its portfolio companies. When the pandemic began, the Bay Area was still the number one place that founders said they’d start a company. Today, remote-first is in first place. Meanwhile, the portfolio companies are either going toward remote-first or a hub-and-spoke model of a smaller headquarters and more far-flung offices. Those who maintain some sort of office say they will require significantly less than five days a week. Nearly two-thirds of respondents said they would also not adjust salaries based on location!\n\nThat’s a small sample but as Demuyakor says, “Startups (a) are frequently the most adept at utilizing the types of technology necessary for effective remote work and (b) simultaneously have to compete ferociously for talent. As such, I think we may be able to infer what the ‘future of work’ may look like as we observe what startups choose to do as the pandemic passes.”\n\nSome landlords (with big loans) and large cities (with big budgets) are making a push to repopulate their offices quickly, and some large companies are loading up on office space or reaffirming their commitments to current locations.\n\nMaybe efforts like these, plus the natural desire to network live, will bring back the industry clusters and pull everyone back to the old geographies? Maybe something close to 100% of what we saw before? What does that look like?\n\nIn such a scenario, some pandemic-era changes will persist, says Christopher Yip, a partner and managing director at RET Ventures. “A populace that has become sensitized to public health considerations may well gravitate toward solo forms of transportation (cars and bicycles) instead of mass transit, and parking-related and bike-sharing tech tools may likely thrive. From a real estate management perspective, technology that makes high-density living more comfortable and healthier will also increase, as consumers will become increasingly attracted to touchless technology and tools that facilitate self-leasing.”\n\nHere’s the other scenario that he lays out “if a large number of jobs remain fully remote.”\n\n“In theory, retail and office properties could structurally continue to suffer, and there has been some talk from government officials in certain regions about converting office properties into affordable housing,” he details. “If market-rate vacancies in cities remain high, there will be increasing demand for short-term rental platforms like Airbnb and Kasa, which enable landlords to gain revenue from hotel-type stays even in a market where residential demand is not strong.”\n\nVik Chawla, a partner at Fifth Wall, sketches out a middle-of-the-road scenario. “We believe that major cities will continue to attract knowledge workers and top talent post-pandemic,” he says, “though we expect remote work to become an increasingly critical component to the work economy, meaning that there will be increased flexibility in terms of time spent in the office versus elsewhere.”\n\nThis would still mean some sort of long-term price decline. “At a city level, this means that rents should taper relative to pre-pandemic levels due to lesser demand,” he believes. “That said, the real estate ecosystems in cities that have experienced growth throughout the pandemic will enter a period of innovation, and with it, see an increase in housing density, ADUs and modular building techniques.”\n\nAndrew Ackerman, managing director of UrbanTech for DreamIt Ventures, also sees a gentle deflation of commercial office prices over time, followed by some complex space-management questions.\n\n“[T]he return to work will likely result in more flexible work arrangements rather than the demise of the office which, as leases renew over the next 5-10 years, will lead to a gradual meaningful-but-not-catastrophic reduction in the demand for office space. The question is, what then happens to the excess office space?”\n\n“Office to residential conversion is tricky,” he elaborates. “Layout is a major constraint. Many modern offices have deep, windowless interior space that is hard to repurpose. But even with narrow layouts, the structural elements are often in the wrong place. Drilling thousands of holes in structural concrete so you can move plumbing and gas to the right places is a heavy lift.”\n\nThis might just lead to new types of still-valuable uses? “One of the areas that I’m still investigating is whether co-living or microunits might be a more attractive conversion option. Turning an office break room and interior bullpens into a shared kitchen, dining area, and recreation or work flexspace may be a better way to repurpose deep interior space without a very costly retrofit. And if you don’t have to reroute too much plumbing, it may even be possible to convert (and convert back!) individual floors as market demand for office and residential space fluctuates over time.”\n\nAll respondents saw proptech being a core part of the next era of big cities (of course), however bullish or bearish they may be about the office itself.\n\nA new equilibrium for residential\n\nHousing availability has become even more limited in most places during the pandemic, with many more people looking to buy and fewer people wanting to sell. This is even though the previously hottest cities have seen major rental price drops.\n\nDemuyakor of Wilshire Lane is staying focused on the housing problem, and solutions to it like co-living. “Despite the pandemic, it is still difficult for millennials and Gen Z to afford to live in the most expensive cities (New York, San Francisco, Los Angeles, etc.) at current wage levels,” he says. “As such, we believe that we will continue to see demand for products and solutions that can continue to help alleviate costs and burdens of living in major cities. For example, we think that at its core, co-living is an economic decision. Solutions that continue to help people live where they want to live more easily (ADUs are another example of this) will continue to thrive.”\n\nCasey Berman, managing director and general partner of Camber Creek, thinks that “cities will continue to attract people to live, work and play because they offer density and opportunities for experiences that people crave even more now. To the extent all of this is true, there will be renewed demand for urban spaces and properties to take advantage of that demand.”\n\nHe says that the firm has been investing in products to make dense living safer and more convenient and “we expect those solutions will become increasingly popular. Flex allows tenants to pay rent online in easier-to-manage installments and in the process makes it more likely that landlords will receive payment on time. Latch’s access control devices are in one out of 10 new multifamily buildings. A lot of people purchased a pet over the past year. PetScreening makes it easy to manage pet records and confirm when a pet is a service or support animal.”\n\nRobin Godenrath and Julian Roeoes, partners at Picus Capital, generally share this viewpoint and describe how new living arrangements in cities could allow for more radical changes to how people live.\n\n“Flexible living solutions will allow remote workers to spend time across different cities with a fully managed, affordable and safe rental option for short-to-long-term urban living,” he says, “while commercial conversion to residential will play a key role in driving down per square foot prices enabling long-term returning residents to afford less densified space. Although co-living densifies multifamily buildings, we believe it will remain an interesting sector as the continued shift to remote work will make living communities increasingly important considering the reduced social interaction on the job.”\n\nBut modern proptech is also making the suburbs and beyond more appealing in the long run, according to many. Great new technologies for living can exist anywhere you are.\n\nProptech has also helped fuel the new suburban boom. “There is an ongoing trend of reverse urban migration causing an uptick in the demand for suburban-style living,” he says. “Proptech companies have played a significant role in enabling this shift, specifically via digitizing the home buying, selling and renting transaction processes (e.g., iBuyers, alternative financing models and tech-enabled brokerages). Additionally, proptech companies have played a key role in reducing physical interactions through remote appraisals, 3D/VR viewings and digital communications thus enabling homebuyers and sellers to efficiently and safely transact throughout the pandemic.”\n\nUltimately, the same technologies that could make cities more affordable will also help out in the suburbs. “We strongly believe that the acceleration of the digitalization of the home transaction process coupled with the significant increase in demand for suburban-style housing and evolving buyer profiles (e.g., tech-savvy millennials) opens up a multitude of opportunities for proptech to significantly impact suburban living across construction, access and lifestyle. This includes companies focusing on built-to-rent developments, modular homebuilding, affordable housing, community building and digital amenities.\n\nMany investors who we talked to highlighted the single-family rental market trend. Here’s Christopher Yip again from RET.\n\n“One of the unheralded trends of the past decade has been the rise of the single-family rental (SFR) market,” he says “with a significant number of major investors moving into this asset class. The SFR space is poised to benefit from the migration from cities, and the tech that supports SFR will likely have positive ripple effects across the industry.”\n\n“SFR portfolios are particularly challenging to operate efficiently and at scale; compared with a multifamily property, they have more distinct unit layouts and are more spread out geographically,” he explains. “Technology has the ability to streamline operations and maintenance for SFR operators, with smart home tools like SmartRent facilitating self-touring and management of these distributed portfolios. We’re bullish on this space and are keeping a close eye on proptech tools that serve this market.”\n\nAndrew Ackerman of DreamIt agrees. “Single-family has been neglected, slowly growing more interesting both from an asset and proptech perspective for some time. For example, we invested in startups like NestEgg and Abode who service this ecosystem … prior to the pandemic. COVID has been good to these startups and brought more attention to the opportunities in single-family in general.”\n\nStonly Baptiste and Shaun Abrahamson, co-founders of Urban.us, already see a world of options unfolding across geographies, with choices like co-living and short-term rentals letting people find new lifestyles. “Portfolio companies like Starcity are really thriving as co-living doesn’t just solve for cost, but also for a key overlooked issue — access to community. We also see room for more nomadic lifestyles. A lot of the discussion about Miami is about people moving there, but it seems like a more interesting question for a lot of places is maybe whether or not people will spend a few months of the year there. So for remote workers this might mean places near specific activities like mountain biking, surfing, snowboarding etc. Starcity makes it easy to move between city locations and Kibbo takes this far beyond the city by building communities around van life.”\n\nHere’s how all these changes are adding up for the suburban market, as mapped out by Clelia Warburg Peters of BCV.\n\n“The residential transaction disruption is now settling in three core categories: iBuyers (who buy homes directly from sellers and ultimately hope to own the sell-side marketplace), neobrokers (who generally employ their agents and use secondary services such as title mortgage and insurance to increase their revenue) and elite agent tools (platforms or tools focused on the top agents).”\n\nThis combination of innovations are changing residential real estate as we know it. “[C]onsumers are increasingly open to alternative financing tools, including home-equity-based financing models (where you sell a stake in your home, or you buy into full ownership in a home over time). The growth and proliferation of these new models are consolidating the whole residential market so that brokerage sales commissions and commission from the sale of mortgage, title and home insurance are now functionally one large and intertwined disruptable market.”\n\nThe surprising revival of neighborhood retail\n\nHumans seem to love the concept of a traditional Main Street full of bustling, walkable local businesses. But the hits have kept coming to the people trying to successfully operate independent retail storefronts.\n\nE-commerce began cutting into traditionally thin margins with the rise of Amazon and the 90s wave of “e-tailers.” More recently, art galleries, high-end restaurants and boutiques became a harbinger of gentrification in many cities. Many commercial retail landlords in these locations aggressively priced rents as more residents moved in who could afford higher prices, ultimately contributing to gluts of empty storefronts in prime locations.\n\nThe pandemic seemed to be the final blow, with even the most loyal shoppers turning to order online while local businesses stayed closed.\n\nAnd yet, a range of investors are strangely optimistic. Even though the pandemic upended social and economic activity for more than a year, most agreed that IRL retail experiences are an essential aspect of modern life.\n\n“Humans are fundamentally social animals and I think we will all be hungry for in-person experiences once it is safe to return to them. Additionally, I think the shift away from working five days a week in the office is going to create a greater desire for ‘third spaces’ — not home, not a formal office environment,” said Peters.\n\n“I do think we will continue to see more ‘Apple store’-type retail experiences, where the focus is less on selling inventory and more on creating an environment for customers to physically interact with goods and experience the brand ethos beyond a website. Because I anticipate that retail rents are going to be meaningfully lower at the end of the pandemic, I actually think we will see even more experimentation than we did pre-COVID. It will be a very interesting period for retail.”\n\nMany others held views in this direction, whether they are investing specifically in retail-related tech or more generally in third-space ideas.\n\n“It’s true that retail has been in flux for more than a decade; the list of common e-commerce purchases has expanded from books and clothing to prepared meals and groceries. It’s also true that the pandemic has accelerated e-commerce’s growth, to the detriment of brick-and-mortar retail,” says RET’s Yip. “But people are still human and crave in-person experiences. Even if cities never bounce back fully, major metropolises will still have enough foot traffic to support a fair amount of retail, and innovative models like pop-up shops can be brought in to help address vacancies. It should also be noted that the public markets still have some confidence in the retail space. While the major REITs struggled in early to mid-2020, many have recovered substantially, and several have actually surpassed their pre-pandemic figures. It has been a bad decade for retail — and a very bad year — but it is just too soon to close the book on the sector.”\n\nGodenrath and Roeoes of Picus say movie theaters are just one example of a retail sector poised for success when public life resumes at scale post-pandemic.\n\n“Cinemas, many of which are key shopping center anchor tenants, were already reinventing the traditional theater experience by offering a more holistic experiential solution (e.g., reserved seating, 4DX visuals, in-theater restaurants, cafes and bars) and the pandemic has led to an expansion of these offerings (i.e., private theater rentals and events). We have the opinion that this trend will continue to expand across the entire retail real estate industry from restaurants (immersive culinary experiences) to traditional retail (integrated online and offline shopping experiences) and believe that proptech will play a defining role in helping retail real estate owners identify potential tenants and market properties as well as in helping retailers drive in-store customer engagement and gain key insights into the customer journey.”\n\nThe internet is also a friend these days, surprisingly! “We also see a lot of potential for hybrid models combining online and offline experiences without friction,” they say. “Taking the fitness sectors as an example we can imagine a new normal where in-studio courses are broadcasted to allow a broader participant group and apps tracking fitness and health progress throughout in-studio visits and at-home workouts.”\n\nYou can also see how retail intersects with many other solutions investors are betting on, particularly to improve the appeal of cities and solve for macro problems like climate change.\n\n“Cities have some massively underutilized assets, perhaps the biggest being public spaces that are allocated to cars,” Baptiste and Abrahamson say. “So one change we think will become permanent is reallocating parking spaces away from private vehicles to micromobility (bike/scooter/board lanes, parking, etc.). We’re seeing a lot of demand for portfolio companies like Coord (manages curb space starting with commercial vehicles and smart zones), Qucit (manages bike and scooter share operations in many large cities) and Oonee (secure bike/scooter/board parking).”\n\nThat’s just the start of the virtuous cycle they foresee.\n\n“As [car removal] happens, the use cases like logistics can shift to electric micro-EVs. Similarly, parklets or seating areas increase social spaces. The EU is setting the pace for banning cars, but overall reduced access to streets for cars is going to be a big change. And likely will make cities attractive — yes, you give up private living space, but you’re going to get a lot more common/social space. This is also likely to drive more co-living so you can decrease the cost basis for being in a city, but get a lot more from shared spaces, which have no real comparison in lower density communities.”\n\nDemuyakor of Wilshire Lane is betting in the same direction.\n\n“One of the key tenets of our overall strategy has always been a focus on space utilization and identifying the best ways technology can monetize underutilized spaces. This can be seen clearly with many of our newest investments: Stuf and Neighbor (monetization of basements, parking garages and other vacant spaces), MealCo (monetization of vacant kitchens), WorkChew (monetization of restaurant seating areas, hotel lobbies and conference rooms), and Saltbox (monetization of empty warehouses). We believe that landlords can certainly use these types of strategies to help mitigate increased levels of vacancies that we’re seeing across the real estate industry today in the medium term.”\n\nIf this thesis pans out, retail may become more about shared spaces. “With WorkChew in particular, which just announced funding this week, we’re seeing a ton of demand for their product both on the demand side and the supply side. Hotels and restaurants are excited to partner with them to monetize their less-utilized spaces and infrastructure,” said Demuyakor. “And of course, employers and companies love [it] as an easy amenity that can be offered to their hybrid workforces that increasingly want to spend more time out of the HQ office.”\n\nI have a few additional reasons to believe in the future of retail that I didn’t hear explicitly from the investors I interviewed.\n\nFirst, millions of new businesses have been created during the pandemic, to the surprise of even economists and policymakers. A large portion appear to have a very local angle, whether food delivery (cupcakes) or services (on-site haircuts) or internet-first products with strong local followings (much of Etsy). These entrepreneurs went internet-first and now, as commercial rents plummet, they have sufficient revenue to support a physical presence.\n\nSecond, most local business that have sustained themselves during the COVID-19 era figured out how to succeed on the internet. To see which ones in your vicinity are weathering the storm, just open one of your preferred on-demand delivery and services apps and place an order.\n\nThird, as noted by respondents and available data, landlords are already starting to drop prices, creating a renter’s market for the first time in decades.\n\nFourth, there are whole new types of financing opening up to more traditional businesses that could enable any company with a successful online side hustle, hobby (or perhaps larger project) to get funding for expansion. (This reason is perhaps the most speculative, but we are trying to figure out the future here at TechCrunch.) For example, Shopify has just invested in Pipe.com, a new “platform for trading recurring revenue.” Although the companies are not saying much now about the relationship, it’s possible to imagine a bunch of successful small(ish) businesses on Shopify suddenly getting a new kind of capital infusion right as the math is suddenly much better for a storefront location.\n\nIf you roll all of this up with other broader shifts in how we think about cities, like making them more climate-friendly through allowing density and bike lanes, you can start to see a world emerging that sounds a lot more like the fantasies of a New Urbanist than the world before the pandemic.\n\nAt the same time, these concepts are being deployed across smaller cities, suburbs and towns: All will compete to offer the highest quality of living — unless the old network effects of industry clusters return miraculously.\n\nAnd let’s say the industry clusters don’t cluster like they used to. It’s possible that many landlords, lenders and city budgets will have to retrench soon, creating a drag on the economies of otherwise-attractive cities.\n\nEven in this case, you can imagine a rebirth for places like New York and San Francisco focused around housing, retail and amenities. Maybe one day, we’ll look back at recent decades as the bad old days before we collectively bottomed out during the pandemic and had to decide on the right answers for the long-term.\n\nAnd with that, I invite readers to go check out the full sets of responses from the investors I interviewed. Each person offered a lot more than I was able to fit into this already-too-long article and is worth reading in detail. Extra Crunch subscription required, so you can support our ongoing coverage of these changes.\n\nI’ll be covering the future of proptech and cities more soon. Have other thoughts about all of this? Email me at eldon@techcrunch.com."}