{"url": "https://techcrunch.com/2025/01/09/prettydamnquick-snaps-up-25m-to-speed-up-online-checkout/", "title": "PrettyDamnQuick snaps up $25M to speed up online checkout", "authors": ["Ingrid Lunden", "Europe Editor", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2025-01-09T00:00:00", "text": "A startup hoping to provide a credible alternative to Amazon has picked up funding to double down on the gap in the market. PrettyDamnQuick (PDQ) provides tech to retailers to let them customize and test different shipping and checkout flows, and now it has picked up a deal of its own: a $25 million Series A to expand its business.\n\nWith some 200 customers already on its books since it was founded in 2020, New York-based PDQ says it currently processes around 30 million orders each month. That works out to $4 billion in gross merchandise volume to date, and the company projects that it will process 300 million orders by the end of 2025.\n\nPDQ’s fundraise and growth come at a time when many have been watching to see what will happen with the e-commerce industry overall.\n\nAfter a very strong period of rapid growth following the peak of the COVID-19 pandemic, a lot of companies and investors saw demand dropping off drastically as people went back to brick-and-mortar stores for shopping. It didn’t help that people also bought less due to inflation and economic uncertainty.\n\nFor those looking for optimism, recent figures from the latest holiday shopping period were a mixed bag: There were some extremely strong shopping days, but these punctuated a period that actually delivered lower growth than forecasters expected.\n\nCompanies like PDQ might still benefit, however: Giving shoppers better discounts without cutting too much into retailer’s margins might be more welcome than ever.\n\nThe crux of the problem that PDQ is solving is a classic one for independent e-commerce retailers.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nAt their hearts, e-commerce companies are more likely to be retailers, not tech specialists per se. Some who really want to outsource the technology layer of their operations might opt for a solution like Amazon, where they can list their goods on Amazon’s marketplace and use its search algorithms, fulfilment, shipping, loyalty programs and other tools to handle the rest of the process for a fee. These days, there are other third-party options, too, including the likes of Temu, Instagram, TikTok, and more.\n\nPDQ is targeting e-commerce companies that would rather build their own online presence. It speaks to a spirit of independence that has spurred the growth of companies like Shopify, which helps build online storefronts easily, and Stripe, which manages customers’ transactions.\n\nPDQ is addressing another critical area in that chain: How these sites set up and manage the wider checkout experience, which can include shipping costs and methods, as well as other kinds of deals to lure shoppers into buying more.\n\nAvi Moskowitz, PDQ’s CEO and founder, said he first came up with the idea for the startup by way of his own experience of starting and running a craft brewing business in Israel.\n\nThe company, called BeerBazaar, launched in 2015, and in early 2020, “not really anticipating what would be coming,” Moskowitz decided that it made sense for them to build a website. The company used Shopify to do so.\n\nThen, just weeks later, COVID-19 arrived.\n\n“Suddenly we were shipping hundreds of orders a day, some days over 1,000 orders,” he recalled. What should have felt like an exciting boom in business quickly turned into a nightmare. Both his company and its customers “were shocked by the lack of this Amazon-like experience that we had been so used to.”\n\nMoskowitz and his team set out to try to fix this for BeerBazaar to give its users “the same trust and confidence” to shop on its site that they might have on Amazon: Predicable information about shipping and its costs, perhaps offers to bring down the cost of shipping, or remove it altogether.\n\n“As we began to solve it for ourselves, we realized that like many of the tools that started emerging in e-commerce, like personalization and optimization and A/B testing, it really does require a platform,” he said. “This is not about a particular feature. If you’re going to be able to optimize in checkout, it means being able to manage the entire customer journey, from the moment they enter your store, all the way through checkout, fulfilment, tracking and delivery.”\n\nAfter building that platform, Moskowitz thought it was a strong enough idea to sell to others, too, and thus PDQ was born. Today, the company is only able to integrate with online stores that have been built on Shopify, Moskowitz said, but the plan is to use some of the funding to expand to cover other sites.\n\nPDQ’s main objective is personalization, Moskowitz said: “Basically every shopper is able to experience the checkout that’s appropriate for them.”\n\nIf a retailer already has order management, shipping and payment partners, it orchestrates those activities on a single platform. For those who do not fulfill orders in-house or have fulfillment partners (third-party logistics, or 3PL, partners) in place, PDQ provides an interface to work with a large range of big carriers (USPS, DHL, FedEx, UPS, etc.) as well as a variety of smaller delivery companies and other 3PL providers.\n\nOther areas that it provides tooling for include checkout, order tracking and protection after a purchase has been made, and A/B testing when a retailer wants to try out different offers at checkout.\n\nThere are, of course, other companies addressing this aspect of the e-commerce flow, including Shopify itself, along with many of the partners that PDQ integrates with. As with other aspects of e-commerce geared at addressing what is a highly fragmented market, it’s likely that there will be multiple players building strong offerings that will coexist.\n\nThe real competition are platforms like Amazon and the ones offering the other alternative to retailers: migrating to larger marketplaces to remove the need to think about independent products altogether.\n\nThe company has so far raised $38 million, and it is not disclosing its valuation with this latest round, which was led by new investor PeakSpan Capital. Previous backers TLV Partners and Moneta also participated."}