{"url": "https://techcrunch.com/podcast/why-gusto-has-stayed-focused-on-serving-small-businesses/", "title": "Why Gusto has stayed focused on serving small businesses", "authors": ["Rebecca Szkutak", "Dominic-Madori Davis", "Senior Reporter", "Zack Whittaker", "Rebecca Bellan", "Amanda Silberling", "Tim De Chant", "Connie Loizos", "Maxwell Zeff", "Maggie Stamets"], "publication_date": null, "text": "Getting payroll right is hard — especially for small businesses with limited resources. The three founders of payroll and benefits startup Gusto all found that out separately, running small businesses of their own, before linking up to try to fix the broken SMB payroll system in 2013.\n\nJosh Reeves, a co-founder and current CEO of Gusto, said on a recent episode of TechCrunch’s Found podcast that while the founders got interested in this area due to personal painpoints, they didn’t just want to build a company that would serve their own problems.\n\n“We immediately started talking to customers,” Reeves said. “Even though we were based in Silicon Valley, we actually were really focused on mainstream small business. I love reminding folks there’s more dentist offices in the U.S. than tech startups. We would go out and meet them, talk to them, interview them, get feedback.”\n\nReeves talked about how they built the company from there to today, 11 years and 300,000 customers later. Gusto has since added healthcare benefits too, a direct response to customer request, Reeves said. Gusto has also navigated rising competition in the space and helping companies transition to serving a remote workforce during the pandemic.\n\nAll the while, the company has stayed laser-focused on serving small and medium-sized businesses, a more fragmented market compared to say enterprise, as opposed to moving up the stack or taking on larger customers.\n\n“I would describe Gusto as being a great product for one to 500 person companies in all of the United States,” Reeves said. “But the reality is, there’s 6.2 million employers in America and 4 million are less than five employees, over half are less than five employees.”\n\nReeves also talked about how more than a decade in all three co-founders are still involved with the company, how they plan to continue to expand and offer other tools for small businesses and why they think they are just getting started.\n\n“We love fixing stuff in people’s lives,” Reeves said. “The truth is, we’re still early. If you look at marketshare, walletshare, and the product mix we have live today, there’s just a lot more work to do. So we’re eager to go get that work done.”"}