{"url": "https://techcrunch.com/2023/09/01/magic-leaps-original-headset-will-stop-working-at-the-end-of-2024/", "title": "Magic Leap’s original headset will stop working at the end of 2024", "authors": ["Brian Heater", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2023-09-01T00:00:00", "text": "As a company, Magic Leap moved on from its first headset some time ago. Along with a new CEO came a major pivot. With the Magic Leap 2, the startup went all in on enterprise — a far safer and more lucrative bet than the fickle world of gaming.\n\nStill, the Magic Leap 1 has continued to operate — good news for those who shelled $2,300 for the device when it finally arrived in the summer of 2018. At the end of next year, however, the augmented reality headset will effectively become a very expensive hunk of plastic and glass.\n\nThe well-funded firm alerted users via email that the system is being end-of-lifed when 2025 rolls around.\n\n“[W]e are announcing that Magic Leap 1’s end-of-life date will be December 31, 2024. Magic Leap 1 is no longer available for purchase but will continue to be supported through December 31, 2024,” the company writes.\n\nShorter term, the product’s various communications are being shuttered. The Magic Leap 1 Developer Forum and Discord channels are both being shuttered at the end of the month, while the company recommends people shift their business to the Magic Leap 2 board instead. Troubleshooting support and warranty claims will continue to be honored through 2024.\n\nMore details are offered in an FAQ.\n\nWhen that date rolls around, however, cloud services, apps and general functionality will all effectively brick. Perhaps we’ll see a homebrew community emerge, though the true number of devices out in the wild is hazy, at best. One report suggested that the headset had sold around 6,000 devices in its first year.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nMuch of that modest figure can be chalked up to pricing, along with the age-old issue of limited content. You can’t, however, blame the technology. If AR’s time ever truly comes, we can safely say that the Magic Leap 1 was ahead of it. And the device’s sequel continues to build on that success.\n\nFrom my conversation with the company, it’s safe to say Magic Leap has no short-term ambitions to return to the consumer market. Maybe someday scale will bring the price down to a manageable level and enough developers will be entrenched in the ecosystem to offer something meaningful.\n\nIn the meantime, the ball is very much in Apple’s court with the Vision Pro. While the software giant’s spatial computing approach is fairly different than what Magic Leap had initially targeted, it’s fair to say the two share common DNA. This is also a relatively rare instance where Apple entering the category doesn’t suck the air out of the room for smaller competitors. If anything, the Vision Pro is a validation for AR’s true believers.\n\nI will be discussing Magic Leap’s journey with CEO Peggy Johnson as part of the Disrupt Hardware Stage, later this month."}