{"url": "https://techcrunch.com/2025/02/20/solar-crushed-2024-but-emissions-were-up-as-industry-used-more-natural-gas/", "title": "Solar crushed 2024, but emissions were up as industry used more natural gas", "authors": ["Tim De Chant", "Senior Reporter", "Sarah Perez", "Rebecca Bellan", "Kyle Wiggers", "Julie Bort", "Maxwell Zeff", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media", "Min-Width"], "publication_date": "2025-02-20T00:00:00", "text": "The U.S. invested a record-breaking $338 billion in the energy transition last year, according to a new report, but it wasn’t quite enough to lessen the country’s overall carbon emissions.\n\nSolar took the lead, adding 49 gigawatts of new electrical generating capacity in 2024, far more than any other technology. Solar and wind together now represent nearly a quarter of electricity demand and nearly 10% of all energy consumption in the U.S., said the report, released Thursday by the BloombergNEF and the Business Council for Sustainable Energy.\n\nAt the same time, demand for natural gas was up 1.3%, enough to nudge U.S. carbon emissions higher by half a percent. The uptick was driven primarily by industrial users and power plants that burn natural gas, primarily to generate power or heat.\n\nThe new report lands at a time when the U.S. is at a crossroads. The country’s carbon emissions are down nearly 16% since 2005, with power-related emissions down over 40% over the same period. The U.S. has also gotten more productive with the energy it uses, generating 2.3% more economic output last year for a given amount of energy consumed.\n\nAt the same time, electricity demand is forecast to rise sharply in the coming years. According to a report from Grid Strategies, the U.S. could use 15.8% more electricity by 2029. Which technology supplies that electricity could determine the country’s impact on climate change for decades to come.\n\nSkyrocketing demand from data centers is the single biggest driver of new electricity demand. Tech companies have been investing in massive new data centers to power cloud operations and fuel their AI ambitions. The pace of additions has quickened to the point that half of all new AI servers could be underpowered by 2027.\n\nSuch forecasts have nudged tech companies to secure power sources for the coming years. Microsoft, Google, and Amazon have all announced significant investments in nuclear power, backing startups like Kairos and X-Energy while simultaneously reviving old nuclear reactors given they do not directly release carbon dioxide or other greenhouse gas emissions.\n\nTechcrunch event Join us at TechCrunch Sessions: AI Secure your spot for our leading AI industry event with speakers from OpenAI, Anthropic, and Cohere. For a limited time, tickets are just $292 for an entire day of expert talks, workshops, and potent networking. Exhibit at TechCrunch Sessions: AI Secure your spot at TC Sessions: AI and show 1,200+ decision-makers what you’ve built — without the big spend. Available through May 9 or while tables last. Berkeley, CA | REGISTER NOW\n\nThey are also continuing to add renewable power to their portfolios. This year alone, to meet the growing demands of its power-hungry data centers, Amazon has entered into agreements with energy producers to add 476 megawatts, while Meta bought 200 megawatts in one deal and 595 megawatts in another. The deals have been dominated by solar, mirroring the trend nationwide. That’s in part because the technology is inexpensive, and new solar farms are fast to bring online. For power-crunched tech companies, cost and speed matter.\n\nEfficiency-minded consumption might further help tech giants by wringing more power out of the grid without needing dramatically more capacity. A study published last week suggests that subtle tweaks — like scheduling computing tasks at times of lower power demand or shifting them to regions with more capacity — could unlock 76 gigawatts of headroom in the U.S. That’s as much as 10% of peak power demand nationwide.\n\nClever adaptations like those might be required if the U.S. is to keep pace with global competitors. Despite record outlays on the energy transition, the U.S. still lags China in deploying capital. Where the U.S. spent 1.3% of GDP on the transition last year, China spent 4.4%."}