{"url": "https://techcrunch.com/2023/12/13/xbox-cloud-gaming-now-available-on-meta-quest-2-3-and-pro/", "title": "Xbox Cloud Gaming now available on Meta Quest 2, 3 and Pro", "authors": ["Darrell Etherington", "Editor At Large", "Kyle Wiggers", "Amanda Silberling", "Rebecca Bellan", "Lorenzo Franceschi-Bicchierai", "Sean O'Kane", "Kirsten Korosec", "--C-Author-Card-Image-Size Align-Items Center Display Flex Gap Var", "Media"], "publication_date": "2023-12-13T00:00:00", "text": "Xbox has brought is Cloud Gaming service to Meta Quest VR headset devices, as both companies said it would at the launch of the latest Quest 3 hardware earlier this year. The Xbox Cloud Gaming app has a beta label, and it’s limited to Quest 2, Quest 3 and Quest Pro headsets (sorry OG Quest owners) but it basically delivers a huge-screen virtual cloud gaming experience so long as you have a compatible controller to work with and a Game Pass Ultimate subscription.\n\nI quickly downloaded the app from the Meta Quest store and gave it a test run to see how it works; very well, I’m happy to report, with the caveat that even after pairing both an Xbox Elite 2 controller and an 8bitdo Pro Gamepad I had to hard reboot the headset to get their input to register in the Xbox Cloud Gaming app itself. Once I’d done that, though, everything worked as it should, and I was able to jump into a session of cloud-based GTV V gameplay without incident.\n\nPerformance was smooth on my device, but of course your network environment will factor into how well this works for you. The app doesn’t make your games immersive, I should note: It presents them on a large virtual 2D display, which can be set to one of four sizes (I like XL) and presented in either a fully virtual Xbox-themed environment or in your own space via Meta Quest 3 or Pro’s passthrough modes.\n\nIn case you’ve somehow avoided it, Xbox Cloud Gaming provides a pretty amazing roster of games to check out via Xbox Game Pass, and now you can play them anywhere on a very nice, very large virtual screen if you own a compatible Quest headset and a controller. It’s a pretty nice upgrade for an already excellent service from Microsoft, and a nice additional reason to own a Quest 3, too."}